#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: A_Alhocol

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass A_Alhocol.A_Alhocol_C
// 0x0020 (0x02B0 - 0x0290)
class AA_Alhocol_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Bottle;                                            // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_A_Alhocol(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"A_Alhocol_C">();
	}
	static class AA_Alhocol_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AA_Alhocol_C>();
	}
};
static_assert(alignof(AA_Alhocol_C) == 0x000008, "Wrong alignment on AA_Alhocol_C");
static_assert(sizeof(AA_Alhocol_C) == 0x0002B0, "Wrong size on AA_Alhocol_C");
static_assert(offsetof(AA_Alhocol_C, UberGraphFrame) == 0x000290, "Member 'AA_Alhocol_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AA_Alhocol_C, StaticMesh) == 0x000298, "Member 'AA_Alhocol_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AA_Alhocol_C, DefaultSceneRoot) == 0x0002A0, "Member 'AA_Alhocol_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AA_Alhocol_C, Bottle) == 0x0002A8, "Member 'AA_Alhocol_C::Bottle' has a wrong offset!");

}

