#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: A_BarStojka

#include "Basic.hpp"

#include "E_InteractType_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "E_ActorType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass A_BarStojka.A_BarStojka_C
// 0x0028 (0x02B8 - 0x0290)
class AA_BarStojka_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        Scene;                                             // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      Player;                                            // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void DestroyInteractable();
	void ExecuteUbergraph_A_BarStojka(int32 EntryPoint);
	void GetActorType(E_ActorType* ActorType);
	void IsLocked_(bool* Result);
	void OnBeginInteract(class APawn* Param_Player);
	void OnFocused(class APawn* Param_Player, class AActor* HighlightActor, class UActorComponent* HighlightActorComponent, E_InteractType* InteractType, double* LateTime);
	void OnInteract(class APawn* Param_Player);
	void OnInteract2(class APawn* Param_Player);
	void OnInteract3(class APawn* Param_Player);
	void OnInteractVehicle(class APawn* Param_Player, int32 SitIndex, bool SkipAnimation);
	void OnLocalInteract(class APawn* Param_Player);
	void OnLostFocus(class APawn* Param_Player);
	void OnSeen(class APawn* Param_Player);
	void OnSquadCheckComplete();
	void OnStopInteract(class APawn* Param_Player);
	void Run_Lockpicking();
	void Set3DWidgetVisibility(bool Visible);
	void SetTutorial3DWidgetVisibility(bool Visible);
	void SitEvent(class ASurvivalPlayer_C* Param_Player, bool Sit);
	void SitEventMulti(class ASurvivalPlayer_C* Param_Player, bool Sit);
	void SitEventServer(class ASurvivalPlayer_C* Param_Player, bool Sit);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"A_BarStojka_C">();
	}
	static class AA_BarStojka_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AA_BarStojka_C>();
	}
};
static_assert(alignof(AA_BarStojka_C) == 0x000008, "Wrong alignment on AA_BarStojka_C");
static_assert(sizeof(AA_BarStojka_C) == 0x0002B8, "Wrong size on AA_BarStojka_C");
static_assert(offsetof(AA_BarStojka_C, UberGraphFrame) == 0x000290, "Member 'AA_BarStojka_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AA_BarStojka_C, Scene) == 0x000298, "Member 'AA_BarStojka_C::Scene' has a wrong offset!");
static_assert(offsetof(AA_BarStojka_C, StaticMesh) == 0x0002A0, "Member 'AA_BarStojka_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AA_BarStojka_C, DefaultSceneRoot) == 0x0002A8, "Member 'AA_BarStojka_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AA_BarStojka_C, Player) == 0x0002B0, "Member 'AA_BarStojka_C::Player' has a wrong offset!");

}

