#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: A_CaptureCamera

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass A_CaptureCamera.A_CaptureCamera_C
// 0x0020 (0x02B0 - 0x0290)
class AA_CaptureCamera_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneCaptureComponent2D*               SceneCaptureComponent2D1;                          // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       CaptureCamera_Preview;                             // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void ExecuteUbergraph_A_CaptureCamera(int32 EntryPoint);
	void CaptureIcon();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"A_CaptureCamera_C">();
	}
	static class AA_CaptureCamera_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AA_CaptureCamera_C>();
	}
};
static_assert(alignof(AA_CaptureCamera_C) == 0x000008, "Wrong alignment on AA_CaptureCamera_C");
static_assert(sizeof(AA_CaptureCamera_C) == 0x0002B0, "Wrong size on AA_CaptureCamera_C");
static_assert(offsetof(AA_CaptureCamera_C, UberGraphFrame) == 0x000290, "Member 'AA_CaptureCamera_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AA_CaptureCamera_C, SceneCaptureComponent2D1) == 0x000298, "Member 'AA_CaptureCamera_C::SceneCaptureComponent2D1' has a wrong offset!");
static_assert(offsetof(AA_CaptureCamera_C, CaptureCamera_Preview) == 0x0002A0, "Member 'AA_CaptureCamera_C::CaptureCamera_Preview' has a wrong offset!");
static_assert(offsetof(AA_CaptureCamera_C, DefaultSceneRoot) == 0x0002A8, "Member 'AA_CaptureCamera_C::DefaultSceneRoot' has a wrong offset!");

}

