#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: A_Item

#include "Basic.hpp"

#include "E_ActorType_structs.hpp"
#include "AttachmentInfo_structs.hpp"
#include "Engine_structs.hpp"
#include "E_InteractType_structs.hpp"
#include "FItemInfo_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "S_Attachment_structs.hpp"
#include "BPS_WeaponData_structs.hpp"


namespace SDK::Params
{

// Function A_Item.A_Item_C.BndEvt__A_Item_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentSleepSignature__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct A_Item_C_BndEvt__A_Item_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentSleepSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    SleepingComponent;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   BoneName;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(A_Item_C_BndEvt__A_Item_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentSleepSignature__DelegateSignature) == 0x000008, "Wrong alignment on A_Item_C_BndEvt__A_Item_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentSleepSignature__DelegateSignature");
static_assert(sizeof(A_Item_C_BndEvt__A_Item_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentSleepSignature__DelegateSignature) == 0x000010, "Wrong size on A_Item_C_BndEvt__A_Item_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentSleepSignature__DelegateSignature");
static_assert(offsetof(A_Item_C_BndEvt__A_Item_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentSleepSignature__DelegateSignature, SleepingComponent) == 0x000000, "Member 'A_Item_C_BndEvt__A_Item_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentSleepSignature__DelegateSignature::SleepingComponent' has a wrong offset!");
static_assert(offsetof(A_Item_C_BndEvt__A_Item_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentSleepSignature__DelegateSignature, BoneName) == 0x000008, "Member 'A_Item_C_BndEvt__A_Item_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentSleepSignature__DelegateSignature::BoneName' has a wrong offset!");

// Function A_Item.A_Item_C.ExecuteUbergraph_A_Item
// 0x0DC0 (0x0DC0 - 0x0000)
struct A_Item_C_ExecuteUbergraph_A_Item final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ATDB_GameMode_C*                        K2Node_DynamicCast_AsTDB_Game_Mode;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SurvGetUID_ID;                            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetUniqueID_Success;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPickupInfo_Updated;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_Player_8;                             // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_Player_7;                             // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_Player_6;                             // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_Player_5;                             // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SitIndex;                             // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_SkipAnimation;                        // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_Player_4;                             // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_Player_3;                             // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Visible_1;                            // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Visible;                              // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E[0x2];                                       // 0x007E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_Player_2;                             // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFItemInfo                             CallFunc_GetInfo_ItemInfo;                         // 0x0088(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Weaponry_C>       K2Node_DynamicCast_AsBPI_Weaponry;                 // 0x02A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_WP_GetSkeletalMesh_SkinnedMesh;           // 0x02C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WP_GetSkeletalMesh_Success;               // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x02D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ISurvAnimInterface_C>  K2Node_DynamicCast_AsSurv_Anim_Interface;          // 0x02E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          CallFunc_GetInteractAnim_Sequence;                 // 0x02F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ISurvAnimInterface_C>  K2Node_DynamicCast_AsSurv_Anim_Interface_1;        // 0x0300(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_311[0x3];                                      // 0x0311(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Montage_Play_ReturnValue;                 // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Montage_Play_ReturnValue_1;               // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31C[0x4];                                      // 0x031C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0320(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_334[0xC];                                      // 0x0334(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0340(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetLootTarget_Return;                     // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A1[0x3];                                      // 0x03A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_Player_1;                             // 0x03A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x03B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_Player;                               // 0x03C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ValidateWeapon_Result;                    // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C9[0x7];                                      // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             K2Node_CustomEvent_FItemInfo;                      // 0x03D0(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	class AWeaponPlaceholder_C*                   K2Node_CustomEvent_WraponPlaceholder;              // 0x05F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPickupInfo_Updated_1;                  // 0x05F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F9[0x3];                                      // 0x05F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumMaterials_ReturnValue;              // 0x05FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0600(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0601(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_602[0x6];                                      // 0x0602(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue_1;                // 0x0608(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0610(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_611[0x7];                                      // 0x0611(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATDB_GameMode_C*                        K2Node_DynamicCast_AsTDB_Game_Mode_1;              // 0x0618(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0620(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_621[0x3];                                      // 0x0621(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SurvGetUID_ID_1;                          // 0x0624(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetUniqueID_Success_1;                    // 0x0628(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0629(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62A[0x2];                                      // 0x062A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x062C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x063C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63D[0x3];                                      // 0x063D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0640(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0648(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0650(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          K2Node_DynamicCast_AsSkeletal_Mesh;                // 0x0658(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0660(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_661[0x7];                                      // 0x0661(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_1;                            // 0x0668(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x0670(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            K2Node_DynamicCast_AsStatic_Mesh;                  // 0x0678(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0680(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0681(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_682[0x2];                                      // 0x0682(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0684(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_68C[0x4];                                      // 0x068C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_SleepingComponent;      // 0x0690(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_BoneName;               // 0x0698(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFItemInfo                             K2Node_CustomEvent_ItemInfo;                       // 0x06A0(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x08C0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x08C8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_3;                              // 0x08D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x08D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x08DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8DD[0x3];                                      // 0x08DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x08E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x08E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E9[0x7];                                      // 0x08E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBPS_WeaponData                        CallFunc_GetDataTableRowFromName_OutRow;           // 0x08F0(0x04C0)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0DB0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DB1[0x3];                                      // 0x0DB1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue_1;            // 0x0DB4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0DB8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(A_Item_C_ExecuteUbergraph_A_Item) == 0x000010, "Wrong alignment on A_Item_C_ExecuteUbergraph_A_Item");
static_assert(sizeof(A_Item_C_ExecuteUbergraph_A_Item) == 0x000DC0, "Wrong size on A_Item_C_ExecuteUbergraph_A_Item");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, EntryPoint) == 0x000000, "Member 'A_Item_C_ExecuteUbergraph_A_Item::EntryPoint' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'A_Item_C_ExecuteUbergraph_A_Item::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, CallFunc_HasAuthority_ReturnValue) == 0x000014, "Member 'A_Item_C_ExecuteUbergraph_A_Item::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, CallFunc_GetGameMode_ReturnValue) == 0x000018, "Member 'A_Item_C_ExecuteUbergraph_A_Item::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, K2Node_DynamicCast_AsTDB_Game_Mode) == 0x000020, "Member 'A_Item_C_ExecuteUbergraph_A_Item::K2Node_DynamicCast_AsTDB_Game_Mode' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'A_Item_C_ExecuteUbergraph_A_Item::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, CallFunc_SurvGetUID_ID) == 0x00002C, "Member 'A_Item_C_ExecuteUbergraph_A_Item::CallFunc_SurvGetUID_ID' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, CallFunc_SetUniqueID_Success) == 0x000030, "Member 'A_Item_C_ExecuteUbergraph_A_Item::CallFunc_SetUniqueID_Success' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, CallFunc_SetPickupInfo_Updated) == 0x000031, "Member 'A_Item_C_ExecuteUbergraph_A_Item::CallFunc_SetPickupInfo_Updated' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, K2Node_Event_Player_8) == 0x000038, "Member 'A_Item_C_ExecuteUbergraph_A_Item::K2Node_Event_Player_8' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, K2Node_Event_Player_7) == 0x000040, "Member 'A_Item_C_ExecuteUbergraph_A_Item::K2Node_Event_Player_7' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, K2Node_Event_Player_6) == 0x000048, "Member 'A_Item_C_ExecuteUbergraph_A_Item::K2Node_Event_Player_6' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, K2Node_Event_Player_5) == 0x000050, "Member 'A_Item_C_ExecuteUbergraph_A_Item::K2Node_Event_Player_5' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, K2Node_Event_SitIndex) == 0x000058, "Member 'A_Item_C_ExecuteUbergraph_A_Item::K2Node_Event_SitIndex' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, K2Node_Event_SkipAnimation) == 0x00005C, "Member 'A_Item_C_ExecuteUbergraph_A_Item::K2Node_Event_SkipAnimation' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, K2Node_Event_Player_4) == 0x000060, "Member 'A_Item_C_ExecuteUbergraph_A_Item::K2Node_Event_Player_4' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, K2Node_Event_Player_3) == 0x000068, "Member 'A_Item_C_ExecuteUbergraph_A_Item::K2Node_Event_Player_3' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, K2Node_Event_Visible_1) == 0x000070, "Member 'A_Item_C_ExecuteUbergraph_A_Item::K2Node_Event_Visible_1' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, K2Node_Event_Visible) == 0x000071, "Member 'A_Item_C_ExecuteUbergraph_A_Item::K2Node_Event_Visible' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, CallFunc_Array_Length_ReturnValue) == 0x000074, "Member 'A_Item_C_ExecuteUbergraph_A_Item::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, CallFunc_Array_Length_ReturnValue_1) == 0x000078, "Member 'A_Item_C_ExecuteUbergraph_A_Item::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, CallFunc_Greater_IntInt_ReturnValue) == 0x00007C, "Member 'A_Item_C_ExecuteUbergraph_A_Item::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, CallFunc_Greater_IntInt_ReturnValue_1) == 0x00007D, "Member 'A_Item_C_ExecuteUbergraph_A_Item::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, K2Node_Event_Player_2) == 0x000080, "Member 'A_Item_C_ExecuteUbergraph_A_Item::K2Node_Event_Player_2' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, CallFunc_GetInfo_ItemInfo) == 0x000088, "Member 'A_Item_C_ExecuteUbergraph_A_Item::CallFunc_GetInfo_ItemInfo' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, K2Node_DynamicCast_AsBPI_Weaponry) == 0x0002A8, "Member 'A_Item_C_ExecuteUbergraph_A_Item::K2Node_DynamicCast_AsBPI_Weaponry' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, K2Node_DynamicCast_bSuccess_1) == 0x0002B8, "Member 'A_Item_C_ExecuteUbergraph_A_Item::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, CallFunc_WP_GetSkeletalMesh_SkinnedMesh) == 0x0002C0, "Member 'A_Item_C_ExecuteUbergraph_A_Item::CallFunc_WP_GetSkeletalMesh_SkinnedMesh' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, CallFunc_WP_GetSkeletalMesh_Success) == 0x0002C8, "Member 'A_Item_C_ExecuteUbergraph_A_Item::CallFunc_WP_GetSkeletalMesh_Success' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, CallFunc_GetAnimInstance_ReturnValue) == 0x0002D0, "Member 'A_Item_C_ExecuteUbergraph_A_Item::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x0002D8, "Member 'A_Item_C_ExecuteUbergraph_A_Item::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, K2Node_DynamicCast_AsSurv_Anim_Interface) == 0x0002E0, "Member 'A_Item_C_ExecuteUbergraph_A_Item::K2Node_DynamicCast_AsSurv_Anim_Interface' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, K2Node_DynamicCast_bSuccess_2) == 0x0002F0, "Member 'A_Item_C_ExecuteUbergraph_A_Item::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, CallFunc_GetInteractAnim_Sequence) == 0x0002F8, "Member 'A_Item_C_ExecuteUbergraph_A_Item::CallFunc_GetInteractAnim_Sequence' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, K2Node_DynamicCast_AsSurv_Anim_Interface_1) == 0x000300, "Member 'A_Item_C_ExecuteUbergraph_A_Item::K2Node_DynamicCast_AsSurv_Anim_Interface_1' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, K2Node_DynamicCast_bSuccess_3) == 0x000310, "Member 'A_Item_C_ExecuteUbergraph_A_Item::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, CallFunc_Montage_Play_ReturnValue) == 0x000314, "Member 'A_Item_C_ExecuteUbergraph_A_Item::CallFunc_Montage_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, CallFunc_Montage_Play_ReturnValue_1) == 0x000318, "Member 'A_Item_C_ExecuteUbergraph_A_Item::CallFunc_Montage_Play_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, CallFunc_Conv_TextToString_ReturnValue) == 0x000320, "Member 'A_Item_C_ExecuteUbergraph_A_Item::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, Temp_int_Variable) == 0x000330, "Member 'A_Item_C_ExecuteUbergraph_A_Item::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, CallFunc_GetTransform_ReturnValue) == 0x000340, "Member 'A_Item_C_ExecuteUbergraph_A_Item::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, CallFunc_SetLootTarget_Return) == 0x0003A0, "Member 'A_Item_C_ExecuteUbergraph_A_Item::CallFunc_SetLootTarget_Return' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, CallFunc_Add_IntInt_ReturnValue) == 0x0003A4, "Member 'A_Item_C_ExecuteUbergraph_A_Item::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, K2Node_Event_Player_1) == 0x0003A8, "Member 'A_Item_C_ExecuteUbergraph_A_Item::K2Node_Event_Player_1' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, K2Node_CreateDelegate_OutputDelegate_1) == 0x0003B0, "Member 'A_Item_C_ExecuteUbergraph_A_Item::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, K2Node_Event_Player) == 0x0003C0, "Member 'A_Item_C_ExecuteUbergraph_A_Item::K2Node_Event_Player' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, CallFunc_ValidateWeapon_Result) == 0x0003C8, "Member 'A_Item_C_ExecuteUbergraph_A_Item::CallFunc_ValidateWeapon_Result' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, K2Node_CustomEvent_FItemInfo) == 0x0003D0, "Member 'A_Item_C_ExecuteUbergraph_A_Item::K2Node_CustomEvent_FItemInfo' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, K2Node_CustomEvent_WraponPlaceholder) == 0x0005F0, "Member 'A_Item_C_ExecuteUbergraph_A_Item::K2Node_CustomEvent_WraponPlaceholder' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, CallFunc_SetPickupInfo_Updated_1) == 0x0005F8, "Member 'A_Item_C_ExecuteUbergraph_A_Item::CallFunc_SetPickupInfo_Updated_1' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, CallFunc_GetNumMaterials_ReturnValue) == 0x0005FC, "Member 'A_Item_C_ExecuteUbergraph_A_Item::CallFunc_GetNumMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000600, "Member 'A_Item_C_ExecuteUbergraph_A_Item::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000601, "Member 'A_Item_C_ExecuteUbergraph_A_Item::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, CallFunc_GetGameMode_ReturnValue_1) == 0x000608, "Member 'A_Item_C_ExecuteUbergraph_A_Item::CallFunc_GetGameMode_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, CallFunc_HasAuthority_ReturnValue_1) == 0x000610, "Member 'A_Item_C_ExecuteUbergraph_A_Item::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, K2Node_DynamicCast_AsTDB_Game_Mode_1) == 0x000618, "Member 'A_Item_C_ExecuteUbergraph_A_Item::K2Node_DynamicCast_AsTDB_Game_Mode_1' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, K2Node_DynamicCast_bSuccess_4) == 0x000620, "Member 'A_Item_C_ExecuteUbergraph_A_Item::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, CallFunc_SurvGetUID_ID_1) == 0x000624, "Member 'A_Item_C_ExecuteUbergraph_A_Item::CallFunc_SurvGetUID_ID_1' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, CallFunc_SetUniqueID_Success_1) == 0x000628, "Member 'A_Item_C_ExecuteUbergraph_A_Item::CallFunc_SetUniqueID_Success_1' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, CallFunc_HasAuthority_ReturnValue_2) == 0x000629, "Member 'A_Item_C_ExecuteUbergraph_A_Item::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, K2Node_CreateDelegate_OutputDelegate_2) == 0x00062C, "Member 'A_Item_C_ExecuteUbergraph_A_Item::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, CallFunc_HasAuthority_ReturnValue_3) == 0x00063C, "Member 'A_Item_C_ExecuteUbergraph_A_Item::CallFunc_HasAuthority_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000640, "Member 'A_Item_C_ExecuteUbergraph_A_Item::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, Temp_object_Variable) == 0x000648, "Member 'A_Item_C_ExecuteUbergraph_A_Item::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, K2Node_CustomEvent_Loaded) == 0x000650, "Member 'A_Item_C_ExecuteUbergraph_A_Item::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, K2Node_DynamicCast_AsSkeletal_Mesh) == 0x000658, "Member 'A_Item_C_ExecuteUbergraph_A_Item::K2Node_DynamicCast_AsSkeletal_Mesh' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, K2Node_DynamicCast_bSuccess_5) == 0x000660, "Member 'A_Item_C_ExecuteUbergraph_A_Item::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, Temp_object_Variable_1) == 0x000668, "Member 'A_Item_C_ExecuteUbergraph_A_Item::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, K2Node_CustomEvent_Loaded_1) == 0x000670, "Member 'A_Item_C_ExecuteUbergraph_A_Item::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, K2Node_DynamicCast_AsStatic_Mesh) == 0x000678, "Member 'A_Item_C_ExecuteUbergraph_A_Item::K2Node_DynamicCast_AsStatic_Mesh' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, K2Node_DynamicCast_bSuccess_6) == 0x000680, "Member 'A_Item_C_ExecuteUbergraph_A_Item::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, CallFunc_SetStaticMesh_ReturnValue) == 0x000681, "Member 'A_Item_C_ExecuteUbergraph_A_Item::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, Temp_name_Variable) == 0x000684, "Member 'A_Item_C_ExecuteUbergraph_A_Item::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, K2Node_ComponentBoundEvent_SleepingComponent) == 0x000690, "Member 'A_Item_C_ExecuteUbergraph_A_Item::K2Node_ComponentBoundEvent_SleepingComponent' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, K2Node_ComponentBoundEvent_BoneName) == 0x000698, "Member 'A_Item_C_ExecuteUbergraph_A_Item::K2Node_ComponentBoundEvent_BoneName' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, K2Node_CustomEvent_ItemInfo) == 0x0006A0, "Member 'A_Item_C_ExecuteUbergraph_A_Item::K2Node_CustomEvent_ItemInfo' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, Temp_name_Variable_1) == 0x0008C0, "Member 'A_Item_C_ExecuteUbergraph_A_Item::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, Temp_name_Variable_2) == 0x0008C8, "Member 'A_Item_C_ExecuteUbergraph_A_Item::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, Temp_name_Variable_3) == 0x0008D0, "Member 'A_Item_C_ExecuteUbergraph_A_Item::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, CallFunc_Array_AddUnique_ReturnValue) == 0x0008D8, "Member 'A_Item_C_ExecuteUbergraph_A_Item::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, Temp_bool_Variable) == 0x0008DC, "Member 'A_Item_C_ExecuteUbergraph_A_Item::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, K2Node_Select_Default) == 0x0008E0, "Member 'A_Item_C_ExecuteUbergraph_A_Item::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, CallFunc_Array_RemoveItem_ReturnValue) == 0x0008E8, "Member 'A_Item_C_ExecuteUbergraph_A_Item::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, CallFunc_GetDataTableRowFromName_OutRow) == 0x0008F0, "Member 'A_Item_C_ExecuteUbergraph_A_Item::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000DB0, "Member 'A_Item_C_ExecuteUbergraph_A_Item::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, CallFunc_Array_AddUnique_ReturnValue_1) == 0x000DB4, "Member 'A_Item_C_ExecuteUbergraph_A_Item::CallFunc_Array_AddUnique_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(A_Item_C_ExecuteUbergraph_A_Item, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x000DB8, "Member 'A_Item_C_ExecuteUbergraph_A_Item::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");

// Function A_Item.A_Item_C.GetActorType
// 0x0001 (0x0001 - 0x0000)
struct A_Item_C_GetActorType final
{
public:
	E_ActorType                                   ActorType;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(A_Item_C_GetActorType) == 0x000001, "Wrong alignment on A_Item_C_GetActorType");
static_assert(sizeof(A_Item_C_GetActorType) == 0x000001, "Wrong size on A_Item_C_GetActorType");
static_assert(offsetof(A_Item_C_GetActorType, ActorType) == 0x000000, "Member 'A_Item_C_GetActorType::ActorType' has a wrong offset!");

// Function A_Item.A_Item_C.HasTag
// 0x0020 (0x0020 - 0x0000)
struct A_Item_C_HasTag final
{
public:
	class FString                                 Tag;                                               // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Param_HasTag;                                      // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ActorHasTag_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(A_Item_C_HasTag) == 0x000008, "Wrong alignment on A_Item_C_HasTag");
static_assert(sizeof(A_Item_C_HasTag) == 0x000020, "Wrong size on A_Item_C_HasTag");
static_assert(offsetof(A_Item_C_HasTag, Tag) == 0x000000, "Member 'A_Item_C_HasTag::Tag' has a wrong offset!");
static_assert(offsetof(A_Item_C_HasTag, Param_HasTag) == 0x000010, "Member 'A_Item_C_HasTag::Param_HasTag' has a wrong offset!");
static_assert(offsetof(A_Item_C_HasTag, CallFunc_Conv_StringToName_ReturnValue) == 0x000014, "Member 'A_Item_C_HasTag::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_Item_C_HasTag, CallFunc_ActorHasTag_ReturnValue) == 0x00001C, "Member 'A_Item_C_HasTag::CallFunc_ActorHasTag_ReturnValue' has a wrong offset!");

// Function A_Item.A_Item_C.InitWeaponPlaceholder
// 0x0228 (0x0228 - 0x0000)
struct A_Item_C_InitWeaponPlaceholder final
{
public:
	struct FFItemInfo                             FItemInfo;                                         // 0x0000(0x0220)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
	class AWeaponPlaceholder_C*                   WraponPlaceholder;                                 // 0x0220(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(A_Item_C_InitWeaponPlaceholder) == 0x000008, "Wrong alignment on A_Item_C_InitWeaponPlaceholder");
static_assert(sizeof(A_Item_C_InitWeaponPlaceholder) == 0x000228, "Wrong size on A_Item_C_InitWeaponPlaceholder");
static_assert(offsetof(A_Item_C_InitWeaponPlaceholder, FItemInfo) == 0x000000, "Member 'A_Item_C_InitWeaponPlaceholder::FItemInfo' has a wrong offset!");
static_assert(offsetof(A_Item_C_InitWeaponPlaceholder, WraponPlaceholder) == 0x000220, "Member 'A_Item_C_InitWeaponPlaceholder::WraponPlaceholder' has a wrong offset!");

// Function A_Item.A_Item_C.IsLocked?
// 0x0001 (0x0001 - 0x0000)
struct A_Item_C_IsLocked_ final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(A_Item_C_IsLocked_) == 0x000001, "Wrong alignment on A_Item_C_IsLocked_");
static_assert(sizeof(A_Item_C_IsLocked_) == 0x000001, "Wrong size on A_Item_C_IsLocked_");
static_assert(offsetof(A_Item_C_IsLocked_, Result) == 0x000000, "Member 'A_Item_C_IsLocked_::Result' has a wrong offset!");

// Function A_Item.A_Item_C.IsSomethingOnA Way
// 0x0140 (0x0140 - 0x0000)
struct A_Item_C_IsSomethingOnA_Way final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0050(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(A_Item_C_IsSomethingOnA_Way) == 0x000008, "Wrong alignment on A_Item_C_IsSomethingOnA_Way");
static_assert(sizeof(A_Item_C_IsSomethingOnA_Way) == 0x000140, "Wrong size on A_Item_C_IsSomethingOnA_Way");
static_assert(offsetof(A_Item_C_IsSomethingOnA_Way, ReturnValue) == 0x000000, "Member 'A_Item_C_IsSomethingOnA_Way::ReturnValue' has a wrong offset!");
static_assert(offsetof(A_Item_C_IsSomethingOnA_Way, Temp_object_Variable) == 0x000008, "Member 'A_Item_C_IsSomethingOnA_Way::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(A_Item_C_IsSomethingOnA_Way, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000018, "Member 'A_Item_C_IsSomethingOnA_Way::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_Item_C_IsSomethingOnA_Way, CallFunc_GetPlayerController_ReturnValue) == 0x000030, "Member 'A_Item_C_IsSomethingOnA_Way::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_Item_C_IsSomethingOnA_Way, CallFunc_GetCameraLocation_ReturnValue) == 0x000038, "Member 'A_Item_C_IsSomethingOnA_Way::CallFunc_GetCameraLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_Item_C_IsSomethingOnA_Way, CallFunc_LineTraceSingle_OutHit) == 0x000050, "Member 'A_Item_C_IsSomethingOnA_Way::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(A_Item_C_IsSomethingOnA_Way, CallFunc_LineTraceSingle_ReturnValue) == 0x000138, "Member 'A_Item_C_IsSomethingOnA_Way::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");

// Function A_Item.A_Item_C.OnBeginInteract
// 0x0008 (0x0008 - 0x0000)
struct A_Item_C_OnBeginInteract final
{
public:
	class APawn*                                  Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(A_Item_C_OnBeginInteract) == 0x000008, "Wrong alignment on A_Item_C_OnBeginInteract");
static_assert(sizeof(A_Item_C_OnBeginInteract) == 0x000008, "Wrong size on A_Item_C_OnBeginInteract");
static_assert(offsetof(A_Item_C_OnBeginInteract, Player) == 0x000000, "Member 'A_Item_C_OnBeginInteract::Player' has a wrong offset!");

// Function A_Item.A_Item_C.OnFocused
// 0x0078 (0x0078 - 0x0000)
struct A_Item_C_OnFocused final
{
public:
	class APawn*                                  Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 HighlightActor;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UActorComponent*                        HighlightActorComponent;                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	E_InteractType                                InteractType;                                      // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        LateTime;                                          // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FunctionLateTime;                                  // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_InteractType                                FunctionInteractType;                              // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC;                  // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_PlayerMain_C*                      CallFunc_GetPlayerGUI_GUI;                         // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSomethingOnA_Way_ReturnValue;           // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(A_Item_C_OnFocused) == 0x000008, "Wrong alignment on A_Item_C_OnFocused");
static_assert(sizeof(A_Item_C_OnFocused) == 0x000078, "Wrong size on A_Item_C_OnFocused");
static_assert(offsetof(A_Item_C_OnFocused, Player) == 0x000000, "Member 'A_Item_C_OnFocused::Player' has a wrong offset!");
static_assert(offsetof(A_Item_C_OnFocused, HighlightActor) == 0x000008, "Member 'A_Item_C_OnFocused::HighlightActor' has a wrong offset!");
static_assert(offsetof(A_Item_C_OnFocused, HighlightActorComponent) == 0x000010, "Member 'A_Item_C_OnFocused::HighlightActorComponent' has a wrong offset!");
static_assert(offsetof(A_Item_C_OnFocused, InteractType) == 0x000018, "Member 'A_Item_C_OnFocused::InteractType' has a wrong offset!");
static_assert(offsetof(A_Item_C_OnFocused, LateTime) == 0x000020, "Member 'A_Item_C_OnFocused::LateTime' has a wrong offset!");
static_assert(offsetof(A_Item_C_OnFocused, FunctionLateTime) == 0x000028, "Member 'A_Item_C_OnFocused::FunctionLateTime' has a wrong offset!");
static_assert(offsetof(A_Item_C_OnFocused, FunctionInteractType) == 0x000030, "Member 'A_Item_C_OnFocused::FunctionInteractType' has a wrong offset!");
static_assert(offsetof(A_Item_C_OnFocused, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'A_Item_C_OnFocused::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_Item_C_OnFocused, CallFunc_GetController_ReturnValue) == 0x000038, "Member 'A_Item_C_OnFocused::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_Item_C_OnFocused, K2Node_DynamicCast_AsPlayer_Controller) == 0x000040, "Member 'A_Item_C_OnFocused::K2Node_DynamicCast_AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(A_Item_C_OnFocused, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'A_Item_C_OnFocused::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(A_Item_C_OnFocused, K2Node_DynamicCast_AsBPI_Surv_PC) == 0x000050, "Member 'A_Item_C_OnFocused::K2Node_DynamicCast_AsBPI_Surv_PC' has a wrong offset!");
static_assert(offsetof(A_Item_C_OnFocused, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'A_Item_C_OnFocused::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(A_Item_C_OnFocused, CallFunc_Not_PreBool_ReturnValue) == 0x000061, "Member 'A_Item_C_OnFocused::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_Item_C_OnFocused, CallFunc_GetPlayerGUI_GUI) == 0x000068, "Member 'A_Item_C_OnFocused::CallFunc_GetPlayerGUI_GUI' has a wrong offset!");
static_assert(offsetof(A_Item_C_OnFocused, CallFunc_IsValid_ReturnValue_1) == 0x000070, "Member 'A_Item_C_OnFocused::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(A_Item_C_OnFocused, CallFunc_IsSomethingOnA_Way_ReturnValue) == 0x000071, "Member 'A_Item_C_OnFocused::CallFunc_IsSomethingOnA_Way_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_Item_C_OnFocused, CallFunc_Not_PreBool_ReturnValue_1) == 0x000072, "Member 'A_Item_C_OnFocused::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");

// Function A_Item.A_Item_C.OnInteract
// 0x0008 (0x0008 - 0x0000)
struct A_Item_C_OnInteract final
{
public:
	class APawn*                                  Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(A_Item_C_OnInteract) == 0x000008, "Wrong alignment on A_Item_C_OnInteract");
static_assert(sizeof(A_Item_C_OnInteract) == 0x000008, "Wrong size on A_Item_C_OnInteract");
static_assert(offsetof(A_Item_C_OnInteract, Player) == 0x000000, "Member 'A_Item_C_OnInteract::Player' has a wrong offset!");

// Function A_Item.A_Item_C.OnInteract2
// 0x0008 (0x0008 - 0x0000)
struct A_Item_C_OnInteract2 final
{
public:
	class APawn*                                  Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(A_Item_C_OnInteract2) == 0x000008, "Wrong alignment on A_Item_C_OnInteract2");
static_assert(sizeof(A_Item_C_OnInteract2) == 0x000008, "Wrong size on A_Item_C_OnInteract2");
static_assert(offsetof(A_Item_C_OnInteract2, Player) == 0x000000, "Member 'A_Item_C_OnInteract2::Player' has a wrong offset!");

// Function A_Item.A_Item_C.OnInteract3
// 0x0008 (0x0008 - 0x0000)
struct A_Item_C_OnInteract3 final
{
public:
	class APawn*                                  Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(A_Item_C_OnInteract3) == 0x000008, "Wrong alignment on A_Item_C_OnInteract3");
static_assert(sizeof(A_Item_C_OnInteract3) == 0x000008, "Wrong size on A_Item_C_OnInteract3");
static_assert(offsetof(A_Item_C_OnInteract3, Player) == 0x000000, "Member 'A_Item_C_OnInteract3::Player' has a wrong offset!");

// Function A_Item.A_Item_C.OnInteractVehicle
// 0x0010 (0x0010 - 0x0000)
struct A_Item_C_OnInteractVehicle final
{
public:
	class APawn*                                  Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         SitIndex;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SkipAnimation;                                     // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(A_Item_C_OnInteractVehicle) == 0x000008, "Wrong alignment on A_Item_C_OnInteractVehicle");
static_assert(sizeof(A_Item_C_OnInteractVehicle) == 0x000010, "Wrong size on A_Item_C_OnInteractVehicle");
static_assert(offsetof(A_Item_C_OnInteractVehicle, Player) == 0x000000, "Member 'A_Item_C_OnInteractVehicle::Player' has a wrong offset!");
static_assert(offsetof(A_Item_C_OnInteractVehicle, SitIndex) == 0x000008, "Member 'A_Item_C_OnInteractVehicle::SitIndex' has a wrong offset!");
static_assert(offsetof(A_Item_C_OnInteractVehicle, SkipAnimation) == 0x00000C, "Member 'A_Item_C_OnInteractVehicle::SkipAnimation' has a wrong offset!");

// Function A_Item.A_Item_C.OnLoaded_0BB85B6D489E01394E6284BCBF05E250
// 0x0008 (0x0008 - 0x0000)
struct A_Item_C_OnLoaded_0BB85B6D489E01394E6284BCBF05E250 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(A_Item_C_OnLoaded_0BB85B6D489E01394E6284BCBF05E250) == 0x000008, "Wrong alignment on A_Item_C_OnLoaded_0BB85B6D489E01394E6284BCBF05E250");
static_assert(sizeof(A_Item_C_OnLoaded_0BB85B6D489E01394E6284BCBF05E250) == 0x000008, "Wrong size on A_Item_C_OnLoaded_0BB85B6D489E01394E6284BCBF05E250");
static_assert(offsetof(A_Item_C_OnLoaded_0BB85B6D489E01394E6284BCBF05E250, Loaded) == 0x000000, "Member 'A_Item_C_OnLoaded_0BB85B6D489E01394E6284BCBF05E250::Loaded' has a wrong offset!");

// Function A_Item.A_Item_C.OnLoaded_8D47720B4D54BD33208329A6A1DDDCE5
// 0x0008 (0x0008 - 0x0000)
struct A_Item_C_OnLoaded_8D47720B4D54BD33208329A6A1DDDCE5 final
{
public:
