#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Abbie_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct Abbie_Skeleton_AnimBlueprint.Abbie_Skeleton_AnimBlueprint_C.AnimBlueprintGeneratedConstantData
// 0x014F (0x0150 - 0x0001)
struct Abbie_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_94;                                 // 0x0008(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_95;                                   // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_96;                                 // 0x0018(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_97;                                 // 0x0019(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_98;                                // 0x0020(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          __BoolProperty_99;                                 // 0x0030(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_100;                                // 0x0034(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_101;                                 // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_102;                               // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_103;                              // 0x0044(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_104;                               // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_105;                                // 0x0074(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_106;                                // 0x0075(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_107;                                // 0x0076(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_77[0x1];                                       // 0x0077(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_108;                                // 0x0078(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_109;                                 // 0x0080(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_110;                              // 0x0088(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_111;                                // 0x00A8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_112;                                // 0x00B0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00B8(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0138(0x0018)()
};
static_assert(alignof(Abbie_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on Abbie_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(Abbie_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData) == 0x000150, "Wrong size on Abbie_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(Abbie_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __BlendProfile_94) == 0x000008, "Member 'Abbie_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__BlendProfile_94' has a wrong offset!");
static_assert(offsetof(Abbie_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __CurveFloat_95) == 0x000010, "Member 'Abbie_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__CurveFloat_95' has a wrong offset!");
static_assert(offsetof(Abbie_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __EnumProperty_96) == 0x000018, "Member 'Abbie_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__EnumProperty_96' has a wrong offset!");
static_assert(offsetof(Abbie_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __EnumProperty_97) == 0x000019, "Member 'Abbie_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__EnumProperty_97' has a wrong offset!");
static_assert(offsetof(Abbie_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __ArrayProperty_98) == 0x000020, "Member 'Abbie_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__ArrayProperty_98' has a wrong offset!");
static_assert(offsetof(Abbie_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __BoolProperty_99) == 0x000030, "Member 'Abbie_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__BoolProperty_99' has a wrong offset!");
static_assert(offsetof(Abbie_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_100) == 0x000034, "Member 'Abbie_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_100' has a wrong offset!");
static_assert(offsetof(Abbie_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __IntProperty_101) == 0x00003C, "Member 'Abbie_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__IntProperty_101' has a wrong offset!");
static_assert(offsetof(Abbie_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __FloatProperty_102) == 0x000040, "Member 'Abbie_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__FloatProperty_102' has a wrong offset!");
static_assert(offsetof(Abbie_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __StructProperty_103) == 0x000044, "Member 'Abbie_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__StructProperty_103' has a wrong offset!");
static_assert(offsetof(Abbie_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __FloatProperty_104) == 0x000070, "Member 'Abbie_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__FloatProperty_104' has a wrong offset!");
static_assert(offsetof(Abbie_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __BoolProperty_105) == 0x000074, "Member 'Abbie_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__BoolProperty_105' has a wrong offset!");
static_assert(offsetof(Abbie_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __EnumProperty_106) == 0x000075, "Member 'Abbie_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__EnumProperty_106' has a wrong offset!");
static_assert(offsetof(Abbie_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __ByteProperty_107) == 0x000076, "Member 'Abbie_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__ByteProperty_107' has a wrong offset!");
static_assert(offsetof(Abbie_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_108) == 0x000078, "Member 'Abbie_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_108' has a wrong offset!");
static_assert(offsetof(Abbie_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __IntProperty_109) == 0x000080, "Member 'Abbie_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__IntProperty_109' has a wrong offset!");
static_assert(offsetof(Abbie_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __StructProperty_110) == 0x000088, "Member 'Abbie_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__StructProperty_110' has a wrong offset!");
static_assert(offsetof(Abbie_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_111) == 0x0000A8, "Member 'Abbie_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_111' has a wrong offset!");
static_assert(offsetof(Abbie_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_112) == 0x0000B0, "Member 'Abbie_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_112' has a wrong offset!");
static_assert(offsetof(Abbie_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000B8, "Member 'Abbie_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(Abbie_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000138, "Member 'Abbie_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct Abbie_Skeleton_AnimBlueprint.Abbie_Skeleton_AnimBlueprint_C.AnimBlueprintGeneratedMutableData
// 0x0001 (0x0002 - 0x0001)
struct Abbie_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Abbie_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on Abbie_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(Abbie_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedMutableData) == 0x000002, "Wrong size on Abbie_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(Abbie_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'Abbie_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");

}

