#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Abbie_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Abbie_Skeleton_AnimBlueprint_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Abbie_Skeleton_AnimBlueprint.Abbie_Skeleton_AnimBlueprint_C
// 0x05D0 (0x0920 - 0x0350)
class UAbbie_Skeleton_AnimBlueprint_C final : public UAnimInstance
{
public:
	uint8                                         Pad_348[0x8];                                      // 0x0348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct Abbie_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x0358(0x0002)(HasGetValueTypeHash)
	uint8                                         Pad_35A[0x6];                                      // 0x035A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0360(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0368(0x0008)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0370(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x03B8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x03E0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x0428(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0448(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0490(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x04B0(0x00C8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0578(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x05A0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x05E8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0608(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0650(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0670(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0738(0x0108)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0840(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x0868(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x08B0(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x08F8(0x0020)()
	bool                                          bSurvInteracted;                                   // 0x0918(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Abbie_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_84A6013D4D434BE1577BB894A2221559();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Abbie_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_B98C11704AA27B8ACD81A6AE3BFCAC70();
	void ExecuteUbergraph_Abbie_Skeleton_AnimBlueprint(int32 EntryPoint);
	void OnInteracted();
	void StopInteracting();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Abbie_Skeleton_AnimBlueprint_C">();
	}
	static class UAbbie_Skeleton_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbbie_Skeleton_AnimBlueprint_C>();
	}
};
static_assert(alignof(UAbbie_Skeleton_AnimBlueprint_C) == 0x000010, "Wrong alignment on UAbbie_Skeleton_AnimBlueprint_C");
static_assert(sizeof(UAbbie_Skeleton_AnimBlueprint_C) == 0x000920, "Wrong size on UAbbie_Skeleton_AnimBlueprint_C");
static_assert(offsetof(UAbbie_Skeleton_AnimBlueprint_C, UberGraphFrame) == 0x000350, "Member 'UAbbie_Skeleton_AnimBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAbbie_Skeleton_AnimBlueprint_C, __AnimBlueprintMutables) == 0x000358, "Member 'UAbbie_Skeleton_AnimBlueprint_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UAbbie_Skeleton_AnimBlueprint_C, AnimBlueprintExtension_PropertyAccess) == 0x000360, "Member 'UAbbie_Skeleton_AnimBlueprint_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UAbbie_Skeleton_AnimBlueprint_C, AnimBlueprintExtension_Base) == 0x000368, "Member 'UAbbie_Skeleton_AnimBlueprint_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UAbbie_Skeleton_AnimBlueprint_C, AnimGraphNode_BlendListByBool) == 0x000370, "Member 'UAbbie_Skeleton_AnimBlueprint_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UAbbie_Skeleton_AnimBlueprint_C, AnimGraphNode_TransitionResult_1) == 0x0003B8, "Member 'UAbbie_Skeleton_AnimBlueprint_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UAbbie_Skeleton_AnimBlueprint_C, AnimGraphNode_SequencePlayer_3) == 0x0003E0, "Member 'UAbbie_Skeleton_AnimBlueprint_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UAbbie_Skeleton_AnimBlueprint_C, AnimGraphNode_StateResult_3) == 0x000428, "Member 'UAbbie_Skeleton_AnimBlueprint_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UAbbie_Skeleton_AnimBlueprint_C, AnimGraphNode_SequencePlayer_2) == 0x000448, "Member 'UAbbie_Skeleton_AnimBlueprint_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UAbbie_Skeleton_AnimBlueprint_C, AnimGraphNode_StateResult_2) == 0x000490, "Member 'UAbbie_Skeleton_AnimBlueprint_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UAbbie_Skeleton_AnimBlueprint_C, AnimGraphNode_StateMachine_1) == 0x0004B0, "Member 'UAbbie_Skeleton_AnimBlueprint_C::AnimGraphNode_StateMachine_1' has a wrong offset!");
static_assert(offsetof(UAbbie_Skeleton_AnimBlueprint_C, AnimGraphNode_TransitionResult) == 0x000578, "Member 'UAbbie_Skeleton_AnimBlueprint_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UAbbie_Skeleton_AnimBlueprint_C, AnimGraphNode_SequencePlayer_1) == 0x0005A0, "Member 'UAbbie_Skeleton_AnimBlueprint_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UAbbie_Skeleton_AnimBlueprint_C, AnimGraphNode_StateResult_1) == 0x0005E8, "Member 'UAbbie_Skeleton_AnimBlueprint_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UAbbie_Skeleton_AnimBlueprint_C, AnimGraphNode_SequencePlayer) == 0x000608, "Member 'UAbbie_Skeleton_AnimBlueprint_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UAbbie_Skeleton_AnimBlueprint_C, AnimGraphNode_StateResult) == 0x000650, "Member 'UAbbie_Skeleton_AnimBlueprint_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UAbbie_Skeleton_AnimBlueprint_C, AnimGraphNode_StateMachine) == 0x000670, "Member 'UAbbie_Skeleton_AnimBlueprint_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UAbbie_Skeleton_AnimBlueprint_C, AnimGraphNode_SaveCachedPose) == 0x000738, "Member 'UAbbie_Skeleton_AnimBlueprint_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UAbbie_Skeleton_AnimBlueprint_C, AnimGraphNode_UseCachedPose) == 0x000840, "Member 'UAbbie_Skeleton_AnimBlueprint_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UAbbie_Skeleton_AnimBlueprint_C, AnimGraphNode_Slot_1) == 0x000868, "Member 'UAbbie_Skeleton_AnimBlueprint_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UAbbie_Skeleton_AnimBlueprint_C, AnimGraphNode_Slot) == 0x0008B0, "Member 'UAbbie_Skeleton_AnimBlueprint_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UAbbie_Skeleton_AnimBlueprint_C, AnimGraphNode_Root) == 0x0008F8, "Member 'UAbbie_Skeleton_AnimBlueprint_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UAbbie_Skeleton_AnimBlueprint_C, bSurvInteracted) == 0x000918, "Member 'UAbbie_Skeleton_AnimBlueprint_C::bSurvInteracted' has a wrong offset!");

}

