#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_MW_3_LOD

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_MW_3_LOD.ABP_MW_3_LOD_C.AnimBlueprintGeneratedConstantData
// 0x0137 (0x0138 - 0x0001)
struct ABP_MW_3_LOD::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_26;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_27;                                 // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_28;                                   // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_29;                                 // 0x0020(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_30;                                 // 0x0021(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_31;                                // 0x0028(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          __BoolProperty_32;                                 // 0x0038(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_33;                                // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_34;                               // 0x0040(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_35;                                // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_36;                                 // 0x0070(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_37;                                 // 0x0071(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_38;                                 // 0x0072(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73[0x1];                                       // 0x0073(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_39;                                 // 0x0074(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_40;                               // 0x0080(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00A0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0120(0x0018)()
};
static_assert(alignof(ABP_MW_3_LOD::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_MW_3_LOD::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_MW_3_LOD::FAnimBlueprintGeneratedConstantData) == 0x000138, "Wrong size on ABP_MW_3_LOD::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_MW_3_LOD::FAnimBlueprintGeneratedConstantData, __NameProperty_26) == 0x000004, "Member 'ABP_MW_3_LOD::FAnimBlueprintGeneratedConstantData::__NameProperty_26' has a wrong offset!");
static_assert(offsetof(ABP_MW_3_LOD::FAnimBlueprintGeneratedConstantData, __BlendProfile_27) == 0x000010, "Member 'ABP_MW_3_LOD::FAnimBlueprintGeneratedConstantData::__BlendProfile_27' has a wrong offset!");
static_assert(offsetof(ABP_MW_3_LOD::FAnimBlueprintGeneratedConstantData, __CurveFloat_28) == 0x000018, "Member 'ABP_MW_3_LOD::FAnimBlueprintGeneratedConstantData::__CurveFloat_28' has a wrong offset!");
static_assert(offsetof(ABP_MW_3_LOD::FAnimBlueprintGeneratedConstantData, __EnumProperty_29) == 0x000020, "Member 'ABP_MW_3_LOD::FAnimBlueprintGeneratedConstantData::__EnumProperty_29' has a wrong offset!");
static_assert(offsetof(ABP_MW_3_LOD::FAnimBlueprintGeneratedConstantData, __EnumProperty_30) == 0x000021, "Member 'ABP_MW_3_LOD::FAnimBlueprintGeneratedConstantData::__EnumProperty_30' has a wrong offset!");
static_assert(offsetof(ABP_MW_3_LOD::FAnimBlueprintGeneratedConstantData, __ArrayProperty_31) == 0x000028, "Member 'ABP_MW_3_LOD::FAnimBlueprintGeneratedConstantData::__ArrayProperty_31' has a wrong offset!");
static_assert(offsetof(ABP_MW_3_LOD::FAnimBlueprintGeneratedConstantData, __BoolProperty_32) == 0x000038, "Member 'ABP_MW_3_LOD::FAnimBlueprintGeneratedConstantData::__BoolProperty_32' has a wrong offset!");
static_assert(offsetof(ABP_MW_3_LOD::FAnimBlueprintGeneratedConstantData, __FloatProperty_33) == 0x00003C, "Member 'ABP_MW_3_LOD::FAnimBlueprintGeneratedConstantData::__FloatProperty_33' has a wrong offset!");
static_assert(offsetof(ABP_MW_3_LOD::FAnimBlueprintGeneratedConstantData, __StructProperty_34) == 0x000040, "Member 'ABP_MW_3_LOD::FAnimBlueprintGeneratedConstantData::__StructProperty_34' has a wrong offset!");
static_assert(offsetof(ABP_MW_3_LOD::FAnimBlueprintGeneratedConstantData, __FloatProperty_35) == 0x00006C, "Member 'ABP_MW_3_LOD::FAnimBlueprintGeneratedConstantData::__FloatProperty_35' has a wrong offset!");
static_assert(offsetof(ABP_MW_3_LOD::FAnimBlueprintGeneratedConstantData, __BoolProperty_36) == 0x000070, "Member 'ABP_MW_3_LOD::FAnimBlueprintGeneratedConstantData::__BoolProperty_36' has a wrong offset!");
static_assert(offsetof(ABP_MW_3_LOD::FAnimBlueprintGeneratedConstantData, __EnumProperty_37) == 0x000071, "Member 'ABP_MW_3_LOD::FAnimBlueprintGeneratedConstantData::__EnumProperty_37' has a wrong offset!");
static_assert(offsetof(ABP_MW_3_LOD::FAnimBlueprintGeneratedConstantData, __ByteProperty_38) == 0x000072, "Member 'ABP_MW_3_LOD::FAnimBlueprintGeneratedConstantData::__ByteProperty_38' has a wrong offset!");
static_assert(offsetof(ABP_MW_3_LOD::FAnimBlueprintGeneratedConstantData, __NameProperty_39) == 0x000074, "Member 'ABP_MW_3_LOD::FAnimBlueprintGeneratedConstantData::__NameProperty_39' has a wrong offset!");
static_assert(offsetof(ABP_MW_3_LOD::FAnimBlueprintGeneratedConstantData, __StructProperty_40) == 0x000080, "Member 'ABP_MW_3_LOD::FAnimBlueprintGeneratedConstantData::__StructProperty_40' has a wrong offset!");
static_assert(offsetof(ABP_MW_3_LOD::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000A0, "Member 'ABP_MW_3_LOD::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_MW_3_LOD::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000120, "Member 'ABP_MW_3_LOD::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct ABP_MW_3_LOD.ABP_MW_3_LOD_C.AnimBlueprintGeneratedMutableData
// 0x0001 (0x0002 - 0x0001)
struct ABP_MW_3_LOD::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_MW_3_LOD::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on ABP_MW_3_LOD::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_MW_3_LOD::FAnimBlueprintGeneratedMutableData) == 0x000002, "Wrong size on ABP_MW_3_LOD::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_MW_3_LOD::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'ABP_MW_3_LOD::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");

}

