#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_WhiteHead

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ABP_WhiteHead_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_WhiteHead.ABP_WhiteHead_C
// 0x04F0 (0x0840 - 0x0350)
class UABP_WhiteHead_C final : public UAnimInstance
{
public:
	uint8                                         Pad_348[0x8];                                      // 0x0348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_WhiteHead::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x0358(0x0002)(HasGetValueTypeHash)
	uint8                                         Pad_35A[0x6];                                      // 0x035A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0360(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0368(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0370(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x0390(0x01D8)(ContainsInstancedReference)
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x0568(0x00E0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x0648(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0690(0x0048)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x06D8(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x07A0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x07E8(0x0048)()
	class USkeletalMeshComponent*                 Mesh;                                              // 0x0830(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          In_Lobby;                                          // 0x0838(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* Param_AnimGraph);
	void BlueprintInitializeAnimation();
	void ExecuteUbergraph_ABP_WhiteHead(int32 EntryPoint);
	void GetInLobby(bool* InLobby);
	void SetInLobby(bool InLobby);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_WhiteHead_C">();
	}
	static class UABP_WhiteHead_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_WhiteHead_C>();
	}
};
static_assert(alignof(UABP_WhiteHead_C) == 0x000010, "Wrong alignment on UABP_WhiteHead_C");
static_assert(sizeof(UABP_WhiteHead_C) == 0x000840, "Wrong size on UABP_WhiteHead_C");
static_assert(offsetof(UABP_WhiteHead_C, UberGraphFrame) == 0x000350, "Member 'UABP_WhiteHead_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_WhiteHead_C, __AnimBlueprintMutables) == 0x000358, "Member 'UABP_WhiteHead_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UABP_WhiteHead_C, AnimBlueprintExtension_PropertyAccess) == 0x000360, "Member 'UABP_WhiteHead_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_WhiteHead_C, AnimBlueprintExtension_Base) == 0x000368, "Member 'UABP_WhiteHead_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_WhiteHead_C, AnimGraphNode_Root) == 0x000370, "Member 'UABP_WhiteHead_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_WhiteHead_C, AnimGraphNode_CopyPoseFromMesh) == 0x000390, "Member 'UABP_WhiteHead_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UABP_WhiteHead_C, AnimGraphNode_LayeredBoneBlend) == 0x000568, "Member 'UABP_WhiteHead_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UABP_WhiteHead_C, AnimGraphNode_Slot_1) == 0x000648, "Member 'UABP_WhiteHead_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UABP_WhiteHead_C, AnimGraphNode_BlendListByBool) == 0x000690, "Member 'UABP_WhiteHead_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UABP_WhiteHead_C, AnimGraphNode_LinkedInputPose) == 0x0006D8, "Member 'UABP_WhiteHead_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UABP_WhiteHead_C, AnimGraphNode_Slot) == 0x0007A0, "Member 'UABP_WhiteHead_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_WhiteHead_C, AnimGraphNode_SequencePlayer) == 0x0007E8, "Member 'UABP_WhiteHead_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_WhiteHead_C, Mesh) == 0x000830, "Member 'UABP_WhiteHead_C::Mesh' has a wrong offset!");
static_assert(offsetof(UABP_WhiteHead_C, In_Lobby) == 0x000838, "Member 'UABP_WhiteHead_C::In_Lobby' has a wrong offset!");

}

