#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_ZombieFinalCopy_Night

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Survival_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ABP_ZombieFinalCopy_Night.ABP_ZombieFinalCopy_Night_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_ZombieFinalCopy_Night_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_ZombieFinalCopy_Night_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_ZombieFinalCopy_Night_C_AnimGraph");
static_assert(sizeof(ABP_ZombieFinalCopy_Night_C_AnimGraph) == 0x000010, "Wrong size on ABP_ZombieFinalCopy_Night_C_AnimGraph");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'ABP_ZombieFinalCopy_Night_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function ABP_ZombieFinalCopy_Night.ABP_ZombieFinalCopy_Night_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_ZombieFinalCopy_Night_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_ZombieFinalCopy_Night_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_ZombieFinalCopy_Night_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_ZombieFinalCopy_Night_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_ZombieFinalCopy_Night_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_ZombieFinalCopy_Night_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_ZombieFinalCopy_Night.ABP_ZombieFinalCopy_Night_C.CalculateLeaning
// 0x0070 (0x0070 - 0x0000)
struct ABP_ZombieFinalCopy_Night_C_CalculateLeaning final
{
public:
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_ReturnValue;                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_NormalizedDeltaRotator_ReturnValue;       // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_SafeDivide_ReturnValue;                   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_DeltaTime_ImplicitCast;         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_B_ImplicitCast;                // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_A_ImplicitCast;                // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_ZombieFinalCopy_Night_C_CalculateLeaning) == 0x000008, "Wrong alignment on ABP_ZombieFinalCopy_Night_C_CalculateLeaning");
static_assert(sizeof(ABP_ZombieFinalCopy_Night_C_CalculateLeaning) == 0x000070, "Wrong size on ABP_ZombieFinalCopy_Night_C_CalculateLeaning");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_CalculateLeaning, CallFunc_FClamp_ReturnValue) == 0x000000, "Member 'ABP_ZombieFinalCopy_Night_C_CalculateLeaning::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_CalculateLeaning, CallFunc_FInterpTo_ReturnValue) == 0x000008, "Member 'ABP_ZombieFinalCopy_Night_C_CalculateLeaning::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_CalculateLeaning, CallFunc_NormalizedDeltaRotator_ReturnValue) == 0x000010, "Member 'ABP_ZombieFinalCopy_Night_C_CalculateLeaning::CallFunc_NormalizedDeltaRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_CalculateLeaning, CallFunc_BreakRotator_Roll) == 0x000028, "Member 'ABP_ZombieFinalCopy_Night_C_CalculateLeaning::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_CalculateLeaning, CallFunc_BreakRotator_Pitch) == 0x00002C, "Member 'ABP_ZombieFinalCopy_Night_C_CalculateLeaning::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_CalculateLeaning, CallFunc_BreakRotator_Yaw) == 0x000030, "Member 'ABP_ZombieFinalCopy_Night_C_CalculateLeaning::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_CalculateLeaning, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000038, "Member 'ABP_ZombieFinalCopy_Night_C_CalculateLeaning::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_CalculateLeaning, CallFunc_SafeDivide_ReturnValue) == 0x000050, "Member 'ABP_ZombieFinalCopy_Night_C_CalculateLeaning::CallFunc_SafeDivide_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_CalculateLeaning, CallFunc_FInterpTo_DeltaTime_ImplicitCast) == 0x000058, "Member 'ABP_ZombieFinalCopy_Night_C_CalculateLeaning::CallFunc_FInterpTo_DeltaTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_CalculateLeaning, CallFunc_SafeDivide_B_ImplicitCast) == 0x000060, "Member 'ABP_ZombieFinalCopy_Night_C_CalculateLeaning::CallFunc_SafeDivide_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_CalculateLeaning, CallFunc_SafeDivide_A_ImplicitCast) == 0x000068, "Member 'ABP_ZombieFinalCopy_Night_C_CalculateLeaning::CallFunc_SafeDivide_A_ImplicitCast' has a wrong offset!");

// Function ABP_ZombieFinalCopy_Night.ABP_ZombieFinalCopy_Night_C.CalculateLookAtLocation
// 0x0018 (0x0018 - 0x0000)
struct ABP_ZombieFinalCopy_Night_C_CalculateLookAtLocation final
{
public:
	struct FVector                                CallFunc_GetLookAtLocation_ReturnValue;            // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_ZombieFinalCopy_Night_C_CalculateLookAtLocation) == 0x000008, "Wrong alignment on ABP_ZombieFinalCopy_Night_C_CalculateLookAtLocation");
static_assert(sizeof(ABP_ZombieFinalCopy_Night_C_CalculateLookAtLocation) == 0x000018, "Wrong size on ABP_ZombieFinalCopy_Night_C_CalculateLookAtLocation");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_CalculateLookAtLocation, CallFunc_GetLookAtLocation_ReturnValue) == 0x000000, "Member 'ABP_ZombieFinalCopy_Night_C_CalculateLookAtLocation::CallFunc_GetLookAtLocation_ReturnValue' has a wrong offset!");

// Function ABP_ZombieFinalCopy_Night.ABP_ZombieFinalCopy_Night_C.Check If Sound Load Needed
// 0x0038 (0x0038 - 0x0000)
struct ABP_ZombieFinalCopy_Night_C_Check_If_Sound_Load_Needed final
{
public:
	TSoftObjectPtr<class UFMODEvent>              FMOD_Event;                                        // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_ZombieFinalCopy_Night_C_Check_If_Sound_Load_Needed) == 0x000008, "Wrong alignment on ABP_ZombieFinalCopy_Night_C_Check_If_Sound_Load_Needed");
static_assert(sizeof(ABP_ZombieFinalCopy_Night_C_Check_If_Sound_Load_Needed) == 0x000038, "Wrong size on ABP_ZombieFinalCopy_Night_C_Check_If_Sound_Load_Needed");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_Check_If_Sound_Load_Needed, FMOD_Event) == 0x000000, "Member 'ABP_ZombieFinalCopy_Night_C_Check_If_Sound_Load_Needed::FMOD_Event' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_Check_If_Sound_Load_Needed, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000030, "Member 'ABP_ZombieFinalCopy_Night_C_Check_If_Sound_Load_Needed::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");

// Function ABP_ZombieFinalCopy_Night.ABP_ZombieFinalCopy_Night_C.DetermineFoot
// 0x0010 (0x0010 - 0x0000)
struct ABP_ZombieFinalCopy_Night_C_DetermineFoot final
{
public:
	float                                         CallFunc_GetCurveValue_ReturnValue;                // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_ZombieFinalCopy_Night_C_DetermineFoot) == 0x000008, "Wrong alignment on ABP_ZombieFinalCopy_Night_C_DetermineFoot");
static_assert(sizeof(ABP_ZombieFinalCopy_Night_C_DetermineFoot) == 0x000010, "Wrong size on ABP_ZombieFinalCopy_Night_C_DetermineFoot");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_DetermineFoot, CallFunc_GetCurveValue_ReturnValue) == 0x000000, "Member 'ABP_ZombieFinalCopy_Night_C_DetermineFoot::CallFunc_GetCurveValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_DetermineFoot, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000004, "Member 'ABP_ZombieFinalCopy_Night_C_DetermineFoot::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_DetermineFoot, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x000008, "Member 'ABP_ZombieFinalCopy_Night_C_DetermineFoot::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function ABP_ZombieFinalCopy_Night.ABP_ZombieFinalCopy_Night_C.ExecuteUbergraph_ABP_ZombieFinalCopy_Night
// 0x0148 (0x0148 - 0x0000)
struct ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetOwningComponent_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetOwningComponent_ReturnValue_1;         // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetOwningComponent_ReturnValue_2;         // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetOwningComponent_ReturnValue_3;         // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetOwningComponent_ReturnValue_4;         // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              CallFunc_TraceOnStep_SurfaceType;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              CallFunc_TraceOnStep_SurfaceType_1;                // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UFMODEvent>              CallFunc_Array_Get_Item;                           // 0x0058(0x0030)(HasGetValueTypeHash)
	TSoftObjectPtr<class UFMODEvent>              CallFunc_Array_Get_Item_1;                         // 0x0088(0x0030)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetOwningComponent_ReturnValue_5;         // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetOwningComponent_ReturnValue_6;         // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDead_ReturnValue;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AZombie_C*                              K2Node_DynamicCast_AsZombie;                       // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F2[0x2];                                       // 0x00F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCPPAnimationAngle_ReturnValue;         // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCPPIsStopping_ReturnValue;             // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Survival::EMovementType                       CallFunc_GetCPPMovementType_ReturnValue;           // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FA[0x2];                                       // 0x00FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCPPVelocityValue_ReturnValue;          // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCPPVelocityFromAnimation_ReturnValue;  // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_102[0x2];                                      // 0x0102(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* TargetActor)>    K2Node_CreateDelegate_OutputDelegate;              // 0x0104(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetTransitToWalk_ReturnValue;             // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetTransitToSprint_ReturnValue;           // 0x0115(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EZombieAnimType                               CallFunc_GetZombieAnimType_ReturnValue;            // 0x0116(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBackToIdle_ReturnValue;                // 0x0117(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAgressive_ReturnValue;                 // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAIMovementComponent_C*                 K2Node_DynamicCast_AsAIMovement_Component;         // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x012B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDamaged_ReturnValue;                   // 0x012D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EZombieType                                   CallFunc_GetCPPZombieType_ReturnValue;             // 0x012E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x012F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_133[0x1];                                      // 0x0133(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_AnimationAngle_ImplicitCast;    // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_VelocityValue_ImplicitCast;     // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night) == 0x000008, "Wrong alignment on ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night");
static_assert(sizeof(ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night) == 0x000148, "Wrong size on ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night, EntryPoint) == 0x000000, "Member 'ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night, CallFunc_GetVelocity_ReturnValue) == 0x000008, "Member 'ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night, CallFunc_VSize_ReturnValue) == 0x000020, "Member 'ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night, CallFunc_GetOwningComponent_ReturnValue) == 0x000028, "Member 'ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night::CallFunc_GetOwningComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night, CallFunc_GetOwningComponent_ReturnValue_1) == 0x000030, "Member 'ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night::CallFunc_GetOwningComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night, CallFunc_GetOwningComponent_ReturnValue_2) == 0x000038, "Member 'ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night::CallFunc_GetOwningComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night, CallFunc_GetOwningComponent_ReturnValue_3) == 0x000040, "Member 'ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night::CallFunc_GetOwningComponent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night, CallFunc_GetOwningComponent_ReturnValue_4) == 0x000048, "Member 'ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night::CallFunc_GetOwningComponent_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night, CallFunc_TraceOnStep_SurfaceType) == 0x000050, "Member 'ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night::CallFunc_TraceOnStep_SurfaceType' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night, CallFunc_TraceOnStep_SurfaceType_1) == 0x000051, "Member 'ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night::CallFunc_TraceOnStep_SurfaceType_1' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night, CallFunc_Array_Get_Item) == 0x000058, "Member 'ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night, CallFunc_Array_Get_Item_1) == 0x000088, "Member 'ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night, CallFunc_IsValid_ReturnValue) == 0x0000B8, "Member 'ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night, CallFunc_GetOwningComponent_ReturnValue_5) == 0x0000C0, "Member 'ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night::CallFunc_GetOwningComponent_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night, CallFunc_GetOwningComponent_ReturnValue_6) == 0x0000C8, "Member 'ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night::CallFunc_GetOwningComponent_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night, CallFunc_IsValid_ReturnValue_1) == 0x0000D0, "Member 'ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night, K2Node_Event_DeltaTimeX) == 0x0000D4, "Member 'ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night, CallFunc_GetDead_ReturnValue) == 0x0000D8, "Member 'ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night::CallFunc_GetDead_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night, CallFunc_TryGetPawnOwner_ReturnValue) == 0x0000E0, "Member 'ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night, K2Node_DynamicCast_AsZombie) == 0x0000E8, "Member 'ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night::K2Node_DynamicCast_AsZombie' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night, CallFunc_BooleanAND_ReturnValue) == 0x0000F1, "Member 'ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night, CallFunc_GetCPPAnimationAngle_ReturnValue) == 0x0000F4, "Member 'ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night::CallFunc_GetCPPAnimationAngle_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night, CallFunc_GetCPPIsStopping_ReturnValue) == 0x0000F8, "Member 'ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night::CallFunc_GetCPPIsStopping_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night, CallFunc_GetCPPMovementType_ReturnValue) == 0x0000F9, "Member 'ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night::CallFunc_GetCPPMovementType_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night, CallFunc_GetCPPVelocityValue_ReturnValue) == 0x0000FC, "Member 'ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night::CallFunc_GetCPPVelocityValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night, CallFunc_IsDedicatedServer_ReturnValue) == 0x000100, "Member 'ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night, CallFunc_GetCPPVelocityFromAnimation_ReturnValue) == 0x000101, "Member 'ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night::CallFunc_GetCPPVelocityFromAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night, K2Node_CreateDelegate_OutputDelegate) == 0x000104, "Member 'ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night, CallFunc_GetTransitToWalk_ReturnValue) == 0x000114, "Member 'ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night::CallFunc_GetTransitToWalk_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night, CallFunc_GetTransitToSprint_ReturnValue) == 0x000115, "Member 'ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night::CallFunc_GetTransitToSprint_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night, CallFunc_GetZombieAnimType_ReturnValue) == 0x000116, "Member 'ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night::CallFunc_GetZombieAnimType_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night, CallFunc_GetBackToIdle_ReturnValue) == 0x000117, "Member 'ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night::CallFunc_GetBackToIdle_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night, CallFunc_GetAgressive_ReturnValue) == 0x000118, "Member 'ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night::CallFunc_GetAgressive_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night, K2Node_DynamicCast_AsAIMovement_Component) == 0x000120, "Member 'ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night::K2Node_DynamicCast_AsAIMovement_Component' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night, K2Node_DynamicCast_bSuccess_1) == 0x000128, "Member 'ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night, CallFunc_IsValid_ReturnValue_2) == 0x000129, "Member 'ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night, CallFunc_Not_PreBool_ReturnValue) == 0x00012A, "Member 'ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night, CallFunc_BooleanAND_ReturnValue_1) == 0x00012B, "Member 'ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night, CallFunc_BooleanAND_ReturnValue_2) == 0x00012C, "Member 'ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night, CallFunc_GetDamaged_ReturnValue) == 0x00012D, "Member 'ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night::CallFunc_GetDamaged_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night, CallFunc_GetCPPZombieType_ReturnValue) == 0x00012E, "Member 'ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night::CallFunc_GetCPPZombieType_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night, CallFunc_Not_PreBool_ReturnValue_1) == 0x00012F, "Member 'ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000130, "Member 'ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night, CallFunc_Not_PreBool_ReturnValue_2) == 0x000131, "Member 'ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night, CallFunc_BooleanAND_ReturnValue_3) == 0x000132, "Member 'ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000134, "Member 'ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night, K2Node_VariableSet_AnimationAngle_ImplicitCast) == 0x000138, "Member 'ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night::K2Node_VariableSet_AnimationAngle_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night, K2Node_VariableSet_VelocityValue_ImplicitCast) == 0x000140, "Member 'ABP_ZombieFinalCopy_Night_C_ExecuteUbergraph_ABP_ZombieFinalCopy_Night::K2Node_VariableSet_VelocityValue_ImplicitCast' has a wrong offset!");

// Function ABP_ZombieFinalCopy_Night.ABP_ZombieFinalCopy_Night_C.GetTransitToSprint
// 0x000A (0x000A - 0x0000)
struct ABP_ZombieFinalCopy_Night_C_GetTransitToSprint final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_ZombieFinalCopy_Night_C_GetTransitToSprint) == 0x000001, "Wrong alignment on ABP_ZombieFinalCopy_Night_C_GetTransitToSprint");
static_assert(sizeof(ABP_ZombieFinalCopy_Night_C_GetTransitToSprint) == 0x00000A, "Wrong size on ABP_ZombieFinalCopy_Night_C_GetTransitToSprint");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_GetTransitToSprint, ReturnValue) == 0x000000, "Member 'ABP_ZombieFinalCopy_Night_C_GetTransitToSprint::ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_GetTransitToSprint, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000001, "Member 'ABP_ZombieFinalCopy_Night_C_GetTransitToSprint::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_GetTransitToSprint, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'ABP_ZombieFinalCopy_Night_C_GetTransitToSprint::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_GetTransitToSprint, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'ABP_ZombieFinalCopy_Night_C_GetTransitToSprint::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_GetTransitToSprint, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000004, "Member 'ABP_ZombieFinalCopy_Night_C_GetTransitToSprint::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_GetTransitToSprint, CallFunc_BooleanOR_ReturnValue) == 0x000005, "Member 'ABP_ZombieFinalCopy_Night_C_GetTransitToSprint::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_GetTransitToSprint, CallFunc_BooleanOR_ReturnValue_1) == 0x000006, "Member 'ABP_ZombieFinalCopy_Night_C_GetTransitToSprint::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_GetTransitToSprint, CallFunc_BooleanAND_ReturnValue) == 0x000007, "Member 'ABP_ZombieFinalCopy_Night_C_GetTransitToSprint::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_GetTransitToSprint, CallFunc_BooleanAND_ReturnValue_1) == 0x000008, "Member 'ABP_ZombieFinalCopy_Night_C_GetTransitToSprint::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_GetTransitToSprint, CallFunc_BooleanAND_ReturnValue_2) == 0x000009, "Member 'ABP_ZombieFinalCopy_Night_C_GetTransitToSprint::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");

// Function ABP_ZombieFinalCopy_Night.ABP_ZombieFinalCopy_Night_C.GetTransitToWalk
// 0x000A (0x000A - 0x0000)
struct ABP_ZombieFinalCopy_Night_C_GetTransitToWalk final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_ZombieFinalCopy_Night_C_GetTransitToWalk) == 0x000001, "Wrong alignment on ABP_ZombieFinalCopy_Night_C_GetTransitToWalk");
static_assert(sizeof(ABP_ZombieFinalCopy_Night_C_GetTransitToWalk) == 0x00000A, "Wrong size on ABP_ZombieFinalCopy_Night_C_GetTransitToWalk");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_GetTransitToWalk, ReturnValue) == 0x000000, "Member 'ABP_ZombieFinalCopy_Night_C_GetTransitToWalk::ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_GetTransitToWalk, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000001, "Member 'ABP_ZombieFinalCopy_Night_C_GetTransitToWalk::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_GetTransitToWalk, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'ABP_ZombieFinalCopy_Night_C_GetTransitToWalk::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_GetTransitToWalk, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'ABP_ZombieFinalCopy_Night_C_GetTransitToWalk::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_GetTransitToWalk, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000004, "Member 'ABP_ZombieFinalCopy_Night_C_GetTransitToWalk::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_GetTransitToWalk, CallFunc_BooleanOR_ReturnValue) == 0x000005, "Member 'ABP_ZombieFinalCopy_Night_C_GetTransitToWalk::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_GetTransitToWalk, CallFunc_BooleanOR_ReturnValue_1) == 0x000006, "Member 'ABP_ZombieFinalCopy_Night_C_GetTransitToWalk::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_GetTransitToWalk, CallFunc_BooleanAND_ReturnValue) == 0x000007, "Member 'ABP_ZombieFinalCopy_Night_C_GetTransitToWalk::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_GetTransitToWalk, CallFunc_BooleanAND_ReturnValue_1) == 0x000008, "Member 'ABP_ZombieFinalCopy_Night_C_GetTransitToWalk::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_GetTransitToWalk, CallFunc_BooleanAND_ReturnValue_2) == 0x000009, "Member 'ABP_ZombieFinalCopy_Night_C_GetTransitToWalk::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");

// Function ABP_ZombieFinalCopy_Night.ABP_ZombieFinalCopy_Night_C.MeshSmoothCorrection
// 0x00C8 (0x00C8 - 0x0000)
struct ABP_ZombieFinalCopy_Night_C_MeshSmoothCorrection final
{
public:
	double                                        Param_Target;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScaledCapsuleHalfHeight_ReturnValue;   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FInterpTo_ReturnValue;                    // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_2;                          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_2;                          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_2;                          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_DeltaTime_ImplicitCast;         // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_ZombieFinalCopy_Night_C_MeshSmoothCorrection) == 0x000008, "Wrong alignment on ABP_ZombieFinalCopy_Night_C_MeshSmoothCorrection");
static_assert(sizeof(ABP_ZombieFinalCopy_Night_C_MeshSmoothCorrection) == 0x0000C8, "Wrong size on ABP_ZombieFinalCopy_Night_C_MeshSmoothCorrection");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_MeshSmoothCorrection, Param_Target) == 0x000000, "Member 'ABP_ZombieFinalCopy_Night_C_MeshSmoothCorrection::Param_Target' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_MeshSmoothCorrection, CallFunc_BreakVector_X) == 0x000008, "Member 'ABP_ZombieFinalCopy_Night_C_MeshSmoothCorrection::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_MeshSmoothCorrection, CallFunc_BreakVector_Y) == 0x000010, "Member 'ABP_ZombieFinalCopy_Night_C_MeshSmoothCorrection::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_MeshSmoothCorrection, CallFunc_BreakVector_Z) == 0x000018, "Member 'ABP_ZombieFinalCopy_Night_C_MeshSmoothCorrection::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_MeshSmoothCorrection, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000020, "Member 'ABP_ZombieFinalCopy_Night_C_MeshSmoothCorrection::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_MeshSmoothCorrection, CallFunc_BreakVector_X_1) == 0x000038, "Member 'ABP_ZombieFinalCopy_Night_C_MeshSmoothCorrection::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_MeshSmoothCorrection, CallFunc_BreakVector_Y_1) == 0x000040, "Member 'ABP_ZombieFinalCopy_Night_C_MeshSmoothCorrection::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_MeshSmoothCorrection, CallFunc_BreakVector_Z_1) == 0x000048, "Member 'ABP_ZombieFinalCopy_Night_C_MeshSmoothCorrection::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_MeshSmoothCorrection, CallFunc_GetScaledCapsuleHalfHeight_ReturnValue) == 0x000050, "Member 'ABP_ZombieFinalCopy_Night_C_MeshSmoothCorrection::CallFunc_GetScaledCapsuleHalfHeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_MeshSmoothCorrection, CallFunc_FInterpTo_ReturnValue) == 0x000058, "Member 'ABP_ZombieFinalCopy_Night_C_MeshSmoothCorrection::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_MeshSmoothCorrection, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000060, "Member 'ABP_ZombieFinalCopy_Night_C_MeshSmoothCorrection::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_MeshSmoothCorrection, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000068, "Member 'ABP_ZombieFinalCopy_Night_C_MeshSmoothCorrection::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_MeshSmoothCorrection, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000070, "Member 'ABP_ZombieFinalCopy_Night_C_MeshSmoothCorrection::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_MeshSmoothCorrection, CallFunc_BreakVector_X_2) == 0x000088, "Member 'ABP_ZombieFinalCopy_Night_C_MeshSmoothCorrection::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_MeshSmoothCorrection, CallFunc_BreakVector_Y_2) == 0x000090, "Member 'ABP_ZombieFinalCopy_Night_C_MeshSmoothCorrection::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_MeshSmoothCorrection, CallFunc_BreakVector_Z_2) == 0x000098, "Member 'ABP_ZombieFinalCopy_Night_C_MeshSmoothCorrection::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_MeshSmoothCorrection, CallFunc_MakeVector_ReturnValue) == 0x0000A0, "Member 'ABP_ZombieFinalCopy_Night_C_MeshSmoothCorrection::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_MeshSmoothCorrection, CallFunc_FInterpTo_DeltaTime_ImplicitCast) == 0x0000B8, "Member 'ABP_ZombieFinalCopy_Night_C_MeshSmoothCorrection::CallFunc_FInterpTo_DeltaTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_MeshSmoothCorrection, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x0000C0, "Member 'ABP_ZombieFinalCopy_Night_C_MeshSmoothCorrection::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function ABP_ZombieFinalCopy_Night.ABP_ZombieFinalCopy_Night_C.OnSetTargetActor
// 0x0018 (0x0018 - 0x0000)
struct ABP_ZombieFinalCopy_Night_C_OnSetTargetActor final
{
public:
	class AActor*                                 TargetActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_ZombieFinalCopy_Night_C_OnSetTargetActor) == 0x000008, "Wrong alignment on ABP_ZombieFinalCopy_Night_C_OnSetTargetActor");
static_assert(sizeof(ABP_ZombieFinalCopy_Night_C_OnSetTargetActor) == 0x000018, "Wrong size on ABP_ZombieFinalCopy_Night_C_OnSetTargetActor");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_OnSetTargetActor, TargetActor) == 0x000000, "Member 'ABP_ZombieFinalCopy_Night_C_OnSetTargetActor::TargetActor' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_OnSetTargetActor, K2Node_DynamicCast_AsSurvival_Player) == 0x000008, "Member 'ABP_ZombieFinalCopy_Night_C_OnSetTargetActor::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_OnSetTargetActor, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'ABP_ZombieFinalCopy_Night_C_OnSetTargetActor::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function ABP_ZombieFinalCopy_Night.ABP_ZombieFinalCopy_Night_C.SetupSurfaceTypeParameter
// 0x0002 (0x0002 - 0x0000)
struct ABP_ZombieFinalCopy_Night_C_SetupSurfaceTypeParameter final
{
public:
	EPhysicalSurface                              SurfaceType;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_ZombieFinalCopy_Night_C_SetupSurfaceTypeParameter) == 0x000001, "Wrong alignment on ABP_ZombieFinalCopy_Night_C_SetupSurfaceTypeParameter");
static_assert(sizeof(ABP_ZombieFinalCopy_Night_C_SetupSurfaceTypeParameter) == 0x000002, "Wrong size on ABP_ZombieFinalCopy_Night_C_SetupSurfaceTypeParameter");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_SetupSurfaceTypeParameter, SurfaceType) == 0x000000, "Member 'ABP_ZombieFinalCopy_Night_C_SetupSurfaceTypeParameter::SurfaceType' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_SetupSurfaceTypeParameter, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'ABP_ZombieFinalCopy_Night_C_SetupSurfaceTypeParameter::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function ABP_ZombieFinalCopy_Night.ABP_ZombieFinalCopy_Night_C.StartCalculateLeaning
// 0x0018 (0x0018 - 0x0000)
struct ABP_ZombieFinalCopy_Night_C_StartCalculateLeaning final
{
public:
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ABP_ZombieFinalCopy_Night_C_StartCalculateLeaning) == 0x000008, "Wrong alignment on ABP_ZombieFinalCopy_Night_C_StartCalculateLeaning");
static_assert(sizeof(ABP_ZombieFinalCopy_Night_C_StartCalculateLeaning) == 0x000018, "Wrong size on ABP_ZombieFinalCopy_Night_C_StartCalculateLeaning");
static_assert(offsetof(ABP_ZombieFinalCopy_Night_C_StartCalculateLeaning, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000000, "Member 'ABP_ZombieFinalCopy_Night_C_StartCalculateLeaning::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");

// Function ABP_ZombieFinalCopy_Night.ABP_ZombieFinalCopy_Night_C.TraceOnStep
// 0x0210 (0x0210 - 0x0000)
struct ABP_ZombieFinalCopy_Night_C_TraceOnStep final
{
public:
	EPhysicalSurface                              SurfaceType;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0048(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
