#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Female_Hair_ponytail

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_Female_Hair_ponytail.ABP_Female_Hair_ponytail_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_Female_Hair_ponytail_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Female_Hair_ponytail_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_Female_Hair_ponytail_C_AnimGraph");
static_assert(sizeof(ABP_Female_Hair_ponytail_C_AnimGraph) == 0x000010, "Wrong size on ABP_Female_Hair_ponytail_C_AnimGraph");
static_assert(offsetof(ABP_Female_Hair_ponytail_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'ABP_Female_Hair_ponytail_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function ABP_Female_Hair_ponytail.ABP_Female_Hair_ponytail_C.ExecuteUbergraph_ABP_Female_Hair_ponytail
// 0x0030 (0x0030 - 0x0000)
struct ABP_Female_Hair_ponytail_C_ExecuteUbergraph_ABP_Female_Hair_ponytail final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetOwningComponent_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Female_Hair_ponytail_C_ExecuteUbergraph_ABP_Female_Hair_ponytail) == 0x000008, "Wrong alignment on ABP_Female_Hair_ponytail_C_ExecuteUbergraph_ABP_Female_Hair_ponytail");
static_assert(sizeof(ABP_Female_Hair_ponytail_C_ExecuteUbergraph_ABP_Female_Hair_ponytail) == 0x000030, "Wrong size on ABP_Female_Hair_ponytail_C_ExecuteUbergraph_ABP_Female_Hair_ponytail");
static_assert(offsetof(ABP_Female_Hair_ponytail_C_ExecuteUbergraph_ABP_Female_Hair_ponytail, EntryPoint) == 0x000000, "Member 'ABP_Female_Hair_ponytail_C_ExecuteUbergraph_ABP_Female_Hair_ponytail::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_Female_Hair_ponytail_C_ExecuteUbergraph_ABP_Female_Hair_ponytail, CallFunc_MakeLiteralName_ReturnValue) == 0x000004, "Member 'ABP_Female_Hair_ponytail_C_ExecuteUbergraph_ABP_Female_Hair_ponytail::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Female_Hair_ponytail_C_ExecuteUbergraph_ABP_Female_Hair_ponytail, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000010, "Member 'ABP_Female_Hair_ponytail_C_ExecuteUbergraph_ABP_Female_Hair_ponytail::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Female_Hair_ponytail_C_ExecuteUbergraph_ABP_Female_Hair_ponytail, K2Node_DynamicCast_AsCharacter) == 0x000018, "Member 'ABP_Female_Hair_ponytail_C_ExecuteUbergraph_ABP_Female_Hair_ponytail::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(ABP_Female_Hair_ponytail_C_ExecuteUbergraph_ABP_Female_Hair_ponytail, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'ABP_Female_Hair_ponytail_C_ExecuteUbergraph_ABP_Female_Hair_ponytail::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_Female_Hair_ponytail_C_ExecuteUbergraph_ABP_Female_Hair_ponytail, CallFunc_GetOwningComponent_ReturnValue) == 0x000028, "Member 'ABP_Female_Hair_ponytail_C_ExecuteUbergraph_ABP_Female_Hair_ponytail::CallFunc_GetOwningComponent_ReturnValue' has a wrong offset!");

}

