#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Female_Hair_ponytail

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_Female_Hair_ponytail.ABP_Female_Hair_ponytail_C.AnimBlueprintGeneratedConstantData
// 0x00CF (0x00D0 - 0x0001)
struct ABP_Female_Hair_ponytail::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_13;                               // 0x0008(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_14;                                 // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_15;                                 // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0038(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00B8(0x0018)()
};
static_assert(alignof(ABP_Female_Hair_ponytail::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_Female_Hair_ponytail::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_Female_Hair_ponytail::FAnimBlueprintGeneratedConstantData) == 0x0000D0, "Wrong size on ABP_Female_Hair_ponytail::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_Female_Hair_ponytail::FAnimBlueprintGeneratedConstantData, __StructProperty_13) == 0x000008, "Member 'ABP_Female_Hair_ponytail::FAnimBlueprintGeneratedConstantData::__StructProperty_13' has a wrong offset!");
static_assert(offsetof(ABP_Female_Hair_ponytail::FAnimBlueprintGeneratedConstantData, __NameProperty_14) == 0x000028, "Member 'ABP_Female_Hair_ponytail::FAnimBlueprintGeneratedConstantData::__NameProperty_14' has a wrong offset!");
static_assert(offsetof(ABP_Female_Hair_ponytail::FAnimBlueprintGeneratedConstantData, __NameProperty_15) == 0x000030, "Member 'ABP_Female_Hair_ponytail::FAnimBlueprintGeneratedConstantData::__NameProperty_15' has a wrong offset!");
static_assert(offsetof(ABP_Female_Hair_ponytail::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000038, "Member 'ABP_Female_Hair_ponytail::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_Female_Hair_ponytail::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000B8, "Member 'ABP_Female_Hair_ponytail::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

