#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_FemaleHead

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_FemaleHead.ABP_FemaleHead_C.AnimBlueprintGeneratedConstantData
// 0x00F7 (0x00F8 - 0x0001)
struct ABP_FemaleHead::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_19;                                 // 0x0008(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_20;                                   // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_21;                                 // 0x0018(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_22;                                 // 0x0019(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_23;                                 // 0x001A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_24;                                // 0x0020(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_25;                                 // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_26;                                 // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_27;                               // 0x0040(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0060(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00E0(0x0018)()
};
static_assert(alignof(ABP_FemaleHead::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_FemaleHead::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_FemaleHead::FAnimBlueprintGeneratedConstantData) == 0x0000F8, "Wrong size on ABP_FemaleHead::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_FemaleHead::FAnimBlueprintGeneratedConstantData, __BlendProfile_19) == 0x000008, "Member 'ABP_FemaleHead::FAnimBlueprintGeneratedConstantData::__BlendProfile_19' has a wrong offset!");
static_assert(offsetof(ABP_FemaleHead::FAnimBlueprintGeneratedConstantData, __CurveFloat_20) == 0x000010, "Member 'ABP_FemaleHead::FAnimBlueprintGeneratedConstantData::__CurveFloat_20' has a wrong offset!");
static_assert(offsetof(ABP_FemaleHead::FAnimBlueprintGeneratedConstantData, __BoolProperty_21) == 0x000018, "Member 'ABP_FemaleHead::FAnimBlueprintGeneratedConstantData::__BoolProperty_21' has a wrong offset!");
static_assert(offsetof(ABP_FemaleHead::FAnimBlueprintGeneratedConstantData, __EnumProperty_22) == 0x000019, "Member 'ABP_FemaleHead::FAnimBlueprintGeneratedConstantData::__EnumProperty_22' has a wrong offset!");
static_assert(offsetof(ABP_FemaleHead::FAnimBlueprintGeneratedConstantData, __EnumProperty_23) == 0x00001A, "Member 'ABP_FemaleHead::FAnimBlueprintGeneratedConstantData::__EnumProperty_23' has a wrong offset!");
static_assert(offsetof(ABP_FemaleHead::FAnimBlueprintGeneratedConstantData, __ArrayProperty_24) == 0x000020, "Member 'ABP_FemaleHead::FAnimBlueprintGeneratedConstantData::__ArrayProperty_24' has a wrong offset!");
static_assert(offsetof(ABP_FemaleHead::FAnimBlueprintGeneratedConstantData, __NameProperty_25) == 0x000030, "Member 'ABP_FemaleHead::FAnimBlueprintGeneratedConstantData::__NameProperty_25' has a wrong offset!");
static_assert(offsetof(ABP_FemaleHead::FAnimBlueprintGeneratedConstantData, __NameProperty_26) == 0x000038, "Member 'ABP_FemaleHead::FAnimBlueprintGeneratedConstantData::__NameProperty_26' has a wrong offset!");
static_assert(offsetof(ABP_FemaleHead::FAnimBlueprintGeneratedConstantData, __StructProperty_27) == 0x000040, "Member 'ABP_FemaleHead::FAnimBlueprintGeneratedConstantData::__StructProperty_27' has a wrong offset!");
static_assert(offsetof(ABP_FemaleHead::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000060, "Member 'ABP_FemaleHead::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_FemaleHead::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000E0, "Member 'ABP_FemaleHead::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct ABP_FemaleHead.ABP_FemaleHead_C.AnimBlueprintGeneratedMutableData
// 0x0001 (0x0002 - 0x0001)
struct ABP_FemaleHead::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_FemaleHead::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on ABP_FemaleHead::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_FemaleHead::FAnimBlueprintGeneratedMutableData) == 0x000002, "Wrong size on ABP_FemaleHead::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_FemaleHead::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'ABP_FemaleHead::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");

}

