#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_DeadBody

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_DeadBody.ABP_DeadBody_C
// 0x0120 (0x0470 - 0x0350)
class UABP_DeadBody_C final : public UAnimInstance
{
public:
	uint8                                         Pad_348[0x8];                                      // 0x0348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0358(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0360(0x0008)()
	struct FAnimNode_PoseSnapshot                 AnimGraphNode_PoseSnapshot;                        // 0x0368(0x0090)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x03F8(0x0020)()
	struct FPoseSnapshot                          SurvPlayerlastSnapshot;                            // 0x0418(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsUpdating;                                        // 0x0450(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_451[0x7];                                      // 0x0451(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        HitAngle;                                          // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DeadBody;                                          // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          ActiveBlendDeath;                                  // 0x0468(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EndDeath;                                          // 0x0469(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void AnimNotify_DeathAnimEnd();
	void ExecuteUbergraph_ABP_DeadBody(int32 EntryPoint);
	void Start(class AActor* Param_DeadBody, double Param_HitAngle, const struct FPoseSnapshot& Param_SurvPlayerlastSnapshot);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_DeadBody_C">();
	}
	static class UABP_DeadBody_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_DeadBody_C>();
	}
};
static_assert(alignof(UABP_DeadBody_C) == 0x000010, "Wrong alignment on UABP_DeadBody_C");
static_assert(sizeof(UABP_DeadBody_C) == 0x000470, "Wrong size on UABP_DeadBody_C");
static_assert(offsetof(UABP_DeadBody_C, UberGraphFrame) == 0x000350, "Member 'UABP_DeadBody_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_DeadBody_C, AnimBlueprintExtension_PropertyAccess) == 0x000358, "Member 'UABP_DeadBody_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_DeadBody_C, AnimBlueprintExtension_Base) == 0x000360, "Member 'UABP_DeadBody_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_DeadBody_C, AnimGraphNode_PoseSnapshot) == 0x000368, "Member 'UABP_DeadBody_C::AnimGraphNode_PoseSnapshot' has a wrong offset!");
static_assert(offsetof(UABP_DeadBody_C, AnimGraphNode_Root) == 0x0003F8, "Member 'UABP_DeadBody_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_DeadBody_C, SurvPlayerlastSnapshot) == 0x000418, "Member 'UABP_DeadBody_C::SurvPlayerlastSnapshot' has a wrong offset!");
static_assert(offsetof(UABP_DeadBody_C, IsUpdating) == 0x000450, "Member 'UABP_DeadBody_C::IsUpdating' has a wrong offset!");
static_assert(offsetof(UABP_DeadBody_C, HitAngle) == 0x000458, "Member 'UABP_DeadBody_C::HitAngle' has a wrong offset!");
static_assert(offsetof(UABP_DeadBody_C, DeadBody) == 0x000460, "Member 'UABP_DeadBody_C::DeadBody' has a wrong offset!");
static_assert(offsetof(UABP_DeadBody_C, ActiveBlendDeath) == 0x000468, "Member 'UABP_DeadBody_C::ActiveBlendDeath' has a wrong offset!");
static_assert(offsetof(UABP_DeadBody_C, EndDeath) == 0x000469, "Member 'UABP_DeadBody_C::EndDeath' has a wrong offset!");

}

