#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_CreateCharacter

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_CreateCharacter.ABP_CreateCharacter_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_CreateCharacter_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_CreateCharacter_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_CreateCharacter_C_AnimGraph");
static_assert(sizeof(ABP_CreateCharacter_C_AnimGraph) == 0x000010, "Wrong size on ABP_CreateCharacter_C_AnimGraph");
static_assert(offsetof(ABP_CreateCharacter_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'ABP_CreateCharacter_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function ABP_CreateCharacter.ABP_CreateCharacter_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_CreateCharacter_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_CreateCharacter_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_CreateCharacter_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_CreateCharacter_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_CreateCharacter_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_CreateCharacter_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_CreateCharacter_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_CreateCharacter.ABP_CreateCharacter_C.ExecuteUbergraph_ABP_CreateCharacter
// 0x0028 (0x0028 - 0x0000)
struct ABP_CreateCharacter_C_ExecuteUbergraph_ABP_CreateCharacter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_CreateCharacter_C*                  K2Node_DynamicCast_AsBP_Create_Character;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_CreateCharacter_C_ExecuteUbergraph_ABP_CreateCharacter) == 0x000008, "Wrong alignment on ABP_CreateCharacter_C_ExecuteUbergraph_ABP_CreateCharacter");
static_assert(sizeof(ABP_CreateCharacter_C_ExecuteUbergraph_ABP_CreateCharacter) == 0x000028, "Wrong size on ABP_CreateCharacter_C_ExecuteUbergraph_ABP_CreateCharacter");
static_assert(offsetof(ABP_CreateCharacter_C_ExecuteUbergraph_ABP_CreateCharacter, EntryPoint) == 0x000000, "Member 'ABP_CreateCharacter_C_ExecuteUbergraph_ABP_CreateCharacter::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_CreateCharacter_C_ExecuteUbergraph_ABP_CreateCharacter, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'ABP_CreateCharacter_C_ExecuteUbergraph_ABP_CreateCharacter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CreateCharacter_C_ExecuteUbergraph_ABP_CreateCharacter, K2Node_Event_DeltaTimeX) == 0x000008, "Member 'ABP_CreateCharacter_C_ExecuteUbergraph_ABP_CreateCharacter::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_CreateCharacter_C_ExecuteUbergraph_ABP_CreateCharacter, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000010, "Member 'ABP_CreateCharacter_C_ExecuteUbergraph_ABP_CreateCharacter::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CreateCharacter_C_ExecuteUbergraph_ABP_CreateCharacter, K2Node_DynamicCast_AsBP_Create_Character) == 0x000018, "Member 'ABP_CreateCharacter_C_ExecuteUbergraph_ABP_CreateCharacter::K2Node_DynamicCast_AsBP_Create_Character' has a wrong offset!");
static_assert(offsetof(ABP_CreateCharacter_C_ExecuteUbergraph_ABP_CreateCharacter, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'ABP_CreateCharacter_C_ExecuteUbergraph_ABP_CreateCharacter::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

