#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_ZombieFinal

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_ZombieFinal.ABP_ZombieFinal_C.AnimBlueprintGeneratedConstantData
// 0x01F7 (0x01F8 - 0x0001)
struct ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_426;                               // 0x0008(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_427;                                // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_428;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_429;                                // 0x0024(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_430;                                 // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_431;                                // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_432;                                 // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_433;                                // 0x003C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_434;                                 // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_435;                                // 0x0048(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_436;                                // 0x0050(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_437;                                 // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_438;                                // 0x005C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_439;                                // 0x0060(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_440;                                 // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_441;                                // 0x006C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_442;                                 // 0x0074(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_443;                               // 0x0078(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_444;                               // 0x0088(0x0010)(BlueprintVisible, EditFixedSize)
	class UBlendProfile*                          __BlendProfile_445;                                // 0x0098(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_446;                                  // 0x00A0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_447;                                // 0x00A8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_448;                                // 0x00A9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_449;                               // 0x00B0(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_450;                               // 0x00C0(0x0010)(BlueprintVisible)
	struct FInputScaleBiasClampConstants          __StructProperty_451;                              // 0x00D0(0x002C)(BlueprintVisible, NoDestructor)
	EAnimSyncMethod                               __EnumProperty_452;                                // 0x00FC(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_453;                                // 0x00FD(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FE[0x2];                                       // 0x00FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_454;                                // 0x0100(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_455;                                 // 0x0108(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_456;                               // 0x010C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_457;                                // 0x0110(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_458;                               // 0x0114(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_459;                                // 0x0118(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_460;                                // 0x0119(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_461;                                // 0x011A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11B[0x1];                                      // 0x011B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_462;                                // 0x011C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_463;                                // 0x0124(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_464;                                 // 0x012C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_465;                              // 0x0130(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_466;                                // 0x0150(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_467;                                // 0x0158(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0160(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x01E0(0x0018)()
};
static_assert(alignof(ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData) == 0x0001F8, "Wrong size on ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData, __ArrayProperty_426) == 0x000008, "Member 'ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData::__ArrayProperty_426' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData, __NameProperty_427) == 0x000018, "Member 'ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData::__NameProperty_427' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData, __IntProperty_428) == 0x000020, "Member 'ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData::__IntProperty_428' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData, __NameProperty_429) == 0x000024, "Member 'ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData::__NameProperty_429' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData, __IntProperty_430) == 0x00002C, "Member 'ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData::__IntProperty_430' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData, __NameProperty_431) == 0x000030, "Member 'ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData::__NameProperty_431' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData, __IntProperty_432) == 0x000038, "Member 'ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData::__IntProperty_432' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData, __NameProperty_433) == 0x00003C, "Member 'ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData::__NameProperty_433' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData, __IntProperty_434) == 0x000044, "Member 'ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData::__IntProperty_434' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData, __NameProperty_435) == 0x000048, "Member 'ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData::__NameProperty_435' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData, __NameProperty_436) == 0x000050, "Member 'ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData::__NameProperty_436' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData, __IntProperty_437) == 0x000058, "Member 'ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData::__IntProperty_437' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData, __ByteProperty_438) == 0x00005C, "Member 'ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData::__ByteProperty_438' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData, __NameProperty_439) == 0x000060, "Member 'ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData::__NameProperty_439' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData, __IntProperty_440) == 0x000068, "Member 'ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData::__IntProperty_440' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData, __NameProperty_441) == 0x00006C, "Member 'ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData::__NameProperty_441' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData, __IntProperty_442) == 0x000074, "Member 'ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData::__IntProperty_442' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData, __ArrayProperty_443) == 0x000078, "Member 'ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData::__ArrayProperty_443' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData, __ArrayProperty_444) == 0x000088, "Member 'ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData::__ArrayProperty_444' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData, __BlendProfile_445) == 0x000098, "Member 'ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData::__BlendProfile_445' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData, __CurveFloat_446) == 0x0000A0, "Member 'ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData::__CurveFloat_446' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData, __EnumProperty_447) == 0x0000A8, "Member 'ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData::__EnumProperty_447' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData, __EnumProperty_448) == 0x0000A9, "Member 'ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData::__EnumProperty_448' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData, __ArrayProperty_449) == 0x0000B0, "Member 'ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData::__ArrayProperty_449' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData, __ArrayProperty_450) == 0x0000C0, "Member 'ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData::__ArrayProperty_450' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData, __StructProperty_451) == 0x0000D0, "Member 'ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData::__StructProperty_451' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData, __EnumProperty_452) == 0x0000FC, "Member 'ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData::__EnumProperty_452' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData, __ByteProperty_453) == 0x0000FD, "Member 'ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData::__ByteProperty_453' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData, __NameProperty_454) == 0x000100, "Member 'ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData::__NameProperty_454' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData, __IntProperty_455) == 0x000108, "Member 'ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData::__IntProperty_455' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData, __FloatProperty_456) == 0x00010C, "Member 'ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData::__FloatProperty_456' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData, __BoolProperty_457) == 0x000110, "Member 'ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData::__BoolProperty_457' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData, __FloatProperty_458) == 0x000114, "Member 'ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData::__FloatProperty_458' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData, __BoolProperty_459) == 0x000118, "Member 'ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData::__BoolProperty_459' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData, __EnumProperty_460) == 0x000119, "Member 'ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData::__EnumProperty_460' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData, __ByteProperty_461) == 0x00011A, "Member 'ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData::__ByteProperty_461' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData, __NameProperty_462) == 0x00011C, "Member 'ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData::__NameProperty_462' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData, __NameProperty_463) == 0x000124, "Member 'ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData::__NameProperty_463' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData, __IntProperty_464) == 0x00012C, "Member 'ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData::__IntProperty_464' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData, __StructProperty_465) == 0x000130, "Member 'ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData::__StructProperty_465' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData, __NameProperty_466) == 0x000150, "Member 'ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData::__NameProperty_466' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData, __NameProperty_467) == 0x000158, "Member 'ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData::__NameProperty_467' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000160, "Member 'ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0001E0, "Member 'ABP_ZombieFinal::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct ABP_ZombieFinal.ABP_ZombieFinal_C.AnimBlueprintGeneratedMutableData
// 0x001B (0x001C - 0x0001)
struct ABP_ZombieFinal::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_0;                                  // 0x0002(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1;                                  // 0x0003(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2;                                 // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_3;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_4;                                   // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_5;                                  // 0x0010(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_6;                                  // 0x0011(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_7;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_8;                                 // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_ZombieFinal::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on ABP_ZombieFinal::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_ZombieFinal::FAnimBlueprintGeneratedMutableData) == 0x00001C, "Wrong size on ABP_ZombieFinal::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_ZombieFinal::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'ABP_ZombieFinal::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinal::FAnimBlueprintGeneratedMutableData, __BoolProperty_0) == 0x000002, "Member 'ABP_ZombieFinal::FAnimBlueprintGeneratedMutableData::__BoolProperty_0' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinal::FAnimBlueprintGeneratedMutableData, __BoolProperty_1) == 0x000003, "Member 'ABP_ZombieFinal::FAnimBlueprintGeneratedMutableData::__BoolProperty_1' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinal::FAnimBlueprintGeneratedMutableData, __FloatProperty_2) == 0x000004, "Member 'ABP_ZombieFinal::FAnimBlueprintGeneratedMutableData::__FloatProperty_2' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinal::FAnimBlueprintGeneratedMutableData, __FloatProperty_3) == 0x000008, "Member 'ABP_ZombieFinal::FAnimBlueprintGeneratedMutableData::__FloatProperty_3' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinal::FAnimBlueprintGeneratedMutableData, __IntProperty_4) == 0x00000C, "Member 'ABP_ZombieFinal::FAnimBlueprintGeneratedMutableData::__IntProperty_4' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinal::FAnimBlueprintGeneratedMutableData, __BoolProperty_5) == 0x000010, "Member 'ABP_ZombieFinal::FAnimBlueprintGeneratedMutableData::__BoolProperty_5' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinal::FAnimBlueprintGeneratedMutableData, __ByteProperty_6) == 0x000011, "Member 'ABP_ZombieFinal::FAnimBlueprintGeneratedMutableData::__ByteProperty_6' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinal::FAnimBlueprintGeneratedMutableData, __FloatProperty_7) == 0x000014, "Member 'ABP_ZombieFinal::FAnimBlueprintGeneratedMutableData::__FloatProperty_7' has a wrong offset!");
static_assert(offsetof(ABP_ZombieFinal::FAnimBlueprintGeneratedMutableData, __FloatProperty_8) == 0x000018, "Member 'ABP_ZombieFinal::FAnimBlueprintGeneratedMutableData::__FloatProperty_8' has a wrong offset!");

}

