#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActorRecording

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ActorRecording.ActorRecording_C.ClickedStart
// 0x0010 (0x0010 - 0x0000)
struct ActorRecording_C_ClickedStart final
{
public:
	struct FVector2D                              MouseLocation;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActorRecording_C_ClickedStart) == 0x000008, "Wrong alignment on ActorRecording_C_ClickedStart");
static_assert(sizeof(ActorRecording_C_ClickedStart) == 0x000010, "Wrong size on ActorRecording_C_ClickedStart");
static_assert(offsetof(ActorRecording_C_ClickedStart, MouseLocation) == 0x000000, "Member 'ActorRecording_C_ClickedStart::MouseLocation' has a wrong offset!");

// Function ActorRecording.ActorRecording_C.CreateNewRenderTarget
// 0x0004 (0x0004 - 0x0000)
struct ActorRecording_C_CreateNewRenderTarget final
{
public:
	int32                                         SlotID;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActorRecording_C_CreateNewRenderTarget) == 0x000004, "Wrong alignment on ActorRecording_C_CreateNewRenderTarget");
static_assert(sizeof(ActorRecording_C_CreateNewRenderTarget) == 0x000004, "Wrong size on ActorRecording_C_CreateNewRenderTarget");
static_assert(offsetof(ActorRecording_C_CreateNewRenderTarget, SlotID) == 0x000000, "Member 'ActorRecording_C_CreateNewRenderTarget::SlotID' has a wrong offset!");

// Function ActorRecording.ActorRecording_C.ExecuteUbergraph_ActorRecording
// 0x00B0 (0x00B0 - 0x0000)
struct ActorRecording_C_ExecuteUbergraph_ActorRecording final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_CustomEvent_MouseLocation_1;                // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_CustomEvent_MouseLocation;                  // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SlotId;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterCreateSave_C*                 CallFunc_CreateSaveGameObject_ReturnValue;         // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_V2_C*                   K2Node_CustomEvent_SurvivalPlayer;                 // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Index;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          CallFunc_GetSkeletalMeshAsset_ReturnValue;         // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          CallFunc_GetSkeletalMeshAsset_ReturnValue_1;       // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          CallFunc_GetSkeletalMeshAsset_ReturnValue_2;       // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          CallFunc_GetSkeletalMeshAsset_ReturnValue_3;       // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          CallFunc_GetSkeletalMeshAsset_ReturnValue_4;       // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          CallFunc_GetSkeletalMeshAsset_ReturnValue_5;       // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          CallFunc_GetSkeletalMeshAsset_ReturnValue_6;       // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          CallFunc_GetSkeletalMeshAsset_ReturnValue_7;       // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   K2Node_CustomEvent_Target;                         // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_LocalCharacter;                 // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterCreateSave_C*                 K2Node_CustomEvent_Character_Save_Ref;             // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ChooseCharacter_C*                  K2Node_DynamicCast_AsBP_Choose_Character;          // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActorRecording_C_ExecuteUbergraph_ActorRecording) == 0x000008, "Wrong alignment on ActorRecording_C_ExecuteUbergraph_ActorRecording");
static_assert(sizeof(ActorRecording_C_ExecuteUbergraph_ActorRecording) == 0x0000B0, "Wrong size on ActorRecording_C_ExecuteUbergraph_ActorRecording");
static_assert(offsetof(ActorRecording_C_ExecuteUbergraph_ActorRecording, EntryPoint) == 0x000000, "Member 'ActorRecording_C_ExecuteUbergraph_ActorRecording::EntryPoint' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_ExecuteUbergraph_ActorRecording, K2Node_CustomEvent_MouseLocation_1) == 0x000008, "Member 'ActorRecording_C_ExecuteUbergraph_ActorRecording::K2Node_CustomEvent_MouseLocation_1' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_ExecuteUbergraph_ActorRecording, K2Node_CustomEvent_MouseLocation) == 0x000018, "Member 'ActorRecording_C_ExecuteUbergraph_ActorRecording::K2Node_CustomEvent_MouseLocation' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_ExecuteUbergraph_ActorRecording, K2Node_CustomEvent_SlotId) == 0x000028, "Member 'ActorRecording_C_ExecuteUbergraph_ActorRecording::K2Node_CustomEvent_SlotId' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_ExecuteUbergraph_ActorRecording, CallFunc_CreateSaveGameObject_ReturnValue) == 0x000030, "Member 'ActorRecording_C_ExecuteUbergraph_ActorRecording::CallFunc_CreateSaveGameObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_ExecuteUbergraph_ActorRecording, K2Node_CustomEvent_SurvivalPlayer) == 0x000038, "Member 'ActorRecording_C_ExecuteUbergraph_ActorRecording::K2Node_CustomEvent_SurvivalPlayer' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_ExecuteUbergraph_ActorRecording, K2Node_CustomEvent_Index) == 0x000040, "Member 'ActorRecording_C_ExecuteUbergraph_ActorRecording::K2Node_CustomEvent_Index' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_ExecuteUbergraph_ActorRecording, CallFunc_GetSkeletalMeshAsset_ReturnValue) == 0x000048, "Member 'ActorRecording_C_ExecuteUbergraph_ActorRecording::CallFunc_GetSkeletalMeshAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_ExecuteUbergraph_ActorRecording, CallFunc_GetSkeletalMeshAsset_ReturnValue_1) == 0x000050, "Member 'ActorRecording_C_ExecuteUbergraph_ActorRecording::CallFunc_GetSkeletalMeshAsset_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_ExecuteUbergraph_ActorRecording, CallFunc_GetSkeletalMeshAsset_ReturnValue_2) == 0x000058, "Member 'ActorRecording_C_ExecuteUbergraph_ActorRecording::CallFunc_GetSkeletalMeshAsset_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_ExecuteUbergraph_ActorRecording, CallFunc_GetSkeletalMeshAsset_ReturnValue_3) == 0x000060, "Member 'ActorRecording_C_ExecuteUbergraph_ActorRecording::CallFunc_GetSkeletalMeshAsset_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_ExecuteUbergraph_ActorRecording, CallFunc_GetSkeletalMeshAsset_ReturnValue_4) == 0x000068, "Member 'ActorRecording_C_ExecuteUbergraph_ActorRecording::CallFunc_GetSkeletalMeshAsset_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_ExecuteUbergraph_ActorRecording, CallFunc_GetSkeletalMeshAsset_ReturnValue_5) == 0x000070, "Member 'ActorRecording_C_ExecuteUbergraph_ActorRecording::CallFunc_GetSkeletalMeshAsset_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_ExecuteUbergraph_ActorRecording, CallFunc_GetSkeletalMeshAsset_ReturnValue_6) == 0x000078, "Member 'ActorRecording_C_ExecuteUbergraph_ActorRecording::CallFunc_GetSkeletalMeshAsset_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_ExecuteUbergraph_ActorRecording, CallFunc_GetSkeletalMeshAsset_ReturnValue_7) == 0x000080, "Member 'ActorRecording_C_ExecuteUbergraph_ActorRecording::CallFunc_GetSkeletalMeshAsset_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_ExecuteUbergraph_ActorRecording, K2Node_CustomEvent_Target) == 0x000088, "Member 'ActorRecording_C_ExecuteUbergraph_ActorRecording::K2Node_CustomEvent_Target' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_ExecuteUbergraph_ActorRecording, K2Node_CustomEvent_LocalCharacter) == 0x000090, "Member 'ActorRecording_C_ExecuteUbergraph_ActorRecording::K2Node_CustomEvent_LocalCharacter' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_ExecuteUbergraph_ActorRecording, K2Node_CustomEvent_Character_Save_Ref) == 0x000098, "Member 'ActorRecording_C_ExecuteUbergraph_ActorRecording::K2Node_CustomEvent_Character_Save_Ref' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_ExecuteUbergraph_ActorRecording, K2Node_DynamicCast_AsBP_Choose_Character) == 0x0000A0, "Member 'ActorRecording_C_ExecuteUbergraph_ActorRecording::K2Node_DynamicCast_AsBP_Choose_Character' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_ExecuteUbergraph_ActorRecording, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'ActorRecording_C_ExecuteUbergraph_ActorRecording::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function ActorRecording.ActorRecording_C.Init
// 0x0240 (0x0240 - 0x0000)
struct ActorRecording_C_Init final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_V2_C*                   K2Node_DynamicCast_AsSurvival_Player_V2;           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActorRecording_C*>              CallFunc_GetAllActorsOfClass_OutActors;            // 0x0048(0x0010)(ReferenceParm)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActorRecording_C*                      CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterCreateSave_C*                 CallFunc_Array_Get_Item_1;                         // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item_2;                         // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_Array_Get_Item_3;                         // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   K2Node_Select_Default;                             // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_GameHUD_C*                          K2Node_DynamicCast_AsBP_Game_HUD;                  // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x00E8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item_4;                         // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Group_C*                           K2Node_DynamicCast_AsWBP_Group;                    // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_112[0x6];                                      // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X;                          // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APS_TDB_C*                              CallFunc_GetPlayerState_PlayerState;               // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPawn_ReturnValue;                      // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_V2_C*                   K2Node_DynamicCast_AsSurvival_Player_V2_1;         // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0152(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_153[0x1];                                      // 0x0153(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_158[0x8];                                      // 0x0158(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_MakeBrushFromMaterial_ReturnValue;        // 0x0160(0x00D0)()
	struct FVector2D                              CallFunc_BreakVector2D_InVec_ImplicitCast;         // 0x0230(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActorRecording_C_Init) == 0x000010, "Wrong alignment on ActorRecording_C_Init");
static_assert(sizeof(ActorRecording_C_Init) == 0x000240, "Wrong size on ActorRecording_C_Init");
static_assert(offsetof(ActorRecording_C_Init, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'ActorRecording_C_Init::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_Init, Temp_int_Loop_Counter_Variable_1) == 0x000004, "Member 'ActorRecording_C_Init::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_Init, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'ActorRecording_C_Init::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_Init, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'ActorRecording_C_Init::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_Init, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000010, "Member 'ActorRecording_C_Init::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_Init, Temp_int_Array_Index_Variable) == 0x000014, "Member 'ActorRecording_C_Init::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_Init, Temp_int_Array_Index_Variable_1) == 0x000018, "Member 'ActorRecording_C_Init::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_Init, CallFunc_GetPlayerController_ReturnValue) == 0x000020, "Member 'ActorRecording_C_Init::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_Init, Temp_int_Array_Index_Variable_2) == 0x000028, "Member 'ActorRecording_C_Init::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_Init, CallFunc_K2_GetPawn_ReturnValue) == 0x000030, "Member 'ActorRecording_C_Init::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_Init, K2Node_DynamicCast_AsSurvival_Player_V2) == 0x000038, "Member 'ActorRecording_C_Init::K2Node_DynamicCast_AsSurvival_Player_V2' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_Init, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'ActorRecording_C_Init::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_Init, CallFunc_GetAllActorsOfClass_OutActors) == 0x000048, "Member 'ActorRecording_C_Init::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_Init, Temp_bool_True_if_break_was_hit_Variable) == 0x000058, "Member 'ActorRecording_C_Init::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_Init, CallFunc_Array_Get_Item) == 0x000060, "Member 'ActorRecording_C_Init::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_Init, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000068, "Member 'ActorRecording_C_Init::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_Init, CallFunc_Not_PreBool_ReturnValue) == 0x000069, "Member 'ActorRecording_C_Init::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_Init, CallFunc_Array_Length_ReturnValue) == 0x00006C, "Member 'ActorRecording_C_Init::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_Init, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000070, "Member 'ActorRecording_C_Init::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_Init, CallFunc_Array_Get_Item_1) == 0x000078, "Member 'ActorRecording_C_Init::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_Init, CallFunc_Max_ReturnValue) == 0x000080, "Member 'ActorRecording_C_Init::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_Init, CallFunc_Array_Get_Item_2) == 0x000088, "Member 'ActorRecording_C_Init::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_Init, Temp_int_Loop_Counter_Variable_2) == 0x000090, "Member 'ActorRecording_C_Init::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_Init, CallFunc_Add_IntInt_ReturnValue_1) == 0x000094, "Member 'ActorRecording_C_Init::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_Init, Temp_int_Variable) == 0x000098, "Member 'ActorRecording_C_Init::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_Init, CallFunc_Array_Get_Item_3) == 0x0000A0, "Member 'ActorRecording_C_Init::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_Init, K2Node_Select_Default) == 0x0000A8, "Member 'ActorRecording_C_Init::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_Init, CallFunc_IsValid_ReturnValue) == 0x0000B0, "Member 'ActorRecording_C_Init::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_Init, CallFunc_Array_Length_ReturnValue_1) == 0x0000B4, "Member 'ActorRecording_C_Init::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_Init, CallFunc_Less_IntInt_ReturnValue) == 0x0000B8, "Member 'ActorRecording_C_Init::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_Init, CallFunc_GetPlayerController_ReturnValue_1) == 0x0000C0, "Member 'ActorRecording_C_Init::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_Init, CallFunc_BooleanAND_ReturnValue) == 0x0000C8, "Member 'ActorRecording_C_Init::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_Init, CallFunc_GetHUD_ReturnValue) == 0x0000D0, "Member 'ActorRecording_C_Init::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_Init, K2Node_DynamicCast_AsBP_Game_HUD) == 0x0000D8, "Member 'ActorRecording_C_Init::K2Node_DynamicCast_AsBP_Game_HUD' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_Init, K2Node_DynamicCast_bSuccess_1) == 0x0000E0, "Member 'ActorRecording_C_Init::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_Init, CallFunc_GetAllChildren_ReturnValue) == 0x0000E8, "Member 'ActorRecording_C_Init::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_Init, CallFunc_Array_Get_Item_4) == 0x0000F8, "Member 'ActorRecording_C_Init::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_Init, CallFunc_Array_Length_ReturnValue_2) == 0x000100, "Member 'ActorRecording_C_Init::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_Init, K2Node_DynamicCast_AsWBP_Group) == 0x000108, "Member 'ActorRecording_C_Init::K2Node_DynamicCast_AsWBP_Group' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_Init, K2Node_DynamicCast_bSuccess_2) == 0x000110, "Member 'ActorRecording_C_Init::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_Init, CallFunc_Less_IntInt_ReturnValue_1) == 0x000111, "Member 'ActorRecording_C_Init::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_Init, CallFunc_BreakVector2D_X) == 0x000118, "Member 'ActorRecording_C_Init::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_Init, CallFunc_BreakVector2D_Y) == 0x000120, "Member 'ActorRecording_C_Init::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_Init, CallFunc_GetPlayerState_PlayerState) == 0x000128, "Member 'ActorRecording_C_Init::CallFunc_GetPlayerState_PlayerState' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_Init, CallFunc_FTrunc_ReturnValue) == 0x000130, "Member 'ActorRecording_C_Init::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_Init, CallFunc_IsValid_ReturnValue_1) == 0x000134, "Member 'ActorRecording_C_Init::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_Init, CallFunc_GetPawn_ReturnValue) == 0x000138, "Member 'ActorRecording_C_Init::CallFunc_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_Init, CallFunc_Array_Find_ReturnValue) == 0x000140, "Member 'ActorRecording_C_Init::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_Init, K2Node_DynamicCast_AsSurvival_Player_V2_1) == 0x000148, "Member 'ActorRecording_C_Init::K2Node_DynamicCast_AsSurvival_Player_V2_1' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_Init, K2Node_DynamicCast_bSuccess_3) == 0x000150, "Member 'ActorRecording_C_Init::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_Init, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000151, "Member 'ActorRecording_C_Init::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_Init, CallFunc_IsLocallyControlled_ReturnValue) == 0x000152, "Member 'ActorRecording_C_Init::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_Init, CallFunc_FTrunc_ReturnValue_1) == 0x000154, "Member 'ActorRecording_C_Init::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_Init, CallFunc_MakeBrushFromMaterial_ReturnValue) == 0x000160, "Member 'ActorRecording_C_Init::CallFunc_MakeBrushFromMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_Init, CallFunc_BreakVector2D_InVec_ImplicitCast) == 0x000230, "Member 'ActorRecording_C_Init::CallFunc_BreakVector2D_InVec_ImplicitCast' has a wrong offset!");

// Function ActorRecording.ActorRecording_C.MakeSaveFromSurvivalPlayer
// 0x0010 (0x0010 - 0x0000)
struct ActorRecording_C_MakeSaveFromSurvivalPlayer final
{
public:
	class ASurvivalPlayer_V2_C*                   SurvivalPlayer;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActorRecording_C_MakeSaveFromSurvivalPlayer) == 0x000008, "Wrong alignment on ActorRecording_C_MakeSaveFromSurvivalPlayer");
static_assert(sizeof(ActorRecording_C_MakeSaveFromSurvivalPlayer) == 0x000010, "Wrong size on ActorRecording_C_MakeSaveFromSurvivalPlayer");
static_assert(offsetof(ActorRecording_C_MakeSaveFromSurvivalPlayer, SurvivalPlayer) == 0x000000, "Member 'ActorRecording_C_MakeSaveFromSurvivalPlayer::SurvivalPlayer' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_MakeSaveFromSurvivalPlayer, Param_Index) == 0x000008, "Member 'ActorRecording_C_MakeSaveFromSurvivalPlayer::Param_Index' has a wrong offset!");

// Function ActorRecording.ActorRecording_C.MouseMove
// 0x0010 (0x0010 - 0x0000)
struct ActorRecording_C_MouseMove final
{
public:
	struct FVector2D                              MouseLocation;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActorRecording_C_MouseMove) == 0x000008, "Wrong alignment on ActorRecording_C_MouseMove");
static_assert(sizeof(ActorRecording_C_MouseMove) == 0x000010, "Wrong size on ActorRecording_C_MouseMove");
static_assert(offsetof(ActorRecording_C_MouseMove, MouseLocation) == 0x000000, "Member 'ActorRecording_C_MouseMove::MouseLocation' has a wrong offset!");

// Function ActorRecording.ActorRecording_C.RefreshMesh
// 0x0018 (0x0018 - 0x0000)
struct ActorRecording_C_RefreshMesh final
{
public:
	class UChildActorComponent*                   Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          LocalCharacter;                                    // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterCreateSave_C*                 Character_Save_Ref;                                // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActorRecording_C_RefreshMesh) == 0x000008, "Wrong alignment on ActorRecording_C_RefreshMesh");
static_assert(sizeof(ActorRecording_C_RefreshMesh) == 0x000018, "Wrong size on ActorRecording_C_RefreshMesh");
static_assert(offsetof(ActorRecording_C_RefreshMesh, Target) == 0x000000, "Member 'ActorRecording_C_RefreshMesh::Target' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_RefreshMesh, LocalCharacter) == 0x000008, "Member 'ActorRecording_C_RefreshMesh::LocalCharacter' has a wrong offset!");
static_assert(offsetof(ActorRecording_C_RefreshMesh, Character_Save_Ref) == 0x000010, "Member 'ActorRecording_C_RefreshMesh::Character_Save_Ref' has a wrong offset!");

}

