#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AddProgress

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "QuestFramework_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AddProgress.AddProgress_C
// 0x0018 (0x0050 - 0x0038)
class UAddProgress_C final : public UQuestEvent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0038(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   Variable_Variable;                                 // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Additive;                                          // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Value;                                             // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteEvent(class UQuestContext* Context, const struct FQuestEventPayload& Payload);
	void ExecuteUbergraph_AddProgress(int32 EntryPoint);
	int32 SetValueProgress(class UQuestContext* Context);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AddProgress_C">();
	}
	static class UAddProgress_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddProgress_C>();
	}
};
static_assert(alignof(UAddProgress_C) == 0x000008, "Wrong alignment on UAddProgress_C");
static_assert(sizeof(UAddProgress_C) == 0x000050, "Wrong size on UAddProgress_C");
static_assert(offsetof(UAddProgress_C, UberGraphFrame) == 0x000038, "Member 'UAddProgress_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAddProgress_C, Variable_Variable) == 0x000040, "Member 'UAddProgress_C::Variable_Variable' has a wrong offset!");
static_assert(offsetof(UAddProgress_C, Additive) == 0x000048, "Member 'UAddProgress_C::Additive' has a wrong offset!");
static_assert(offsetof(UAddProgress_C, Value) == 0x00004C, "Member 'UAddProgress_C::Value' has a wrong offset!");

}

