#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AddProgressInUI

#include "Basic.hpp"

#include "QuestFramework_structs.hpp"


namespace SDK::Params
{

// Function AddProgressInUI.AddProgressInUI_C.ExecuteEvent
// 0x0028 (0x0028 - 0x0000)
struct AddProgressInUI_C_ExecuteEvent final
{
public:
	class UQuestContext*                          Context;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FQuestEventPayload                     Payload;                                           // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(AddProgressInUI_C_ExecuteEvent) == 0x000008, "Wrong alignment on AddProgressInUI_C_ExecuteEvent");
static_assert(sizeof(AddProgressInUI_C_ExecuteEvent) == 0x000028, "Wrong size on AddProgressInUI_C_ExecuteEvent");
static_assert(offsetof(AddProgressInUI_C_ExecuteEvent, Context) == 0x000000, "Member 'AddProgressInUI_C_ExecuteEvent::Context' has a wrong offset!");
static_assert(offsetof(AddProgressInUI_C_ExecuteEvent, Payload) == 0x000008, "Member 'AddProgressInUI_C_ExecuteEvent::Payload' has a wrong offset!");

// Function AddProgressInUI.AddProgressInUI_C.ExecuteUbergraph_AddProgressInUI
// 0x0058 (0x0058 - 0x0000)
struct AddProgressInUI_C_ExecuteUbergraph_AddProgressInUI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UQuestContext*                          K2Node_Event_Context;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FQuestEventPayload                     K2Node_Event_Payload;                              // 0x0010(0x0020)(ConstParm, NoDestructor)
	int32                                         CallFunc_SetValueProgress_ReturnValue;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UQuest*                                 CallFunc_GetQuestAsset_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetOwnerController_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvPC_C*                              K2Node_DynamicCast_AsSurv_PC;                      // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AddProgressInUI_C_ExecuteUbergraph_AddProgressInUI) == 0x000008, "Wrong alignment on AddProgressInUI_C_ExecuteUbergraph_AddProgressInUI");
static_assert(sizeof(AddProgressInUI_C_ExecuteUbergraph_AddProgressInUI) == 0x000058, "Wrong size on AddProgressInUI_C_ExecuteUbergraph_AddProgressInUI");
static_assert(offsetof(AddProgressInUI_C_ExecuteUbergraph_AddProgressInUI, EntryPoint) == 0x000000, "Member 'AddProgressInUI_C_ExecuteUbergraph_AddProgressInUI::EntryPoint' has a wrong offset!");
static_assert(offsetof(AddProgressInUI_C_ExecuteUbergraph_AddProgressInUI, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'AddProgressInUI_C_ExecuteUbergraph_AddProgressInUI::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AddProgressInUI_C_ExecuteUbergraph_AddProgressInUI, K2Node_Event_Context) == 0x000008, "Member 'AddProgressInUI_C_ExecuteUbergraph_AddProgressInUI::K2Node_Event_Context' has a wrong offset!");
static_assert(offsetof(AddProgressInUI_C_ExecuteUbergraph_AddProgressInUI, K2Node_Event_Payload) == 0x000010, "Member 'AddProgressInUI_C_ExecuteUbergraph_AddProgressInUI::K2Node_Event_Payload' has a wrong offset!");
static_assert(offsetof(AddProgressInUI_C_ExecuteUbergraph_AddProgressInUI, CallFunc_SetValueProgress_ReturnValue) == 0x000030, "Member 'AddProgressInUI_C_ExecuteUbergraph_AddProgressInUI::CallFunc_SetValueProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(AddProgressInUI_C_ExecuteUbergraph_AddProgressInUI, CallFunc_GetQuestAsset_ReturnValue) == 0x000038, "Member 'AddProgressInUI_C_ExecuteUbergraph_AddProgressInUI::CallFunc_GetQuestAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(AddProgressInUI_C_ExecuteUbergraph_AddProgressInUI, CallFunc_GetOwnerController_ReturnValue) == 0x000040, "Member 'AddProgressInUI_C_ExecuteUbergraph_AddProgressInUI::CallFunc_GetOwnerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(AddProgressInUI_C_ExecuteUbergraph_AddProgressInUI, K2Node_DynamicCast_AsSurv_PC) == 0x000048, "Member 'AddProgressInUI_C_ExecuteUbergraph_AddProgressInUI::K2Node_DynamicCast_AsSurv_PC' has a wrong offset!");
static_assert(offsetof(AddProgressInUI_C_ExecuteUbergraph_AddProgressInUI, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'AddProgressInUI_C_ExecuteUbergraph_AddProgressInUI::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function AddProgressInUI.AddProgressInUI_C.SetValueProgress
// 0x0038 (0x0038 - 0x0000)
struct AddProgressInUI_C_SetValueProgress final
{
public:
	class UQuestContext*                          Context;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuestVariable                         K2Node_MakeStruct_QuestVariable;                   // 0x000C(0x000C)(NoDestructor)
	int32                                         CallFunc_GetQuestVariableValueAsInteger_ReturnValue; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuestVariable                         K2Node_MakeStruct_QuestVariable_1;                 // 0x001C(0x000C)(NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuestVariable                         K2Node_MakeStruct_QuestVariable_2;                 // 0x002C(0x000C)(NoDestructor)
};
static_assert(alignof(AddProgressInUI_C_SetValueProgress) == 0x000008, "Wrong alignment on AddProgressInUI_C_SetValueProgress");
static_assert(sizeof(AddProgressInUI_C_SetValueProgress) == 0x000038, "Wrong size on AddProgressInUI_C_SetValueProgress");
static_assert(offsetof(AddProgressInUI_C_SetValueProgress, Context) == 0x000000, "Member 'AddProgressInUI_C_SetValueProgress::Context' has a wrong offset!");
static_assert(offsetof(AddProgressInUI_C_SetValueProgress, ReturnValue) == 0x000008, "Member 'AddProgressInUI_C_SetValueProgress::ReturnValue' has a wrong offset!");
static_assert(offsetof(AddProgressInUI_C_SetValueProgress, K2Node_MakeStruct_QuestVariable) == 0x00000C, "Member 'AddProgressInUI_C_SetValueProgress::K2Node_MakeStruct_QuestVariable' has a wrong offset!");
static_assert(offsetof(AddProgressInUI_C_SetValueProgress, CallFunc_GetQuestVariableValueAsInteger_ReturnValue) == 0x000018, "Member 'AddProgressInUI_C_SetValueProgress::CallFunc_GetQuestVariableValueAsInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(AddProgressInUI_C_SetValueProgress, K2Node_MakeStruct_QuestVariable_1) == 0x00001C, "Member 'AddProgressInUI_C_SetValueProgress::K2Node_MakeStruct_QuestVariable_1' has a wrong offset!");
static_assert(offsetof(AddProgressInUI_C_SetValueProgress, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'AddProgressInUI_C_SetValueProgress::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AddProgressInUI_C_SetValueProgress, K2Node_MakeStruct_QuestVariable_2) == 0x00002C, "Member 'AddProgressInUI_C_SetValueProgress::K2Node_MakeStruct_QuestVariable_2' has a wrong offset!");

}

