#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AIC_Deer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AIC_Deer.AIC_Deer_C
// 0x0090 (0x0448 - 0x03B8)
class AAIC_Deer_C final : public AAIController
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAIPerceptionComponent*                 AIPerception;                                      // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPawnSensingComponent*                  PawnSensing;                                       // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 StartSensedActor;                                  // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   RunAwayKey;                                        // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RunAwayLocationKey;                                // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Waiting;                                           // 0x03E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ActivatedAI;                                       // 0x03E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EA[0x6];                                      // 0x03EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           SenseLimitTimer;                                   // 0x03F0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          SensesAreBlocked;                                  // 0x03F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F9[0x7];                                      // 0x03F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_DeerV2_C*                           DeerV2;                                            // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   HomeLocationKey;                                   // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DisabledAI;                                        // 0x0410(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_411[0x7];                                      // 0x0411(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           ClearLookAtActorTimer;                             // 0x0418(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        AllSoundsScareDistance;                            // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TrueHearDistance;                                  // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFearZombie;                                       // 0x0430(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_431[0x3];                                      // 0x0431(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Run_Away_Radius_After_Distance;                    // 0x0434(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsAnyPlayerNear;                                  // 0x0438(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_439[0x7];                                      // 0x0439(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           PlayerIsNearTimer;                                 // 0x0440(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__AIC_Deer_AIPerception_K2Node_ComponentBoundEvent_5_ActorPerceptionUpdatedDelegate__DelegateSignature(class AActor* Actor, const struct FAIStimulus& Stimulus);
	void BndEvt__AIC_Deer_PawnSensing_K2Node_ComponentBoundEvent_0_HearNoiseDelegate__DelegateSignature(class APawn* Param_Instigator, const struct FVector& Location, float Volume);
	void BndEvt__AIC_Deer_PawnSensing_K2Node_ComponentBoundEvent_1_SeePawnDelegate__DelegateSignature(class APawn* Param_Pawn);
	void CanLookAtCharacter(const struct FAIStimulus& Stimulus, class AActor* ActorHeared, bool* Result);
	void CanPerceptionHappen(class AActor* SensedActor, bool* Yes);
	void CheckIsOptimizationHearing(class AActor* Actor, const struct FAIStimulus& AIStimulus);
	void ClearLookAtActor();
	void EnableAI(bool Enable, const struct FVector& HomeLocation);
	void ExecuteUbergraph_AIC_Deer(int32 EntryPoint);
	void GenerateRunAwayLocation(class AActor* SensedActor, float RadiusAfterDistance, struct FVector* RunAwayLocation, bool* IsReachable);
	void IsDangerHeared(const struct FAIStimulus& Stimulus, bool* Param_IsDangerHeared);
	void IsReachableLocation(const struct FVector& Target_Location, bool* IsReachable);
	void OnAnySense();
	void OnSenseHappened(class AActor* SensedActor);
	void OptimizationAdjustTicks(bool IsPlayerNear);
	void ReceiveBeginPlay();
	void RefreshSense();
	void SetHomeLocationArea(const struct FVector& HomeLocation);
	void SetNoPlayersNear();
	void ValidateOnStartSense(class AActor* SensedActor, bool* Continue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AIC_Deer_C">();
	}
	static class AAIC_Deer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAIC_Deer_C>();
	}
};
static_assert(alignof(AAIC_Deer_C) == 0x000008, "Wrong alignment on AAIC_Deer_C");
static_assert(sizeof(AAIC_Deer_C) == 0x000448, "Wrong size on AAIC_Deer_C");
static_assert(offsetof(AAIC_Deer_C, UberGraphFrame) == 0x0003B8, "Member 'AAIC_Deer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AAIC_Deer_C, AIPerception) == 0x0003C0, "Member 'AAIC_Deer_C::AIPerception' has a wrong offset!");
static_assert(offsetof(AAIC_Deer_C, PawnSensing) == 0x0003C8, "Member 'AAIC_Deer_C::PawnSensing' has a wrong offset!");
static_assert(offsetof(AAIC_Deer_C, StartSensedActor) == 0x0003D0, "Member 'AAIC_Deer_C::StartSensedActor' has a wrong offset!");
static_assert(offsetof(AAIC_Deer_C, RunAwayKey) == 0x0003D8, "Member 'AAIC_Deer_C::RunAwayKey' has a wrong offset!");
static_assert(offsetof(AAIC_Deer_C, RunAwayLocationKey) == 0x0003E0, "Member 'AAIC_Deer_C::RunAwayLocationKey' has a wrong offset!");
static_assert(offsetof(AAIC_Deer_C, Waiting) == 0x0003E8, "Member 'AAIC_Deer_C::Waiting' has a wrong offset!");
static_assert(offsetof(AAIC_Deer_C, ActivatedAI) == 0x0003E9, "Member 'AAIC_Deer_C::ActivatedAI' has a wrong offset!");
static_assert(offsetof(AAIC_Deer_C, SenseLimitTimer) == 0x0003F0, "Member 'AAIC_Deer_C::SenseLimitTimer' has a wrong offset!");
static_assert(offsetof(AAIC_Deer_C, SensesAreBlocked) == 0x0003F8, "Member 'AAIC_Deer_C::SensesAreBlocked' has a wrong offset!");
static_assert(offsetof(AAIC_Deer_C, DeerV2) == 0x000400, "Member 'AAIC_Deer_C::DeerV2' has a wrong offset!");
static_assert(offsetof(AAIC_Deer_C, HomeLocationKey) == 0x000408, "Member 'AAIC_Deer_C::HomeLocationKey' has a wrong offset!");
static_assert(offsetof(AAIC_Deer_C, DisabledAI) == 0x000410, "Member 'AAIC_Deer_C::DisabledAI' has a wrong offset!");
static_assert(offsetof(AAIC_Deer_C, ClearLookAtActorTimer) == 0x000418, "Member 'AAIC_Deer_C::ClearLookAtActorTimer' has a wrong offset!");
static_assert(offsetof(AAIC_Deer_C, AllSoundsScareDistance) == 0x000420, "Member 'AAIC_Deer_C::AllSoundsScareDistance' has a wrong offset!");
static_assert(offsetof(AAIC_Deer_C, TrueHearDistance) == 0x000428, "Member 'AAIC_Deer_C::TrueHearDistance' has a wrong offset!");
static_assert(offsetof(AAIC_Deer_C, bFearZombie) == 0x000430, "Member 'AAIC_Deer_C::bFearZombie' has a wrong offset!");
static_assert(offsetof(AAIC_Deer_C, Run_Away_Radius_After_Distance) == 0x000434, "Member 'AAIC_Deer_C::Run_Away_Radius_After_Distance' has a wrong offset!");
static_assert(offsetof(AAIC_Deer_C, bIsAnyPlayerNear) == 0x000438, "Member 'AAIC_Deer_C::bIsAnyPlayerNear' has a wrong offset!");
static_assert(offsetof(AAIC_Deer_C, PlayerIsNearTimer) == 0x000440, "Member 'AAIC_Deer_C::PlayerIsNearTimer' has a wrong offset!");

}

