#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AimIdleNegEffShake

#include "Basic.hpp"


namespace SDK::Params
{

// Function AimIdleNegEffShake.AimIdleNegEffShake_C.ExecuteUbergraph_AimIdleNegEffShake
// 0x0008 (0x0008 - 0x0000)
struct AimIdleNegEffShake_C_ExecuteUbergraph_AimIdleNegEffShake final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Scale;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AimIdleNegEffShake_C_ExecuteUbergraph_AimIdleNegEffShake) == 0x000004, "Wrong alignment on AimIdleNegEffShake_C_ExecuteUbergraph_AimIdleNegEffShake");
static_assert(sizeof(AimIdleNegEffShake_C_ExecuteUbergraph_AimIdleNegEffShake) == 0x000008, "Wrong size on AimIdleNegEffShake_C_ExecuteUbergraph_AimIdleNegEffShake");
static_assert(offsetof(AimIdleNegEffShake_C_ExecuteUbergraph_AimIdleNegEffShake, EntryPoint) == 0x000000, "Member 'AimIdleNegEffShake_C_ExecuteUbergraph_AimIdleNegEffShake::EntryPoint' has a wrong offset!");
static_assert(offsetof(AimIdleNegEffShake_C_ExecuteUbergraph_AimIdleNegEffShake, K2Node_Event_Scale) == 0x000004, "Member 'AimIdleNegEffShake_C_ExecuteUbergraph_AimIdleNegEffShake::K2Node_Event_Scale' has a wrong offset!");

// Function AimIdleNegEffShake.AimIdleNegEffShake_C.ReceivePlayShake_2
// 0x0004 (0x0004 - 0x0000)
struct AimIdleNegEffShake_C_ReceivePlayShake_2 final
{
public:
	float                                         Scale;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AimIdleNegEffShake_C_ReceivePlayShake_2) == 0x000004, "Wrong alignment on AimIdleNegEffShake_C_ReceivePlayShake_2");
static_assert(sizeof(AimIdleNegEffShake_C_ReceivePlayShake_2) == 0x000004, "Wrong size on AimIdleNegEffShake_C_ReceivePlayShake_2");
static_assert(offsetof(AimIdleNegEffShake_C_ReceivePlayShake_2, Scale) == 0x000000, "Member 'AimIdleNegEffShake_C_ReceivePlayShake_2::Scale' has a wrong offset!");

}

