#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AimIdleShake

#include "Basic.hpp"


namespace SDK::Params
{

// Function AimIdleShake.AimIdleShake_C.ExecuteUbergraph_AimIdleShake
// 0x0008 (0x0008 - 0x0000)
struct AimIdleShake_C_ExecuteUbergraph_AimIdleShake final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Scale;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AimIdleShake_C_ExecuteUbergraph_AimIdleShake) == 0x000004, "Wrong alignment on AimIdleShake_C_ExecuteUbergraph_AimIdleShake");
static_assert(sizeof(AimIdleShake_C_ExecuteUbergraph_AimIdleShake) == 0x000008, "Wrong size on AimIdleShake_C_ExecuteUbergraph_AimIdleShake");
static_assert(offsetof(AimIdleShake_C_ExecuteUbergraph_AimIdleShake, EntryPoint) == 0x000000, "Member 'AimIdleShake_C_ExecuteUbergraph_AimIdleShake::EntryPoint' has a wrong offset!");
static_assert(offsetof(AimIdleShake_C_ExecuteUbergraph_AimIdleShake, K2Node_Event_Scale) == 0x000004, "Member 'AimIdleShake_C_ExecuteUbergraph_AimIdleShake::K2Node_Event_Scale' has a wrong offset!");

// Function AimIdleShake.AimIdleShake_C.ReceivePlayShake_2
// 0x0004 (0x0004 - 0x0000)
struct AimIdleShake_C_ReceivePlayShake_2 final
{
public:
	float                                         Scale;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AimIdleShake_C_ReceivePlayShake_2) == 0x000004, "Wrong alignment on AimIdleShake_C_ReceivePlayShake_2");
static_assert(sizeof(AimIdleShake_C_ReceivePlayShake_2) == 0x000004, "Wrong size on AimIdleShake_C_ReceivePlayShake_2");
static_assert(offsetof(AimIdleShake_C_ReceivePlayShake_2, Scale) == 0x000000, "Member 'AimIdleShake_C_ReceivePlayShake_2::Scale' has a wrong offset!");

}

