#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AimIdleNegEffTPPShake

#include "Basic.hpp"


namespace SDK::Params
{

// Function AimIdleNegEffTPPShake.AimIdleNegEffTPPShake_C.ExecuteUbergraph_AimIdleNegEffTPPShake
// 0x0008 (0x0008 - 0x0000)
struct AimIdleNegEffTPPShake_C_ExecuteUbergraph_AimIdleNegEffTPPShake final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Scale;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AimIdleNegEffTPPShake_C_ExecuteUbergraph_AimIdleNegEffTPPShake) == 0x000004, "Wrong alignment on AimIdleNegEffTPPShake_C_ExecuteUbergraph_AimIdleNegEffTPPShake");
static_assert(sizeof(AimIdleNegEffTPPShake_C_ExecuteUbergraph_AimIdleNegEffTPPShake) == 0x000008, "Wrong size on AimIdleNegEffTPPShake_C_ExecuteUbergraph_AimIdleNegEffTPPShake");
static_assert(offsetof(AimIdleNegEffTPPShake_C_ExecuteUbergraph_AimIdleNegEffTPPShake, EntryPoint) == 0x000000, "Member 'AimIdleNegEffTPPShake_C_ExecuteUbergraph_AimIdleNegEffTPPShake::EntryPoint' has a wrong offset!");
static_assert(offsetof(AimIdleNegEffTPPShake_C_ExecuteUbergraph_AimIdleNegEffTPPShake, K2Node_Event_Scale) == 0x000004, "Member 'AimIdleNegEffTPPShake_C_ExecuteUbergraph_AimIdleNegEffTPPShake::K2Node_Event_Scale' has a wrong offset!");

// Function AimIdleNegEffTPPShake.AimIdleNegEffTPPShake_C.ReceivePlayShake_2
// 0x0004 (0x0004 - 0x0000)
struct AimIdleNegEffTPPShake_C_ReceivePlayShake_2 final
{
public:
	float                                         Scale;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AimIdleNegEffTPPShake_C_ReceivePlayShake_2) == 0x000004, "Wrong alignment on AimIdleNegEffTPPShake_C_ReceivePlayShake_2");
static_assert(sizeof(AimIdleNegEffTPPShake_C_ReceivePlayShake_2) == 0x000004, "Wrong size on AimIdleNegEffTPPShake_C_ReceivePlayShake_2");
static_assert(offsetof(AimIdleNegEffTPPShake_C_ReceivePlayShake_2, Scale) == 0x000000, "Member 'AimIdleNegEffTPPShake_C_ReceivePlayShake_2::Scale' has a wrong offset!");

}

