#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AimIdleShakeFPP

#include "Basic.hpp"


namespace SDK::Params
{

// Function AimIdleShakeFPP.AimIdleShakeFPP_C.ExecuteUbergraph_AimIdleShakeFPP
// 0x0008 (0x0008 - 0x0000)
struct AimIdleShakeFPP_C_ExecuteUbergraph_AimIdleShakeFPP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Scale;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AimIdleShakeFPP_C_ExecuteUbergraph_AimIdleShakeFPP) == 0x000004, "Wrong alignment on AimIdleShakeFPP_C_ExecuteUbergraph_AimIdleShakeFPP");
static_assert(sizeof(AimIdleShakeFPP_C_ExecuteUbergraph_AimIdleShakeFPP) == 0x000008, "Wrong size on AimIdleShakeFPP_C_ExecuteUbergraph_AimIdleShakeFPP");
static_assert(offsetof(AimIdleShakeFPP_C_ExecuteUbergraph_AimIdleShakeFPP, EntryPoint) == 0x000000, "Member 'AimIdleShakeFPP_C_ExecuteUbergraph_AimIdleShakeFPP::EntryPoint' has a wrong offset!");
static_assert(offsetof(AimIdleShakeFPP_C_ExecuteUbergraph_AimIdleShakeFPP, K2Node_Event_Scale) == 0x000004, "Member 'AimIdleShakeFPP_C_ExecuteUbergraph_AimIdleShakeFPP::K2Node_Event_Scale' has a wrong offset!");

// Function AimIdleShakeFPP.AimIdleShakeFPP_C.ReceivePlayShake_2
// 0x0004 (0x0004 - 0x0000)
struct AimIdleShakeFPP_C_ReceivePlayShake_2 final
{
public:
	float                                         Scale;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AimIdleShakeFPP_C_ReceivePlayShake_2) == 0x000004, "Wrong alignment on AimIdleShakeFPP_C_ReceivePlayShake_2");
static_assert(sizeof(AimIdleShakeFPP_C_ReceivePlayShake_2) == 0x000004, "Wrong size on AimIdleShakeFPP_C_ReceivePlayShake_2");
static_assert(offsetof(AimIdleShakeFPP_C_ReceivePlayShake_2, Scale) == 0x000000, "Member 'AimIdleShakeFPP_C_ReceivePlayShake_2::Scale' has a wrong offset!");

}

