#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AIMovementComponent

#include "Basic.hpp"

#include "E_AIMovementType_structs.hpp"
#include "Survival_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "F_RotationCurvesMap_structs.hpp"
#include "Engine_structs.hpp"
#include "F_MovementSettings_structs.hpp"


namespace SDK::Params
{

// Function AIMovementComponent.AIMovementComponent_C.ActivateComponent
// 0x0070 (0x0070 - 0x0000)
struct AIMovementComponent_C_ActivateComponent final
{
public:
	bool                                          TickEnabled;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* TargetActor)>    K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AZombie_C*                              K2Node_DynamicCast_AsZombie;                       // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterMovementComponent*            CallFunc_GetComponentByClass_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AIMovementComponent_C_ActivateComponent) == 0x000008, "Wrong alignment on AIMovementComponent_C_ActivateComponent");
static_assert(sizeof(AIMovementComponent_C_ActivateComponent) == 0x000070, "Wrong size on AIMovementComponent_C_ActivateComponent");
static_assert(offsetof(AIMovementComponent_C_ActivateComponent, TickEnabled) == 0x000000, "Member 'AIMovementComponent_C_ActivateComponent::TickEnabled' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_ActivateComponent, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'AIMovementComponent_C_ActivateComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_ActivateComponent, CallFunc_IsValid_ReturnValue_1) == 0x000002, "Member 'AIMovementComponent_C_ActivateComponent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_ActivateComponent, CallFunc_IsValid_ReturnValue_2) == 0x000003, "Member 'AIMovementComponent_C_ActivateComponent::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_ActivateComponent, K2Node_MakeArray_Array) == 0x000008, "Member 'AIMovementComponent_C_ActivateComponent::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_ActivateComponent, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'AIMovementComponent_C_ActivateComponent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_ActivateComponent, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'AIMovementComponent_C_ActivateComponent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_ActivateComponent, K2Node_DynamicCast_AsZombie) == 0x000038, "Member 'AIMovementComponent_C_ActivateComponent::K2Node_DynamicCast_AsZombie' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_ActivateComponent, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'AIMovementComponent_C_ActivateComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_ActivateComponent, CallFunc_IsValid_ReturnValue_3) == 0x000041, "Member 'AIMovementComponent_C_ActivateComponent::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_ActivateComponent, CallFunc_GetComponentByClass_ReturnValue) == 0x000048, "Member 'AIMovementComponent_C_ActivateComponent::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_ActivateComponent, CallFunc_GetOwner_ReturnValue) == 0x000050, "Member 'AIMovementComponent_C_ActivateComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_ActivateComponent, K2Node_DynamicCast_AsCharacter) == 0x000058, "Member 'AIMovementComponent_C_ActivateComponent::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_ActivateComponent, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'AIMovementComponent_C_ActivateComponent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_ActivateComponent, CallFunc_GetAnimInstance_ReturnValue) == 0x000068, "Member 'AIMovementComponent_C_ActivateComponent::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");

// Function AIMovementComponent.AIMovementComponent_C.AddCarAvoidingPoint
// 0x01B0 (0x01B0 - 0x0000)
struct AIMovementComponent_C_AddCarAvoidingPoint final
{
public:
	TArray<struct FVector>                        InPoints;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FVector>                        OutPoints;                                         // 0x0010(0x0010)(Parm, OutParm)
	double                                        ReflectionAvoidDistance;                           // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RotateAvoidDistance;                               // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PointFromReflection;                               // 0x0030(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ChooseFront;                                       // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CarBackCenter;                                     // 0x0050(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PointFromRotate;                                   // 0x0068(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ForwardVectorRotated;                              // 0x0080(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CalcStartLocation;                                 // 0x0098(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue_1;      // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetAngleBetweenTwoVectors_Angle;          // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0198(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AIMovementComponent_C_AddCarAvoidingPoint) == 0x000008, "Wrong alignment on AIMovementComponent_C_AddCarAvoidingPoint");
static_assert(sizeof(AIMovementComponent_C_AddCarAvoidingPoint) == 0x0001B0, "Wrong size on AIMovementComponent_C_AddCarAvoidingPoint");
static_assert(offsetof(AIMovementComponent_C_AddCarAvoidingPoint, InPoints) == 0x000000, "Member 'AIMovementComponent_C_AddCarAvoidingPoint::InPoints' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_AddCarAvoidingPoint, OutPoints) == 0x000010, "Member 'AIMovementComponent_C_AddCarAvoidingPoint::OutPoints' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_AddCarAvoidingPoint, ReflectionAvoidDistance) == 0x000020, "Member 'AIMovementComponent_C_AddCarAvoidingPoint::ReflectionAvoidDistance' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_AddCarAvoidingPoint, RotateAvoidDistance) == 0x000028, "Member 'AIMovementComponent_C_AddCarAvoidingPoint::RotateAvoidDistance' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_AddCarAvoidingPoint, PointFromReflection) == 0x000030, "Member 'AIMovementComponent_C_AddCarAvoidingPoint::PointFromReflection' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_AddCarAvoidingPoint, ChooseFront) == 0x000048, "Member 'AIMovementComponent_C_AddCarAvoidingPoint::ChooseFront' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_AddCarAvoidingPoint, CarBackCenter) == 0x000050, "Member 'AIMovementComponent_C_AddCarAvoidingPoint::CarBackCenter' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_AddCarAvoidingPoint, PointFromRotate) == 0x000068, "Member 'AIMovementComponent_C_AddCarAvoidingPoint::PointFromRotate' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_AddCarAvoidingPoint, ForwardVectorRotated) == 0x000080, "Member 'AIMovementComponent_C_AddCarAvoidingPoint::ForwardVectorRotated' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_AddCarAvoidingPoint, CalcStartLocation) == 0x000098, "Member 'AIMovementComponent_C_AddCarAvoidingPoint::CalcStartLocation' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_AddCarAvoidingPoint, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x0000B0, "Member 'AIMovementComponent_C_AddCarAvoidingPoint::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_AddCarAvoidingPoint, CallFunc_GetActorForwardVector_ReturnValue) == 0x0000C8, "Member 'AIMovementComponent_C_AddCarAvoidingPoint::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_AddCarAvoidingPoint, CallFunc_RotateAngleAxis_ReturnValue) == 0x0000E0, "Member 'AIMovementComponent_C_AddCarAvoidingPoint::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_AddCarAvoidingPoint, CallFunc_GetActorForwardVector_ReturnValue_1) == 0x0000F8, "Member 'AIMovementComponent_C_AddCarAvoidingPoint::CallFunc_GetActorForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_AddCarAvoidingPoint, CallFunc_GetAngleBetweenTwoVectors_Angle) == 0x000110, "Member 'AIMovementComponent_C_AddCarAvoidingPoint::CallFunc_GetAngleBetweenTwoVectors_Angle' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_AddCarAvoidingPoint, CallFunc_Conv_DoubleToVector_ReturnValue_1) == 0x000118, "Member 'AIMovementComponent_C_AddCarAvoidingPoint::CallFunc_Conv_DoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_AddCarAvoidingPoint, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000130, "Member 'AIMovementComponent_C_AddCarAvoidingPoint::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_AddCarAvoidingPoint, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000138, "Member 'AIMovementComponent_C_AddCarAvoidingPoint::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_AddCarAvoidingPoint, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x000150, "Member 'AIMovementComponent_C_AddCarAvoidingPoint::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_AddCarAvoidingPoint, CallFunc_Add_VectorVector_ReturnValue) == 0x000168, "Member 'AIMovementComponent_C_AddCarAvoidingPoint::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_AddCarAvoidingPoint, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000180, "Member 'AIMovementComponent_C_AddCarAvoidingPoint::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_AddCarAvoidingPoint, CallFunc_SelectVector_ReturnValue) == 0x000198, "Member 'AIMovementComponent_C_AddCarAvoidingPoint::CallFunc_SelectVector_ReturnValue' has a wrong offset!");

// Function AIMovementComponent.AIMovementComponent_C.AddRandomPointNearTarget
// 0x01B0 (0x01B0 - 0x0000)
struct AIMovementComponent_C_AddRandomPointNearTarget final
{
public:
	TArray<struct FVector>                        InPoints;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FVector>                        OutPoints;                                         // 0x0010(0x0010)(Parm, OutParm)
	struct FVector                                RaycastEnd;                                        // 0x0020(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RaycastStart;                                      // 0x0038(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NewLastPoint;                                      // 0x0050(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LastIndex;                                         // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Adjustment;                                        // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LastPoint;                                         // 0x0070(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBool_ReturnValue;                   // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBool_ReturnValue_1;                 // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorRightVector_ReturnValue;          // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_2;        // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_2;      // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_Adjustment_ImplicitCast;        // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast; // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AIMovementComponent_C_AddRandomPointNearTarget) == 0x000008, "Wrong alignment on AIMovementComponent_C_AddRandomPointNearTarget");
static_assert(sizeof(AIMovementComponent_C_AddRandomPointNearTarget) == 0x0001B0, "Wrong size on AIMovementComponent_C_AddRandomPointNearTarget");
static_assert(offsetof(AIMovementComponent_C_AddRandomPointNearTarget, InPoints) == 0x000000, "Member 'AIMovementComponent_C_AddRandomPointNearTarget::InPoints' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_AddRandomPointNearTarget, OutPoints) == 0x000010, "Member 'AIMovementComponent_C_AddRandomPointNearTarget::OutPoints' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_AddRandomPointNearTarget, RaycastEnd) == 0x000020, "Member 'AIMovementComponent_C_AddRandomPointNearTarget::RaycastEnd' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_AddRandomPointNearTarget, RaycastStart) == 0x000038, "Member 'AIMovementComponent_C_AddRandomPointNearTarget::RaycastStart' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_AddRandomPointNearTarget, NewLastPoint) == 0x000050, "Member 'AIMovementComponent_C_AddRandomPointNearTarget::NewLastPoint' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_AddRandomPointNearTarget, LastIndex) == 0x000068, "Member 'AIMovementComponent_C_AddRandomPointNearTarget::LastIndex' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_AddRandomPointNearTarget, Adjustment) == 0x00006C, "Member 'AIMovementComponent_C_AddRandomPointNearTarget::Adjustment' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_AddRandomPointNearTarget, LastPoint) == 0x000070, "Member 'AIMovementComponent_C_AddRandomPointNearTarget::LastPoint' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_AddRandomPointNearTarget, CallFunc_MapRangeClamped_ReturnValue) == 0x000088, "Member 'AIMovementComponent_C_AddRandomPointNearTarget::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_AddRandomPointNearTarget, CallFunc_IsValid_ReturnValue) == 0x000090, "Member 'AIMovementComponent_C_AddRandomPointNearTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_AddRandomPointNearTarget, CallFunc_GetActorForwardVector_ReturnValue) == 0x000098, "Member 'AIMovementComponent_C_AddRandomPointNearTarget::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_AddRandomPointNearTarget, CallFunc_RandomBool_ReturnValue) == 0x0000B0, "Member 'AIMovementComponent_C_AddRandomPointNearTarget::CallFunc_RandomBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_AddRandomPointNearTarget, CallFunc_RandomBool_ReturnValue_1) == 0x0000B1, "Member 'AIMovementComponent_C_AddRandomPointNearTarget::CallFunc_RandomBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_AddRandomPointNearTarget, CallFunc_SelectFloat_ReturnValue) == 0x0000B8, "Member 'AIMovementComponent_C_AddRandomPointNearTarget::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_AddRandomPointNearTarget, CallFunc_GetActorRightVector_ReturnValue) == 0x0000C0, "Member 'AIMovementComponent_C_AddRandomPointNearTarget::CallFunc_GetActorRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_AddRandomPointNearTarget, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x0000D8, "Member 'AIMovementComponent_C_AddRandomPointNearTarget::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_AddRandomPointNearTarget, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0000F0, "Member 'AIMovementComponent_C_AddRandomPointNearTarget::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_AddRandomPointNearTarget, CallFunc_Array_Add_ReturnValue) == 0x000108, "Member 'AIMovementComponent_C_AddRandomPointNearTarget::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_AddRandomPointNearTarget, CallFunc_Array_LastIndex_ReturnValue) == 0x00010C, "Member 'AIMovementComponent_C_AddRandomPointNearTarget::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_AddRandomPointNearTarget, CallFunc_Conv_DoubleToVector_ReturnValue_1) == 0x000110, "Member 'AIMovementComponent_C_AddRandomPointNearTarget::CallFunc_Conv_DoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_AddRandomPointNearTarget, CallFunc_Conv_DoubleToVector_ReturnValue_2) == 0x000128, "Member 'AIMovementComponent_C_AddRandomPointNearTarget::CallFunc_Conv_DoubleToVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_AddRandomPointNearTarget, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x000140, "Member 'AIMovementComponent_C_AddRandomPointNearTarget::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_AddRandomPointNearTarget, CallFunc_SelectVector_ReturnValue) == 0x000158, "Member 'AIMovementComponent_C_AddRandomPointNearTarget::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_AddRandomPointNearTarget, CallFunc_Multiply_VectorVector_ReturnValue_2) == 0x000170, "Member 'AIMovementComponent_C_AddRandomPointNearTarget::CallFunc_Multiply_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_AddRandomPointNearTarget, CallFunc_Add_VectorVector_ReturnValue) == 0x000188, "Member 'AIMovementComponent_C_AddRandomPointNearTarget::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_AddRandomPointNearTarget, K2Node_VariableSet_Adjustment_ImplicitCast) == 0x0001A0, "Member 'AIMovementComponent_C_AddRandomPointNearTarget::K2Node_VariableSet_Adjustment_ImplicitCast' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_AddRandomPointNearTarget, CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast) == 0x0001A8, "Member 'AIMovementComponent_C_AddRandomPointNearTarget::CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast' has a wrong offset!");

// Function AIMovementComponent.AIMovementComponent_C.AnalyzePath
// 0x0008 (0x0008 - 0x0000)
struct AIMovementComponent_C_AnalyzePath final
{
public:
	int32                                         CurrentIndex;                                      // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCPPIsStopping_ReturnValue;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TimeToChangePointIndex_Change;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AIMovementComponent_C_AnalyzePath) == 0x000004, "Wrong alignment on AIMovementComponent_C_AnalyzePath");
static_assert(sizeof(AIMovementComponent_C_AnalyzePath) == 0x000008, "Wrong size on AIMovementComponent_C_AnalyzePath");
static_assert(offsetof(AIMovementComponent_C_AnalyzePath, CurrentIndex) == 0x000000, "Member 'AIMovementComponent_C_AnalyzePath::CurrentIndex' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_AnalyzePath, CallFunc_GetCPPIsStopping_ReturnValue) == 0x000004, "Member 'AIMovementComponent_C_AnalyzePath::CallFunc_GetCPPIsStopping_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_AnalyzePath, CallFunc_TimeToChangePointIndex_Change) == 0x000005, "Member 'AIMovementComponent_C_AnalyzePath::CallFunc_TimeToChangePointIndex_Change' has a wrong offset!");

// Function AIMovementComponent.AIMovementComponent_C.BlockZombie
// 0x0010 (0x0010 - 0x0000)
struct AIMovementComponent_C_BlockZombie final
{
public:
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AIMovementComponent_C_BlockZombie) == 0x000008, "Wrong alignment on AIMovementComponent_C_BlockZombie");
static_assert(sizeof(AIMovementComponent_C_BlockZombie) == 0x000010, "Wrong size on AIMovementComponent_C_BlockZombie");
static_assert(offsetof(AIMovementComponent_C_BlockZombie, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000000, "Member 'AIMovementComponent_C_BlockZombie::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_BlockZombie, CallFunc_K2_SetTimer_ReturnValue) == 0x000008, "Member 'AIMovementComponent_C_BlockZombie::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");

// Function AIMovementComponent.AIMovementComponent_C.BlockZombieByWaterTarget
// 0x0010 (0x0010 - 0x0000)
struct AIMovementComponent_C_BlockZombieByWaterTarget final
{
public:
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AIMovementComponent_C_BlockZombieByWaterTarget) == 0x000008, "Wrong alignment on AIMovementComponent_C_BlockZombieByWaterTarget");
static_assert(sizeof(AIMovementComponent_C_BlockZombieByWaterTarget) == 0x000010, "Wrong size on AIMovementComponent_C_BlockZombieByWaterTarget");
static_assert(offsetof(AIMovementComponent_C_BlockZombieByWaterTarget, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000000, "Member 'AIMovementComponent_C_BlockZombieByWaterTarget::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_BlockZombieByWaterTarget, CallFunc_K2_SetTimer_ReturnValue) == 0x000008, "Member 'AIMovementComponent_C_BlockZombieByWaterTarget::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");

// Function AIMovementComponent.AIMovementComponent_C.Calculate Desired Direction
// 0x00A8 (0x00A8 - 0x0000)
struct AIMovementComponent_C_Calculate_Desired_Direction final
{
public:
	struct FVector                                DesiredDirection;                                  // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ResultDirection;                                   // 0x0018(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetDesiredVector_DesiredVector;           // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AIMovementComponent_C_Calculate_Desired_Direction) == 0x000008, "Wrong alignment on AIMovementComponent_C_Calculate_Desired_Direction");
static_assert(sizeof(AIMovementComponent_C_Calculate_Desired_Direction) == 0x0000A8, "Wrong size on AIMovementComponent_C_Calculate_Desired_Direction");
static_assert(offsetof(AIMovementComponent_C_Calculate_Desired_Direction, DesiredDirection) == 0x000000, "Member 'AIMovementComponent_C_Calculate_Desired_Direction::DesiredDirection' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_Calculate_Desired_Direction, ResultDirection) == 0x000018, "Member 'AIMovementComponent_C_Calculate_Desired_Direction::ResultDirection' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_Calculate_Desired_Direction, CallFunc_GetDesiredVector_DesiredVector) == 0x000030, "Member 'AIMovementComponent_C_Calculate_Desired_Direction::CallFunc_GetDesiredVector_DesiredVector' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_Calculate_Desired_Direction, CallFunc_FindLookAtRotation_ReturnValue) == 0x000048, "Member 'AIMovementComponent_C_Calculate_Desired_Direction::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_Calculate_Desired_Direction, CallFunc_GetForwardVector_ReturnValue) == 0x000060, "Member 'AIMovementComponent_C_Calculate_Desired_Direction::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_Calculate_Desired_Direction, CallFunc_BreakVector_X) == 0x000078, "Member 'AIMovementComponent_C_Calculate_Desired_Direction::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_Calculate_Desired_Direction, CallFunc_BreakVector_Y) == 0x000080, "Member 'AIMovementComponent_C_Calculate_Desired_Direction::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_Calculate_Desired_Direction, CallFunc_BreakVector_Z) == 0x000088, "Member 'AIMovementComponent_C_Calculate_Desired_Direction::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_Calculate_Desired_Direction, CallFunc_MakeVector_ReturnValue) == 0x000090, "Member 'AIMovementComponent_C_Calculate_Desired_Direction::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function AIMovementComponent.AIMovementComponent_C.CalculateCurrentPathPointLocation
// 0x0008 (0x0008 - 0x0000)
struct AIMovementComponent_C_CalculateCurrentPathPointLocation final
{
public:
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsIndexInRange_InRange;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AIMovementComponent_C_CalculateCurrentPathPointLocation) == 0x000004, "Wrong alignment on AIMovementComponent_C_CalculateCurrentPathPointLocation");
static_assert(sizeof(AIMovementComponent_C_CalculateCurrentPathPointLocation) == 0x000008, "Wrong size on AIMovementComponent_C_CalculateCurrentPathPointLocation");
static_assert(offsetof(AIMovementComponent_C_CalculateCurrentPathPointLocation, CallFunc_Array_Length_ReturnValue) == 0x000000, "Member 'AIMovementComponent_C_CalculateCurrentPathPointLocation::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_CalculateCurrentPathPointLocation, CallFunc_Greater_IntInt_ReturnValue) == 0x000004, "Member 'AIMovementComponent_C_CalculateCurrentPathPointLocation::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_CalculateCurrentPathPointLocation, CallFunc_IsIndexInRange_InRange) == 0x000005, "Member 'AIMovementComponent_C_CalculateCurrentPathPointLocation::CallFunc_IsIndexInRange_InRange' has a wrong offset!");

// Function AIMovementComponent.AIMovementComponent_C.CalculateDirectionInterpolationSpeed
// 0x0020 (0x0020 - 0x0000)
struct AIMovementComponent_C_CalculateDirectionInterpolationSpeed final
{
public:
	double                                        InterpolationSpeed;                                // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCPPVelocityValue_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCloseToTarget_IsClose;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_Value_ImplicitCast;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AIMovementComponent_C_CalculateDirectionInterpolationSpeed) == 0x000008, "Wrong alignment on AIMovementComponent_C_CalculateDirectionInterpolationSpeed");
static_assert(sizeof(AIMovementComponent_C_CalculateDirectionInterpolationSpeed) == 0x000020, "Wrong size on AIMovementComponent_C_CalculateDirectionInterpolationSpeed");
static_assert(offsetof(AIMovementComponent_C_CalculateDirectionInterpolationSpeed, InterpolationSpeed) == 0x000000, "Member 'AIMovementComponent_C_CalculateDirectionInterpolationSpeed::InterpolationSpeed' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_CalculateDirectionInterpolationSpeed, CallFunc_GetCPPVelocityValue_ReturnValue) == 0x000008, "Member 'AIMovementComponent_C_CalculateDirectionInterpolationSpeed::CallFunc_GetCPPVelocityValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_CalculateDirectionInterpolationSpeed, CallFunc_IsCloseToTarget_IsClose) == 0x00000C, "Member 'AIMovementComponent_C_CalculateDirectionInterpolationSpeed::CallFunc_IsCloseToTarget_IsClose' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_CalculateDirectionInterpolationSpeed, CallFunc_MapRangeClamped_ReturnValue) == 0x000010, "Member 'AIMovementComponent_C_CalculateDirectionInterpolationSpeed::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_CalculateDirectionInterpolationSpeed, CallFunc_MapRangeClamped_Value_ImplicitCast) == 0x000018, "Member 'AIMovementComponent_C_CalculateDirectionInterpolationSpeed::CallFunc_MapRangeClamped_Value_ImplicitCast' has a wrong offset!");

// Function AIMovementComponent.AIMovementComponent_C.CalculateDistanceToCurrentPoint
// 0x0008 (0x0008 - 0x0000)
struct AIMovementComponent_C_CalculateDistanceToCurrentPoint final
{
public:
	double                                        CallFunc_Vector_Distance2D_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AIMovementComponent_C_CalculateDistanceToCurrentPoint) == 0x000008, "Wrong alignment on AIMovementComponent_C_CalculateDistanceToCurrentPoint");
static_assert(sizeof(AIMovementComponent_C_CalculateDistanceToCurrentPoint) == 0x000008, "Wrong size on AIMovementComponent_C_CalculateDistanceToCurrentPoint");
static_assert(offsetof(AIMovementComponent_C_CalculateDistanceToCurrentPoint, CallFunc_Vector_Distance2D_ReturnValue) == 0x000000, "Member 'AIMovementComponent_C_CalculateDistanceToCurrentPoint::CallFunc_Vector_Distance2D_ReturnValue' has a wrong offset!");

// Function AIMovementComponent.AIMovementComponent_C.CalculateDistanceToTarget
// 0x0008 (0x0008 - 0x0000)
struct AIMovementComponent_C_CalculateDistanceToTarget final
{
public:
	double                                        CallFunc_Vector_Distance2D_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AIMovementComponent_C_CalculateDistanceToTarget) == 0x000008, "Wrong alignment on AIMovementComponent_C_CalculateDistanceToTarget");
static_assert(sizeof(AIMovementComponent_C_CalculateDistanceToTarget) == 0x000008, "Wrong size on AIMovementComponent_C_CalculateDistanceToTarget");
static_assert(offsetof(AIMovementComponent_C_CalculateDistanceToTarget, CallFunc_Vector_Distance2D_ReturnValue) == 0x000000, "Member 'AIMovementComponent_C_CalculateDistanceToTarget::CallFunc_Vector_Distance2D_ReturnValue' has a wrong offset!");

// Function AIMovementComponent.AIMovementComponent_C.CalculateNextPathPointLocation
// 0x0014 (0x0014 - 0x0000)
struct AIMovementComponent_C_CalculateNextPathPointLocation final
{
public:
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsIndexInRange_InRange;                   // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AIMovementComponent_C_CalculateNextPathPointLocation) == 0x000004, "Wrong alignment on AIMovementComponent_C_CalculateNextPathPointLocation");
static_assert(sizeof(AIMovementComponent_C_CalculateNextPathPointLocation) == 0x000014, "Wrong size on AIMovementComponent_C_CalculateNextPathPointLocation");
static_assert(offsetof(AIMovementComponent_C_CalculateNextPathPointLocation, CallFunc_Array_Length_ReturnValue) == 0x000000, "Member 'AIMovementComponent_C_CalculateNextPathPointLocation::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_CalculateNextPathPointLocation, CallFunc_Greater_IntInt_ReturnValue) == 0x000004, "Member 'AIMovementComponent_C_CalculateNextPathPointLocation::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_CalculateNextPathPointLocation, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'AIMovementComponent_C_CalculateNextPathPointLocation::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_CalculateNextPathPointLocation, CallFunc_IsIndexInRange_InRange) == 0x00000C, "Member 'AIMovementComponent_C_CalculateNextPathPointLocation::CallFunc_IsIndexInRange_InRange' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_CalculateNextPathPointLocation, CallFunc_Add_IntInt_ReturnValue_1) == 0x000010, "Member 'AIMovementComponent_C_CalculateNextPathPointLocation::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function AIMovementComponent.AIMovementComponent_C.CalculateOwnerDirection
// 0x0060 (0x0060 - 0x0000)
struct AIMovementComponent_C_CalculateOwnerDirection final
{
public:
	struct FVector                                OwnerDirection;                                    // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AIMovementComponent_C_CalculateOwnerDirection) == 0x000008, "Wrong alignment on AIMovementComponent_C_CalculateOwnerDirection");
static_assert(sizeof(AIMovementComponent_C_CalculateOwnerDirection) == 0x000060, "Wrong size on AIMovementComponent_C_CalculateOwnerDirection");
static_assert(offsetof(AIMovementComponent_C_CalculateOwnerDirection, OwnerDirection) == 0x000000, "Member 'AIMovementComponent_C_CalculateOwnerDirection::OwnerDirection' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_CalculateOwnerDirection, CallFunc_GetActorForwardVector_ReturnValue) == 0x000018, "Member 'AIMovementComponent_C_CalculateOwnerDirection::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_CalculateOwnerDirection, CallFunc_BreakVector_X) == 0x000030, "Member 'AIMovementComponent_C_CalculateOwnerDirection::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_CalculateOwnerDirection, CallFunc_BreakVector_Y) == 0x000038, "Member 'AIMovementComponent_C_CalculateOwnerDirection::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_CalculateOwnerDirection, CallFunc_BreakVector_Z) == 0x000040, "Member 'AIMovementComponent_C_CalculateOwnerDirection::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_CalculateOwnerDirection, CallFunc_MakeVector_ReturnValue) == 0x000048, "Member 'AIMovementComponent_C_CalculateOwnerDirection::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function AIMovementComponent.AIMovementComponent_C.CalculateOwnerLocation
// 0x0018 (0x0018 - 0x0000)
struct AIMovementComponent_C_CalculateOwnerLocation final
{
public:
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AIMovementComponent_C_CalculateOwnerLocation) == 0x000008, "Wrong alignment on AIMovementComponent_C_CalculateOwnerLocation");
static_assert(sizeof(AIMovementComponent_C_CalculateOwnerLocation) == 0x000018, "Wrong size on AIMovementComponent_C_CalculateOwnerLocation");
static_assert(offsetof(AIMovementComponent_C_CalculateOwnerLocation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000000, "Member 'AIMovementComponent_C_CalculateOwnerLocation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");

// Function AIMovementComponent.AIMovementComponent_C.CalculateResultVelocity
// 0x00A0 (0x00A0 - 0x0000)
struct AIMovementComponent_C_CalculateResultVelocity final
{
public:
	struct FVector                                Velocity;                                          // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCPPVelocityValue_ReturnValue;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast; // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AIMovementComponent_C_CalculateResultVelocity) == 0x000008, "Wrong alignment on AIMovementComponent_C_CalculateResultVelocity");
static_assert(sizeof(AIMovementComponent_C_CalculateResultVelocity) == 0x0000A0, "Wrong size on AIMovementComponent_C_CalculateResultVelocity");
static_assert(offsetof(AIMovementComponent_C_CalculateResultVelocity, Velocity) == 0x000000, "Member 'AIMovementComponent_C_CalculateResultVelocity::Velocity' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_CalculateResultVelocity, CallFunc_GetCPPVelocityValue_ReturnValue) == 0x000018, "Member 'AIMovementComponent_C_CalculateResultVelocity::CallFunc_GetCPPVelocityValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_CalculateResultVelocity, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000020, "Member 'AIMovementComponent_C_CalculateResultVelocity::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_CalculateResultVelocity, CallFunc_BreakVector_X) == 0x000038, "Member 'AIMovementComponent_C_CalculateResultVelocity::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_CalculateResultVelocity, CallFunc_BreakVector_Y) == 0x000040, "Member 'AIMovementComponent_C_CalculateResultVelocity::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_CalculateResultVelocity, CallFunc_BreakVector_Z) == 0x000048, "Member 'AIMovementComponent_C_CalculateResultVelocity::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_CalculateResultVelocity, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000050, "Member 'AIMovementComponent_C_CalculateResultVelocity::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_CalculateResultVelocity, CallFunc_BreakVector_X_1) == 0x000068, "Member 'AIMovementComponent_C_CalculateResultVelocity::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_CalculateResultVelocity, CallFunc_BreakVector_Y_1) == 0x000070, "Member 'AIMovementComponent_C_CalculateResultVelocity::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_CalculateResultVelocity, CallFunc_BreakVector_Z_1) == 0x000078, "Member 'AIMovementComponent_C_CalculateResultVelocity::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_CalculateResultVelocity, CallFunc_MakeVector_ReturnValue) == 0x000080, "Member 'AIMovementComponent_C_CalculateResultVelocity::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_CalculateResultVelocity, CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast) == 0x000098, "Member 'AIMovementComponent_C_CalculateResultVelocity::CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast' has a wrong offset!");

// Function AIMovementComponent.AIMovementComponent_C.CalculateTargetLocation
// 0x0018 (0x0018 - 0x0000)
struct AIMovementComponent_C_CalculateTargetLocation final
{
public:
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AIMovementComponent_C_CalculateTargetLocation) == 0x000008, "Wrong alignment on AIMovementComponent_C_CalculateTargetLocation");
static_assert(sizeof(AIMovementComponent_C_CalculateTargetLocation) == 0x000018, "Wrong size on AIMovementComponent_C_CalculateTargetLocation");
static_assert(offsetof(AIMovementComponent_C_CalculateTargetLocation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000000, "Member 'AIMovementComponent_C_CalculateTargetLocation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");

// Function AIMovementComponent.AIMovementComponent_C.CalculateTargetLocationDifference
// 0x0010 (0x0010 - 0x0000)
struct AIMovementComponent_C_CalculateTargetLocationDifference final
{
public:
	double                                        CallFunc_Vector_Distance2D_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AIMovementComponent_C_CalculateTargetLocationDifference) == 0x000008, "Wrong alignment on AIMovementComponent_C_CalculateTargetLocationDifference");
static_assert(sizeof(AIMovementComponent_C_CalculateTargetLocationDifference) == 0x000010, "Wrong size on AIMovementComponent_C_CalculateTargetLocationDifference");
static_assert(offsetof(AIMovementComponent_C_CalculateTargetLocationDifference, CallFunc_Vector_Distance2D_ReturnValue) == 0x000000, "Member 'AIMovementComponent_C_CalculateTargetLocationDifference::CallFunc_Vector_Distance2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIMovementComponent_C_CalculateTargetLocationDifference, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000008, "Member 'AIMovementComponent_C_CalculateTargetLocationDifference::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");

// Function AIMovementComponent.AIMovementComponent_C.CalculateVelocity
// 0x0098 (0x0098 - 0x0000)
struct AIMovementComponent_C_CalculateVelocity final
{
public:
	double                                        DeltaSeconds;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_CalculateVelocityValue_VelocityValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
