#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AimWalkNegEffTPPShake

#include "Basic.hpp"


namespace SDK::Params
{

// Function AimWalkNegEffTPPShake.AimWalkNegEffTPPShake_C.ExecuteUbergraph_AimWalkNegEffTPPShake
// 0x0008 (0x0008 - 0x0000)
struct AimWalkNegEffTPPShake_C_ExecuteUbergraph_AimWalkNegEffTPPShake final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Scale;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AimWalkNegEffTPPShake_C_ExecuteUbergraph_AimWalkNegEffTPPShake) == 0x000004, "Wrong alignment on AimWalkNegEffTPPShake_C_ExecuteUbergraph_AimWalkNegEffTPPShake");
static_assert(sizeof(AimWalkNegEffTPPShake_C_ExecuteUbergraph_AimWalkNegEffTPPShake) == 0x000008, "Wrong size on AimWalkNegEffTPPShake_C_ExecuteUbergraph_AimWalkNegEffTPPShake");
static_assert(offsetof(AimWalkNegEffTPPShake_C_ExecuteUbergraph_AimWalkNegEffTPPShake, EntryPoint) == 0x000000, "Member 'AimWalkNegEffTPPShake_C_ExecuteUbergraph_AimWalkNegEffTPPShake::EntryPoint' has a wrong offset!");
static_assert(offsetof(AimWalkNegEffTPPShake_C_ExecuteUbergraph_AimWalkNegEffTPPShake, K2Node_Event_Scale) == 0x000004, "Member 'AimWalkNegEffTPPShake_C_ExecuteUbergraph_AimWalkNegEffTPPShake::K2Node_Event_Scale' has a wrong offset!");

// Function AimWalkNegEffTPPShake.AimWalkNegEffTPPShake_C.ReceivePlayShake_2
// 0x0004 (0x0004 - 0x0000)
struct AimWalkNegEffTPPShake_C_ReceivePlayShake_2 final
{
public:
	float                                         Scale;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AimWalkNegEffTPPShake_C_ReceivePlayShake_2) == 0x000004, "Wrong alignment on AimWalkNegEffTPPShake_C_ReceivePlayShake_2");
static_assert(sizeof(AimWalkNegEffTPPShake_C_ReceivePlayShake_2) == 0x000004, "Wrong size on AimWalkNegEffTPPShake_C_ReceivePlayShake_2");
static_assert(offsetof(AimWalkNegEffTPPShake_C_ReceivePlayShake_2, Scale) == 0x000000, "Member 'AimWalkNegEffTPPShake_C_ReceivePlayShake_2::Scale' has a wrong offset!");

}

