#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AimWalkShakeFPP

#include "Basic.hpp"


namespace SDK::Params
{

// Function AimWalkShakeFPP.AimWalkShakeFPP_C.ExecuteUbergraph_AimWalkShakeFPP
// 0x0008 (0x0008 - 0x0000)
struct AimWalkShakeFPP_C_ExecuteUbergraph_AimWalkShakeFPP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Scale;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AimWalkShakeFPP_C_ExecuteUbergraph_AimWalkShakeFPP) == 0x000004, "Wrong alignment on AimWalkShakeFPP_C_ExecuteUbergraph_AimWalkShakeFPP");
static_assert(sizeof(AimWalkShakeFPP_C_ExecuteUbergraph_AimWalkShakeFPP) == 0x000008, "Wrong size on AimWalkShakeFPP_C_ExecuteUbergraph_AimWalkShakeFPP");
static_assert(offsetof(AimWalkShakeFPP_C_ExecuteUbergraph_AimWalkShakeFPP, EntryPoint) == 0x000000, "Member 'AimWalkShakeFPP_C_ExecuteUbergraph_AimWalkShakeFPP::EntryPoint' has a wrong offset!");
static_assert(offsetof(AimWalkShakeFPP_C_ExecuteUbergraph_AimWalkShakeFPP, K2Node_Event_Scale) == 0x000004, "Member 'AimWalkShakeFPP_C_ExecuteUbergraph_AimWalkShakeFPP::K2Node_Event_Scale' has a wrong offset!");

// Function AimWalkShakeFPP.AimWalkShakeFPP_C.ReceivePlayShake_2
// 0x0004 (0x0004 - 0x0000)
struct AimWalkShakeFPP_C_ReceivePlayShake_2 final
{
public:
	float                                         Scale;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AimWalkShakeFPP_C_ReceivePlayShake_2) == 0x000004, "Wrong alignment on AimWalkShakeFPP_C_ReceivePlayShake_2");
static_assert(sizeof(AimWalkShakeFPP_C_ReceivePlayShake_2) == 0x000004, "Wrong size on AimWalkShakeFPP_C_ReceivePlayShake_2");
static_assert(offsetof(AimWalkShakeFPP_C_ReceivePlayShake_2, Scale) == 0x000000, "Member 'AimWalkShakeFPP_C_ReceivePlayShake_2::Scale' has a wrong offset!");

}

