#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AimWalkShake

#include "Basic.hpp"


namespace SDK::Params
{

// Function AimWalkShake.AimWalkShake_C.ExecuteUbergraph_AimWalkShake
// 0x0008 (0x0008 - 0x0000)
struct AimWalkShake_C_ExecuteUbergraph_AimWalkShake final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Scale;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AimWalkShake_C_ExecuteUbergraph_AimWalkShake) == 0x000004, "Wrong alignment on AimWalkShake_C_ExecuteUbergraph_AimWalkShake");
static_assert(sizeof(AimWalkShake_C_ExecuteUbergraph_AimWalkShake) == 0x000008, "Wrong size on AimWalkShake_C_ExecuteUbergraph_AimWalkShake");
static_assert(offsetof(AimWalkShake_C_ExecuteUbergraph_AimWalkShake, EntryPoint) == 0x000000, "Member 'AimWalkShake_C_ExecuteUbergraph_AimWalkShake::EntryPoint' has a wrong offset!");
static_assert(offsetof(AimWalkShake_C_ExecuteUbergraph_AimWalkShake, K2Node_Event_Scale) == 0x000004, "Member 'AimWalkShake_C_ExecuteUbergraph_AimWalkShake::K2Node_Event_Scale' has a wrong offset!");

// Function AimWalkShake.AimWalkShake_C.ReceivePlayShake_2
// 0x0004 (0x0004 - 0x0000)
struct AimWalkShake_C_ReceivePlayShake_2 final
{
public:
	float                                         Scale;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AimWalkShake_C_ReceivePlayShake_2) == 0x000004, "Wrong alignment on AimWalkShake_C_ReceivePlayShake_2");
static_assert(sizeof(AimWalkShake_C_ReceivePlayShake_2) == 0x000004, "Wrong size on AimWalkShake_C_ReceivePlayShake_2");
static_assert(offsetof(AimWalkShake_C_ReceivePlayShake_2, Scale) == 0x000000, "Member 'AimWalkShake_C_ReceivePlayShake_2::Scale' has a wrong offset!");

}

