#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AimWalkNegEffShake

#include "Basic.hpp"


namespace SDK::Params
{

// Function AimWalkNegEffShake.AimWalkNegEffShake_C.ExecuteUbergraph_AimWalkNegEffShake
// 0x0008 (0x0008 - 0x0000)
struct AimWalkNegEffShake_C_ExecuteUbergraph_AimWalkNegEffShake final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Scale;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AimWalkNegEffShake_C_ExecuteUbergraph_AimWalkNegEffShake) == 0x000004, "Wrong alignment on AimWalkNegEffShake_C_ExecuteUbergraph_AimWalkNegEffShake");
static_assert(sizeof(AimWalkNegEffShake_C_ExecuteUbergraph_AimWalkNegEffShake) == 0x000008, "Wrong size on AimWalkNegEffShake_C_ExecuteUbergraph_AimWalkNegEffShake");
static_assert(offsetof(AimWalkNegEffShake_C_ExecuteUbergraph_AimWalkNegEffShake, EntryPoint) == 0x000000, "Member 'AimWalkNegEffShake_C_ExecuteUbergraph_AimWalkNegEffShake::EntryPoint' has a wrong offset!");
static_assert(offsetof(AimWalkNegEffShake_C_ExecuteUbergraph_AimWalkNegEffShake, K2Node_Event_Scale) == 0x000004, "Member 'AimWalkNegEffShake_C_ExecuteUbergraph_AimWalkNegEffShake::K2Node_Event_Scale' has a wrong offset!");

// Function AimWalkNegEffShake.AimWalkNegEffShake_C.ReceivePlayShake_2
// 0x0004 (0x0004 - 0x0000)
struct AimWalkNegEffShake_C_ReceivePlayShake_2 final
{
public:
	float                                         Scale;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AimWalkNegEffShake_C_ReceivePlayShake_2) == 0x000004, "Wrong alignment on AimWalkNegEffShake_C_ReceivePlayShake_2");
static_assert(sizeof(AimWalkNegEffShake_C_ReceivePlayShake_2) == 0x000004, "Wrong size on AimWalkNegEffShake_C_ReceivePlayShake_2");
static_assert(offsetof(AimWalkNegEffShake_C_ReceivePlayShake_2, Scale) == 0x000000, "Member 'AimWalkNegEffShake_C_ReceivePlayShake_2::Scale' has a wrong offset!");

}

