#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimNotify_FMODPlayEvent

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AnimNotify_FMODPlayEvent.AnimNotify_FMODPlayEvent_C
// 0x0020 (0x0058 - 0x0038)
class UAnimNotify_FMODPlayEvent_C final : public UAnimNotify
{
public:
	bool                                          bFollow;                                           // 0x0038(0x0001)(Edit, ConstParm, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AttachName;                                        // 0x0040(0x0010)(Edit, ConstParm, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class UFMODEvent*                             Event;                                             // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	class FString GetNotifyName() const;
	bool Received_Notify(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, const struct FAnimNotifyEventReference& EventReference) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AnimNotify_FMODPlayEvent_C">();
	}
	static class UAnimNotify_FMODPlayEvent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_FMODPlayEvent_C>();
	}
};
static_assert(alignof(UAnimNotify_FMODPlayEvent_C) == 0x000008, "Wrong alignment on UAnimNotify_FMODPlayEvent_C");
static_assert(sizeof(UAnimNotify_FMODPlayEvent_C) == 0x000058, "Wrong size on UAnimNotify_FMODPlayEvent_C");
static_assert(offsetof(UAnimNotify_FMODPlayEvent_C, bFollow) == 0x000038, "Member 'UAnimNotify_FMODPlayEvent_C::bFollow' has a wrong offset!");
static_assert(offsetof(UAnimNotify_FMODPlayEvent_C, AttachName) == 0x000040, "Member 'UAnimNotify_FMODPlayEvent_C::AttachName' has a wrong offset!");
static_assert(offsetof(UAnimNotify_FMODPlayEvent_C, Event) == 0x000050, "Member 'UAnimNotify_FMODPlayEvent_C::Event' has a wrong offset!");

}

