#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_DeerM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_DeerState_structs.hpp"


namespace SDK::Params
{

// Function AnimBP_DeerM.AnimBP_DeerM_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct AnimBP_DeerM_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(AnimBP_DeerM_C_AnimGraph) == 0x000008, "Wrong alignment on AnimBP_DeerM_C_AnimGraph");
static_assert(sizeof(AnimBP_DeerM_C_AnimGraph) == 0x000010, "Wrong size on AnimBP_DeerM_C_AnimGraph");
static_assert(offsetof(AnimBP_DeerM_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'AnimBP_DeerM_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function AnimBP_DeerM.AnimBP_DeerM_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct AnimBP_DeerM_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimBP_DeerM_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on AnimBP_DeerM_C_BlueprintUpdateAnimation");
static_assert(sizeof(AnimBP_DeerM_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on AnimBP_DeerM_C_BlueprintUpdateAnimation");
static_assert(offsetof(AnimBP_DeerM_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'AnimBP_DeerM_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function AnimBP_DeerM.AnimBP_DeerM_C.CalculateBackBodyTrace
// 0x02D8 (0x02D8 - 0x0000)
struct AnimBP_DeerM_C_CalculateBackBodyTrace final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             OutHit;                                            // 0x0008(0x00E8)(Parm, OutParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	EDrawDebugTrace                               Temp_byte_Variable;                                // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x00F8(0x0010)(ConstParm, ReferenceParm)
	EDrawDebugTrace                               Temp_byte_Variable_1;                              // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDrawDebugTrace                               K2Node_Select_Default;                             // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x01D8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1;   // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimBP_DeerM_C_CalculateBackBodyTrace) == 0x000008, "Wrong alignment on AnimBP_DeerM_C_CalculateBackBodyTrace");
static_assert(sizeof(AnimBP_DeerM_C_CalculateBackBodyTrace) == 0x0002D8, "Wrong size on AnimBP_DeerM_C_CalculateBackBodyTrace");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBackBodyTrace, ReturnValue) == 0x000000, "Member 'AnimBP_DeerM_C_CalculateBackBodyTrace::ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBackBodyTrace, OutHit) == 0x000008, "Member 'AnimBP_DeerM_C_CalculateBackBodyTrace::OutHit' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBackBodyTrace, Temp_byte_Variable) == 0x0000F0, "Member 'AnimBP_DeerM_C_CalculateBackBodyTrace::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBackBodyTrace, Temp_object_Variable) == 0x0000F8, "Member 'AnimBP_DeerM_C_CalculateBackBodyTrace::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBackBodyTrace, Temp_byte_Variable_1) == 0x000108, "Member 'AnimBP_DeerM_C_CalculateBackBodyTrace::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBackBodyTrace, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000110, "Member 'AnimBP_DeerM_C_CalculateBackBodyTrace::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBackBodyTrace, CallFunc_MakeVector_ReturnValue) == 0x000118, "Member 'AnimBP_DeerM_C_CalculateBackBodyTrace::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBackBodyTrace, Temp_bool_Variable) == 0x000130, "Member 'AnimBP_DeerM_C_CalculateBackBodyTrace::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBackBodyTrace, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000138, "Member 'AnimBP_DeerM_C_CalculateBackBodyTrace::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBackBodyTrace, K2Node_Select_Default) == 0x000140, "Member 'AnimBP_DeerM_C_CalculateBackBodyTrace::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBackBodyTrace, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000148, "Member 'AnimBP_DeerM_C_CalculateBackBodyTrace::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBackBodyTrace, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000160, "Member 'AnimBP_DeerM_C_CalculateBackBodyTrace::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBackBodyTrace, CallFunc_GetActorForwardVector_ReturnValue) == 0x000178, "Member 'AnimBP_DeerM_C_CalculateBackBodyTrace::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBackBodyTrace, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000190, "Member 'AnimBP_DeerM_C_CalculateBackBodyTrace::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBackBodyTrace, CallFunc_Add_VectorVector_ReturnValue) == 0x0001A8, "Member 'AnimBP_DeerM_C_CalculateBackBodyTrace::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBackBodyTrace, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0001C0, "Member 'AnimBP_DeerM_C_CalculateBackBodyTrace::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBackBodyTrace, CallFunc_LineTraceSingle_OutHit) == 0x0001D8, "Member 'AnimBP_DeerM_C_CalculateBackBodyTrace::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBackBodyTrace, CallFunc_LineTraceSingle_ReturnValue) == 0x0002C0, "Member 'AnimBP_DeerM_C_CalculateBackBodyTrace::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBackBodyTrace, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x0002C8, "Member 'AnimBP_DeerM_C_CalculateBackBodyTrace::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBackBodyTrace, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1) == 0x0002D0, "Member 'AnimBP_DeerM_C_CalculateBackBodyTrace::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");

// Function AnimBP_DeerM.AnimBP_DeerM_C.CalculateBodyToFloor
// 0x0A90 (0x0A90 - 0x0000)
struct AnimBP_DeerM_C_CalculateBodyToFloor final
{
public:
	bool                                          BackBodyHit;                                       // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                PrevCenterBodyHit;                                 // 0x0008(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PrevFrontBodyHit;                                  // 0x0020(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PrevBackBodyHit;                                   // 0x0038(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DistanceToFloor;                                   // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NeckHitDistance;                                   // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PelvisHitDistance;                                 // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CenterBodyHitLocation;                             // 0x0060(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FrontBodyHitLocaiton;                              // 0x0078(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BackBodyHitLocation;                               // 0x0090(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AB[0x1];                                       // 0x00AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_182[0x2];                                      // 0x0182(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x01D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0200(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName_1;                // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x0228(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x0240(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0258(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_2;            // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_2;         // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_272[0x2];                                      // 0x0272(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_2;                    // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_2;                // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location_2;                // 0x0280(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_2;             // 0x0298(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_2;                  // 0x02B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_2;            // 0x02C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_2;                 // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_2;                // 0x02E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_2;            // 0x02F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_2;             // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName_2;                // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_2;                 // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_2;            // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_2;               // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_314[0x4];                                      // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart_2;              // 0x0318(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_2;                // 0x0330(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CalculateCenterBodyTrace_ReturnValue;     // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_349[0x7];                                      // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_CalculateCenterBodyTrace_OutHit;          // 0x0350(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0438(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_3;            // 0x0450(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_3;         // 0x0451(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_452[0x2];                                      // 0x0452(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_3;                    // 0x0454(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_3;                // 0x0458(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45C[0x4];                                      // 0x045C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location_3;                // 0x0460(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_3;             // 0x0478(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_3;                  // 0x0490(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_3;            // 0x04A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_3;                 // 0x04C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_3;                // 0x04C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_3;            // 0x04D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_3;             // 0x04D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName_3;                // 0x04E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_3;                 // 0x04E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_3;            // 0x04EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_3;               // 0x04F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F4[0x4];                                      // 0x04F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart_3;              // 0x04F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_3;                // 0x0510(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CalculateFrontBodyTrace_ReturnValue;      // 0x0528(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_529[0x7];                                      // 0x0529(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_CalculateFrontBodyTrace_OutHit;           // 0x0530(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0618(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_4;            // 0x0630(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_4;         // 0x0631(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_632[0x2];                                      // 0x0632(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_4;                    // 0x0634(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_4;                // 0x0638(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63C[0x4];                                      // 0x063C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location_4;                // 0x0640(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_4;             // 0x0658(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_4;                  // 0x0670(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_4;            // 0x0688(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_4;                 // 0x06A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_4;                // 0x06A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_4;            // 0x06B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_4;             // 0x06B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName_4;                // 0x06C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_4;                 // 0x06C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_4;            // 0x06CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_4;               // 0x06D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D4[0x4];                                      // 0x06D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart_4;              // 0x06D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_4;                // 0x06F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CalculateBackBodyTrace_ReturnValue;       // 0x0708(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_709[0x7];                                      // 0x0709(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_CalculateBackBodyTrace_OutHit;            // 0x0710(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_5;            // 0x07F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_5;         // 0x07F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7FA[0x2];                                      // 0x07FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_5;                    // 0x07FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_5;                // 0x0800(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_804[0x4];                                      // 0x0804(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location_5;                // 0x0808(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_5;             // 0x0820(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_5;                  // 0x0838(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_5;            // 0x0850(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_5;                 // 0x0868(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_5;                // 0x0870(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_5;            // 0x0878(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_5;             // 0x0880(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName_5;                // 0x0888(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_5;                 // 0x0890(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_5;            // 0x0894(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_5;               // 0x0898(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89C[0x4];                                      // 0x089C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart_5;              // 0x08A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_5;                // 0x08B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x08D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D1[0x7];                                      // 0x08D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x08D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x08E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x08E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x08F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDeltaSeconds_ReturnValue;              // 0x08F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8FC[0x4];                                      // 0x08FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0900(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0908(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_2;      // 0x0920(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0928(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_929[0x7];                                      // 0x0929(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0930(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_2;      // 0x0948(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0960(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0968(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0970(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0978(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_979[0x7];                                      // 0x0979(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_3;      // 0x0980(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0988(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_989[0x7];                                      // 0x0989(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0990(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_998[0x8];                                      // 0x0998(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x09A0(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetDirectionUnitVector_ReturnValue;       // 0x0A00(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_InverseTransformDirection_ReturnValue;    // 0x0A18(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0A30(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0A48(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0A4C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0A50(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A54[0x4];                                      // 0x0A54(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FInterpTo_ReturnValue;                    // 0x0A58(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0A60(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_DeltaTime_ImplicitCast;         // 0x0A68(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0A70(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_DistanceToFloor_ImplicitCast;   // 0x0A78(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A7C[0x4];                                      // 0x0A7C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MakeVector_Z_ImplicitCast;                // 0x0A80(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_Target_ImplicitCast;            // 0x0A88(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimBP_DeerM_C_CalculateBodyToFloor) == 0x000010, "Wrong alignment on AnimBP_DeerM_C_CalculateBodyToFloor");
static_assert(sizeof(AnimBP_DeerM_C_CalculateBodyToFloor) == 0x000A90, "Wrong size on AnimBP_DeerM_C_CalculateBodyToFloor");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, BackBodyHit) == 0x000000, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::BackBodyHit' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, PrevCenterBodyHit) == 0x000008, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::PrevCenterBodyHit' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, PrevFrontBodyHit) == 0x000020, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::PrevFrontBodyHit' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, PrevBackBodyHit) == 0x000038, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::PrevBackBodyHit' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, DistanceToFloor) == 0x000050, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::DistanceToFloor' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, NeckHitDistance) == 0x000054, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::NeckHitDistance' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, PelvisHitDistance) == 0x000058, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::PelvisHitDistance' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, CenterBodyHitLocation) == 0x000060, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::CenterBodyHitLocation' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, FrontBodyHitLocaiton) == 0x000078, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::FrontBodyHitLocaiton' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, BackBodyHitLocation) == 0x000090, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::BackBodyHitLocation' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, CallFunc_IsValid_ReturnValue) == 0x0000A8, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, CallFunc_BreakHitResult_bBlockingHit) == 0x0000A9, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, CallFunc_BreakHitResult_bInitialOverlap) == 0x0000AA, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, CallFunc_BreakHitResult_Time) == 0x0000AC, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, CallFunc_BreakHitResult_Distance) == 0x0000B0, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, CallFunc_BreakHitResult_Location) == 0x0000B8, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, CallFunc_BreakHitResult_ImpactPoint) == 0x0000D0, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, CallFunc_BreakHitResult_Normal) == 0x0000E8, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, CallFunc_BreakHitResult_ImpactNormal) == 0x000100, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, CallFunc_BreakHitResult_PhysMat) == 0x000118, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, CallFunc_BreakHitResult_HitActor) == 0x000120, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, CallFunc_BreakHitResult_HitComponent) == 0x000128, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, CallFunc_BreakHitResult_HitBoneName) == 0x000130, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, CallFunc_BreakHitResult_BoneName) == 0x000138, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, CallFunc_BreakHitResult_HitItem) == 0x000140, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, CallFunc_BreakHitResult_ElementIndex) == 0x000144, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, CallFunc_BreakHitResult_FaceIndex) == 0x000148, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, CallFunc_BreakHitResult_TraceStart) == 0x000150, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, CallFunc_BreakHitResult_TraceEnd) == 0x000168, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, CallFunc_BreakHitResult_bBlockingHit_1) == 0x000180, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x000181, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, CallFunc_BreakHitResult_Time_1) == 0x000184, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, CallFunc_BreakHitResult_Distance_1) == 0x000188, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, CallFunc_BreakHitResult_Location_1) == 0x000190, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, CallFunc_BreakHitResult_ImpactPoint_1) == 0x0001A8, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, CallFunc_BreakHitResult_Normal_1) == 0x0001C0, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, CallFunc_BreakHitResult_ImpactNormal_1) == 0x0001D8, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, CallFunc_BreakHitResult_PhysMat_1) == 0x0001F0, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, CallFunc_BreakHitResult_HitActor_1) == 0x0001F8, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, CallFunc_BreakHitResult_HitComponent_1) == 0x000200, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, CallFunc_BreakHitResult_HitBoneName_1) == 0x000208, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, CallFunc_BreakHitResult_BoneName_1) == 0x000210, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::CallFunc_BreakHitResult_BoneName_1' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, CallFunc_BreakHitResult_HitItem_1) == 0x000218, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, CallFunc_BreakHitResult_ElementIndex_1) == 0x00021C, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::CallFunc_BreakHitResult_ElementIndex_1' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, CallFunc_BreakHitResult_FaceIndex_1) == 0x000220, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, CallFunc_BreakHitResult_TraceStart_1) == 0x000228, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::CallFunc_BreakHitResult_TraceStart_1' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, CallFunc_BreakHitResult_TraceEnd_1) == 0x000240, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::CallFunc_BreakHitResult_TraceEnd_1' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000258, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, CallFunc_BreakHitResult_bBlockingHit_2) == 0x000270, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::CallFunc_BreakHitResult_bBlockingHit_2' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, CallFunc_BreakHitResult_bInitialOverlap_2) == 0x000271, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::CallFunc_BreakHitResult_bInitialOverlap_2' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, CallFunc_BreakHitResult_Time_2) == 0x000274, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::CallFunc_BreakHitResult_Time_2' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, CallFunc_BreakHitResult_Distance_2) == 0x000278, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::CallFunc_BreakHitResult_Distance_2' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, CallFunc_BreakHitResult_Location_2) == 0x000280, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::CallFunc_BreakHitResult_Location_2' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, CallFunc_BreakHitResult_ImpactPoint_2) == 0x000298, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::CallFunc_BreakHitResult_ImpactPoint_2' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, CallFunc_BreakHitResult_Normal_2) == 0x0002B0, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::CallFunc_BreakHitResult_Normal_2' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, CallFunc_BreakHitResult_ImpactNormal_2) == 0x0002C8, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::CallFunc_BreakHitResult_ImpactNormal_2' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, CallFunc_BreakHitResult_PhysMat_2) == 0x0002E0, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::CallFunc_BreakHitResult_PhysMat_2' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, CallFunc_BreakHitResult_HitActor_2) == 0x0002E8, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::CallFunc_BreakHitResult_HitActor_2' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, CallFunc_BreakHitResult_HitComponent_2) == 0x0002F0, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::CallFunc_BreakHitResult_HitComponent_2' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, CallFunc_BreakHitResult_HitBoneName_2) == 0x0002F8, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::CallFunc_BreakHitResult_HitBoneName_2' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, CallFunc_BreakHitResult_BoneName_2) == 0x000300, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::CallFunc_BreakHitResult_BoneName_2' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, CallFunc_BreakHitResult_HitItem_2) == 0x000308, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::CallFunc_BreakHitResult_HitItem_2' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, CallFunc_BreakHitResult_ElementIndex_2) == 0x00030C, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::CallFunc_BreakHitResult_ElementIndex_2' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, CallFunc_BreakHitResult_FaceIndex_2) == 0x000310, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::CallFunc_BreakHitResult_FaceIndex_2' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, CallFunc_BreakHitResult_TraceStart_2) == 0x000318, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::CallFunc_BreakHitResult_TraceStart_2' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM_C_CalculateBodyToFloor, CallFunc_BreakHitResult_TraceEnd_2) == 0x000330, "Member 'AnimBP_DeerM_C_CalculateBodyToFloor::CallFunc_BreakHitResult_TraceEnd_2' has a wrong offset!");
