#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimNotify_FMODPlayEvent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FMODStudio_structs.hpp"


namespace SDK::Params
{

// Function AnimNotify_FMODPlayEvent.AnimNotify_FMODPlayEvent_C.GetNotifyName
// 0x0048 (0x0048 - 0x0000)
struct AnimNotify_FMODPlayEvent_C_GetNotifyName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	class FString                                 NotifyName;                                        // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetNotifyName_ReturnValue;                // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimNotify_FMODPlayEvent_C_GetNotifyName) == 0x000008, "Wrong alignment on AnimNotify_FMODPlayEvent_C_GetNotifyName");
static_assert(sizeof(AnimNotify_FMODPlayEvent_C_GetNotifyName) == 0x000048, "Wrong size on AnimNotify_FMODPlayEvent_C_GetNotifyName");
static_assert(offsetof(AnimNotify_FMODPlayEvent_C_GetNotifyName, ReturnValue) == 0x000000, "Member 'AnimNotify_FMODPlayEvent_C_GetNotifyName::ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_FMODPlayEvent_C_GetNotifyName, NotifyName) == 0x000010, "Member 'AnimNotify_FMODPlayEvent_C_GetNotifyName::NotifyName' has a wrong offset!");
static_assert(offsetof(AnimNotify_FMODPlayEvent_C_GetNotifyName, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'AnimNotify_FMODPlayEvent_C_GetNotifyName::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_FMODPlayEvent_C_GetNotifyName, CallFunc_GetDisplayName_ReturnValue) == 0x000028, "Member 'AnimNotify_FMODPlayEvent_C_GetNotifyName::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_FMODPlayEvent_C_GetNotifyName, CallFunc_GetNotifyName_ReturnValue) == 0x000038, "Member 'AnimNotify_FMODPlayEvent_C_GetNotifyName::CallFunc_GetNotifyName_ReturnValue' has a wrong offset!");

// Function AnimNotify_FMODPlayEvent.AnimNotify_FMODPlayEvent_C.Received_Notify
// 0x00C0 (0x00C0 - 0x0000)
struct AnimNotify_FMODPlayEvent_C_Received_Notify final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimNotifyEventReference              EventReference;                                    // 0x0010(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0040(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFMODEventInstance                     CallFunc_PlayEventAtLocation_ReturnValue;          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFMODAudioComponent*                    CallFunc_PlayEventAttached_ReturnValue;            // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimNotify_FMODPlayEvent_C_Received_Notify) == 0x000010, "Wrong alignment on AnimNotify_FMODPlayEvent_C_Received_Notify");
static_assert(sizeof(AnimNotify_FMODPlayEvent_C_Received_Notify) == 0x0000C0, "Wrong size on AnimNotify_FMODPlayEvent_C_Received_Notify");
static_assert(offsetof(AnimNotify_FMODPlayEvent_C_Received_Notify, MeshComp) == 0x000000, "Member 'AnimNotify_FMODPlayEvent_C_Received_Notify::MeshComp' has a wrong offset!");
static_assert(offsetof(AnimNotify_FMODPlayEvent_C_Received_Notify, Animation) == 0x000008, "Member 'AnimNotify_FMODPlayEvent_C_Received_Notify::Animation' has a wrong offset!");
static_assert(offsetof(AnimNotify_FMODPlayEvent_C_Received_Notify, EventReference) == 0x000010, "Member 'AnimNotify_FMODPlayEvent_C_Received_Notify::EventReference' has a wrong offset!");
static_assert(offsetof(AnimNotify_FMODPlayEvent_C_Received_Notify, ReturnValue) == 0x000038, "Member 'AnimNotify_FMODPlayEvent_C_Received_Notify::ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_FMODPlayEvent_C_Received_Notify, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000040, "Member 'AnimNotify_FMODPlayEvent_C_Received_Notify::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_FMODPlayEvent_C_Received_Notify, CallFunc_PlayEventAtLocation_ReturnValue) == 0x0000A0, "Member 'AnimNotify_FMODPlayEvent_C_Received_Notify::CallFunc_PlayEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_FMODPlayEvent_C_Received_Notify, CallFunc_Conv_StringToName_ReturnValue) == 0x0000A8, "Member 'AnimNotify_FMODPlayEvent_C_Received_Notify::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_FMODPlayEvent_C_Received_Notify, CallFunc_PlayEventAttached_ReturnValue) == 0x0000B0, "Member 'AnimNotify_FMODPlayEvent_C_Received_Notify::CallFunc_PlayEventAttached_ReturnValue' has a wrong offset!");

}

