#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_DeerM

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct AnimBP_DeerM.AnimBP_DeerM_C.AnimBlueprintGeneratedConstantData
// 0x018F (0x0190 - 0x0001)
struct AnimBP_DeerM::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_255;                               // 0x0008(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_256;                                // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_257;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_258;                                // 0x0024(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_259;                                 // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_260;                                // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_261;                                 // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_262;                                // 0x003C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_263;                                 // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendProfile*                          __BlendProfile_264;                                // 0x0048(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_265;                                  // 0x0050(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_266;                                // 0x0058(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_267;                                // 0x0059(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_268;                               // 0x0060(0x0010)(BlueprintVisible, EditFixedSize)
	struct FInputScaleBiasClampConstants          __StructProperty_269;                              // 0x0070(0x002C)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_270;                                // 0x009C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_271;                                 // 0x00A4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_272;                               // 0x00A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_273;                                // 0x00AC(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_274;                               // 0x00B0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_275;                                // 0x00B4(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_276;                                // 0x00B5(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_277;                                // 0x00B6(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B7[0x1];                                       // 0x00B7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_278;                                // 0x00B8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_279;                                 // 0x00C0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_280;                                // 0x00C4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_281;                                // 0x00CC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_282;                              // 0x00D8(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00F8(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0178(0x0018)()
};
static_assert(alignof(AnimBP_DeerM::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on AnimBP_DeerM::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(AnimBP_DeerM::FAnimBlueprintGeneratedConstantData) == 0x000190, "Wrong size on AnimBP_DeerM::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(AnimBP_DeerM::FAnimBlueprintGeneratedConstantData, __ArrayProperty_255) == 0x000008, "Member 'AnimBP_DeerM::FAnimBlueprintGeneratedConstantData::__ArrayProperty_255' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM::FAnimBlueprintGeneratedConstantData, __NameProperty_256) == 0x000018, "Member 'AnimBP_DeerM::FAnimBlueprintGeneratedConstantData::__NameProperty_256' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM::FAnimBlueprintGeneratedConstantData, __IntProperty_257) == 0x000020, "Member 'AnimBP_DeerM::FAnimBlueprintGeneratedConstantData::__IntProperty_257' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM::FAnimBlueprintGeneratedConstantData, __NameProperty_258) == 0x000024, "Member 'AnimBP_DeerM::FAnimBlueprintGeneratedConstantData::__NameProperty_258' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM::FAnimBlueprintGeneratedConstantData, __IntProperty_259) == 0x00002C, "Member 'AnimBP_DeerM::FAnimBlueprintGeneratedConstantData::__IntProperty_259' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM::FAnimBlueprintGeneratedConstantData, __NameProperty_260) == 0x000030, "Member 'AnimBP_DeerM::FAnimBlueprintGeneratedConstantData::__NameProperty_260' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM::FAnimBlueprintGeneratedConstantData, __IntProperty_261) == 0x000038, "Member 'AnimBP_DeerM::FAnimBlueprintGeneratedConstantData::__IntProperty_261' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM::FAnimBlueprintGeneratedConstantData, __NameProperty_262) == 0x00003C, "Member 'AnimBP_DeerM::FAnimBlueprintGeneratedConstantData::__NameProperty_262' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM::FAnimBlueprintGeneratedConstantData, __IntProperty_263) == 0x000044, "Member 'AnimBP_DeerM::FAnimBlueprintGeneratedConstantData::__IntProperty_263' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM::FAnimBlueprintGeneratedConstantData, __BlendProfile_264) == 0x000048, "Member 'AnimBP_DeerM::FAnimBlueprintGeneratedConstantData::__BlendProfile_264' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM::FAnimBlueprintGeneratedConstantData, __CurveFloat_265) == 0x000050, "Member 'AnimBP_DeerM::FAnimBlueprintGeneratedConstantData::__CurveFloat_265' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM::FAnimBlueprintGeneratedConstantData, __EnumProperty_266) == 0x000058, "Member 'AnimBP_DeerM::FAnimBlueprintGeneratedConstantData::__EnumProperty_266' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM::FAnimBlueprintGeneratedConstantData, __EnumProperty_267) == 0x000059, "Member 'AnimBP_DeerM::FAnimBlueprintGeneratedConstantData::__EnumProperty_267' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM::FAnimBlueprintGeneratedConstantData, __ArrayProperty_268) == 0x000060, "Member 'AnimBP_DeerM::FAnimBlueprintGeneratedConstantData::__ArrayProperty_268' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM::FAnimBlueprintGeneratedConstantData, __StructProperty_269) == 0x000070, "Member 'AnimBP_DeerM::FAnimBlueprintGeneratedConstantData::__StructProperty_269' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM::FAnimBlueprintGeneratedConstantData, __NameProperty_270) == 0x00009C, "Member 'AnimBP_DeerM::FAnimBlueprintGeneratedConstantData::__NameProperty_270' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM::FAnimBlueprintGeneratedConstantData, __IntProperty_271) == 0x0000A4, "Member 'AnimBP_DeerM::FAnimBlueprintGeneratedConstantData::__IntProperty_271' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM::FAnimBlueprintGeneratedConstantData, __FloatProperty_272) == 0x0000A8, "Member 'AnimBP_DeerM::FAnimBlueprintGeneratedConstantData::__FloatProperty_272' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM::FAnimBlueprintGeneratedConstantData, __BoolProperty_273) == 0x0000AC, "Member 'AnimBP_DeerM::FAnimBlueprintGeneratedConstantData::__BoolProperty_273' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM::FAnimBlueprintGeneratedConstantData, __FloatProperty_274) == 0x0000B0, "Member 'AnimBP_DeerM::FAnimBlueprintGeneratedConstantData::__FloatProperty_274' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM::FAnimBlueprintGeneratedConstantData, __BoolProperty_275) == 0x0000B4, "Member 'AnimBP_DeerM::FAnimBlueprintGeneratedConstantData::__BoolProperty_275' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM::FAnimBlueprintGeneratedConstantData, __EnumProperty_276) == 0x0000B5, "Member 'AnimBP_DeerM::FAnimBlueprintGeneratedConstantData::__EnumProperty_276' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM::FAnimBlueprintGeneratedConstantData, __ByteProperty_277) == 0x0000B6, "Member 'AnimBP_DeerM::FAnimBlueprintGeneratedConstantData::__ByteProperty_277' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM::FAnimBlueprintGeneratedConstantData, __NameProperty_278) == 0x0000B8, "Member 'AnimBP_DeerM::FAnimBlueprintGeneratedConstantData::__NameProperty_278' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM::FAnimBlueprintGeneratedConstantData, __IntProperty_279) == 0x0000C0, "Member 'AnimBP_DeerM::FAnimBlueprintGeneratedConstantData::__IntProperty_279' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM::FAnimBlueprintGeneratedConstantData, __NameProperty_280) == 0x0000C4, "Member 'AnimBP_DeerM::FAnimBlueprintGeneratedConstantData::__NameProperty_280' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM::FAnimBlueprintGeneratedConstantData, __NameProperty_281) == 0x0000CC, "Member 'AnimBP_DeerM::FAnimBlueprintGeneratedConstantData::__NameProperty_281' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM::FAnimBlueprintGeneratedConstantData, __StructProperty_282) == 0x0000D8, "Member 'AnimBP_DeerM::FAnimBlueprintGeneratedConstantData::__StructProperty_282' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000F8, "Member 'AnimBP_DeerM::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000178, "Member 'AnimBP_DeerM::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct AnimBP_DeerM.AnimBP_DeerM_C.AnimBlueprintGeneratedMutableData
// 0x0013 (0x0014 - 0x0001)
struct AnimBP_DeerM::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         __IntProperty_0;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1;                                   // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_3;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimBP_DeerM::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on AnimBP_DeerM::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(AnimBP_DeerM::FAnimBlueprintGeneratedMutableData) == 0x000014, "Wrong size on AnimBP_DeerM::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(AnimBP_DeerM::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'AnimBP_DeerM::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM::FAnimBlueprintGeneratedMutableData, __IntProperty_0) == 0x000004, "Member 'AnimBP_DeerM::FAnimBlueprintGeneratedMutableData::__IntProperty_0' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM::FAnimBlueprintGeneratedMutableData, __IntProperty_1) == 0x000008, "Member 'AnimBP_DeerM::FAnimBlueprintGeneratedMutableData::__IntProperty_1' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM::FAnimBlueprintGeneratedMutableData, __FloatProperty_2) == 0x00000C, "Member 'AnimBP_DeerM::FAnimBlueprintGeneratedMutableData::__FloatProperty_2' has a wrong offset!");
static_assert(offsetof(AnimBP_DeerM::FAnimBlueprintGeneratedMutableData, __FloatProperty_3) == 0x000010, "Member 'AnimBP_DeerM::FAnimBlueprintGeneratedMutableData::__FloatProperty_3' has a wrong offset!");

}

