#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArtDirectionStruct

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct ArtDirectionStruct.ArtDirectionStruct
// 0x0020 (0x0020 - 0x0000)
struct FArtDirectionStruct final
{
public:
	struct FLinearColor                           SkyLuminanceFactor_2_888F75E2421DC30BF96B778767CBA674; // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AerialPerspectiveViewDistanceScale_5_102EF6A34B1FBA0272B342A1692F4E93; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HeightFogContribution_7_39FDE51E46CBA5791EE58BB085B7F497; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FArtDirectionStruct) == 0x000008, "Wrong alignment on FArtDirectionStruct");
static_assert(sizeof(FArtDirectionStruct) == 0x000020, "Wrong size on FArtDirectionStruct");
static_assert(offsetof(FArtDirectionStruct, SkyLuminanceFactor_2_888F75E2421DC30BF96B778767CBA674) == 0x000000, "Member 'FArtDirectionStruct::SkyLuminanceFactor_2_888F75E2421DC30BF96B778767CBA674' has a wrong offset!");
static_assert(offsetof(FArtDirectionStruct, AerialPerspectiveViewDistanceScale_5_102EF6A34B1FBA0272B342A1692F4E93) == 0x000010, "Member 'FArtDirectionStruct::AerialPerspectiveViewDistanceScale_5_102EF6A34B1FBA0272B342A1692F4E93' has a wrong offset!");
static_assert(offsetof(FArtDirectionStruct, HeightFogContribution_7_39FDE51E46CBA5791EE58BB085B7F497) == 0x000018, "Member 'FArtDirectionStruct::HeightFogContribution_7_39FDE51E46CBA5791EE58BB085B7F497' has a wrong offset!");

}

