#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ATPCCameraFOVObjectV2

#include "Basic.hpp"


namespace SDK::Params
{

// Function ATPCCameraFOVObjectV2.ATPCCameraFOVObjectV2_C.ExecuteUbergraph_ATPCCameraFOVObjectV2
// 0x0030 (0x0030 - 0x0000)
struct ATPCCameraFOVObjectV2_C_ExecuteUbergraph_ATPCCameraFOVObjectV2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWithInterpolation;                   // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ATPCCameraFOVObjectV2_C_ExecuteUbergraph_ATPCCameraFOVObjectV2) == 0x000008, "Wrong alignment on ATPCCameraFOVObjectV2_C_ExecuteUbergraph_ATPCCameraFOVObjectV2");
static_assert(sizeof(ATPCCameraFOVObjectV2_C_ExecuteUbergraph_ATPCCameraFOVObjectV2) == 0x000030, "Wrong size on ATPCCameraFOVObjectV2_C_ExecuteUbergraph_ATPCCameraFOVObjectV2");
static_assert(offsetof(ATPCCameraFOVObjectV2_C_ExecuteUbergraph_ATPCCameraFOVObjectV2, EntryPoint) == 0x000000, "Member 'ATPCCameraFOVObjectV2_C_ExecuteUbergraph_ATPCCameraFOVObjectV2::EntryPoint' has a wrong offset!");
static_assert(offsetof(ATPCCameraFOVObjectV2_C_ExecuteUbergraph_ATPCCameraFOVObjectV2, Temp_bool_IsClosed_Variable) == 0x000004, "Member 'ATPCCameraFOVObjectV2_C_ExecuteUbergraph_ATPCCameraFOVObjectV2::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(ATPCCameraFOVObjectV2_C_ExecuteUbergraph_ATPCCameraFOVObjectV2, Temp_bool_Has_Been_Initd_Variable) == 0x000005, "Member 'ATPCCameraFOVObjectV2_C_ExecuteUbergraph_ATPCCameraFOVObjectV2::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(ATPCCameraFOVObjectV2_C_ExecuteUbergraph_ATPCCameraFOVObjectV2, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'ATPCCameraFOVObjectV2_C_ExecuteUbergraph_ATPCCameraFOVObjectV2::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(ATPCCameraFOVObjectV2_C_ExecuteUbergraph_ATPCCameraFOVObjectV2, K2Node_Event_bWithInterpolation) == 0x00000C, "Member 'ATPCCameraFOVObjectV2_C_ExecuteUbergraph_ATPCCameraFOVObjectV2::K2Node_Event_bWithInterpolation' has a wrong offset!");
static_assert(offsetof(ATPCCameraFOVObjectV2_C_ExecuteUbergraph_ATPCCameraFOVObjectV2, CallFunc_GetPlayerPawn_ReturnValue) == 0x000010, "Member 'ATPCCameraFOVObjectV2_C_ExecuteUbergraph_ATPCCameraFOVObjectV2::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(ATPCCameraFOVObjectV2_C_ExecuteUbergraph_ATPCCameraFOVObjectV2, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'ATPCCameraFOVObjectV2_C_ExecuteUbergraph_ATPCCameraFOVObjectV2::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ATPCCameraFOVObjectV2_C_ExecuteUbergraph_ATPCCameraFOVObjectV2, CallFunc_IsLocallyControlled_ReturnValue) == 0x000019, "Member 'ATPCCameraFOVObjectV2_C_ExecuteUbergraph_ATPCCameraFOVObjectV2::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(ATPCCameraFOVObjectV2_C_ExecuteUbergraph_ATPCCameraFOVObjectV2, K2Node_DynamicCast_AsSurvival_Player) == 0x000020, "Member 'ATPCCameraFOVObjectV2_C_ExecuteUbergraph_ATPCCameraFOVObjectV2::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(ATPCCameraFOVObjectV2_C_ExecuteUbergraph_ATPCCameraFOVObjectV2, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'ATPCCameraFOVObjectV2_C_ExecuteUbergraph_ATPCCameraFOVObjectV2::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ATPCCameraFOVObjectV2_C_ExecuteUbergraph_ATPCCameraFOVObjectV2, CallFunc_IsValid_ReturnValue_1) == 0x000029, "Member 'ATPCCameraFOVObjectV2_C_ExecuteUbergraph_ATPCCameraFOVObjectV2::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ATPCCameraFOVObjectV2_C_ExecuteUbergraph_ATPCCameraFOVObjectV2, Temp_bool_IsClosed_Variable_1) == 0x00002A, "Member 'ATPCCameraFOVObjectV2_C_ExecuteUbergraph_ATPCCameraFOVObjectV2::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(ATPCCameraFOVObjectV2_C_ExecuteUbergraph_ATPCCameraFOVObjectV2, CallFunc_BooleanAND_ReturnValue) == 0x00002B, "Member 'ATPCCameraFOVObjectV2_C_ExecuteUbergraph_ATPCCameraFOVObjectV2::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ATPCCameraFOVObjectV2_C_ExecuteUbergraph_ATPCCameraFOVObjectV2, Temp_bool_Has_Been_Initd_Variable_1) == 0x00002C, "Member 'ATPCCameraFOVObjectV2_C_ExecuteUbergraph_ATPCCameraFOVObjectV2::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");

// Function ATPCCameraFOVObjectV2.ATPCCameraFOVObjectV2_C.K2_Tick
// 0x0004 (0x0004 - 0x0000)
struct ATPCCameraFOVObjectV2_C_K2_Tick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ATPCCameraFOVObjectV2_C_K2_Tick) == 0x000004, "Wrong alignment on ATPCCameraFOVObjectV2_C_K2_Tick");
static_assert(sizeof(ATPCCameraFOVObjectV2_C_K2_Tick) == 0x000004, "Wrong size on ATPCCameraFOVObjectV2_C_K2_Tick");
static_assert(offsetof(ATPCCameraFOVObjectV2_C_K2_Tick, DeltaSeconds) == 0x000000, "Member 'ATPCCameraFOVObjectV2_C_K2_Tick::DeltaSeconds' has a wrong offset!");

// Function ATPCCameraFOVObjectV2.ATPCCameraFOVObjectV2_C.K2_Validate
// 0x0001 (0x0001 - 0x0000)
struct ATPCCameraFOVObjectV2_C_K2_Validate final
{
public:
	bool                                          bWithInterpolation;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ATPCCameraFOVObjectV2_C_K2_Validate) == 0x000001, "Wrong alignment on ATPCCameraFOVObjectV2_C_K2_Validate");
static_assert(sizeof(ATPCCameraFOVObjectV2_C_K2_Validate) == 0x000001, "Wrong size on ATPCCameraFOVObjectV2_C_K2_Validate");
static_assert(offsetof(ATPCCameraFOVObjectV2_C_K2_Validate, bWithInterpolation) == 0x000000, "Member 'ATPCCameraFOVObjectV2_C_K2_Validate::bWithInterpolation' has a wrong offset!");

}

