#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ATPCCameraLocationObjectV2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Survival_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass ATPCCameraLocationObjectV2.ATPCCameraLocationObjectV2_C
// 0x0060 (0x0520 - 0x04C0)
class alignas(0x10) UATPCCameraLocationObjectV2_C final : public USurvCameraLocationObject
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ASurvivalPlayer_C*                      As_Survival_Player;                                // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LeftTilt;                                          // 0x04D0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DefaultLeftTilt;                                   // 0x04E8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RightTilt;                                         // 0x0500(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLeftTilt;                                        // 0x0518(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ATPCCameraLocationObjectV2(int32 EntryPoint);
	void K2_OnEnterCameraMode(bool bWithInterpolation);
	void K2_Tick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ATPCCameraLocationObjectV2_C">();
	}
	static class UATPCCameraLocationObjectV2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UATPCCameraLocationObjectV2_C>();
	}
};
static_assert(alignof(UATPCCameraLocationObjectV2_C) == 0x000010, "Wrong alignment on UATPCCameraLocationObjectV2_C");
static_assert(sizeof(UATPCCameraLocationObjectV2_C) == 0x000520, "Wrong size on UATPCCameraLocationObjectV2_C");
static_assert(offsetof(UATPCCameraLocationObjectV2_C, UberGraphFrame) == 0x0004C0, "Member 'UATPCCameraLocationObjectV2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UATPCCameraLocationObjectV2_C, As_Survival_Player) == 0x0004C8, "Member 'UATPCCameraLocationObjectV2_C::As_Survival_Player' has a wrong offset!");
static_assert(offsetof(UATPCCameraLocationObjectV2_C, LeftTilt) == 0x0004D0, "Member 'UATPCCameraLocationObjectV2_C::LeftTilt' has a wrong offset!");
static_assert(offsetof(UATPCCameraLocationObjectV2_C, DefaultLeftTilt) == 0x0004E8, "Member 'UATPCCameraLocationObjectV2_C::DefaultLeftTilt' has a wrong offset!");
static_assert(offsetof(UATPCCameraLocationObjectV2_C, RightTilt) == 0x000500, "Member 'UATPCCameraLocationObjectV2_C::RightTilt' has a wrong offset!");
static_assert(offsetof(UATPCCameraLocationObjectV2_C, IsLeftTilt) == 0x000518, "Member 'UATPCCameraLocationObjectV2_C::IsLeftTilt' has a wrong offset!");

}

