#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ATPCCameraFOVObjectTutorial

#include "Basic.hpp"


namespace SDK::Params
{

// Function ATPCCameraFOVObjectTutorial.ATPCCameraFOVObjectTutorial_C.ExecuteUbergraph_ATPCCameraFOVObjectTutorial
// 0x0060 (0x0060 - 0x0000)
struct ATPCCameraFOVObjectTutorial_C_ExecuteUbergraph_ATPCCameraFOVObjectTutorial final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWithInterpolation;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UCineCameraComponent*>           CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCineCameraComponent*                   CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ATPCCameraFOVObjectTutorial_C_ExecuteUbergraph_ATPCCameraFOVObjectTutorial) == 0x000008, "Wrong alignment on ATPCCameraFOVObjectTutorial_C_ExecuteUbergraph_ATPCCameraFOVObjectTutorial");
static_assert(sizeof(ATPCCameraFOVObjectTutorial_C_ExecuteUbergraph_ATPCCameraFOVObjectTutorial) == 0x000060, "Wrong size on ATPCCameraFOVObjectTutorial_C_ExecuteUbergraph_ATPCCameraFOVObjectTutorial");
static_assert(offsetof(ATPCCameraFOVObjectTutorial_C_ExecuteUbergraph_ATPCCameraFOVObjectTutorial, EntryPoint) == 0x000000, "Member 'ATPCCameraFOVObjectTutorial_C_ExecuteUbergraph_ATPCCameraFOVObjectTutorial::EntryPoint' has a wrong offset!");
static_assert(offsetof(ATPCCameraFOVObjectTutorial_C_ExecuteUbergraph_ATPCCameraFOVObjectTutorial, Temp_bool_True_if_break_was_hit_Variable) == 0x000004, "Member 'ATPCCameraFOVObjectTutorial_C_ExecuteUbergraph_ATPCCameraFOVObjectTutorial::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(ATPCCameraFOVObjectTutorial_C_ExecuteUbergraph_ATPCCameraFOVObjectTutorial, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'ATPCCameraFOVObjectTutorial_C_ExecuteUbergraph_ATPCCameraFOVObjectTutorial::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ATPCCameraFOVObjectTutorial_C_ExecuteUbergraph_ATPCCameraFOVObjectTutorial, Temp_int_Array_Index_Variable) == 0x000008, "Member 'ATPCCameraFOVObjectTutorial_C_ExecuteUbergraph_ATPCCameraFOVObjectTutorial::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ATPCCameraFOVObjectTutorial_C_ExecuteUbergraph_ATPCCameraFOVObjectTutorial, K2Node_Event_DeltaSeconds) == 0x00000C, "Member 'ATPCCameraFOVObjectTutorial_C_ExecuteUbergraph_ATPCCameraFOVObjectTutorial::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(ATPCCameraFOVObjectTutorial_C_ExecuteUbergraph_ATPCCameraFOVObjectTutorial, K2Node_Event_bWithInterpolation) == 0x000010, "Member 'ATPCCameraFOVObjectTutorial_C_ExecuteUbergraph_ATPCCameraFOVObjectTutorial::K2Node_Event_bWithInterpolation' has a wrong offset!");
static_assert(offsetof(ATPCCameraFOVObjectTutorial_C_ExecuteUbergraph_ATPCCameraFOVObjectTutorial, CallFunc_GetPlayerController_ReturnValue) == 0x000018, "Member 'ATPCCameraFOVObjectTutorial_C_ExecuteUbergraph_ATPCCameraFOVObjectTutorial::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(ATPCCameraFOVObjectTutorial_C_ExecuteUbergraph_ATPCCameraFOVObjectTutorial, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'ATPCCameraFOVObjectTutorial_C_ExecuteUbergraph_ATPCCameraFOVObjectTutorial::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ATPCCameraFOVObjectTutorial_C_ExecuteUbergraph_ATPCCameraFOVObjectTutorial, CallFunc_GetViewTarget_ReturnValue) == 0x000028, "Member 'ATPCCameraFOVObjectTutorial_C_ExecuteUbergraph_ATPCCameraFOVObjectTutorial::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(ATPCCameraFOVObjectTutorial_C_ExecuteUbergraph_ATPCCameraFOVObjectTutorial, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000030, "Member 'ATPCCameraFOVObjectTutorial_C_ExecuteUbergraph_ATPCCameraFOVObjectTutorial::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ATPCCameraFOVObjectTutorial_C_ExecuteUbergraph_ATPCCameraFOVObjectTutorial, Temp_int_Loop_Counter_Variable) == 0x000040, "Member 'ATPCCameraFOVObjectTutorial_C_ExecuteUbergraph_ATPCCameraFOVObjectTutorial::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ATPCCameraFOVObjectTutorial_C_ExecuteUbergraph_ATPCCameraFOVObjectTutorial, CallFunc_Array_Get_Item) == 0x000048, "Member 'ATPCCameraFOVObjectTutorial_C_ExecuteUbergraph_ATPCCameraFOVObjectTutorial::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ATPCCameraFOVObjectTutorial_C_ExecuteUbergraph_ATPCCameraFOVObjectTutorial, CallFunc_IsActive_ReturnValue) == 0x000050, "Member 'ATPCCameraFOVObjectTutorial_C_ExecuteUbergraph_ATPCCameraFOVObjectTutorial::CallFunc_IsActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(ATPCCameraFOVObjectTutorial_C_ExecuteUbergraph_ATPCCameraFOVObjectTutorial, CallFunc_Add_IntInt_ReturnValue) == 0x000054, "Member 'ATPCCameraFOVObjectTutorial_C_ExecuteUbergraph_ATPCCameraFOVObjectTutorial::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ATPCCameraFOVObjectTutorial_C_ExecuteUbergraph_ATPCCameraFOVObjectTutorial, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'ATPCCameraFOVObjectTutorial_C_ExecuteUbergraph_ATPCCameraFOVObjectTutorial::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ATPCCameraFOVObjectTutorial_C_ExecuteUbergraph_ATPCCameraFOVObjectTutorial, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'ATPCCameraFOVObjectTutorial_C_ExecuteUbergraph_ATPCCameraFOVObjectTutorial::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ATPCCameraFOVObjectTutorial_C_ExecuteUbergraph_ATPCCameraFOVObjectTutorial, CallFunc_BooleanAND_ReturnValue) == 0x00005D, "Member 'ATPCCameraFOVObjectTutorial_C_ExecuteUbergraph_ATPCCameraFOVObjectTutorial::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function ATPCCameraFOVObjectTutorial.ATPCCameraFOVObjectTutorial_C.K2_Tick
// 0x0004 (0x0004 - 0x0000)
struct ATPCCameraFOVObjectTutorial_C_K2_Tick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ATPCCameraFOVObjectTutorial_C_K2_Tick) == 0x000004, "Wrong alignment on ATPCCameraFOVObjectTutorial_C_K2_Tick");
static_assert(sizeof(ATPCCameraFOVObjectTutorial_C_K2_Tick) == 0x000004, "Wrong size on ATPCCameraFOVObjectTutorial_C_K2_Tick");
static_assert(offsetof(ATPCCameraFOVObjectTutorial_C_K2_Tick, DeltaSeconds) == 0x000000, "Member 'ATPCCameraFOVObjectTutorial_C_K2_Tick::DeltaSeconds' has a wrong offset!");

// Function ATPCCameraFOVObjectTutorial.ATPCCameraFOVObjectTutorial_C.K2_Validate
// 0x0001 (0x0001 - 0x0000)
struct ATPCCameraFOVObjectTutorial_C_K2_Validate final
{
public:
	bool                                          bWithInterpolation;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ATPCCameraFOVObjectTutorial_C_K2_Validate) == 0x000001, "Wrong alignment on ATPCCameraFOVObjectTutorial_C_K2_Validate");
static_assert(sizeof(ATPCCameraFOVObjectTutorial_C_K2_Validate) == 0x000001, "Wrong size on ATPCCameraFOVObjectTutorial_C_K2_Validate");
static_assert(offsetof(ATPCCameraFOVObjectTutorial_C_K2_Validate, bWithInterpolation) == 0x000000, "Member 'ATPCCameraFOVObjectTutorial_C_K2_Validate::bWithInterpolation' has a wrong offset!");

}

