#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ATPCCameraLocationObjectV2

#include "Basic.hpp"


namespace SDK::Params
{

// Function ATPCCameraLocationObjectV2.ATPCCameraLocationObjectV2_C.ExecuteUbergraph_ATPCCameraLocationObjectV2
// 0x0030 (0x0030 - 0x0000)
struct ATPCCameraLocationObjectV2_C_ExecuteUbergraph_ATPCCameraLocationObjectV2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWithInterpolation;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ATPCCameraLocationObjectV2_C_ExecuteUbergraph_ATPCCameraLocationObjectV2) == 0x000008, "Wrong alignment on ATPCCameraLocationObjectV2_C_ExecuteUbergraph_ATPCCameraLocationObjectV2");
static_assert(sizeof(ATPCCameraLocationObjectV2_C_ExecuteUbergraph_ATPCCameraLocationObjectV2) == 0x000030, "Wrong size on ATPCCameraLocationObjectV2_C_ExecuteUbergraph_ATPCCameraLocationObjectV2");
static_assert(offsetof(ATPCCameraLocationObjectV2_C_ExecuteUbergraph_ATPCCameraLocationObjectV2, EntryPoint) == 0x000000, "Member 'ATPCCameraLocationObjectV2_C_ExecuteUbergraph_ATPCCameraLocationObjectV2::EntryPoint' has a wrong offset!");
static_assert(offsetof(ATPCCameraLocationObjectV2_C_ExecuteUbergraph_ATPCCameraLocationObjectV2, K2Node_Event_bWithInterpolation) == 0x000004, "Member 'ATPCCameraLocationObjectV2_C_ExecuteUbergraph_ATPCCameraLocationObjectV2::K2Node_Event_bWithInterpolation' has a wrong offset!");
static_assert(offsetof(ATPCCameraLocationObjectV2_C_ExecuteUbergraph_ATPCCameraLocationObjectV2, CallFunc_GetPlayerPawn_ReturnValue) == 0x000008, "Member 'ATPCCameraLocationObjectV2_C_ExecuteUbergraph_ATPCCameraLocationObjectV2::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(ATPCCameraLocationObjectV2_C_ExecuteUbergraph_ATPCCameraLocationObjectV2, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'ATPCCameraLocationObjectV2_C_ExecuteUbergraph_ATPCCameraLocationObjectV2::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ATPCCameraLocationObjectV2_C_ExecuteUbergraph_ATPCCameraLocationObjectV2, CallFunc_IsLocallyControlled_ReturnValue) == 0x000011, "Member 'ATPCCameraLocationObjectV2_C_ExecuteUbergraph_ATPCCameraLocationObjectV2::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(ATPCCameraLocationObjectV2_C_ExecuteUbergraph_ATPCCameraLocationObjectV2, K2Node_DynamicCast_AsSurvival_Player) == 0x000018, "Member 'ATPCCameraLocationObjectV2_C_ExecuteUbergraph_ATPCCameraLocationObjectV2::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(ATPCCameraLocationObjectV2_C_ExecuteUbergraph_ATPCCameraLocationObjectV2, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'ATPCCameraLocationObjectV2_C_ExecuteUbergraph_ATPCCameraLocationObjectV2::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ATPCCameraLocationObjectV2_C_ExecuteUbergraph_ATPCCameraLocationObjectV2, CallFunc_IsValid_ReturnValue_1) == 0x000021, "Member 'ATPCCameraLocationObjectV2_C_ExecuteUbergraph_ATPCCameraLocationObjectV2::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ATPCCameraLocationObjectV2_C_ExecuteUbergraph_ATPCCameraLocationObjectV2, CallFunc_IsValid_ReturnValue_2) == 0x000022, "Member 'ATPCCameraLocationObjectV2_C_ExecuteUbergraph_ATPCCameraLocationObjectV2::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ATPCCameraLocationObjectV2_C_ExecuteUbergraph_ATPCCameraLocationObjectV2, CallFunc_BooleanOR_ReturnValue) == 0x000023, "Member 'ATPCCameraLocationObjectV2_C_ExecuteUbergraph_ATPCCameraLocationObjectV2::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ATPCCameraLocationObjectV2_C_ExecuteUbergraph_ATPCCameraLocationObjectV2, Temp_bool_Has_Been_Initd_Variable) == 0x000024, "Member 'ATPCCameraLocationObjectV2_C_ExecuteUbergraph_ATPCCameraLocationObjectV2::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(ATPCCameraLocationObjectV2_C_ExecuteUbergraph_ATPCCameraLocationObjectV2, Temp_bool_IsClosed_Variable) == 0x000025, "Member 'ATPCCameraLocationObjectV2_C_ExecuteUbergraph_ATPCCameraLocationObjectV2::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(ATPCCameraLocationObjectV2_C_ExecuteUbergraph_ATPCCameraLocationObjectV2, K2Node_Event_DeltaSeconds) == 0x000028, "Member 'ATPCCameraLocationObjectV2_C_ExecuteUbergraph_ATPCCameraLocationObjectV2::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function ATPCCameraLocationObjectV2.ATPCCameraLocationObjectV2_C.K2_OnEnterCameraMode
// 0x0001 (0x0001 - 0x0000)
struct ATPCCameraLocationObjectV2_C_K2_OnEnterCameraMode final
{
public:
	bool                                          bWithInterpolation;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ATPCCameraLocationObjectV2_C_K2_OnEnterCameraMode) == 0x000001, "Wrong alignment on ATPCCameraLocationObjectV2_C_K2_OnEnterCameraMode");
static_assert(sizeof(ATPCCameraLocationObjectV2_C_K2_OnEnterCameraMode) == 0x000001, "Wrong size on ATPCCameraLocationObjectV2_C_K2_OnEnterCameraMode");
static_assert(offsetof(ATPCCameraLocationObjectV2_C_K2_OnEnterCameraMode, bWithInterpolation) == 0x000000, "Member 'ATPCCameraLocationObjectV2_C_K2_OnEnterCameraMode::bWithInterpolation' has a wrong offset!");

// Function ATPCCameraLocationObjectV2.ATPCCameraLocationObjectV2_C.K2_Tick
// 0x0004 (0x0004 - 0x0000)
struct ATPCCameraLocationObjectV2_C_K2_Tick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ATPCCameraLocationObjectV2_C_K2_Tick) == 0x000004, "Wrong alignment on ATPCCameraLocationObjectV2_C_K2_Tick");
static_assert(sizeof(ATPCCameraLocationObjectV2_C_K2_Tick) == 0x000004, "Wrong size on ATPCCameraLocationObjectV2_C_K2_Tick");
static_assert(offsetof(ATPCCameraLocationObjectV2_C_K2_Tick, DeltaSeconds) == 0x000000, "Member 'ATPCCameraLocationObjectV2_C_K2_Tick::DeltaSeconds' has a wrong offset!");

}

