#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AVS_Lambo

#include "Basic.hpp"

#include "AVS_VehicleMaster_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass AVS_Lambo.AVS_Lambo_C
// 0x0040 (0x1030 - 0x0FF0)
class AAVS_Lambo_C final : public AAVS_VehicleMaster_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_AVS_Lambo_C;                        // 0x0FE8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      FlowmapBrush_NPC;                                  // 0x0FF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LamboMurci_Kuzov_Lambo_Base_Window;                // 0x0FF8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LamboMurci_DoorL_L_Door_Window;                    // 0x1000(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LamboMurci_DoorR_R_Door_Window;                    // 0x1008(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LamboMurci_Kuzov_Lambo_Base;                       // 0x1010(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LamboMurci_DoorR_R_Door1;                          // 0x1018(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LamboMurci_DoorL_L_Door1;                          // 0x1020(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AVS_Lambo(int32 EntryPoint);
	void GearChanged_1(int32 PreviousGear, int32 CurrentGear);
	void AttachDoorToBone();
	void AttachDoorToMainMesh();
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AVS_Lambo_C">();
	}
	static class AAVS_Lambo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAVS_Lambo_C>();
	}
};
static_assert(alignof(AAVS_Lambo_C) == 0x000010, "Wrong alignment on AAVS_Lambo_C");
static_assert(sizeof(AAVS_Lambo_C) == 0x001030, "Wrong size on AAVS_Lambo_C");
static_assert(offsetof(AAVS_Lambo_C, UberGraphFrame_AVS_Lambo_C) == 0x000FE8, "Member 'AAVS_Lambo_C::UberGraphFrame_AVS_Lambo_C' has a wrong offset!");
static_assert(offsetof(AAVS_Lambo_C, FlowmapBrush_NPC) == 0x000FF0, "Member 'AAVS_Lambo_C::FlowmapBrush_NPC' has a wrong offset!");
static_assert(offsetof(AAVS_Lambo_C, LamboMurci_Kuzov_Lambo_Base_Window) == 0x000FF8, "Member 'AAVS_Lambo_C::LamboMurci_Kuzov_Lambo_Base_Window' has a wrong offset!");
static_assert(offsetof(AAVS_Lambo_C, LamboMurci_DoorL_L_Door_Window) == 0x001000, "Member 'AAVS_Lambo_C::LamboMurci_DoorL_L_Door_Window' has a wrong offset!");
static_assert(offsetof(AAVS_Lambo_C, LamboMurci_DoorR_R_Door_Window) == 0x001008, "Member 'AAVS_Lambo_C::LamboMurci_DoorR_R_Door_Window' has a wrong offset!");
static_assert(offsetof(AAVS_Lambo_C, LamboMurci_Kuzov_Lambo_Base) == 0x001010, "Member 'AAVS_Lambo_C::LamboMurci_Kuzov_Lambo_Base' has a wrong offset!");
static_assert(offsetof(AAVS_Lambo_C, LamboMurci_DoorR_R_Door1) == 0x001018, "Member 'AAVS_Lambo_C::LamboMurci_DoorR_R_Door1' has a wrong offset!");
static_assert(offsetof(AAVS_Lambo_C, LamboMurci_DoorL_L_Door1) == 0x001020, "Member 'AAVS_Lambo_C::LamboMurci_DoorL_L_Door1' has a wrong offset!");

}

