#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AVS_Sportcar

#include "Basic.hpp"

#include "AVS_VehicleMaster_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass AVS_Sportcar.AVS_Sportcar_C
// 0x0050 (0x1040 - 0x0FF0)
class AAVS_Sportcar_C final : public AAVS_VehicleMaster_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_AVS_Sportcar_C;                     // 0x0FE8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Sportcar_Burned_DoorR;                             // 0x0FF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sportcar_Burned_DoorL;                             // 0x0FF8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      FlowmapBrush_NPC;                                  // 0x1000(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sportcar_Back_Window;                              // 0x1008(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sportcar_Forward_Window;                           // 0x1010(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   R_Door_Window;                                     // 0x1018(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   L_Door_Window;                                     // 0x1020(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   L_Door;                                            // 0x1028(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   R_Door;                                            // 0x1030(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sportcar_StaticMesh;                               // 0x1038(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AVS_Sportcar(int32 EntryPoint);
	void GearChanged_1(int32 PreviousGear, int32 CurrentGear);
	void AttachDoorToBone();
	void AttachDoorToMainMesh();
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AVS_Sportcar_C">();
	}
	static class AAVS_Sportcar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAVS_Sportcar_C>();
	}
};
static_assert(alignof(AAVS_Sportcar_C) == 0x000010, "Wrong alignment on AAVS_Sportcar_C");
static_assert(sizeof(AAVS_Sportcar_C) == 0x001040, "Wrong size on AAVS_Sportcar_C");
static_assert(offsetof(AAVS_Sportcar_C, UberGraphFrame_AVS_Sportcar_C) == 0x000FE8, "Member 'AAVS_Sportcar_C::UberGraphFrame_AVS_Sportcar_C' has a wrong offset!");
static_assert(offsetof(AAVS_Sportcar_C, Sportcar_Burned_DoorR) == 0x000FF0, "Member 'AAVS_Sportcar_C::Sportcar_Burned_DoorR' has a wrong offset!");
static_assert(offsetof(AAVS_Sportcar_C, Sportcar_Burned_DoorL) == 0x000FF8, "Member 'AAVS_Sportcar_C::Sportcar_Burned_DoorL' has a wrong offset!");
static_assert(offsetof(AAVS_Sportcar_C, FlowmapBrush_NPC) == 0x001000, "Member 'AAVS_Sportcar_C::FlowmapBrush_NPC' has a wrong offset!");
static_assert(offsetof(AAVS_Sportcar_C, Sportcar_Back_Window) == 0x001008, "Member 'AAVS_Sportcar_C::Sportcar_Back_Window' has a wrong offset!");
static_assert(offsetof(AAVS_Sportcar_C, Sportcar_Forward_Window) == 0x001010, "Member 'AAVS_Sportcar_C::Sportcar_Forward_Window' has a wrong offset!");
static_assert(offsetof(AAVS_Sportcar_C, R_Door_Window) == 0x001018, "Member 'AAVS_Sportcar_C::R_Door_Window' has a wrong offset!");
static_assert(offsetof(AAVS_Sportcar_C, L_Door_Window) == 0x001020, "Member 'AAVS_Sportcar_C::L_Door_Window' has a wrong offset!");
static_assert(offsetof(AAVS_Sportcar_C, L_Door) == 0x001028, "Member 'AAVS_Sportcar_C::L_Door' has a wrong offset!");
static_assert(offsetof(AAVS_Sportcar_C, R_Door) == 0x001030, "Member 'AAVS_Sportcar_C::R_Door' has a wrong offset!");
static_assert(offsetof(AAVS_Sportcar_C, Sportcar_StaticMesh) == 0x001038, "Member 'AAVS_Sportcar_C::Sportcar_StaticMesh' has a wrong offset!");

}

