#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AVS_Tiger

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AVS_Tiger.AVS_Tiger_C.ExecuteUbergraph_AVS_Tiger
// 0x0020 (0x0020 - 0x0000)
struct AVS_Tiger_C_ExecuteUbergraph_AVS_Tiger final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_1;       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_2;       // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_3;       // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_4;       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_5;       // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_6;       // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_7;       // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UNiagaraComponent*>              K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(AVS_Tiger_C_ExecuteUbergraph_AVS_Tiger) == 0x000008, "Wrong alignment on AVS_Tiger_C_ExecuteUbergraph_AVS_Tiger");
static_assert(sizeof(AVS_Tiger_C_ExecuteUbergraph_AVS_Tiger) == 0x000020, "Wrong size on AVS_Tiger_C_ExecuteUbergraph_AVS_Tiger");
static_assert(offsetof(AVS_Tiger_C_ExecuteUbergraph_AVS_Tiger, EntryPoint) == 0x000000, "Member 'AVS_Tiger_C_ExecuteUbergraph_AVS_Tiger::EntryPoint' has a wrong offset!");
static_assert(offsetof(AVS_Tiger_C_ExecuteUbergraph_AVS_Tiger, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000004, "Member 'AVS_Tiger_C_ExecuteUbergraph_AVS_Tiger::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_Tiger_C_ExecuteUbergraph_AVS_Tiger, CallFunc_K2_AttachToComponent_ReturnValue_1) == 0x000005, "Member 'AVS_Tiger_C_ExecuteUbergraph_AVS_Tiger::CallFunc_K2_AttachToComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AVS_Tiger_C_ExecuteUbergraph_AVS_Tiger, CallFunc_K2_AttachToComponent_ReturnValue_2) == 0x000006, "Member 'AVS_Tiger_C_ExecuteUbergraph_AVS_Tiger::CallFunc_K2_AttachToComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AVS_Tiger_C_ExecuteUbergraph_AVS_Tiger, CallFunc_K2_AttachToComponent_ReturnValue_3) == 0x000007, "Member 'AVS_Tiger_C_ExecuteUbergraph_AVS_Tiger::CallFunc_K2_AttachToComponent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AVS_Tiger_C_ExecuteUbergraph_AVS_Tiger, CallFunc_K2_AttachToComponent_ReturnValue_4) == 0x000008, "Member 'AVS_Tiger_C_ExecuteUbergraph_AVS_Tiger::CallFunc_K2_AttachToComponent_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AVS_Tiger_C_ExecuteUbergraph_AVS_Tiger, CallFunc_K2_AttachToComponent_ReturnValue_5) == 0x000009, "Member 'AVS_Tiger_C_ExecuteUbergraph_AVS_Tiger::CallFunc_K2_AttachToComponent_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(AVS_Tiger_C_ExecuteUbergraph_AVS_Tiger, CallFunc_K2_AttachToComponent_ReturnValue_6) == 0x00000A, "Member 'AVS_Tiger_C_ExecuteUbergraph_AVS_Tiger::CallFunc_K2_AttachToComponent_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(AVS_Tiger_C_ExecuteUbergraph_AVS_Tiger, CallFunc_K2_AttachToComponent_ReturnValue_7) == 0x00000B, "Member 'AVS_Tiger_C_ExecuteUbergraph_AVS_Tiger::CallFunc_K2_AttachToComponent_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(AVS_Tiger_C_ExecuteUbergraph_AVS_Tiger, K2Node_MakeArray_Array) == 0x000010, "Member 'AVS_Tiger_C_ExecuteUbergraph_AVS_Tiger::K2Node_MakeArray_Array' has a wrong offset!");

// Function AVS_Tiger.AVS_Tiger_C.UserConstructionScript
// 0x0590 (0x0590 - 0x0000)
struct AVS_Tiger_C_UserConstructionScript final
{
public:
	struct FHitResult                             CallFunc_K2_AddRelativeLocation_SweepHitResult;    // 0x0000(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_AddRelativeLocation_SweepHitResult_1;  // 0x00E8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_AddRelativeLocation_SweepHitResult_2;  // 0x01D0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_AddRelativeLocation_SweepHitResult_3;  // 0x02B8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_AddRelativeLocation_SweepHitResult_4;  // 0x03A0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_AddRelativeLocation_SweepHitResult_5;  // 0x0488(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TArray<class UStaticMeshComponent*>           K2Node_MakeArray_Array;                            // 0x0570(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0580(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0588(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_1;       // 0x0589(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_2;       // 0x058A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_3;       // 0x058B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AVS_Tiger_C_UserConstructionScript) == 0x000008, "Wrong alignment on AVS_Tiger_C_UserConstructionScript");
static_assert(sizeof(AVS_Tiger_C_UserConstructionScript) == 0x000590, "Wrong size on AVS_Tiger_C_UserConstructionScript");
static_assert(offsetof(AVS_Tiger_C_UserConstructionScript, CallFunc_K2_AddRelativeLocation_SweepHitResult) == 0x000000, "Member 'AVS_Tiger_C_UserConstructionScript::CallFunc_K2_AddRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(AVS_Tiger_C_UserConstructionScript, CallFunc_K2_AddRelativeLocation_SweepHitResult_1) == 0x0000E8, "Member 'AVS_Tiger_C_UserConstructionScript::CallFunc_K2_AddRelativeLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(AVS_Tiger_C_UserConstructionScript, CallFunc_K2_AddRelativeLocation_SweepHitResult_2) == 0x0001D0, "Member 'AVS_Tiger_C_UserConstructionScript::CallFunc_K2_AddRelativeLocation_SweepHitResult_2' has a wrong offset!");
static_assert(offsetof(AVS_Tiger_C_UserConstructionScript, CallFunc_K2_AddRelativeLocation_SweepHitResult_3) == 0x0002B8, "Member 'AVS_Tiger_C_UserConstructionScript::CallFunc_K2_AddRelativeLocation_SweepHitResult_3' has a wrong offset!");
static_assert(offsetof(AVS_Tiger_C_UserConstructionScript, CallFunc_K2_AddRelativeLocation_SweepHitResult_4) == 0x0003A0, "Member 'AVS_Tiger_C_UserConstructionScript::CallFunc_K2_AddRelativeLocation_SweepHitResult_4' has a wrong offset!");
static_assert(offsetof(AVS_Tiger_C_UserConstructionScript, CallFunc_K2_AddRelativeLocation_SweepHitResult_5) == 0x000488, "Member 'AVS_Tiger_C_UserConstructionScript::CallFunc_K2_AddRelativeLocation_SweepHitResult_5' has a wrong offset!");
static_assert(offsetof(AVS_Tiger_C_UserConstructionScript, K2Node_MakeArray_Array) == 0x000570, "Member 'AVS_Tiger_C_UserConstructionScript::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AVS_Tiger_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000580, "Member 'AVS_Tiger_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_Tiger_C_UserConstructionScript, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000588, "Member 'AVS_Tiger_C_UserConstructionScript::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_Tiger_C_UserConstructionScript, CallFunc_K2_AttachToComponent_ReturnValue_1) == 0x000589, "Member 'AVS_Tiger_C_UserConstructionScript::CallFunc_K2_AttachToComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AVS_Tiger_C_UserConstructionScript, CallFunc_K2_AttachToComponent_ReturnValue_2) == 0x00058A, "Member 'AVS_Tiger_C_UserConstructionScript::CallFunc_K2_AttachToComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AVS_Tiger_C_UserConstructionScript, CallFunc_K2_AttachToComponent_ReturnValue_3) == 0x00058B, "Member 'AVS_Tiger_C_UserConstructionScript::CallFunc_K2_AttachToComponent_ReturnValue_3' has a wrong offset!");

}

