#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AVS_Lugatti

#include "Basic.hpp"

#include "AVS_VehicleMaster_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass AVS_Lugatti.AVS_Lugatti_C
// 0x0030 (0x1020 - 0x0FF0)
class AAVS_Lugatti_C final : public AAVS_VehicleMaster_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_AVS_Lugatti_C;                      // 0x0FE8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Lugatti_R_Door_Window;                             // 0x0FF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Lugatti_L_Door_Window;                             // 0x0FF8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Lugatti_StaticMesh;                                // 0x1000(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Lugatti_R_Door;                                    // 0x1008(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Lugatti_L_Door;                                    // 0x1010(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Lugatti_F_Window;                                  // 0x1018(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AVS_Lugatti(int32 EntryPoint);
	void GearChanged_1(int32 PreviousGear, int32 CurrentGear);
	void AttachDoorToBone();
	void AttachDoorToMainMesh();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AVS_Lugatti_C">();
	}
	static class AAVS_Lugatti_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAVS_Lugatti_C>();
	}
};
static_assert(alignof(AAVS_Lugatti_C) == 0x000010, "Wrong alignment on AAVS_Lugatti_C");
static_assert(sizeof(AAVS_Lugatti_C) == 0x001020, "Wrong size on AAVS_Lugatti_C");
static_assert(offsetof(AAVS_Lugatti_C, UberGraphFrame_AVS_Lugatti_C) == 0x000FE8, "Member 'AAVS_Lugatti_C::UberGraphFrame_AVS_Lugatti_C' has a wrong offset!");
static_assert(offsetof(AAVS_Lugatti_C, Lugatti_R_Door_Window) == 0x000FF0, "Member 'AAVS_Lugatti_C::Lugatti_R_Door_Window' has a wrong offset!");
static_assert(offsetof(AAVS_Lugatti_C, Lugatti_L_Door_Window) == 0x000FF8, "Member 'AAVS_Lugatti_C::Lugatti_L_Door_Window' has a wrong offset!");
static_assert(offsetof(AAVS_Lugatti_C, Lugatti_StaticMesh) == 0x001000, "Member 'AAVS_Lugatti_C::Lugatti_StaticMesh' has a wrong offset!");
static_assert(offsetof(AAVS_Lugatti_C, Lugatti_R_Door) == 0x001008, "Member 'AAVS_Lugatti_C::Lugatti_R_Door' has a wrong offset!");
static_assert(offsetof(AAVS_Lugatti_C, Lugatti_L_Door) == 0x001010, "Member 'AAVS_Lugatti_C::Lugatti_L_Door' has a wrong offset!");
static_assert(offsetof(AAVS_Lugatti_C, Lugatti_F_Window) == 0x001018, "Member 'AAVS_Lugatti_C::Lugatti_F_Window' has a wrong offset!");

}

