#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AVS_Vehicle

#include "Basic.hpp"

#include "LightConfig_structs.hpp"
#include "ShifterPositions_structs.hpp"
#include "VehicleSystemPlugin_structs.hpp"
#include "Engine_structs.hpp"
#include "SpeedUnit_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AVS_Vehicle.AVS_Vehicle_C.AddWheel
// 0x0030 (0x0030 - 0x0000)
struct AVS_Vehicle_C_AddWheel final
{
public:
	class UVehicle_Wheel_C*                       NewWheel;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetupWheelContactModification_RegisterSuccess; // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsDrivingWheel_isDrivingWheel;         // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    CallFunc_CreateWheelMesh_NewMesh;                  // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumChildrenComponents_ReturnValue;     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSimulatingPhysics_ReturnValue;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AVS_Vehicle_C_AddWheel) == 0x000008, "Wrong alignment on AVS_Vehicle_C_AddWheel");
static_assert(sizeof(AVS_Vehicle_C_AddWheel) == 0x000030, "Wrong size on AVS_Vehicle_C_AddWheel");
static_assert(offsetof(AVS_Vehicle_C_AddWheel, NewWheel) == 0x000000, "Member 'AVS_Vehicle_C_AddWheel::NewWheel' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_AddWheel, CallFunc_SetupWheelContactModification_RegisterSuccess) == 0x000008, "Member 'AVS_Vehicle_C_AddWheel::CallFunc_SetupWheelContactModification_RegisterSuccess' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_AddWheel, CallFunc_GetIsDrivingWheel_isDrivingWheel) == 0x000009, "Member 'AVS_Vehicle_C_AddWheel::CallFunc_GetIsDrivingWheel_isDrivingWheel' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_AddWheel, CallFunc_CreateWheelMesh_NewMesh) == 0x000010, "Member 'AVS_Vehicle_C_AddWheel::CallFunc_CreateWheelMesh_NewMesh' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_AddWheel, CallFunc_GetNumChildrenComponents_ReturnValue) == 0x000018, "Member 'AVS_Vehicle_C_AddWheel::CallFunc_GetNumChildrenComponents_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_AddWheel, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00001C, "Member 'AVS_Vehicle_C_AddWheel::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_AddWheel, Temp_int_Variable) == 0x000020, "Member 'AVS_Vehicle_C_AddWheel::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_AddWheel, CallFunc_Array_Add_ReturnValue) == 0x000024, "Member 'AVS_Vehicle_C_AddWheel::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_AddWheel, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'AVS_Vehicle_C_AddWheel::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_AddWheel, CallFunc_IsSimulatingPhysics_ReturnValue) == 0x00002C, "Member 'AVS_Vehicle_C_AddWheel::CallFunc_IsSimulatingPhysics_ReturnValue' has a wrong offset!");

// Function AVS_Vehicle.AVS_Vehicle_C.AnyWheelContact
// 0x0040 (0x0040 - 0x0000)
struct AVS_Vehicle_C_AnyWheelContact final
{
public:
	bool                                          WheelContact;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AWheelTouched;                                     // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UVehicle_Wheel_C*>               CallFunc_GetAllWheels_Wheels;                      // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVehicle_Wheel_C*                       CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetHasContact_ReturnValue;                // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AVS_Vehicle_C_AnyWheelContact) == 0x000008, "Wrong alignment on AVS_Vehicle_C_AnyWheelContact");
static_assert(sizeof(AVS_Vehicle_C_AnyWheelContact) == 0x000040, "Wrong size on AVS_Vehicle_C_AnyWheelContact");
static_assert(offsetof(AVS_Vehicle_C_AnyWheelContact, WheelContact) == 0x000000, "Member 'AVS_Vehicle_C_AnyWheelContact::WheelContact' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_AnyWheelContact, AWheelTouched) == 0x000001, "Member 'AVS_Vehicle_C_AnyWheelContact::AWheelTouched' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_AnyWheelContact, Temp_bool_True_if_break_was_hit_Variable) == 0x000002, "Member 'AVS_Vehicle_C_AnyWheelContact::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_AnyWheelContact, Temp_int_Array_Index_Variable) == 0x000004, "Member 'AVS_Vehicle_C_AnyWheelContact::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_AnyWheelContact, CallFunc_Not_PreBool_ReturnValue) == 0x000008, "Member 'AVS_Vehicle_C_AnyWheelContact::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_AnyWheelContact, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'AVS_Vehicle_C_AnyWheelContact::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_AnyWheelContact, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'AVS_Vehicle_C_AnyWheelContact::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_AnyWheelContact, CallFunc_GetAllWheels_Wheels) == 0x000018, "Member 'AVS_Vehicle_C_AnyWheelContact::CallFunc_GetAllWheels_Wheels' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_AnyWheelContact, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'AVS_Vehicle_C_AnyWheelContact::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_AnyWheelContact, CallFunc_Array_Get_Item) == 0x000030, "Member 'AVS_Vehicle_C_AnyWheelContact::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_AnyWheelContact, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'AVS_Vehicle_C_AnyWheelContact::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_AnyWheelContact, CallFunc_GetHasContact_ReturnValue) == 0x000039, "Member 'AVS_Vehicle_C_AnyWheelContact::CallFunc_GetHasContact_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_AnyWheelContact, CallFunc_BooleanAND_ReturnValue) == 0x00003A, "Member 'AVS_Vehicle_C_AnyWheelContact::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function AVS_Vehicle.AVS_Vehicle_C.ApplyCOM
// 0x0048 (0x0048 - 0x0000)
struct AVS_Vehicle_C_ApplyCOM final
{
public:
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AVS_Vehicle_C_ApplyCOM) == 0x000008, "Wrong alignment on AVS_Vehicle_C_ApplyCOM");
static_assert(sizeof(AVS_Vehicle_C_ApplyCOM) == 0x000048, "Wrong size on AVS_Vehicle_C_ApplyCOM");
static_assert(offsetof(AVS_Vehicle_C_ApplyCOM, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000000, "Member 'AVS_Vehicle_C_ApplyCOM::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_ApplyCOM, CallFunc_Add_VectorVector_ReturnValue) == 0x000018, "Member 'AVS_Vehicle_C_ApplyCOM::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_ApplyCOM, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000030, "Member 'AVS_Vehicle_C_ApplyCOM::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");

// Function AVS_Vehicle.AVS_Vehicle_C.AutomaticShifterPosition
// 0x0030 (0x0030 - 0x0000)
struct AVS_Vehicle_C_AutomaticShifterPosition final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerControlled_ReturnValue;           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1;  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_1;     // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_2;  // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_3;  // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetAirSpeed_AirSpeed;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_2;     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EShifterPositions                             CallFunc_GetShifterPosition_ShifterPos;            // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetAirSpeed_AirSpeed_1;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_3;     // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AVS_Vehicle_C_AutomaticShifterPosition) == 0x000008, "Wrong alignment on AVS_Vehicle_C_AutomaticShifterPosition");
static_assert(sizeof(AVS_Vehicle_C_AutomaticShifterPosition) == 0x000030, "Wrong size on AVS_Vehicle_C_AutomaticShifterPosition");
static_assert(offsetof(AVS_Vehicle_C_AutomaticShifterPosition, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'AVS_Vehicle_C_AutomaticShifterPosition::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_AutomaticShifterPosition, CallFunc_IsPlayerControlled_ReturnValue) == 0x000001, "Member 'AVS_Vehicle_C_AutomaticShifterPosition::CallFunc_IsPlayerControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_AutomaticShifterPosition, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000002, "Member 'AVS_Vehicle_C_AutomaticShifterPosition::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_AutomaticShifterPosition, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'AVS_Vehicle_C_AutomaticShifterPosition::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_AutomaticShifterPosition, CallFunc_IsLocallyControlled_ReturnValue) == 0x000004, "Member 'AVS_Vehicle_C_AutomaticShifterPosition::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_AutomaticShifterPosition, CallFunc_BooleanAND_ReturnValue) == 0x000005, "Member 'AVS_Vehicle_C_AutomaticShifterPosition::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_AutomaticShifterPosition, CallFunc_BooleanOR_ReturnValue) == 0x000006, "Member 'AVS_Vehicle_C_AutomaticShifterPosition::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_AutomaticShifterPosition, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000007, "Member 'AVS_Vehicle_C_AutomaticShifterPosition::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_AutomaticShifterPosition, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1) == 0x000008, "Member 'AVS_Vehicle_C_AutomaticShifterPosition::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_AutomaticShifterPosition, CallFunc_LessEqual_DoubleDouble_ReturnValue_1) == 0x000009, "Member 'AVS_Vehicle_C_AutomaticShifterPosition::CallFunc_LessEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_AutomaticShifterPosition, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_2) == 0x00000A, "Member 'AVS_Vehicle_C_AutomaticShifterPosition::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_AutomaticShifterPosition, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_3) == 0x00000B, "Member 'AVS_Vehicle_C_AutomaticShifterPosition::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_AutomaticShifterPosition, CallFunc_BooleanOR_ReturnValue_1) == 0x00000C, "Member 'AVS_Vehicle_C_AutomaticShifterPosition::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_AutomaticShifterPosition, CallFunc_GetAirSpeed_AirSpeed) == 0x000010, "Member 'AVS_Vehicle_C_AutomaticShifterPosition::CallFunc_GetAirSpeed_AirSpeed' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_AutomaticShifterPosition, CallFunc_LessEqual_DoubleDouble_ReturnValue_2) == 0x000018, "Member 'AVS_Vehicle_C_AutomaticShifterPosition::CallFunc_LessEqual_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_AutomaticShifterPosition, CallFunc_BooleanAND_ReturnValue_1) == 0x000019, "Member 'AVS_Vehicle_C_AutomaticShifterPosition::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_AutomaticShifterPosition, CallFunc_GetShifterPosition_ShifterPos) == 0x00001A, "Member 'AVS_Vehicle_C_AutomaticShifterPosition::CallFunc_GetShifterPosition_ShifterPos' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_AutomaticShifterPosition, CallFunc_GetAirSpeed_AirSpeed_1) == 0x000020, "Member 'AVS_Vehicle_C_AutomaticShifterPosition::CallFunc_GetAirSpeed_AirSpeed_1' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_AutomaticShifterPosition, K2Node_SwitchEnum_CmpSuccess) == 0x000028, "Member 'AVS_Vehicle_C_AutomaticShifterPosition::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_AutomaticShifterPosition, CallFunc_LessEqual_DoubleDouble_ReturnValue_3) == 0x000029, "Member 'AVS_Vehicle_C_AutomaticShifterPosition::CallFunc_LessEqual_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_AutomaticShifterPosition, CallFunc_BooleanAND_ReturnValue_2) == 0x00002A, "Member 'AVS_Vehicle_C_AutomaticShifterPosition::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");

// Function AVS_Vehicle.AVS_Vehicle_C.AVS_PrintDebugMessage
// 0x0078 (0x0078 - 0x0000)
struct AVS_Vehicle_C_AVS_PrintDebugMessage final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Error_;                                            // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(AVS_Vehicle_C_AVS_PrintDebugMessage) == 0x000008, "Wrong alignment on AVS_Vehicle_C_AVS_PrintDebugMessage");
static_assert(sizeof(AVS_Vehicle_C_AVS_PrintDebugMessage) == 0x000078, "Wrong size on AVS_Vehicle_C_AVS_PrintDebugMessage");
static_assert(offsetof(AVS_Vehicle_C_AVS_PrintDebugMessage, Message) == 0x000000, "Member 'AVS_Vehicle_C_AVS_PrintDebugMessage::Message' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_AVS_PrintDebugMessage, Error_) == 0x000010, "Member 'AVS_Vehicle_C_AVS_PrintDebugMessage::Error_' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_AVS_PrintDebugMessage, Temp_bool_Variable) == 0x000011, "Member 'AVS_Vehicle_C_AVS_PrintDebugMessage::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_AVS_PrintDebugMessage, Temp_struct_Variable) == 0x000014, "Member 'AVS_Vehicle_C_AVS_PrintDebugMessage::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_AVS_PrintDebugMessage, Temp_struct_Variable_1) == 0x000024, "Member 'AVS_Vehicle_C_AVS_PrintDebugMessage::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_AVS_PrintDebugMessage, CallFunc_GetDisplayName_ReturnValue) == 0x000038, "Member 'AVS_Vehicle_C_AVS_PrintDebugMessage::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_AVS_PrintDebugMessage, K2Node_Select_Default) == 0x000048, "Member 'AVS_Vehicle_C_AVS_PrintDebugMessage::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_AVS_PrintDebugMessage, CallFunc_Concat_StrStr_ReturnValue) == 0x000058, "Member 'AVS_Vehicle_C_AVS_PrintDebugMessage::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_AVS_PrintDebugMessage, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000068, "Member 'AVS_Vehicle_C_AVS_PrintDebugMessage::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");

// Function AVS_Vehicle.AVS_Vehicle_C.AVS_Tick
// 0x0004 (0x0004 - 0x0000)
struct AVS_Vehicle_C_AVS_Tick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AVS_Vehicle_C_AVS_Tick) == 0x000004, "Wrong alignment on AVS_Vehicle_C_AVS_Tick");
static_assert(sizeof(AVS_Vehicle_C_AVS_Tick) == 0x000004, "Wrong size on AVS_Vehicle_C_AVS_Tick");
static_assert(offsetof(AVS_Vehicle_C_AVS_Tick, DeltaTime) == 0x000000, "Member 'AVS_Vehicle_C_AVS_Tick::DeltaTime' has a wrong offset!");

// Function AVS_Vehicle.AVS_Vehicle_C.CalculateSteering
// 0x0060 (0x0060 - 0x0000)
struct AVS_Vehicle_C_CalculateSteering final
{
public:
	float                                         CallFunc_GetMaxSteeringFromCurve_ReturnValue;      // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetCurrentSteeringInput_SteeringInput;    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FInterpTo_Constant_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_ReturnValue;                    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxSteeringFromCurve_Speed_ImplicitCast; // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_InterpSpeed_ImplicitCast;       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_Constant_InterpSpeed_ImplicitCast; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AVS_Vehicle_C_CalculateSteering) == 0x000008, "Wrong alignment on AVS_Vehicle_C_CalculateSteering");
static_assert(sizeof(AVS_Vehicle_C_CalculateSteering) == 0x000060, "Wrong size on AVS_Vehicle_C_CalculateSteering");
static_assert(offsetof(AVS_Vehicle_C_CalculateSteering, CallFunc_GetMaxSteeringFromCurve_ReturnValue) == 0x000000, "Member 'AVS_Vehicle_C_CalculateSteering::CallFunc_GetMaxSteeringFromCurve_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_CalculateSteering, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000008, "Member 'AVS_Vehicle_C_CalculateSteering::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_CalculateSteering, CallFunc_FClamp_ReturnValue) == 0x000010, "Member 'AVS_Vehicle_C_CalculateSteering::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_CalculateSteering, CallFunc_GetCurrentSteeringInput_SteeringInput) == 0x000018, "Member 'AVS_Vehicle_C_CalculateSteering::CallFunc_GetCurrentSteeringInput_SteeringInput' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_CalculateSteering, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000020, "Member 'AVS_Vehicle_C_CalculateSteering::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_CalculateSteering, K2Node_SwitchEnum_CmpSuccess) == 0x000028, "Member 'AVS_Vehicle_C_CalculateSteering::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_CalculateSteering, CallFunc_FInterpTo_Constant_ReturnValue) == 0x000030, "Member 'AVS_Vehicle_C_CalculateSteering::CallFunc_FInterpTo_Constant_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_CalculateSteering, CallFunc_FInterpTo_ReturnValue) == 0x000038, "Member 'AVS_Vehicle_C_CalculateSteering::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_CalculateSteering, CallFunc_GetMaxSteeringFromCurve_Speed_ImplicitCast) == 0x000040, "Member 'AVS_Vehicle_C_CalculateSteering::CallFunc_GetMaxSteeringFromCurve_Speed_ImplicitCast' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_CalculateSteering, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000048, "Member 'AVS_Vehicle_C_CalculateSteering::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_CalculateSteering, CallFunc_FInterpTo_InterpSpeed_ImplicitCast) == 0x000050, "Member 'AVS_Vehicle_C_CalculateSteering::CallFunc_FInterpTo_InterpSpeed_ImplicitCast' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_CalculateSteering, CallFunc_FInterpTo_Constant_InterpSpeed_ImplicitCast) == 0x000058, "Member 'AVS_Vehicle_C_CalculateSteering::CallFunc_FInterpTo_Constant_InterpSpeed_ImplicitCast' has a wrong offset!");

// Function AVS_Vehicle.AVS_Vehicle_C.ChangeGear
// 0x0010 (0x0010 - 0x0000)
struct AVS_Vehicle_C_ChangeGear final
{
public:
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_DynamicMaxTorque_ImplicitCast;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AVS_Vehicle_C_ChangeGear) == 0x000008, "Wrong alignment on AVS_Vehicle_C_ChangeGear");
static_assert(sizeof(AVS_Vehicle_C_ChangeGear) == 0x000010, "Wrong size on AVS_Vehicle_C_ChangeGear");
static_assert(offsetof(AVS_Vehicle_C_ChangeGear, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000000, "Member 'AVS_Vehicle_C_ChangeGear::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_ChangeGear, K2Node_VariableSet_DynamicMaxTorque_ImplicitCast) == 0x000008, "Member 'AVS_Vehicle_C_ChangeGear::K2Node_VariableSet_DynamicMaxTorque_ImplicitCast' has a wrong offset!");

// Function AVS_Vehicle.AVS_Vehicle_C.Cleanup
// 0x0038 (0x0038 - 0x0000)
struct AVS_Vehicle_C_Cleanup final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UVehicle_Wheel_C*>               CallFunc_GetAllWheels_Wheels;                      // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVehicle_Wheel_C*                       CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AVS_Vehicle_C_Cleanup) == 0x000008, "Wrong alignment on AVS_Vehicle_C_Cleanup");
static_assert(sizeof(AVS_Vehicle_C_Cleanup) == 0x000038, "Wrong size on AVS_Vehicle_C_Cleanup");
static_assert(offsetof(AVS_Vehicle_C_Cleanup, Temp_int_Array_Index_Variable) == 0x000000, "Member 'AVS_Vehicle_C_Cleanup::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_Cleanup, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'AVS_Vehicle_C_Cleanup::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_Cleanup, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'AVS_Vehicle_C_Cleanup::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_Cleanup, CallFunc_GetAllWheels_Wheels) == 0x000010, "Member 'AVS_Vehicle_C_Cleanup::CallFunc_GetAllWheels_Wheels' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_Cleanup, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'AVS_Vehicle_C_Cleanup::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_Cleanup, CallFunc_Array_Get_Item) == 0x000028, "Member 'AVS_Vehicle_C_Cleanup::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_Cleanup, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'AVS_Vehicle_C_Cleanup::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_Cleanup, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'AVS_Vehicle_C_Cleanup::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function AVS_Vehicle.AVS_Vehicle_C.ConstructComponents
// 0x00B8 (0x00B8 - 0x0000)
struct AVS_Vehicle_C_ConstructComponents final
{
public:
	TArray<class USceneComponent*>                LightControllerComps;                              // 0x0000(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	TArray<class USceneComponent*>                ComponentsToInit;                                  // 0x0010(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVehicle_LightController_C*             K2Node_DynamicCast_AsVehicle_Light_Controller;     // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children;           // 0x0050(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UVehicle_Hitch_C*                       K2Node_DynamicCast_AsVehicle_Hitch;                // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVehicle_ExhaustController_C*           K2Node_DynamicCast_AsVehicle_Exhaust_Controller;   // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UVehicleComponent*>              CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0080(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USceneComponent*                        CallFunc_Array_Get_Item_1;                         // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULightComponent*                        K2Node_DynamicCast_AsLight_Component;              // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AVS_Vehicle_C_ConstructComponents) == 0x000008, "Wrong alignment on AVS_Vehicle_C_ConstructComponents");
static_assert(sizeof(AVS_Vehicle_C_ConstructComponents) == 0x0000B8, "Wrong size on AVS_Vehicle_C_ConstructComponents");
static_assert(offsetof(AVS_Vehicle_C_ConstructComponents, LightControllerComps) == 0x000000, "Member 'AVS_Vehicle_C_ConstructComponents::LightControllerComps' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_ConstructComponents, ComponentsToInit) == 0x000010, "Member 'AVS_Vehicle_C_ConstructComponents::ComponentsToInit' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_ConstructComponents, Temp_int_Array_Index_Variable) == 0x000020, "Member 'AVS_Vehicle_C_ConstructComponents::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_ConstructComponents, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'AVS_Vehicle_C_ConstructComponents::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_ConstructComponents, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'AVS_Vehicle_C_ConstructComponents::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_ConstructComponents, Temp_int_Array_Index_Variable_1) == 0x00002C, "Member 'AVS_Vehicle_C_ConstructComponents::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_ConstructComponents, CallFunc_Array_Get_Item) == 0x000030, "Member 'AVS_Vehicle_C_ConstructComponents::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_ConstructComponents, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'AVS_Vehicle_C_ConstructComponents::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_ConstructComponents, K2Node_DynamicCast_AsVehicle_Light_Controller) == 0x000040, "Member 'AVS_Vehicle_C_ConstructComponents::K2Node_DynamicCast_AsVehicle_Light_Controller' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_ConstructComponents, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'AVS_Vehicle_C_ConstructComponents::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_ConstructComponents, CallFunc_Less_IntInt_ReturnValue) == 0x000049, "Member 'AVS_Vehicle_C_ConstructComponents::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_ConstructComponents, CallFunc_GetChildrenComponents_Children) == 0x000050, "Member 'AVS_Vehicle_C_ConstructComponents::CallFunc_GetChildrenComponents_Children' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_ConstructComponents, K2Node_DynamicCast_AsVehicle_Hitch) == 0x000060, "Member 'AVS_Vehicle_C_ConstructComponents::K2Node_DynamicCast_AsVehicle_Hitch' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_ConstructComponents, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'AVS_Vehicle_C_ConstructComponents::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_ConstructComponents, K2Node_DynamicCast_AsVehicle_Exhaust_Controller) == 0x000070, "Member 'AVS_Vehicle_C_ConstructComponents::K2Node_DynamicCast_AsVehicle_Exhaust_Controller' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_ConstructComponents, K2Node_DynamicCast_bSuccess_2) == 0x000078, "Member 'AVS_Vehicle_C_ConstructComponents::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_ConstructComponents, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000080, "Member 'AVS_Vehicle_C_ConstructComponents::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_ConstructComponents, CallFunc_Array_Get_Item_1) == 0x000090, "Member 'AVS_Vehicle_C_ConstructComponents::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_ConstructComponents, CallFunc_Array_Length_ReturnValue_1) == 0x000098, "Member 'AVS_Vehicle_C_ConstructComponents::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_ConstructComponents, K2Node_DynamicCast_AsLight_Component) == 0x0000A0, "Member 'AVS_Vehicle_C_ConstructComponents::K2Node_DynamicCast_AsLight_Component' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_ConstructComponents, K2Node_DynamicCast_bSuccess_3) == 0x0000A8, "Member 'AVS_Vehicle_C_ConstructComponents::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_ConstructComponents, Temp_int_Loop_Counter_Variable_1) == 0x0000AC, "Member 'AVS_Vehicle_C_ConstructComponents::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_ConstructComponents, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000B0, "Member 'AVS_Vehicle_C_ConstructComponents::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_ConstructComponents, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000B4, "Member 'AVS_Vehicle_C_ConstructComponents::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function AVS_Vehicle.AVS_Vehicle_C.ConstructWheels
// 0x0168 (0x0168 - 0x0000)
struct AVS_Vehicle_C_ConstructWheels final
{
public:
	TArray<class UVehicle_Wheel_C*>               VehicleChildren;                                   // 0x0000(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	TArray<class UVehicle_Wheel_C*>               CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVehicle_Wheel_C*                       CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    CallFunc_CreateWheelMesh_NewMesh;                  // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumChildrenComponents_ReturnValue;     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_GetAttachParent_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 K2Node_DynamicCast_AsSkeletal_Mesh_Component;      // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0080(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(AVS_Vehicle_C_ConstructWheels) == 0x000008, "Wrong alignment on AVS_Vehicle_C_ConstructWheels");
static_assert(sizeof(AVS_Vehicle_C_ConstructWheels) == 0x000168, "Wrong size on AVS_Vehicle_C_ConstructWheels");
static_assert(offsetof(AVS_Vehicle_C_ConstructWheels, VehicleChildren) == 0x000000, "Member 'AVS_Vehicle_C_ConstructWheels::VehicleChildren' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_ConstructWheels, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000010, "Member 'AVS_Vehicle_C_ConstructWheels::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_ConstructWheels, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'AVS_Vehicle_C_ConstructWheels::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_ConstructWheels, Temp_int_Array_Index_Variable) == 0x000024, "Member 'AVS_Vehicle_C_ConstructWheels::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_ConstructWheels, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'AVS_Vehicle_C_ConstructWheels::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_ConstructWheels, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'AVS_Vehicle_C_ConstructWheels::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_ConstructWheels, CallFunc_Array_Get_Item) == 0x000030, "Member 'AVS_Vehicle_C_ConstructWheels::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_ConstructWheels, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'AVS_Vehicle_C_ConstructWheels::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_ConstructWheels, CallFunc_CreateWheelMesh_NewMesh) == 0x000040, "Member 'AVS_Vehicle_C_ConstructWheels::CallFunc_CreateWheelMesh_NewMesh' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_ConstructWheels, CallFunc_GetNumChildrenComponents_ReturnValue) == 0x000048, "Member 'AVS_Vehicle_C_ConstructWheels::CallFunc_GetNumChildrenComponents_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_ConstructWheels, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00004C, "Member 'AVS_Vehicle_C_ConstructWheels::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_ConstructWheels, CallFunc_GetAttachParent_ReturnValue) == 0x000050, "Member 'AVS_Vehicle_C_ConstructWheels::CallFunc_GetAttachParent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_ConstructWheels, K2Node_DynamicCast_AsSkeletal_Mesh_Component) == 0x000058, "Member 'AVS_Vehicle_C_ConstructWheels::K2Node_DynamicCast_AsSkeletal_Mesh_Component' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_ConstructWheels, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'AVS_Vehicle_C_ConstructWheels::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_ConstructWheels, CallFunc_GetSocketLocation_ReturnValue) == 0x000068, "Member 'AVS_Vehicle_C_ConstructWheels::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_ConstructWheels, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000080, "Member 'AVS_Vehicle_C_ConstructWheels::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");

// Function AVS_Vehicle.AVS_Vehicle_C.CopyInputsFromHost
// 0x0010 (0x0010 - 0x0000)
struct AVS_Vehicle_C_CopyInputsFromHost final
{
public:
	bool                                          CallFunc_GetHandbrakeApplied_isHandbrakeApplied;   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetHandbrakeApplied_isHandbrakeApplied_1; // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetCurrentSteeringInput_SteeringInput;    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AVS_Vehicle_C_CopyInputsFromHost) == 0x000008, "Wrong alignment on AVS_Vehicle_C_CopyInputsFromHost");
static_assert(sizeof(AVS_Vehicle_C_CopyInputsFromHost) == 0x000010, "Wrong size on AVS_Vehicle_C_CopyInputsFromHost");
static_assert(offsetof(AVS_Vehicle_C_CopyInputsFromHost, CallFunc_GetHandbrakeApplied_isHandbrakeApplied) == 0x000000, "Member 'AVS_Vehicle_C_CopyInputsFromHost::CallFunc_GetHandbrakeApplied_isHandbrakeApplied' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_CopyInputsFromHost, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'AVS_Vehicle_C_CopyInputsFromHost::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_CopyInputsFromHost, CallFunc_GetHandbrakeApplied_isHandbrakeApplied_1) == 0x000002, "Member 'AVS_Vehicle_C_CopyInputsFromHost::CallFunc_GetHandbrakeApplied_isHandbrakeApplied_1' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_CopyInputsFromHost, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000003, "Member 'AVS_Vehicle_C_CopyInputsFromHost::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_CopyInputsFromHost, CallFunc_GetCurrentSteeringInput_SteeringInput) == 0x000008, "Member 'AVS_Vehicle_C_CopyInputsFromHost::CallFunc_GetCurrentSteeringInput_SteeringInput' has a wrong offset!");

// Function AVS_Vehicle.AVS_Vehicle_C.CreateBoneConstraint
// 0x0080 (0x0080 - 0x0000)
struct AVS_Vehicle_C_CreateBoneConstraint final
{
public:
	bool                                          bManualAttachment;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RelativeTransform;                                 // 0x0010(0x0060)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVehicleConstraint*                     VehicleConstraint;                                 // 0x0070(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVehicleConstraint*                     CallFunc_AddComponent_ReturnValue;                 // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AVS_Vehicle_C_CreateBoneConstraint) == 0x000010, "Wrong alignment on AVS_Vehicle_C_CreateBoneConstraint");
static_assert(sizeof(AVS_Vehicle_C_CreateBoneConstraint) == 0x000080, "Wrong size on AVS_Vehicle_C_CreateBoneConstraint");
static_assert(offsetof(AVS_Vehicle_C_CreateBoneConstraint, bManualAttachment) == 0x000000, "Member 'AVS_Vehicle_C_CreateBoneConstraint::bManualAttachment' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_CreateBoneConstraint, RelativeTransform) == 0x000010, "Member 'AVS_Vehicle_C_CreateBoneConstraint::RelativeTransform' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_CreateBoneConstraint, VehicleConstraint) == 0x000070, "Member 'AVS_Vehicle_C_CreateBoneConstraint::VehicleConstraint' has a wrong offset!");
static_assert(offsetof(AVS_Vehicle_C_CreateBoneConstraint, CallFunc_AddComponent_ReturnValue) == 0x000078, "Member 'AVS_Vehicle_C_CreateBoneConstraint::CallFunc_AddComponent_ReturnValue' has a wrong offset!");

// Function AVS_Vehicle.AVS_Vehicle_C.CreateHitchConstraints
// 0x00F0 (0x00F0 - 0x0000)
struct AVS_Vehicle_C_CreateHitchConstraints final
{
public:
	bool                                          bManualAttachment;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
