#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AVS_VehicleMaster

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "E_InteractType_structs.hpp"
#include "E_ActorType_structs.hpp"
#include "S_VehicleSit_structs.hpp"
#include "E_SitsType_structs.hpp"
#include "StatType_structs.hpp"
#include "FMODStudio_structs.hpp"
#include "CarTipe_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "BPE_AmmoClass_structs.hpp"
#include "Survival_structs.hpp"
#include "DropItemEntry_structs.hpp"


namespace SDK::Params
{

// Function AVS_VehicleMaster.AVS_VehicleMaster_C.AfterExitSurv
// 0x0048 (0x0048 - 0x0000)
struct AVS_VehicleMaster_C_AfterExitSurv final
{
public:
	class AActor*                                 Surv;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GeneralInterface_C> K2Node_DynamicCast_AsBPI_General_Interface;        // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameHUD_C>        K2Node_DynamicCast_AsBPI_Game_HUD;                 // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AVS_VehicleMaster_C_AfterExitSurv) == 0x000008, "Wrong alignment on AVS_VehicleMaster_C_AfterExitSurv");
static_assert(sizeof(AVS_VehicleMaster_C_AfterExitSurv) == 0x000048, "Wrong size on AVS_VehicleMaster_C_AfterExitSurv");
static_assert(offsetof(AVS_VehicleMaster_C_AfterExitSurv, Surv) == 0x000000, "Member 'AVS_VehicleMaster_C_AfterExitSurv::Surv' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_AfterExitSurv, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'AVS_VehicleMaster_C_AfterExitSurv::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_AfterExitSurv, K2Node_DynamicCast_AsBPI_General_Interface) == 0x000010, "Member 'AVS_VehicleMaster_C_AfterExitSurv::K2Node_DynamicCast_AsBPI_General_Interface' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_AfterExitSurv, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'AVS_VehicleMaster_C_AfterExitSurv::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_AfterExitSurv, CallFunc_GetHUD_ReturnValue) == 0x000028, "Member 'AVS_VehicleMaster_C_AfterExitSurv::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_AfterExitSurv, K2Node_DynamicCast_AsBPI_Game_HUD) == 0x000030, "Member 'AVS_VehicleMaster_C_AfterExitSurv::K2Node_DynamicCast_AsBPI_Game_HUD' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_AfterExitSurv, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'AVS_VehicleMaster_C_AfterExitSurv::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function AVS_VehicleMaster.AVS_VehicleMaster_C.AllowStabilizeVehicle
// 0x0010 (0x0010 - 0x0000)
struct AVS_VehicleMaster_C_AllowStabilizeVehicle final
{
public:
	bool                                          Allow;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_hasContact_ReturnValue;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_hasContact_ReturnValue_1;                 // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_hasContact_ReturnValue_2;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_hasContact_ReturnValue_3;                 // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSimulatingPhysics_ReturnValue;          // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AVS_VehicleMaster_C_AllowStabilizeVehicle) == 0x000001, "Wrong alignment on AVS_VehicleMaster_C_AllowStabilizeVehicle");
static_assert(sizeof(AVS_VehicleMaster_C_AllowStabilizeVehicle) == 0x000010, "Wrong size on AVS_VehicleMaster_C_AllowStabilizeVehicle");
static_assert(offsetof(AVS_VehicleMaster_C_AllowStabilizeVehicle, Allow) == 0x000000, "Member 'AVS_VehicleMaster_C_AllowStabilizeVehicle::Allow' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_AllowStabilizeVehicle, CallFunc_hasContact_ReturnValue) == 0x000001, "Member 'AVS_VehicleMaster_C_AllowStabilizeVehicle::CallFunc_hasContact_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_AllowStabilizeVehicle, CallFunc_hasContact_ReturnValue_1) == 0x000002, "Member 'AVS_VehicleMaster_C_AllowStabilizeVehicle::CallFunc_hasContact_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_AllowStabilizeVehicle, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'AVS_VehicleMaster_C_AllowStabilizeVehicle::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_AllowStabilizeVehicle, CallFunc_Not_PreBool_ReturnValue_1) == 0x000004, "Member 'AVS_VehicleMaster_C_AllowStabilizeVehicle::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_AllowStabilizeVehicle, CallFunc_hasContact_ReturnValue_2) == 0x000005, "Member 'AVS_VehicleMaster_C_AllowStabilizeVehicle::CallFunc_hasContact_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_AllowStabilizeVehicle, CallFunc_hasContact_ReturnValue_3) == 0x000006, "Member 'AVS_VehicleMaster_C_AllowStabilizeVehicle::CallFunc_hasContact_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_AllowStabilizeVehicle, CallFunc_Not_PreBool_ReturnValue_2) == 0x000007, "Member 'AVS_VehicleMaster_C_AllowStabilizeVehicle::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_AllowStabilizeVehicle, CallFunc_Not_PreBool_ReturnValue_3) == 0x000008, "Member 'AVS_VehicleMaster_C_AllowStabilizeVehicle::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_AllowStabilizeVehicle, CallFunc_BooleanOR_ReturnValue) == 0x000009, "Member 'AVS_VehicleMaster_C_AllowStabilizeVehicle::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_AllowStabilizeVehicle, CallFunc_IsSimulatingPhysics_ReturnValue) == 0x00000A, "Member 'AVS_VehicleMaster_C_AllowStabilizeVehicle::CallFunc_IsSimulatingPhysics_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_AllowStabilizeVehicle, CallFunc_BooleanOR_ReturnValue_1) == 0x00000B, "Member 'AVS_VehicleMaster_C_AllowStabilizeVehicle::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_AllowStabilizeVehicle, CallFunc_BooleanOR_ReturnValue_2) == 0x00000C, "Member 'AVS_VehicleMaster_C_AllowStabilizeVehicle::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_AllowStabilizeVehicle, CallFunc_Not_PreBool_ReturnValue_4) == 0x00000D, "Member 'AVS_VehicleMaster_C_AllowStabilizeVehicle::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_AllowStabilizeVehicle, CallFunc_BooleanAND_ReturnValue) == 0x00000E, "Member 'AVS_VehicleMaster_C_AllowStabilizeVehicle::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_AllowStabilizeVehicle, CallFunc_BooleanAND_ReturnValue_1) == 0x00000F, "Member 'AVS_VehicleMaster_C_AllowStabilizeVehicle::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function AVS_VehicleMaster.AVS_VehicleMaster_C.AnySitsEmpty
// 0x0030 (0x0030 - 0x0000)
struct AVS_VehicleMaster_C_AnySitsEmpty final
{
public:
	bool                                          Zaebis1;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         EmptyIndex1;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EmptyIndex;                                        // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Zaebis;                                            // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_SitsType                                    Temp_byte_Variable;                                // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27[0x1];                                       // 0x0027(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AVS_VehicleMaster_C_AnySitsEmpty) == 0x000004, "Wrong alignment on AVS_VehicleMaster_C_AnySitsEmpty");
static_assert(sizeof(AVS_VehicleMaster_C_AnySitsEmpty) == 0x000030, "Wrong size on AVS_VehicleMaster_C_AnySitsEmpty");
static_assert(offsetof(AVS_VehicleMaster_C_AnySitsEmpty, Zaebis1) == 0x000000, "Member 'AVS_VehicleMaster_C_AnySitsEmpty::Zaebis1' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_AnySitsEmpty, EmptyIndex1) == 0x000004, "Member 'AVS_VehicleMaster_C_AnySitsEmpty::EmptyIndex1' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_AnySitsEmpty, EmptyIndex) == 0x000008, "Member 'AVS_VehicleMaster_C_AnySitsEmpty::EmptyIndex' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_AnySitsEmpty, Zaebis) == 0x00000C, "Member 'AVS_VehicleMaster_C_AnySitsEmpty::Zaebis' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_AnySitsEmpty, Temp_int_Variable) == 0x000010, "Member 'AVS_VehicleMaster_C_AnySitsEmpty::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_AnySitsEmpty, Temp_int_Variable_1) == 0x000014, "Member 'AVS_VehicleMaster_C_AnySitsEmpty::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_AnySitsEmpty, Temp_int_Variable_2) == 0x000018, "Member 'AVS_VehicleMaster_C_AnySitsEmpty::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_AnySitsEmpty, Temp_int_Variable_3) == 0x00001C, "Member 'AVS_VehicleMaster_C_AnySitsEmpty::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_AnySitsEmpty, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'AVS_VehicleMaster_C_AnySitsEmpty::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_AnySitsEmpty, Temp_bool_Variable) == 0x000024, "Member 'AVS_VehicleMaster_C_AnySitsEmpty::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_AnySitsEmpty, CallFunc_Not_PreBool_ReturnValue) == 0x000025, "Member 'AVS_VehicleMaster_C_AnySitsEmpty::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_AnySitsEmpty, Temp_byte_Variable) == 0x000026, "Member 'AVS_VehicleMaster_C_AnySitsEmpty::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_AnySitsEmpty, K2Node_Select_Default) == 0x000028, "Member 'AVS_VehicleMaster_C_AnySitsEmpty::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_AnySitsEmpty, CallFunc_Not_PreBool_ReturnValue_1) == 0x00002C, "Member 'AVS_VehicleMaster_C_AnySitsEmpty::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_AnySitsEmpty, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00002D, "Member 'AVS_VehicleMaster_C_AnySitsEmpty::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_AnySitsEmpty, CallFunc_BooleanAND_ReturnValue) == 0x00002E, "Member 'AVS_VehicleMaster_C_AnySitsEmpty::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function AVS_VehicleMaster.AVS_VehicleMaster_C.AnyWheelHasContact
// 0x0008 (0x0008 - 0x0000)
struct AVS_VehicleMaster_C_AnyWheelHasContact final
{
public:
	bool                                          HasContact;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_hasContact_ReturnValue;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_hasContact_ReturnValue_1;                 // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_hasContact_ReturnValue_2;                 // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_hasContact_ReturnValue_3;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AVS_VehicleMaster_C_AnyWheelHasContact) == 0x000001, "Wrong alignment on AVS_VehicleMaster_C_AnyWheelHasContact");
static_assert(sizeof(AVS_VehicleMaster_C_AnyWheelHasContact) == 0x000008, "Wrong size on AVS_VehicleMaster_C_AnyWheelHasContact");
static_assert(offsetof(AVS_VehicleMaster_C_AnyWheelHasContact, HasContact) == 0x000000, "Member 'AVS_VehicleMaster_C_AnyWheelHasContact::HasContact' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_AnyWheelHasContact, CallFunc_hasContact_ReturnValue) == 0x000001, "Member 'AVS_VehicleMaster_C_AnyWheelHasContact::CallFunc_hasContact_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_AnyWheelHasContact, CallFunc_hasContact_ReturnValue_1) == 0x000002, "Member 'AVS_VehicleMaster_C_AnyWheelHasContact::CallFunc_hasContact_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_AnyWheelHasContact, CallFunc_hasContact_ReturnValue_2) == 0x000003, "Member 'AVS_VehicleMaster_C_AnyWheelHasContact::CallFunc_hasContact_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_AnyWheelHasContact, CallFunc_hasContact_ReturnValue_3) == 0x000004, "Member 'AVS_VehicleMaster_C_AnyWheelHasContact::CallFunc_hasContact_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_AnyWheelHasContact, CallFunc_BooleanOR_ReturnValue) == 0x000005, "Member 'AVS_VehicleMaster_C_AnyWheelHasContact::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_AnyWheelHasContact, CallFunc_BooleanOR_ReturnValue_1) == 0x000006, "Member 'AVS_VehicleMaster_C_AnyWheelHasContact::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_AnyWheelHasContact, CallFunc_BooleanOR_ReturnValue_2) == 0x000007, "Member 'AVS_VehicleMaster_C_AnyWheelHasContact::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");

// Function AVS_VehicleMaster.AVS_VehicleMaster_C.BindOnSurvDeathAndDestroy
// 0x0008 (0x0008 - 0x0000)
struct AVS_VehicleMaster_C_BindOnSurvDeathAndDestroy final
{
public:
	class ASurvivalPlayer_V2_C*                   Surv;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AVS_VehicleMaster_C_BindOnSurvDeathAndDestroy) == 0x000008, "Wrong alignment on AVS_VehicleMaster_C_BindOnSurvDeathAndDestroy");
static_assert(sizeof(AVS_VehicleMaster_C_BindOnSurvDeathAndDestroy) == 0x000008, "Wrong size on AVS_VehicleMaster_C_BindOnSurvDeathAndDestroy");
static_assert(offsetof(AVS_VehicleMaster_C_BindOnSurvDeathAndDestroy, Surv) == 0x000000, "Member 'AVS_VehicleMaster_C_BindOnSurvDeathAndDestroy::Surv' has a wrong offset!");

// Function AVS_VehicleMaster.AVS_VehicleMaster_C.BndEvt__AVS_VehicleMaster_5WheelDetection_K2Node_ComponentBoundEvent_7_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_5WheelDetection_K2Node_ComponentBoundEvent_7_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_5WheelDetection_K2Node_ComponentBoundEvent_7_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_5WheelDetection_K2Node_ComponentBoundEvent_7_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_5WheelDetection_K2Node_ComponentBoundEvent_7_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_5WheelDetection_K2Node_ComponentBoundEvent_7_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_5WheelDetection_K2Node_ComponentBoundEvent_7_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_5WheelDetection_K2Node_ComponentBoundEvent_7_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_5WheelDetection_K2Node_ComponentBoundEvent_7_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_5WheelDetection_K2Node_ComponentBoundEvent_7_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_5WheelDetection_K2Node_ComponentBoundEvent_7_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_5WheelDetection_K2Node_ComponentBoundEvent_7_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_5WheelDetection_K2Node_ComponentBoundEvent_7_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_5WheelDetection_K2Node_ComponentBoundEvent_7_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_5WheelDetection_K2Node_ComponentBoundEvent_7_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_5WheelDetection_K2Node_ComponentBoundEvent_7_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_5WheelDetection_K2Node_ComponentBoundEvent_7_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_5WheelDetection_K2Node_ComponentBoundEvent_7_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function AVS_VehicleMaster.AVS_VehicleMaster_C.BndEvt__AVS_VehicleMaster_5WheelDetection_K2Node_ComponentBoundEvent_8_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_5WheelDetection_K2Node_ComponentBoundEvent_8_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_5WheelDetection_K2Node_ComponentBoundEvent_8_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_5WheelDetection_K2Node_ComponentBoundEvent_8_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_5WheelDetection_K2Node_ComponentBoundEvent_8_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_5WheelDetection_K2Node_ComponentBoundEvent_8_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_5WheelDetection_K2Node_ComponentBoundEvent_8_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_5WheelDetection_K2Node_ComponentBoundEvent_8_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_5WheelDetection_K2Node_ComponentBoundEvent_8_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_5WheelDetection_K2Node_ComponentBoundEvent_8_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_5WheelDetection_K2Node_ComponentBoundEvent_8_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_5WheelDetection_K2Node_ComponentBoundEvent_8_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_5WheelDetection_K2Node_ComponentBoundEvent_8_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_5WheelDetection_K2Node_ComponentBoundEvent_8_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function AVS_VehicleMaster.AVS_VehicleMaster_C.BndEvt__AVS_VehicleMaster_Cylinder_BL_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylinder_BL_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylinder_BL_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylinder_BL_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylinder_BL_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylinder_BL_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylinder_BL_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylinder_BL_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylinder_BL_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylinder_BL_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylinder_BL_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylinder_BL_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylinder_BL_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylinder_BL_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylinder_BL_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylinder_BL_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylinder_BL_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylinder_BL_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function AVS_VehicleMaster.AVS_VehicleMaster_C.BndEvt__AVS_VehicleMaster_Cylinder_BR_K2Node_ComponentBoundEvent_11_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylinder_BR_K2Node_ComponentBoundEvent_11_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylinder_BR_K2Node_ComponentBoundEvent_11_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylinder_BR_K2Node_ComponentBoundEvent_11_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylinder_BR_K2Node_ComponentBoundEvent_11_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylinder_BR_K2Node_ComponentBoundEvent_11_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylinder_BR_K2Node_ComponentBoundEvent_11_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylinder_BR_K2Node_ComponentBoundEvent_11_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylinder_BR_K2Node_ComponentBoundEvent_11_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylinder_BR_K2Node_ComponentBoundEvent_11_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylinder_BR_K2Node_ComponentBoundEvent_11_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylinder_BR_K2Node_ComponentBoundEvent_11_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylinder_BR_K2Node_ComponentBoundEvent_11_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylinder_BR_K2Node_ComponentBoundEvent_11_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylinder_BR_K2Node_ComponentBoundEvent_11_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylinder_BR_K2Node_ComponentBoundEvent_11_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylinder_BR_K2Node_ComponentBoundEvent_11_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylinder_BR_K2Node_ComponentBoundEvent_11_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function AVS_VehicleMaster.AVS_VehicleMaster_C.BndEvt__AVS_VehicleMaster_Cylinder_FR_K2Node_ComponentBoundEvent_14_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylinder_FR_K2Node_ComponentBoundEvent_14_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylinder_FR_K2Node_ComponentBoundEvent_14_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylinder_FR_K2Node_ComponentBoundEvent_14_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylinder_FR_K2Node_ComponentBoundEvent_14_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylinder_FR_K2Node_ComponentBoundEvent_14_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylinder_FR_K2Node_ComponentBoundEvent_14_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylinder_FR_K2Node_ComponentBoundEvent_14_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylinder_FR_K2Node_ComponentBoundEvent_14_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylinder_FR_K2Node_ComponentBoundEvent_14_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylinder_FR_K2Node_ComponentBoundEvent_14_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylinder_FR_K2Node_ComponentBoundEvent_14_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylinder_FR_K2Node_ComponentBoundEvent_14_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylinder_FR_K2Node_ComponentBoundEvent_14_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylinder_FR_K2Node_ComponentBoundEvent_14_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylinder_FR_K2Node_ComponentBoundEvent_14_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylinder_FR_K2Node_ComponentBoundEvent_14_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylinder_FR_K2Node_ComponentBoundEvent_14_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function AVS_VehicleMaster.AVS_VehicleMaster_C.BndEvt__AVS_VehicleMaster_Cylynder_FL_K2Node_ComponentBoundEvent_10_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylynder_FL_K2Node_ComponentBoundEvent_10_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylynder_FL_K2Node_ComponentBoundEvent_10_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylynder_FL_K2Node_ComponentBoundEvent_10_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylynder_FL_K2Node_ComponentBoundEvent_10_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylynder_FL_K2Node_ComponentBoundEvent_10_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylynder_FL_K2Node_ComponentBoundEvent_10_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylynder_FL_K2Node_ComponentBoundEvent_10_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylynder_FL_K2Node_ComponentBoundEvent_10_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylynder_FL_K2Node_ComponentBoundEvent_10_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylynder_FL_K2Node_ComponentBoundEvent_10_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylynder_FL_K2Node_ComponentBoundEvent_10_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylynder_FL_K2Node_ComponentBoundEvent_10_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylynder_FL_K2Node_ComponentBoundEvent_10_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylynder_FL_K2Node_ComponentBoundEvent_10_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylynder_FL_K2Node_ComponentBoundEvent_10_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylynder_FL_K2Node_ComponentBoundEvent_10_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_Cylynder_FL_K2Node_ComponentBoundEvent_10_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function AVS_VehicleMaster.AVS_VehicleMaster_C.BndEvt__AVS_VehicleMaster_mMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature
// 0x0118 (0x0118 - 0x0000)
struct AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_mMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0030(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_mMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x000008, "Wrong alignment on AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_mMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(sizeof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_mMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x000118, "Wrong size on AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_mMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(offsetof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_mMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, HitComponent) == 0x000000, "Member 'AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_mMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::HitComponent' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_mMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_mMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_mMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_mMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_mMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, NormalImpulse) == 0x000018, "Member 'AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_mMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::NormalImpulse' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_mMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, Hit) == 0x000030, "Member 'AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_mMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::Hit' has a wrong offset!");

// Function AVS_VehicleMaster.AVS_VehicleMaster_C.BndEvt__AVS_VehicleMaster_mMesh_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_mMesh_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_mMesh_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_mMesh_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_mMesh_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_mMesh_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_mMesh_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_mMesh_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_mMesh_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_mMesh_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_mMesh_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_mMesh_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_mMesh_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_mMesh_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_mMesh_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_mMesh_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_mMesh_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_mMesh_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function AVS_VehicleMaster.AVS_VehicleMaster_C.BndEvt__AVS_VehicleMaster_mMesh_K2Node_ComponentBoundEvent_6_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_mMesh_K2Node_ComponentBoundEvent_6_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_mMesh_K2Node_ComponentBoundEvent_6_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_mMesh_K2Node_ComponentBoundEvent_6_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_mMesh_K2Node_ComponentBoundEvent_6_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on AVS_VehicleMaster_C_BndEvt__AVS_VehicleMaster_mMesh_K2Node_ComponentBoundEvent_6_ComponentEndOverlapSignature__DelegateSignature");
