#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AVS_BugBolide

#include "Basic.hpp"


namespace SDK::Params
{

// Function AVS_BugBolide.AVS_BugBolide_C.ExecuteUbergraph_AVS_BugBolide
// 0x0048 (0x0048 - 0x0000)
struct AVS_BugBolide_C_ExecuteUbergraph_AVS_BugBolide final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_PreviousGear;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_CurrentGear;                          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFMODAudioComponent*                    CallFunc_FMODPlayEventAttachedBullet_ReturnValue;  // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UFMODAudioComponent*                    CallFunc_FMODPlayEventAttachedBullet_ReturnValue_1; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UNiagaraComponent*>              K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_1;       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_2;       // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_3;       // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AVS_BugBolide_C_ExecuteUbergraph_AVS_BugBolide) == 0x000008, "Wrong alignment on AVS_BugBolide_C_ExecuteUbergraph_AVS_BugBolide");
static_assert(sizeof(AVS_BugBolide_C_ExecuteUbergraph_AVS_BugBolide) == 0x000048, "Wrong size on AVS_BugBolide_C_ExecuteUbergraph_AVS_BugBolide");
static_assert(offsetof(AVS_BugBolide_C_ExecuteUbergraph_AVS_BugBolide, EntryPoint) == 0x000000, "Member 'AVS_BugBolide_C_ExecuteUbergraph_AVS_BugBolide::EntryPoint' has a wrong offset!");
static_assert(offsetof(AVS_BugBolide_C_ExecuteUbergraph_AVS_BugBolide, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000004, "Member 'AVS_BugBolide_C_ExecuteUbergraph_AVS_BugBolide::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_BugBolide_C_ExecuteUbergraph_AVS_BugBolide, K2Node_Event_PreviousGear) == 0x000008, "Member 'AVS_BugBolide_C_ExecuteUbergraph_AVS_BugBolide::K2Node_Event_PreviousGear' has a wrong offset!");
static_assert(offsetof(AVS_BugBolide_C_ExecuteUbergraph_AVS_BugBolide, K2Node_Event_CurrentGear) == 0x00000C, "Member 'AVS_BugBolide_C_ExecuteUbergraph_AVS_BugBolide::K2Node_Event_CurrentGear' has a wrong offset!");
static_assert(offsetof(AVS_BugBolide_C_ExecuteUbergraph_AVS_BugBolide, CallFunc_Greater_IntInt_ReturnValue) == 0x000010, "Member 'AVS_BugBolide_C_ExecuteUbergraph_AVS_BugBolide::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_BugBolide_C_ExecuteUbergraph_AVS_BugBolide, CallFunc_FMODPlayEventAttachedBullet_ReturnValue) == 0x000018, "Member 'AVS_BugBolide_C_ExecuteUbergraph_AVS_BugBolide::CallFunc_FMODPlayEventAttachedBullet_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_BugBolide_C_ExecuteUbergraph_AVS_BugBolide, CallFunc_FMODPlayEventAttachedBullet_ReturnValue_1) == 0x000020, "Member 'AVS_BugBolide_C_ExecuteUbergraph_AVS_BugBolide::CallFunc_FMODPlayEventAttachedBullet_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AVS_BugBolide_C_ExecuteUbergraph_AVS_BugBolide, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000028, "Member 'AVS_BugBolide_C_ExecuteUbergraph_AVS_BugBolide::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AVS_BugBolide_C_ExecuteUbergraph_AVS_BugBolide, CallFunc_Greater_IntInt_ReturnValue_2) == 0x000029, "Member 'AVS_BugBolide_C_ExecuteUbergraph_AVS_BugBolide::CallFunc_Greater_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AVS_BugBolide_C_ExecuteUbergraph_AVS_BugBolide, K2Node_MakeArray_Array) == 0x000030, "Member 'AVS_BugBolide_C_ExecuteUbergraph_AVS_BugBolide::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AVS_BugBolide_C_ExecuteUbergraph_AVS_BugBolide, CallFunc_K2_AttachToComponent_ReturnValue_1) == 0x000040, "Member 'AVS_BugBolide_C_ExecuteUbergraph_AVS_BugBolide::CallFunc_K2_AttachToComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AVS_BugBolide_C_ExecuteUbergraph_AVS_BugBolide, CallFunc_K2_AttachToComponent_ReturnValue_2) == 0x000041, "Member 'AVS_BugBolide_C_ExecuteUbergraph_AVS_BugBolide::CallFunc_K2_AttachToComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AVS_BugBolide_C_ExecuteUbergraph_AVS_BugBolide, CallFunc_K2_AttachToComponent_ReturnValue_3) == 0x000042, "Member 'AVS_BugBolide_C_ExecuteUbergraph_AVS_BugBolide::CallFunc_K2_AttachToComponent_ReturnValue_3' has a wrong offset!");

// Function AVS_BugBolide.AVS_BugBolide_C.GearChanged_1
// 0x0008 (0x0008 - 0x0000)
struct AVS_BugBolide_C_GearChanged_1 final
{
public:
	int32                                         PreviousGear;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentGear;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AVS_BugBolide_C_GearChanged_1) == 0x000004, "Wrong alignment on AVS_BugBolide_C_GearChanged_1");
static_assert(sizeof(AVS_BugBolide_C_GearChanged_1) == 0x000008, "Wrong size on AVS_BugBolide_C_GearChanged_1");
static_assert(offsetof(AVS_BugBolide_C_GearChanged_1, PreviousGear) == 0x000000, "Member 'AVS_BugBolide_C_GearChanged_1::PreviousGear' has a wrong offset!");
static_assert(offsetof(AVS_BugBolide_C_GearChanged_1, CurrentGear) == 0x000004, "Member 'AVS_BugBolide_C_GearChanged_1::CurrentGear' has a wrong offset!");

// Function AVS_BugBolide.AVS_BugBolide_C.UserConstructionScript
// 0x0018 (0x0018 - 0x0000)
struct AVS_BugBolide_C_UserConstructionScript final
{
public:
	TArray<class UStaticMeshComponent*>           K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_1;       // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AVS_BugBolide_C_UserConstructionScript) == 0x000008, "Wrong alignment on AVS_BugBolide_C_UserConstructionScript");
static_assert(sizeof(AVS_BugBolide_C_UserConstructionScript) == 0x000018, "Wrong size on AVS_BugBolide_C_UserConstructionScript");
static_assert(offsetof(AVS_BugBolide_C_UserConstructionScript, K2Node_MakeArray_Array) == 0x000000, "Member 'AVS_BugBolide_C_UserConstructionScript::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AVS_BugBolide_C_UserConstructionScript, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000010, "Member 'AVS_BugBolide_C_UserConstructionScript::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_BugBolide_C_UserConstructionScript, CallFunc_K2_AttachToComponent_ReturnValue_1) == 0x000011, "Member 'AVS_BugBolide_C_UserConstructionScript::CallFunc_K2_AttachToComponent_ReturnValue_1' has a wrong offset!");

}

