#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AVS_Lugatti

#include "Basic.hpp"


namespace SDK::Params
{

// Function AVS_Lugatti.AVS_Lugatti_C.ExecuteUbergraph_AVS_Lugatti
// 0x0030 (0x0030 - 0x0000)
struct AVS_Lugatti_C_ExecuteUbergraph_AVS_Lugatti final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_PreviousGear;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_CurrentGear;                          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFMODAudioComponent*                    CallFunc_FMODPlayEventAttachedBullet_ReturnValue;  // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UFMODAudioComponent*                    CallFunc_FMODPlayEventAttachedBullet_ReturnValue_1; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_1;       // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_2;       // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_3;       // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AVS_Lugatti_C_ExecuteUbergraph_AVS_Lugatti) == 0x000008, "Wrong alignment on AVS_Lugatti_C_ExecuteUbergraph_AVS_Lugatti");
static_assert(sizeof(AVS_Lugatti_C_ExecuteUbergraph_AVS_Lugatti) == 0x000030, "Wrong size on AVS_Lugatti_C_ExecuteUbergraph_AVS_Lugatti");
static_assert(offsetof(AVS_Lugatti_C_ExecuteUbergraph_AVS_Lugatti, EntryPoint) == 0x000000, "Member 'AVS_Lugatti_C_ExecuteUbergraph_AVS_Lugatti::EntryPoint' has a wrong offset!");
static_assert(offsetof(AVS_Lugatti_C_ExecuteUbergraph_AVS_Lugatti, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000004, "Member 'AVS_Lugatti_C_ExecuteUbergraph_AVS_Lugatti::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_Lugatti_C_ExecuteUbergraph_AVS_Lugatti, K2Node_Event_PreviousGear) == 0x000008, "Member 'AVS_Lugatti_C_ExecuteUbergraph_AVS_Lugatti::K2Node_Event_PreviousGear' has a wrong offset!");
static_assert(offsetof(AVS_Lugatti_C_ExecuteUbergraph_AVS_Lugatti, K2Node_Event_CurrentGear) == 0x00000C, "Member 'AVS_Lugatti_C_ExecuteUbergraph_AVS_Lugatti::K2Node_Event_CurrentGear' has a wrong offset!");
static_assert(offsetof(AVS_Lugatti_C_ExecuteUbergraph_AVS_Lugatti, CallFunc_Greater_IntInt_ReturnValue) == 0x000010, "Member 'AVS_Lugatti_C_ExecuteUbergraph_AVS_Lugatti::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_Lugatti_C_ExecuteUbergraph_AVS_Lugatti, CallFunc_FMODPlayEventAttachedBullet_ReturnValue) == 0x000018, "Member 'AVS_Lugatti_C_ExecuteUbergraph_AVS_Lugatti::CallFunc_FMODPlayEventAttachedBullet_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_Lugatti_C_ExecuteUbergraph_AVS_Lugatti, CallFunc_FMODPlayEventAttachedBullet_ReturnValue_1) == 0x000020, "Member 'AVS_Lugatti_C_ExecuteUbergraph_AVS_Lugatti::CallFunc_FMODPlayEventAttachedBullet_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AVS_Lugatti_C_ExecuteUbergraph_AVS_Lugatti, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000028, "Member 'AVS_Lugatti_C_ExecuteUbergraph_AVS_Lugatti::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AVS_Lugatti_C_ExecuteUbergraph_AVS_Lugatti, CallFunc_Greater_IntInt_ReturnValue_2) == 0x000029, "Member 'AVS_Lugatti_C_ExecuteUbergraph_AVS_Lugatti::CallFunc_Greater_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AVS_Lugatti_C_ExecuteUbergraph_AVS_Lugatti, CallFunc_K2_AttachToComponent_ReturnValue_1) == 0x00002A, "Member 'AVS_Lugatti_C_ExecuteUbergraph_AVS_Lugatti::CallFunc_K2_AttachToComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AVS_Lugatti_C_ExecuteUbergraph_AVS_Lugatti, CallFunc_K2_AttachToComponent_ReturnValue_2) == 0x00002B, "Member 'AVS_Lugatti_C_ExecuteUbergraph_AVS_Lugatti::CallFunc_K2_AttachToComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AVS_Lugatti_C_ExecuteUbergraph_AVS_Lugatti, CallFunc_K2_AttachToComponent_ReturnValue_3) == 0x00002C, "Member 'AVS_Lugatti_C_ExecuteUbergraph_AVS_Lugatti::CallFunc_K2_AttachToComponent_ReturnValue_3' has a wrong offset!");

// Function AVS_Lugatti.AVS_Lugatti_C.GearChanged_1
// 0x0008 (0x0008 - 0x0000)
struct AVS_Lugatti_C_GearChanged_1 final
{
public:
	int32                                         PreviousGear;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentGear;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AVS_Lugatti_C_GearChanged_1) == 0x000004, "Wrong alignment on AVS_Lugatti_C_GearChanged_1");
static_assert(sizeof(AVS_Lugatti_C_GearChanged_1) == 0x000008, "Wrong size on AVS_Lugatti_C_GearChanged_1");
static_assert(offsetof(AVS_Lugatti_C_GearChanged_1, PreviousGear) == 0x000000, "Member 'AVS_Lugatti_C_GearChanged_1::PreviousGear' has a wrong offset!");
static_assert(offsetof(AVS_Lugatti_C_GearChanged_1, CurrentGear) == 0x000004, "Member 'AVS_Lugatti_C_GearChanged_1::CurrentGear' has a wrong offset!");

// Function AVS_Lugatti.AVS_Lugatti_C.UserConstructionScript
// 0x0002 (0x0002 - 0x0000)
struct AVS_Lugatti_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_1;       // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AVS_Lugatti_C_UserConstructionScript) == 0x000001, "Wrong alignment on AVS_Lugatti_C_UserConstructionScript");
static_assert(sizeof(AVS_Lugatti_C_UserConstructionScript) == 0x000002, "Wrong size on AVS_Lugatti_C_UserConstructionScript");
static_assert(offsetof(AVS_Lugatti_C_UserConstructionScript, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000000, "Member 'AVS_Lugatti_C_UserConstructionScript::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_Lugatti_C_UserConstructionScript, CallFunc_K2_AttachToComponent_ReturnValue_1) == 0x000001, "Member 'AVS_Lugatti_C_UserConstructionScript::CallFunc_K2_AttachToComponent_ReturnValue_1' has a wrong offset!");

}

