#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AVS_Dodge

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AVS_Dodge.AVS_Dodge_C.ExecuteUbergraph_AVS_Dodge
// 0x0038 (0x0038 - 0x0000)
struct AVS_Dodge_C_ExecuteUbergraph_AVS_Dodge final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PreviousGear;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_CurrentGear;                          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFMODAudioComponent*                    CallFunc_FMODPlayEventAttachedBullet_ReturnValue;  // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_1;       // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_2;       // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_3;       // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UNiagaraComponent*>              K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(AVS_Dodge_C_ExecuteUbergraph_AVS_Dodge) == 0x000008, "Wrong alignment on AVS_Dodge_C_ExecuteUbergraph_AVS_Dodge");
static_assert(sizeof(AVS_Dodge_C_ExecuteUbergraph_AVS_Dodge) == 0x000038, "Wrong size on AVS_Dodge_C_ExecuteUbergraph_AVS_Dodge");
static_assert(offsetof(AVS_Dodge_C_ExecuteUbergraph_AVS_Dodge, EntryPoint) == 0x000000, "Member 'AVS_Dodge_C_ExecuteUbergraph_AVS_Dodge::EntryPoint' has a wrong offset!");
static_assert(offsetof(AVS_Dodge_C_ExecuteUbergraph_AVS_Dodge, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'AVS_Dodge_C_ExecuteUbergraph_AVS_Dodge::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(AVS_Dodge_C_ExecuteUbergraph_AVS_Dodge, K2Node_Event_PreviousGear) == 0x000008, "Member 'AVS_Dodge_C_ExecuteUbergraph_AVS_Dodge::K2Node_Event_PreviousGear' has a wrong offset!");
static_assert(offsetof(AVS_Dodge_C_ExecuteUbergraph_AVS_Dodge, K2Node_Event_CurrentGear) == 0x00000C, "Member 'AVS_Dodge_C_ExecuteUbergraph_AVS_Dodge::K2Node_Event_CurrentGear' has a wrong offset!");
static_assert(offsetof(AVS_Dodge_C_ExecuteUbergraph_AVS_Dodge, CallFunc_Greater_IntInt_ReturnValue) == 0x000010, "Member 'AVS_Dodge_C_ExecuteUbergraph_AVS_Dodge::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_Dodge_C_ExecuteUbergraph_AVS_Dodge, CallFunc_FMODPlayEventAttachedBullet_ReturnValue) == 0x000018, "Member 'AVS_Dodge_C_ExecuteUbergraph_AVS_Dodge::CallFunc_FMODPlayEventAttachedBullet_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_Dodge_C_ExecuteUbergraph_AVS_Dodge, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000020, "Member 'AVS_Dodge_C_ExecuteUbergraph_AVS_Dodge::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AVS_Dodge_C_ExecuteUbergraph_AVS_Dodge, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000021, "Member 'AVS_Dodge_C_ExecuteUbergraph_AVS_Dodge::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_Dodge_C_ExecuteUbergraph_AVS_Dodge, CallFunc_K2_AttachToComponent_ReturnValue_1) == 0x000022, "Member 'AVS_Dodge_C_ExecuteUbergraph_AVS_Dodge::CallFunc_K2_AttachToComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AVS_Dodge_C_ExecuteUbergraph_AVS_Dodge, CallFunc_K2_AttachToComponent_ReturnValue_2) == 0x000023, "Member 'AVS_Dodge_C_ExecuteUbergraph_AVS_Dodge::CallFunc_K2_AttachToComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AVS_Dodge_C_ExecuteUbergraph_AVS_Dodge, CallFunc_K2_AttachToComponent_ReturnValue_3) == 0x000024, "Member 'AVS_Dodge_C_ExecuteUbergraph_AVS_Dodge::CallFunc_K2_AttachToComponent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AVS_Dodge_C_ExecuteUbergraph_AVS_Dodge, K2Node_MakeArray_Array) == 0x000028, "Member 'AVS_Dodge_C_ExecuteUbergraph_AVS_Dodge::K2Node_MakeArray_Array' has a wrong offset!");

// Function AVS_Dodge.AVS_Dodge_C.GearChanged_1
// 0x0008 (0x0008 - 0x0000)
struct AVS_Dodge_C_GearChanged_1 final
{
public:
	int32                                         PreviousGear;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentGear;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AVS_Dodge_C_GearChanged_1) == 0x000004, "Wrong alignment on AVS_Dodge_C_GearChanged_1");
static_assert(sizeof(AVS_Dodge_C_GearChanged_1) == 0x000008, "Wrong size on AVS_Dodge_C_GearChanged_1");
static_assert(offsetof(AVS_Dodge_C_GearChanged_1, PreviousGear) == 0x000000, "Member 'AVS_Dodge_C_GearChanged_1::PreviousGear' has a wrong offset!");
static_assert(offsetof(AVS_Dodge_C_GearChanged_1, CurrentGear) == 0x000004, "Member 'AVS_Dodge_C_GearChanged_1::CurrentGear' has a wrong offset!");

// Function AVS_Dodge.AVS_Dodge_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct AVS_Dodge_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AVS_Dodge_C_ReceiveTick) == 0x000004, "Wrong alignment on AVS_Dodge_C_ReceiveTick");
static_assert(sizeof(AVS_Dodge_C_ReceiveTick) == 0x000004, "Wrong size on AVS_Dodge_C_ReceiveTick");
static_assert(offsetof(AVS_Dodge_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'AVS_Dodge_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function AVS_Dodge.AVS_Dodge_C.UserConstructionScript
// 0x0588 (0x0588 - 0x0000)
struct AVS_Dodge_C_UserConstructionScript final
{
public:
	struct FHitResult                             CallFunc_K2_AddRelativeLocation_SweepHitResult;    // 0x0000(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_AddRelativeLocation_SweepHitResult_1;  // 0x00E8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_AddRelativeLocation_SweepHitResult_2;  // 0x01D0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_AddRelativeLocation_SweepHitResult_3;  // 0x02B8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_AddRelativeLocation_SweepHitResult_4;  // 0x03A0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_AddRelativeLocation_SweepHitResult_5;  // 0x0488(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TArray<class UStaticMeshComponent*>           K2Node_MakeArray_Array;                            // 0x0570(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0580(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_1;       // 0x0581(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AVS_Dodge_C_UserConstructionScript) == 0x000008, "Wrong alignment on AVS_Dodge_C_UserConstructionScript");
static_assert(sizeof(AVS_Dodge_C_UserConstructionScript) == 0x000588, "Wrong size on AVS_Dodge_C_UserConstructionScript");
static_assert(offsetof(AVS_Dodge_C_UserConstructionScript, CallFunc_K2_AddRelativeLocation_SweepHitResult) == 0x000000, "Member 'AVS_Dodge_C_UserConstructionScript::CallFunc_K2_AddRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(AVS_Dodge_C_UserConstructionScript, CallFunc_K2_AddRelativeLocation_SweepHitResult_1) == 0x0000E8, "Member 'AVS_Dodge_C_UserConstructionScript::CallFunc_K2_AddRelativeLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(AVS_Dodge_C_UserConstructionScript, CallFunc_K2_AddRelativeLocation_SweepHitResult_2) == 0x0001D0, "Member 'AVS_Dodge_C_UserConstructionScript::CallFunc_K2_AddRelativeLocation_SweepHitResult_2' has a wrong offset!");
static_assert(offsetof(AVS_Dodge_C_UserConstructionScript, CallFunc_K2_AddRelativeLocation_SweepHitResult_3) == 0x0002B8, "Member 'AVS_Dodge_C_UserConstructionScript::CallFunc_K2_AddRelativeLocation_SweepHitResult_3' has a wrong offset!");
static_assert(offsetof(AVS_Dodge_C_UserConstructionScript, CallFunc_K2_AddRelativeLocation_SweepHitResult_4) == 0x0003A0, "Member 'AVS_Dodge_C_UserConstructionScript::CallFunc_K2_AddRelativeLocation_SweepHitResult_4' has a wrong offset!");
static_assert(offsetof(AVS_Dodge_C_UserConstructionScript, CallFunc_K2_AddRelativeLocation_SweepHitResult_5) == 0x000488, "Member 'AVS_Dodge_C_UserConstructionScript::CallFunc_K2_AddRelativeLocation_SweepHitResult_5' has a wrong offset!");
static_assert(offsetof(AVS_Dodge_C_UserConstructionScript, K2Node_MakeArray_Array) == 0x000570, "Member 'AVS_Dodge_C_UserConstructionScript::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AVS_Dodge_C_UserConstructionScript, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000580, "Member 'AVS_Dodge_C_UserConstructionScript::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AVS_Dodge_C_UserConstructionScript, CallFunc_K2_AttachToComponent_ReturnValue_1) == 0x000581, "Member 'AVS_Dodge_C_UserConstructionScript::CallFunc_K2_AttachToComponent_ReturnValue_1' has a wrong offset!");

}

