#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BanditParentAI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EquipmentData_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ComponentAndTransform_structs.hpp"
#include "ClimbParams_structs.hpp"
#include "ClimBType_structs.hpp"
#include "ClimbAsset_structs.hpp"
#include "FMODStudio_structs.hpp"


namespace SDK::Params
{

// Function BanditParentAI.BanditParentAI_C.BanditDeath
// 0x0030 (0x0030 - 0x0000)
struct BanditParentAI_C_BanditDeath final
{
public:
	class AController*                            InstigatedBy;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        HitAngle;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation;                                       // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BoneName;                                          // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BanditParentAI_C_BanditDeath) == 0x000008, "Wrong alignment on BanditParentAI_C_BanditDeath");
static_assert(sizeof(BanditParentAI_C_BanditDeath) == 0x000030, "Wrong size on BanditParentAI_C_BanditDeath");
static_assert(offsetof(BanditParentAI_C_BanditDeath, InstigatedBy) == 0x000000, "Member 'BanditParentAI_C_BanditDeath::InstigatedBy' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_BanditDeath, HitAngle) == 0x000008, "Member 'BanditParentAI_C_BanditDeath::HitAngle' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_BanditDeath, HitLocation) == 0x000010, "Member 'BanditParentAI_C_BanditDeath::HitLocation' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_BanditDeath, BoneName) == 0x000028, "Member 'BanditParentAI_C_BanditDeath::BoneName' has a wrong offset!");

// Function BanditParentAI.BanditParentAI_C.ClimbCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct BanditParentAI_C_ClimbCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BanditParentAI_C_ClimbCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BanditParentAI_C_ClimbCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BanditParentAI_C_ClimbCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on BanditParentAI_C_ClimbCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BanditParentAI_C_ClimbCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BanditParentAI_C_ClimbCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BanditParentAI_C_ClimbCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BanditParentAI_C_ClimbCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BanditParentAI_C_ClimbCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BanditParentAI_C_ClimbCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BanditParentAI_C_ClimbCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BanditParentAI.BanditParentAI_C.CalcAccelDecel
// 0x0028 (0x0028 - 0x0000)
struct BanditParentAI_C_CalcAccelDecel final
{
public:
	bool                                          Default_;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Accel;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Decel;                                             // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_VariableSet_MaxAcceleration_ImplicitCast;   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_BrakingDecelerationWalking_ImplicitCast; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BanditParentAI_C_CalcAccelDecel) == 0x000008, "Wrong alignment on BanditParentAI_C_CalcAccelDecel");
static_assert(sizeof(BanditParentAI_C_CalcAccelDecel) == 0x000028, "Wrong size on BanditParentAI_C_CalcAccelDecel");
static_assert(offsetof(BanditParentAI_C_CalcAccelDecel, Default_) == 0x000000, "Member 'BanditParentAI_C_CalcAccelDecel::Default_' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_CalcAccelDecel, Accel) == 0x000008, "Member 'BanditParentAI_C_CalcAccelDecel::Accel' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_CalcAccelDecel, Decel) == 0x000010, "Member 'BanditParentAI_C_CalcAccelDecel::Decel' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_CalcAccelDecel, CallFunc_HasAuthority_ReturnValue) == 0x000018, "Member 'BanditParentAI_C_CalcAccelDecel::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_CalcAccelDecel, K2Node_SwitchEnum_CmpSuccess) == 0x000019, "Member 'BanditParentAI_C_CalcAccelDecel::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_CalcAccelDecel, K2Node_VariableSet_MaxAcceleration_ImplicitCast) == 0x00001C, "Member 'BanditParentAI_C_CalcAccelDecel::K2Node_VariableSet_MaxAcceleration_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_CalcAccelDecel, K2Node_VariableSet_BrakingDecelerationWalking_ImplicitCast) == 0x000020, "Member 'BanditParentAI_C_CalcAccelDecel::K2Node_VariableSet_BrakingDecelerationWalking_ImplicitCast' has a wrong offset!");

// Function BanditParentAI.BanditParentAI_C.ClimbCheck
// 0x0CE0 (0x0CE0 - 0x0000)
struct BanditParentAI_C_ClimbCheck final
{
public:
	bool                                          Vault;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0020(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FComponentAndTransform                 K2Node_MakeStruct_ComponentAndTransform;           // 0x00A0(0x00C0)(IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable_1;                            // 0x0168(0x0010)(ConstParm, ReferenceParm)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable_2;                            // 0x0180(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x01D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScaledCapsuleHalfHeight_ReturnValue;   // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetUpVector_ReturnValue;                  // 0x01F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0218(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0230(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0248(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0260(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0290(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x02F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0308(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0320(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_NormalizedDeltaRotator_ReturnValue;       // 0x0338(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_BreakVector_X_2;                          // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_2;                          // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_2;                          // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_374[0x4];                                      // 0x0374(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_2;           // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_391[0x7];                                      // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0398(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x03B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_SphereTraceSingle_OutHit;                 // 0x03C8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingle_ReturnValue;            // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B1[0x7];                                      // 0x04B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x04B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x04D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x04E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWalkable_ReturnValue;                   // 0x0500(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_501[0x7];                                      // 0x0501(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0508(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0520(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0521(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_522[0x2];                                      // 0x0522(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0524(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0528(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52C[0x4];                                      // 0x052C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0530(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0548(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0560(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0578(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0590(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0598(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x05A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x05A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x05B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x05B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x05BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x05C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C4[0x4];                                      // 0x05C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x05C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x05E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_3;                          // 0x05F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_3;                          // 0x0600(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_3;                          // 0x0608(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_4;                          // 0x0610(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_4;                          // 0x0618(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_4;                          // 0x0620(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0628(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_629[0x7];                                      // 0x0629(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x0630(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_648[0x8];                                      // 0x0648(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0650(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_3;           // 0x06B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x06B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_4;                 // 0x06C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScaledCapsuleHalfHeight_ReturnValue_1; // 0x06D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DC[0x4];                                      // 0x06DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetUpVector_ReturnValue_1;                // 0x06E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_4;           // 0x06F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0700(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x0718(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue;           // 0x0730(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_2;      // 0x0748(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0760(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x0764(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0768(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76C[0x4];                                      // 0x076C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0770(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0788(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetRightVector_ReturnValue;               // 0x07A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x07B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_3;       // 0x07D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_4;       // 0x07E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0800(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0818(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_5;       // 0x0830(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_6;       // 0x0848(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_3;           // 0x0860(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_4;           // 0x0878(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_5;           // 0x0890(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_6;           // 0x08A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_7;       // 0x08C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_7;           // 0x08D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_8;           // 0x08F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0908(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x09F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9F1[0x7];                                      // 0x09F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_CapsuleTraceSingle_OutHit;                // 0x09F8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_CapsuleTraceSingle_ReturnValue;           // 0x0AE0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x0AE1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x0AE2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AE3[0x1];                                      // 0x0AE3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x0AE4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x0AE8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AEC[0x4];                                      // 0x0AEC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x0AF0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x0B08(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x0B20(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x0B38(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0B50(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0B58(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0B60(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0B68(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName_1;                // 0x0B70(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0B78(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x0B7C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x0B80(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B84[0x4];                                      // 0x0B84(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x0B88(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x0BA0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWalkable_ReturnValue_1;                 // 0x0BB8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BB9[0x7];                                      // 0x0BB9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X_5;                          // 0x0BC0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_5;                          // 0x0BC8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_5;                          // 0x0BD0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0BD8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD9[0x7];                                      // 0x0BD9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0BE0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_2;            // 0x0BE8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_2;         // 0x0BE9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BEA[0x2];                                      // 0x0BEA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_2;                    // 0x0BEC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_2;                // 0x0BF0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BF4[0x4];                                      // 0x0BF4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location_2;                // 0x0BF8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_2;             // 0x0C10(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_2;                  // 0x0C28(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_2;            // 0x0C40(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_2;                 // 0x0C58(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_2;                // 0x0C60(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_2;            // 0x0C68(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_2;             // 0x0C70(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName_2;                // 0x0C78(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_2;                 // 0x0C80(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_2;            // 0x0C84(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_2;               // 0x0C88(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C8C[0x4];                                      // 0x0C8C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart_2;              // 0x0C90(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_2;                // 0x0CA8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0CC0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0CC1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0CC2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0CC3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC4[0x4];                                      // 0x0CC4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0CC8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_A_ImplicitCast;                       // 0x0CD0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast_1;        // 0x0CD8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BanditParentAI_C_ClimbCheck) == 0x000010, "Wrong alignment on BanditParentAI_C_ClimbCheck");
static_assert(sizeof(BanditParentAI_C_ClimbCheck) == 0x000CE0, "Wrong size on BanditParentAI_C_ClimbCheck");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, Vault) == 0x000000, "Member 'BanditParentAI_C_ClimbCheck::Vault' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, Temp_object_Variable) == 0x000008, "Member 'BanditParentAI_C_ClimbCheck::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000020, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_MakeVector_ReturnValue) == 0x000080, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, K2Node_MakeStruct_ComponentAndTransform) == 0x0000A0, "Member 'BanditParentAI_C_ClimbCheck::K2Node_MakeStruct_ComponentAndTransform' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000160, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, Temp_object_Variable_1) == 0x000168, "Member 'BanditParentAI_C_ClimbCheck::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, K2Node_SwitchEnum_CmpSuccess) == 0x000178, "Member 'BanditParentAI_C_ClimbCheck::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, Temp_object_Variable_2) == 0x000180, "Member 'BanditParentAI_C_ClimbCheck::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000190, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_BreakVector_X) == 0x0001A8, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_BreakVector_Y) == 0x0001B0, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_BreakVector_Z) == 0x0001B8, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x0001C0, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0001D8, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_GetScaledCapsuleHalfHeight_ReturnValue) == 0x0001F0, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_GetScaledCapsuleHalfHeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_GetUpVector_ReturnValue) == 0x0001F8, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_GetUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000210, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000218, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000230, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000248, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000260, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_BreakVector_X_1) == 0x000278, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_BreakVector_Y_1) == 0x000280, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_BreakVector_Z_1) == 0x000288, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_MakeTransform_ReturnValue) == 0x000290, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_MakeVector_ReturnValue_1) == 0x0002F0, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_Add_VectorVector_ReturnValue) == 0x000308, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000320, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_NormalizedDeltaRotator_ReturnValue) == 0x000338, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_NormalizedDeltaRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_BreakVector_X_2) == 0x000350, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_BreakVector_Y_2) == 0x000358, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_BreakVector_Z_2) == 0x000360, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_BreakRotator_Roll) == 0x000368, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_BreakRotator_Pitch) == 0x00036C, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_BreakRotator_Yaw) == 0x000370, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000378, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_Abs_ReturnValue) == 0x000380, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_Add_DoubleDouble_ReturnValue_2) == 0x000388, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_Add_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000390, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_MakeVector_ReturnValue_2) == 0x000398, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0003B0, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_SphereTraceSingle_OutHit) == 0x0003C8, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_SphereTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_SphereTraceSingle_ReturnValue) == 0x0004B0, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_SphereTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_BreakTransform_Location) == 0x0004B8, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_BreakTransform_Rotation) == 0x0004D0, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_BreakTransform_Scale) == 0x0004E8, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_IsWalkable_ReturnValue) == 0x000500, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_IsWalkable_ReturnValue' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x000508, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_BreakHitResult_bBlockingHit) == 0x000520, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_BreakHitResult_bInitialOverlap) == 0x000521, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_BreakHitResult_Time) == 0x000524, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_BreakHitResult_Distance) == 0x000528, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_BreakHitResult_Location) == 0x000530, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_BreakHitResult_ImpactPoint) == 0x000548, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_BreakHitResult_Normal) == 0x000560, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_BreakHitResult_ImpactNormal) == 0x000578, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_BreakHitResult_PhysMat) == 0x000590, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_BreakHitResult_HitActor) == 0x000598, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_BreakHitResult_HitComponent) == 0x0005A0, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_BreakHitResult_HitBoneName) == 0x0005A8, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_BreakHitResult_BoneName) == 0x0005B0, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_BreakHitResult_HitItem) == 0x0005B8, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_BreakHitResult_ElementIndex) == 0x0005BC, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_BreakHitResult_FaceIndex) == 0x0005C0, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_BreakHitResult_TraceStart) == 0x0005C8, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_BreakHitResult_TraceEnd) == 0x0005E0, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_BreakVector_X_3) == 0x0005F8, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_BreakVector_X_3' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_BreakVector_Y_3) == 0x000600, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_BreakVector_Y_3' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_BreakVector_Z_3) == 0x000608, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_BreakVector_Z_3' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_BreakVector_X_4) == 0x000610, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_BreakVector_X_4' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_BreakVector_Y_4) == 0x000618, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_BreakVector_Y_4' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_BreakVector_Z_4) == 0x000620, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_BreakVector_Z_4' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_BooleanAND_ReturnValue) == 0x000628, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_MakeVector_ReturnValue_3) == 0x000630, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_MakeVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_GetTransform_ReturnValue) == 0x000650, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_Add_DoubleDouble_ReturnValue_3) == 0x0006B0, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_Add_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0006B8, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_MakeVector_ReturnValue_4) == 0x0006C0, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_MakeVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_GetScaledCapsuleHalfHeight_ReturnValue_1) == 0x0006D8, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_GetScaledCapsuleHalfHeight_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_GetUpVector_ReturnValue_1) == 0x0006E0, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_GetUpVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_Add_DoubleDouble_ReturnValue_4) == 0x0006F8, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_Add_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BanditParentAI_C_ClimbCheck, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000700, "Member 'BanditParentAI_C_ClimbCheck::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
