#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bandit_Mannequin

#include "Basic.hpp"

#include "E_InteractType_structs.hpp"
#include "Engine_structs.hpp"
#include "MainBanditAI_classes.hpp"
#include "E_ActorType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Bandit_Mannequin.Bandit_Mannequin_C
// 0x0010 (0x1620 - 0x1610)
class ABandit_Mannequin_C final : public AMainBanditAI_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Bandit_Mannequin_C;                 // 0x1610(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         Count;                                             // 0x1618(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Crawling_0;                                        // 0x161C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void DestroyInteractable();
	void ExecuteMannequin(class ASurvivalPlayer_C* Killer);
	void ExecuteUbergraph_Bandit_Mannequin(int32 EntryPoint);
	void GetActorType(E_ActorType* ActorType);
	void IsLocked_(bool* Result);
	void OnBeginInteract(class APawn* Player);
	void OnBlendOut_9A19B6754C459B5BFCE125BE80B6DBF1(class FName NotifyName);
	void OnCompleted_9A19B6754C459B5BFCE125BE80B6DBF1(class FName NotifyName);
	void OnFocused(class APawn* Player, class AActor* HighlightActor, class UActorComponent* HighlightActorComponent, E_InteractType* InteractType, double* LateTime);
	void OnInteract(class APawn* Player);
	void OnInteract2(class APawn* Player);
	void OnInteract3(class APawn* Player);
	void OnInteractVehicle(class APawn* Player, int32 SitIndex, bool SkipAnimation);
	void OnInterrupted_9A19B6754C459B5BFCE125BE80B6DBF1(class FName NotifyName);
	void OnLocalInteract(class APawn* Player);
	void OnLostFocus(class APawn* Player);
	void OnNotifyBegin_9A19B6754C459B5BFCE125BE80B6DBF1(class FName NotifyName);
	void OnNotifyEnd_9A19B6754C459B5BFCE125BE80B6DBF1(class FName NotifyName);
	void OnSeen(class APawn* Player);
	void OnSquadCheckComplete();
	void OnStopInteract(class APawn* Player);
	void Run_Lockpicking();
	void Set3DWidgetVisibility(bool Visible);
	void SetTutorial3DWidgetVisibility(bool Visible);
	void ReceivePointDamage(float Param_Damage, const class UDamageType* DamageType, const struct FVector& HitLocation, const struct FVector& HitNormal, class UPrimitiveComponent* Param_HitComponent, class FName BoneName, const struct FVector& ShotFromDirection, class AController* InstigatedBy, class AActor* DamageCauser, const struct FHitResult& HitInfo);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Bandit_Mannequin_C">();
	}
	static class ABandit_Mannequin_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABandit_Mannequin_C>();
	}
};
static_assert(alignof(ABandit_Mannequin_C) == 0x000010, "Wrong alignment on ABandit_Mannequin_C");
static_assert(sizeof(ABandit_Mannequin_C) == 0x001620, "Wrong size on ABandit_Mannequin_C");
static_assert(offsetof(ABandit_Mannequin_C, UberGraphFrame_Bandit_Mannequin_C) == 0x001610, "Member 'ABandit_Mannequin_C::UberGraphFrame_Bandit_Mannequin_C' has a wrong offset!");
static_assert(offsetof(ABandit_Mannequin_C, Count) == 0x001618, "Member 'ABandit_Mannequin_C::Count' has a wrong offset!");
static_assert(offsetof(ABandit_Mannequin_C, Crawling_0) == 0x00161C, "Member 'ABandit_Mannequin_C::Crawling_0' has a wrong offset!");

}

