#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BanditAnim_BP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct BanditAnim_BP.BanditAnim_BP_C.AnimBlueprintGeneratedConstantData
// 0x02DF (0x02E0 - 0x0001)
struct BanditAnim_BP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_2069;                               // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2070;                               // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2071;                               // 0x0014(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2072;                               // 0x001C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2073;                                // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2074;                              // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2075;                               // 0x002C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2076;                                // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2077;                               // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2078;                                // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2079;                               // 0x0044(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2080;                               // 0x004C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2081;                                // 0x0054(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2082;                              // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2083;                               // 0x005C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2084;                                // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_2085;                              // 0x0068(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_2086;                               // 0x0078(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2087;                                // 0x0080(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2088;                               // 0x0084(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2089;                                // 0x008C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2090;                               // 0x0090(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2091;                               // 0x0098(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2092;                               // 0x00A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2093;                                // 0x00A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 __ArrayProperty_2094;                              // 0x00B0(0x0010)(BlueprintVisible)
	class FName                                   __NameProperty_2095;                               // 0x00C0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2096;                                // 0x00C8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_2097;                              // 0x00D0(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_2098;                              // 0x00E0(0x0010)(BlueprintVisible)
	class FName                                   __NameProperty_2099;                               // 0x00F0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_2100;                              // 0x00F8(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_2101;                               // 0x0108(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2102;                               // 0x0110(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2103;                               // 0x0118(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 __ArrayProperty_2104;                              // 0x0120(0x0010)(BlueprintVisible)
	float                                         __FloatProperty_2105;                              // 0x0130(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2106;                               // 0x0134(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2107;                                // 0x013C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_2108;                             // 0x0140(0x002C)(BlueprintVisible, NoDestructor)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_2109;                              // 0x0170(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_2110;                              // 0x0180(0x0010)(BlueprintVisible)
	float                                         __FloatProperty_2111;                              // 0x0190(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_2112;                               // 0x0194(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_195[0x3];                                      // 0x0195(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_2113;                              // 0x0198(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_2114;                              // 0x01A8(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_2115;                              // 0x01B8(0x0010)(BlueprintVisible, EditFixedSize)
	EAnimGroupRole                                __ByteProperty_2116;                               // 0x01C8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_2117;                               // 0x01C9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CA[0x2];                                      // 0x01CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_2118;                              // 0x01CC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_2119;                               // 0x01D0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_2120;                               // 0x01D1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D2[0x2];                                      // 0x01D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_2121;                               // 0x01D4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2122;                                // 0x01DC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2123;                               // 0x01E0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2124;                                // 0x01E8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_2125;                               // 0x01F0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_2126;                                 // 0x01F8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_2127;                               // 0x0200(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_2128;                               // 0x0201(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_2129;                               // 0x0202(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_203[0x5];                                      // 0x0203(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_2130;                              // 0x0208(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_2131;                               // 0x0218(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2132;                               // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_2133;                             // 0x0228(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0248(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x02C8(0x0018)()
};
static_assert(alignof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on BanditAnim_BP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData) == 0x0002E0, "Wrong size on BanditAnim_BP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __NameProperty_2069) == 0x000004, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__NameProperty_2069' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __NameProperty_2070) == 0x00000C, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__NameProperty_2070' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __NameProperty_2071) == 0x000014, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__NameProperty_2071' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __NameProperty_2072) == 0x00001C, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__NameProperty_2072' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __IntProperty_2073) == 0x000024, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__IntProperty_2073' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __FloatProperty_2074) == 0x000028, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__FloatProperty_2074' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __NameProperty_2075) == 0x00002C, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__NameProperty_2075' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __IntProperty_2076) == 0x000034, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__IntProperty_2076' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __NameProperty_2077) == 0x000038, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__NameProperty_2077' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __IntProperty_2078) == 0x000040, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__IntProperty_2078' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __NameProperty_2079) == 0x000044, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__NameProperty_2079' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __NameProperty_2080) == 0x00004C, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__NameProperty_2080' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __IntProperty_2081) == 0x000054, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__IntProperty_2081' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __FloatProperty_2082) == 0x000058, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__FloatProperty_2082' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __NameProperty_2083) == 0x00005C, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__NameProperty_2083' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __IntProperty_2084) == 0x000064, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__IntProperty_2084' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2085) == 0x000068, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2085' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __NameProperty_2086) == 0x000078, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__NameProperty_2086' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __IntProperty_2087) == 0x000080, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__IntProperty_2087' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __NameProperty_2088) == 0x000084, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__NameProperty_2088' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __IntProperty_2089) == 0x00008C, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__IntProperty_2089' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __NameProperty_2090) == 0x000090, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__NameProperty_2090' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __NameProperty_2091) == 0x000098, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__NameProperty_2091' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __NameProperty_2092) == 0x0000A0, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__NameProperty_2092' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __IntProperty_2093) == 0x0000A8, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__IntProperty_2093' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2094) == 0x0000B0, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2094' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __NameProperty_2095) == 0x0000C0, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__NameProperty_2095' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __IntProperty_2096) == 0x0000C8, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__IntProperty_2096' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2097) == 0x0000D0, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2097' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2098) == 0x0000E0, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2098' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __NameProperty_2099) == 0x0000F0, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__NameProperty_2099' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2100) == 0x0000F8, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2100' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __NameProperty_2101) == 0x000108, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__NameProperty_2101' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __NameProperty_2102) == 0x000110, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__NameProperty_2102' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __NameProperty_2103) == 0x000118, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__NameProperty_2103' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2104) == 0x000120, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2104' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __FloatProperty_2105) == 0x000130, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__FloatProperty_2105' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __NameProperty_2106) == 0x000134, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__NameProperty_2106' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __IntProperty_2107) == 0x00013C, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__IntProperty_2107' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __StructProperty_2108) == 0x000140, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__StructProperty_2108' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2109) == 0x000170, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2109' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2110) == 0x000180, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2110' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __FloatProperty_2111) == 0x000190, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__FloatProperty_2111' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __EnumProperty_2112) == 0x000194, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__EnumProperty_2112' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2113) == 0x000198, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2113' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2114) == 0x0001A8, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2114' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2115) == 0x0001B8, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2115' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __ByteProperty_2116) == 0x0001C8, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__ByteProperty_2116' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __BoolProperty_2117) == 0x0001C9, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__BoolProperty_2117' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __FloatProperty_2118) == 0x0001CC, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__FloatProperty_2118' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __EnumProperty_2119) == 0x0001D0, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__EnumProperty_2119' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __ByteProperty_2120) == 0x0001D1, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__ByteProperty_2120' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __NameProperty_2121) == 0x0001D4, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__NameProperty_2121' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __IntProperty_2122) == 0x0001DC, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__IntProperty_2122' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __NameProperty_2123) == 0x0001E0, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__NameProperty_2123' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __IntProperty_2124) == 0x0001E8, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__IntProperty_2124' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __BlendProfile_2125) == 0x0001F0, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__BlendProfile_2125' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __CurveFloat_2126) == 0x0001F8, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__CurveFloat_2126' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __BoolProperty_2127) == 0x000200, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__BoolProperty_2127' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __EnumProperty_2128) == 0x000201, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__EnumProperty_2128' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __EnumProperty_2129) == 0x000202, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__EnumProperty_2129' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2130) == 0x000208, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2130' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __NameProperty_2131) == 0x000218, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__NameProperty_2131' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __NameProperty_2132) == 0x000220, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__NameProperty_2132' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, __StructProperty_2133) == 0x000228, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::__StructProperty_2133' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000248, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(BanditAnim_BP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0002C8, "Member 'BanditAnim_BP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct BanditAnim_BP.BanditAnim_BP_C.AnimBlueprintGeneratedMutableData
// 0x020B (0x020C - 0x0001)
struct BanditAnim_BP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_0;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_3;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_4;                                  // 0x0018(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_5;                                  // 0x0019(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_6;                                 // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_7;                                  // 0x0020(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_8;                                 // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_9;                                  // 0x0028(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_10;                                 // 0x0029(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_11;                                 // 0x002A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_12;                                 // 0x002B(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_13;                                 // 0x002C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_14;                                 // 0x002D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_15;                                 // 0x002E(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_16;                                 // 0x002F(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_17;                                 // 0x0030(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_18;                                 // 0x0031(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_19;                                 // 0x0032(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33[0x1];                                       // 0x0033(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_20;                                // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_21;                                // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_22;                                // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_23;                                // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_24;                                // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_25;                                // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_26;                                // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_27;                                // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_28;                                // 0x0054(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_29;                                // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_30;                                 // 0x005C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_31;                                 // 0x005D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_32;                                 // 0x005E(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_33;                                 // 0x005F(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_34;                                // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_35;                                // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_36;                                // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_37;                                // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_38;                                // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_39;                                // 0x0074(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_40;                                // 0x0078(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_41;                                // 0x007C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_42;                                 // 0x0080(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_43;                                // 0x0084(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_44;                                // 0x0088(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_45;                                 // 0x008C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_46;                                // 0x0090(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_47;                                // 0x0094(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_48;                                 // 0x0098(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_49;                                // 0x009C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_50;                                // 0x00A0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_51;                                // 0x00A4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_52;                                // 0x00A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_53;                                // 0x00AC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_54;                                // 0x00B0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_55;                                // 0x00B4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_56;                                // 0x00B8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_57;                                // 0x00BC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_58;                                // 0x00C0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_59;                                // 0x00C4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_60;                                // 0x00C8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_61;                                // 0x00CC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_62;                                // 0x00D0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_63;                                 // 0x00D4(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_64;                                 // 0x00D5(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_65;                                 // 0x00D6(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D7[0x1];                                       // 0x00D7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_66;                                // 0x00D8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_67;                                 // 0x00DC(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_68;                                // 0x00E0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_69;                                // 0x00E4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_70;                                // 0x00E8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_71;                                // 0x00EC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_72;                                // 0x00F0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_73;                                 // 0x00F4(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_74;                                // 0x00F8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_75;                                // 0x00FC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_76;                                // 0x0100(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_77;                                // 0x0104(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_78;                                // 0x0108(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_79;                                // 0x010C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_80;                                // 0x0110(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_81;                                // 0x0114(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_82;                                // 0x0118(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_83;                                // 0x011C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_84;                                // 0x0120(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_85;                                 // 0x0124(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_86;                                // 0x0128(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_87;                                // 0x012C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_88;                                // 0x0130(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_89;                                // 0x0134(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_90;                                // 0x0138(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_91;                                // 0x013C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_92;                                // 0x0140(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_93;                                // 0x0144(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_94;                                // 0x0148(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_95;                                // 0x014C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_96;                                // 0x0150(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_97;                                // 0x0154(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_98;                                // 0x0158(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_99;                                 // 0x015C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15D[0x3];                                      // 0x015D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_100;                               // 0x0160(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_101;                               // 0x0164(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_102;                               // 0x0168(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_103;                               // 0x016C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_104;                               // 0x0170(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_105;                               // 0x0174(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_106;                               // 0x0178(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_107;                               // 0x017C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_108;                               // 0x0180(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_109;                               // 0x0184(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_110;                               // 0x0188(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_111;                               // 0x018C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_112;                               // 0x0190(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_113;                               // 0x0194(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_114;                               // 0x0198(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_115;                                // 0x019C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19D[0x3];                                      // 0x019D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_116;                               // 0x01A0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_117;                               // 0x01A4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_118;                               // 0x01A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_119;                               // 0x01AC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_120;                               // 0x01B0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_121;                               // 0x01B4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_122;                               // 0x01B8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_123;                               // 0x01BC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_124;                               // 0x01C0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_125;                               // 0x01C4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_126;                               // 0x01C8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_127;                               // 0x01CC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_128;                               // 0x01D0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_129;                               // 0x01D4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_130;                                // 0x01D8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_131;                               // 0x01DC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_132;                               // 0x01E0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_133;                               // 0x01E4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_134;                               // 0x01E8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_135;                               // 0x01EC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_136;                               // 0x01F0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_137;                                // 0x01F4(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_138;                                // 0x01F5(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
