#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BarParent

#include "Basic.hpp"

#include "E_InteractType_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "E_ActorType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BarParent.BarParent_C
// 0x0118 (0x03A8 - 0x0290)
class ABarParent_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        Start_Location4;                                   // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Start_Location3;                                   // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Start_Location2;                                   // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        ExitDot;                                           // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Start_Location1;                                   // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           SitAnim;                                           // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           StartSit;                                          // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           EndSit;                                            // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           Places;                                            // 0x02F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FName, bool>                       Place;                                             // 0x0300(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UPlayerCutsceneComponent_C*             CutsceneEnded;                                     // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ULevelSequence*                         Sequence;                                          // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Sit;                                               // 0x0360(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      Player;                                            // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ULevelSequence*                         SequenceExit;                                      // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<bool>                                  PlaceArray;                                        // 0x0378(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnInstance)
	int32                                         Index_BarParent_C;                                 // 0x0388(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38C[0x4];                                      // 0x038C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ASurvivalPlayer_C*>              SitPlayers;                                        // 0x0390(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class UAnimMontage*                           SitAnimFemale;                                     // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AddFoodPlaces();
	void CheckPlace(class FName* StartPlace, class FName* SitPlace);
	void CheckPlaceByBool(class FName* StartPlace, class FName* SitPlace);
	void CollisionSwitcher(bool On_);
	void CutsceneEnding();
	void CutSceneExit(class ASurvivalPlayer_C* Param_Player);
	void DestroyInteractable();
	void ExecuteUbergraph_BarParent(int32 EntryPoint);
	void FindEmptySlot(class USceneComponent** Output, int32* Param_Index);
	void GetActorType(E_ActorType* ActorType);
	void IsLocked_(bool* Result);
	void OnBeginInteract(class APawn* Param_Player);
	void OnBlendOut_B04013B842C91A74A0D4EB9ED97CBCD8(class FName NotifyName);
	void OnCompleted_B04013B842C91A74A0D4EB9ED97CBCD8(class FName NotifyName);
	void OnCutsceneStart(class ASurvivalPlayer_C* Param_Player);
	void OnExitBar(int32 PlaceIndex);
	void OnFocused(class APawn* Param_Player, class AActor* HighlightActor, class UActorComponent* HighlightActorComponent, E_InteractType* InteractType, double* LateTime);
	void OnInteract(class APawn* Param_Player);
	void OnInteract2(class APawn* Param_Player);
	void OnInteract3(class APawn* Param_Player);
	void OnInteractVehicle(class APawn* Param_Player, int32 SitIndex, bool SkipAnimation);
	void OnInterrupted_B04013B842C91A74A0D4EB9ED97CBCD8(class FName NotifyName);
	void OnLocalInteract(class APawn* Param_Player);
	void OnLostFocus(class APawn* Param_Player);
	void OnNotifyBegin_B04013B842C91A74A0D4EB9ED97CBCD8(class FName NotifyName);
	void OnNotifyEnd_B04013B842C91A74A0D4EB9ED97CBCD8(class FName NotifyName);
	void OnSeen(class APawn* Param_Player);
	void OnSquadCheckComplete();
	void OnStopInteract(class APawn* Param_Player);
	void ReceiveBeginPlay();
	void Run_Lockpicking();
	void Set3DWidgetVisibility(bool Visible);
	void SetTutorial3DWidgetVisibility(bool Visible);
	void SitEvent(class ASurvivalPlayer_C* Param_Player, bool Param_Sit, int32 Param_Index);
	void SitEventMulti(class ASurvivalPlayer_C* Param_Player, bool Param_Sit, int32 Param_Index);
	void SitEventServer(class ASurvivalPlayer_C* Param_Player, bool Param_Sit);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BarParent_C">();
	}
	static class ABarParent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABarParent_C>();
	}
};
static_assert(alignof(ABarParent_C) == 0x000008, "Wrong alignment on ABarParent_C");
static_assert(sizeof(ABarParent_C) == 0x0003A8, "Wrong size on ABarParent_C");
static_assert(offsetof(ABarParent_C, UberGraphFrame) == 0x000290, "Member 'ABarParent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABarParent_C, Start_Location4) == 0x000298, "Member 'ABarParent_C::Start_Location4' has a wrong offset!");
static_assert(offsetof(ABarParent_C, Start_Location3) == 0x0002A0, "Member 'ABarParent_C::Start_Location3' has a wrong offset!");
static_assert(offsetof(ABarParent_C, Start_Location2) == 0x0002A8, "Member 'ABarParent_C::Start_Location2' has a wrong offset!");
static_assert(offsetof(ABarParent_C, ExitDot) == 0x0002B0, "Member 'ABarParent_C::ExitDot' has a wrong offset!");
static_assert(offsetof(ABarParent_C, Box) == 0x0002B8, "Member 'ABarParent_C::Box' has a wrong offset!");
static_assert(offsetof(ABarParent_C, Start_Location1) == 0x0002C0, "Member 'ABarParent_C::Start_Location1' has a wrong offset!");
static_assert(offsetof(ABarParent_C, StaticMesh) == 0x0002C8, "Member 'ABarParent_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABarParent_C, Scene) == 0x0002D0, "Member 'ABarParent_C::Scene' has a wrong offset!");
static_assert(offsetof(ABarParent_C, SitAnim) == 0x0002D8, "Member 'ABarParent_C::SitAnim' has a wrong offset!");
static_assert(offsetof(ABarParent_C, StartSit) == 0x0002E0, "Member 'ABarParent_C::StartSit' has a wrong offset!");
static_assert(offsetof(ABarParent_C, EndSit) == 0x0002E8, "Member 'ABarParent_C::EndSit' has a wrong offset!");
static_assert(offsetof(ABarParent_C, Places) == 0x0002F0, "Member 'ABarParent_C::Places' has a wrong offset!");
static_assert(offsetof(ABarParent_C, Place) == 0x000300, "Member 'ABarParent_C::Place' has a wrong offset!");
static_assert(offsetof(ABarParent_C, CutsceneEnded) == 0x000350, "Member 'ABarParent_C::CutsceneEnded' has a wrong offset!");
static_assert(offsetof(ABarParent_C, Sequence) == 0x000358, "Member 'ABarParent_C::Sequence' has a wrong offset!");
static_assert(offsetof(ABarParent_C, Sit) == 0x000360, "Member 'ABarParent_C::Sit' has a wrong offset!");
static_assert(offsetof(ABarParent_C, Player) == 0x000368, "Member 'ABarParent_C::Player' has a wrong offset!");
static_assert(offsetof(ABarParent_C, SequenceExit) == 0x000370, "Member 'ABarParent_C::SequenceExit' has a wrong offset!");
static_assert(offsetof(ABarParent_C, PlaceArray) == 0x000378, "Member 'ABarParent_C::PlaceArray' has a wrong offset!");
static_assert(offsetof(ABarParent_C, Index_BarParent_C) == 0x000388, "Member 'ABarParent_C::Index_BarParent_C' has a wrong offset!");
static_assert(offsetof(ABarParent_C, SitPlayers) == 0x000390, "Member 'ABarParent_C::SitPlayers' has a wrong offset!");
static_assert(offsetof(ABarParent_C, SitAnimFemale) == 0x0003A0, "Member 'ABarParent_C::SitAnimFemale' has a wrong offset!");

}

