#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BarParent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_InteractType_structs.hpp"
#include "E_ActorType_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BarParent.BarParent_C.CheckPlace
// 0x02B8 (0x02B8 - 0x0000)
struct BarParent_C_CheckPlace final
{
public:
	class FName                                   StartPlace;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SitPlace;                                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0028(0x0010)(ConstParm, ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartsWith_ReturnValue;                   // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_CapsuleTraceSingle_OutHit;                // 0x0090(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_CapsuleTraceSingle_ReturnValue;           // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSubstring_ReturnValue;                 // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_192[0x2];                                      // 0x0192(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0210(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0238(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0250(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0268(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_281[0x3];                                      // 0x0281(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0284(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x028C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x029C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29D[0x3];                                      // 0x029D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetAllSocketNames_ReturnValue;            // 0x02A8(0x0010)(ReferenceParm)
};
static_assert(alignof(BarParent_C_CheckPlace) == 0x000008, "Wrong alignment on BarParent_C_CheckPlace");
static_assert(sizeof(BarParent_C_CheckPlace) == 0x0002B8, "Wrong size on BarParent_C_CheckPlace");
static_assert(offsetof(BarParent_C_CheckPlace, StartPlace) == 0x000000, "Member 'BarParent_C_CheckPlace::StartPlace' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlace, SitPlace) == 0x000008, "Member 'BarParent_C_CheckPlace::SitPlace' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlace, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BarParent_C_CheckPlace::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlace, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'BarParent_C_CheckPlace::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlace, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'BarParent_C_CheckPlace::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlace, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'BarParent_C_CheckPlace::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlace, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BarParent_C_CheckPlace::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlace, Temp_int_Array_Index_Variable_1) == 0x000024, "Member 'BarParent_C_CheckPlace::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlace, Temp_object_Variable) == 0x000028, "Member 'BarParent_C_CheckPlace::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlace, CallFunc_Array_Get_Item) == 0x000038, "Member 'BarParent_C_CheckPlace::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlace, CallFunc_Conv_NameToString_ReturnValue) == 0x000040, "Member 'BarParent_C_CheckPlace::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlace, CallFunc_StartsWith_ReturnValue) == 0x000050, "Member 'BarParent_C_CheckPlace::CallFunc_StartsWith_ReturnValue' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlace, Temp_int_Loop_Counter_Variable_1) == 0x000054, "Member 'BarParent_C_CheckPlace::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlace, CallFunc_Array_Get_Item_1) == 0x000058, "Member 'BarParent_C_CheckPlace::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlace, CallFunc_Conv_NameToString_ReturnValue_1) == 0x000060, "Member 'BarParent_C_CheckPlace::CallFunc_Conv_NameToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlace, CallFunc_GetSocketLocation_ReturnValue) == 0x000070, "Member 'BarParent_C_CheckPlace::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlace, CallFunc_Len_ReturnValue) == 0x000088, "Member 'BarParent_C_CheckPlace::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlace, CallFunc_CapsuleTraceSingle_OutHit) == 0x000090, "Member 'BarParent_C_CheckPlace::CallFunc_CapsuleTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlace, CallFunc_CapsuleTraceSingle_ReturnValue) == 0x000178, "Member 'BarParent_C_CheckPlace::CallFunc_CapsuleTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlace, CallFunc_Subtract_IntInt_ReturnValue) == 0x00017C, "Member 'BarParent_C_CheckPlace::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlace, CallFunc_GetSubstring_ReturnValue) == 0x000180, "Member 'BarParent_C_CheckPlace::CallFunc_GetSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlace, CallFunc_BreakHitResult_bBlockingHit) == 0x000190, "Member 'BarParent_C_CheckPlace::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlace, CallFunc_BreakHitResult_bInitialOverlap) == 0x000191, "Member 'BarParent_C_CheckPlace::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlace, CallFunc_BreakHitResult_Time) == 0x000194, "Member 'BarParent_C_CheckPlace::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlace, CallFunc_BreakHitResult_Distance) == 0x000198, "Member 'BarParent_C_CheckPlace::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlace, CallFunc_BreakHitResult_Location) == 0x0001A0, "Member 'BarParent_C_CheckPlace::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlace, CallFunc_BreakHitResult_ImpactPoint) == 0x0001B8, "Member 'BarParent_C_CheckPlace::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlace, CallFunc_BreakHitResult_Normal) == 0x0001D0, "Member 'BarParent_C_CheckPlace::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlace, CallFunc_BreakHitResult_ImpactNormal) == 0x0001E8, "Member 'BarParent_C_CheckPlace::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlace, CallFunc_BreakHitResult_PhysMat) == 0x000200, "Member 'BarParent_C_CheckPlace::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlace, CallFunc_BreakHitResult_HitActor) == 0x000208, "Member 'BarParent_C_CheckPlace::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlace, CallFunc_BreakHitResult_HitComponent) == 0x000210, "Member 'BarParent_C_CheckPlace::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlace, CallFunc_BreakHitResult_HitBoneName) == 0x000218, "Member 'BarParent_C_CheckPlace::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlace, CallFunc_BreakHitResult_BoneName) == 0x000220, "Member 'BarParent_C_CheckPlace::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlace, CallFunc_BreakHitResult_HitItem) == 0x000228, "Member 'BarParent_C_CheckPlace::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlace, CallFunc_BreakHitResult_ElementIndex) == 0x00022C, "Member 'BarParent_C_CheckPlace::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlace, CallFunc_BreakHitResult_FaceIndex) == 0x000230, "Member 'BarParent_C_CheckPlace::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlace, CallFunc_BreakHitResult_TraceStart) == 0x000238, "Member 'BarParent_C_CheckPlace::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlace, CallFunc_BreakHitResult_TraceEnd) == 0x000250, "Member 'BarParent_C_CheckPlace::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlace, CallFunc_Concat_StrStr_ReturnValue) == 0x000268, "Member 'BarParent_C_CheckPlace::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlace, K2Node_DynamicCast_AsSurvival_Player) == 0x000278, "Member 'BarParent_C_CheckPlace::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlace, K2Node_DynamicCast_bSuccess) == 0x000280, "Member 'BarParent_C_CheckPlace::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlace, CallFunc_Conv_StringToName_ReturnValue) == 0x000284, "Member 'BarParent_C_CheckPlace::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlace, CallFunc_Conv_StringToName_ReturnValue_1) == 0x00028C, "Member 'BarParent_C_CheckPlace::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlace, CallFunc_Add_IntInt_ReturnValue_1) == 0x000294, "Member 'BarParent_C_CheckPlace::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlace, CallFunc_Array_Length_ReturnValue_1) == 0x000298, "Member 'BarParent_C_CheckPlace::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlace, CallFunc_Less_IntInt_ReturnValue_1) == 0x00029C, "Member 'BarParent_C_CheckPlace::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlace, CallFunc_Array_AddUnique_ReturnValue) == 0x0002A0, "Member 'BarParent_C_CheckPlace::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlace, CallFunc_GetAllSocketNames_ReturnValue) == 0x0002A8, "Member 'BarParent_C_CheckPlace::CallFunc_GetAllSocketNames_ReturnValue' has a wrong offset!");

// Function BarParent.BarParent_C.CheckPlaceByBool
// 0x0120 (0x0120 - 0x0000)
struct BarParent_C_CheckPlaceByBool final
{
public:
	class FName                                   StartPlace;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SitPlace;                                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0020(0x0010)(ConstParm, ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartsWith_ReturnValue;                   // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_Map_Keys_Keys;                            // 0x0058(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_Value;                           // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Len_ReturnValue;                          // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSubstring_ReturnValue;                 // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00C4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x00D0(0x0010)(ConstParm, ReferenceParm)
	TArray<class FName>                           CallFunc_GetAllSocketNames_ReturnValue;            // 0x00E0(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_CapsuleOverlapActors_OutActors;           // 0x0108(0x0010)(ReferenceParm)
	bool                                          CallFunc_CapsuleOverlapActors_ReturnValue;         // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BarParent_C_CheckPlaceByBool) == 0x000008, "Wrong alignment on BarParent_C_CheckPlaceByBool");
static_assert(sizeof(BarParent_C_CheckPlaceByBool) == 0x000120, "Wrong size on BarParent_C_CheckPlaceByBool");
static_assert(offsetof(BarParent_C_CheckPlaceByBool, StartPlace) == 0x000000, "Member 'BarParent_C_CheckPlaceByBool::StartPlace' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlaceByBool, SitPlace) == 0x000008, "Member 'BarParent_C_CheckPlaceByBool::SitPlace' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlaceByBool, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'BarParent_C_CheckPlaceByBool::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlaceByBool, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'BarParent_C_CheckPlaceByBool::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlaceByBool, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BarParent_C_CheckPlaceByBool::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlaceByBool, Temp_int_Array_Index_Variable_1) == 0x00001C, "Member 'BarParent_C_CheckPlaceByBool::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlaceByBool, Temp_object_Variable) == 0x000020, "Member 'BarParent_C_CheckPlaceByBool::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlaceByBool, CallFunc_Array_Get_Item) == 0x000030, "Member 'BarParent_C_CheckPlaceByBool::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlaceByBool, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'BarParent_C_CheckPlaceByBool::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlaceByBool, CallFunc_Conv_NameToString_ReturnValue) == 0x000040, "Member 'BarParent_C_CheckPlaceByBool::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlaceByBool, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'BarParent_C_CheckPlaceByBool::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlaceByBool, CallFunc_StartsWith_ReturnValue) == 0x000051, "Member 'BarParent_C_CheckPlaceByBool::CallFunc_StartsWith_ReturnValue' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlaceByBool, Temp_int_Loop_Counter_Variable_1) == 0x000054, "Member 'BarParent_C_CheckPlaceByBool::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlaceByBool, CallFunc_Map_Keys_Keys) == 0x000058, "Member 'BarParent_C_CheckPlaceByBool::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlaceByBool, CallFunc_Add_IntInt_ReturnValue_1) == 0x000068, "Member 'BarParent_C_CheckPlaceByBool::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlaceByBool, CallFunc_Array_Get_Item_1) == 0x00006C, "Member 'BarParent_C_CheckPlaceByBool::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlaceByBool, CallFunc_Conv_NameToString_ReturnValue_1) == 0x000078, "Member 'BarParent_C_CheckPlaceByBool::CallFunc_Conv_NameToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlaceByBool, CallFunc_Map_Find_Value) == 0x000088, "Member 'BarParent_C_CheckPlaceByBool::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlaceByBool, CallFunc_Map_Find_ReturnValue) == 0x000089, "Member 'BarParent_C_CheckPlaceByBool::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlaceByBool, CallFunc_Len_ReturnValue) == 0x00008C, "Member 'BarParent_C_CheckPlaceByBool::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlaceByBool, CallFunc_Subtract_IntInt_ReturnValue) == 0x000090, "Member 'BarParent_C_CheckPlaceByBool::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlaceByBool, CallFunc_GetSubstring_ReturnValue) == 0x000098, "Member 'BarParent_C_CheckPlaceByBool::CallFunc_GetSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlaceByBool, CallFunc_Array_Length_ReturnValue_1) == 0x0000A8, "Member 'BarParent_C_CheckPlaceByBool::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlaceByBool, CallFunc_Concat_StrStr_ReturnValue) == 0x0000B0, "Member 'BarParent_C_CheckPlaceByBool::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlaceByBool, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000C0, "Member 'BarParent_C_CheckPlaceByBool::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlaceByBool, CallFunc_Conv_StringToName_ReturnValue) == 0x0000C4, "Member 'BarParent_C_CheckPlaceByBool::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlaceByBool, K2Node_MakeArray_Array) == 0x0000D0, "Member 'BarParent_C_CheckPlaceByBool::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlaceByBool, CallFunc_GetAllSocketNames_ReturnValue) == 0x0000E0, "Member 'BarParent_C_CheckPlaceByBool::CallFunc_GetAllSocketNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlaceByBool, CallFunc_GetSocketLocation_ReturnValue) == 0x0000F0, "Member 'BarParent_C_CheckPlaceByBool::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlaceByBool, CallFunc_CapsuleOverlapActors_OutActors) == 0x000108, "Member 'BarParent_C_CheckPlaceByBool::CallFunc_CapsuleOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(BarParent_C_CheckPlaceByBool, CallFunc_CapsuleOverlapActors_ReturnValue) == 0x000118, "Member 'BarParent_C_CheckPlaceByBool::CallFunc_CapsuleOverlapActors_ReturnValue' has a wrong offset!");

// Function BarParent.BarParent_C.CollisionSwitcher
// 0x0001 (0x0001 - 0x0000)
struct BarParent_C_CollisionSwitcher final
{
public:
	bool                                          On_;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BarParent_C_CollisionSwitcher) == 0x000001, "Wrong alignment on BarParent_C_CollisionSwitcher");
static_assert(sizeof(BarParent_C_CollisionSwitcher) == 0x000001, "Wrong size on BarParent_C_CollisionSwitcher");
static_assert(offsetof(BarParent_C_CollisionSwitcher, On_) == 0x000000, "Member 'BarParent_C_CollisionSwitcher::On_' has a wrong offset!");

// Function BarParent.BarParent_C.CutSceneExit
// 0x0008 (0x0008 - 0x0000)
struct BarParent_C_CutSceneExit final
{
public:
	class ASurvivalPlayer_C*                      Param_Player;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BarParent_C_CutSceneExit) == 0x000008, "Wrong alignment on BarParent_C_CutSceneExit");
static_assert(sizeof(BarParent_C_CutSceneExit) == 0x000008, "Wrong size on BarParent_C_CutSceneExit");
static_assert(offsetof(BarParent_C_CutSceneExit, Param_Player) == 0x000000, "Member 'BarParent_C_CutSceneExit::Param_Player' has a wrong offset!");

// Function BarParent.BarParent_C.ExecuteUbergraph_BarParent
// 0x04D0 (0x04D0 - 0x0000)
struct BarParent_C_ExecuteUbergraph_BarParent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x003C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x006C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x007C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0084(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           Temp_object_Variable;                              // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Temp_object_Variable_1;                            // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             Temp_byte_Variable;                                // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             Temp_byte_Variable_1;                              // 0x00AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class USceneComponent*>                K2Node_MakeArray_Array;                            // 0x00E0(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x00F0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_CustomEvent_Player_4;                       // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Sit_2;                          // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Visible_1;                            // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival;                  // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Visible;                              // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_122[0x6];                                      // 0x0122(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_FindEmptySlot_Output;                     // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FindEmptySlot_Index;                      // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_Player_8;                             // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_Player_7;                             // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_Player_6;                             // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_Player_5;                             // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_Player_4;                             // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SitIndex;                             // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_SkipAnimation;                        // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16D[0x3];                                      // 0x016D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_Player_3;                             // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_Player_2;                             // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_Player_1;                             // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_GameHUD_C*                          K2Node_DynamicCast_AsBP_Game_HUD;                  // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_Player;                               // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_CustomEvent_Player_3;                       // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival_1;                // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInHouse_ReturnValue;                    // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_1;        // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_2;        // 0x01EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x01EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x01F0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E9[0x3];                                      // 0x02E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Select_Default;                             // 0x02EC(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_Array_Get_Item;                           // 0x02F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_V2_C*                   K2Node_DynamicCast_AsSurvival_Player_V2;           // 0x0300(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0310(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult_1;     // 0x0328(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue_1;        // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_411[0x7];                                      // 0x0411(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue_1;    // 0x0418(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue_1;        // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_431[0x7];                                      // 0x0431(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0438(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_3;        // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_441[0x7];                                      // 0x0441(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_1;        // 0x0448(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_4;        // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_461[0x7];                                      // 0x0461(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0468(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_CustomEvent_Player_2;                       // 0x0470(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_5;        // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_479[0x7];                                      // 0x0479(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UAnimMontage*                     K2Node_Select_Default_1;                           // 0x0480(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_CustomEvent_Player_1;                       // 0x0488(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Sit_1;                          // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_491[0x3];                                      // 0x0491(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Index_1;                        // 0x0494(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_On_;                            // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             K2Node_Select_Default_2;                           // 0x0499(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_6;        // 0x049A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x049B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49C[0x4];                                      // 0x049C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      K2Node_CustomEvent_Player;                         // 0x04A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Sit;                            // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A9[0x3];                                      // 0x04A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Index;                          // 0x04AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_7;        // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B1[0x7];                                      // 0x04B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_Select_Default_3;                           // 0x04B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x04C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x04C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BarParent_C_ExecuteUbergraph_BarParent) == 0x000008, "Wrong alignment on BarParent_C_ExecuteUbergraph_BarParent");
static_assert(sizeof(BarParent_C_ExecuteUbergraph_BarParent) == 0x0004D0, "Wrong size on BarParent_C_ExecuteUbergraph_BarParent");
static_assert(offsetof(BarParent_C_ExecuteUbergraph_BarParent, EntryPoint) == 0x000000, "Member 'BarParent_C_ExecuteUbergraph_BarParent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BarParent_C_ExecuteUbergraph_BarParent, K2Node_CustomEvent_NotifyName_4) == 0x000004, "Member 'BarParent_C_ExecuteUbergraph_BarParent::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(BarParent_C_ExecuteUbergraph_BarParent, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'BarParent_C_ExecuteUbergraph_BarParent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BarParent_C_ExecuteUbergraph_BarParent, K2Node_CustomEvent_NotifyName_3) == 0x00001C, "Member 'BarParent_C_ExecuteUbergraph_BarParent::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(BarParent_C_ExecuteUbergraph_BarParent, K2Node_CreateDelegate_OutputDelegate_1) == 0x000024, "Member 'BarParent_C_ExecuteUbergraph_BarParent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BarParent_C_ExecuteUbergraph_BarParent, K2Node_CustomEvent_NotifyName_2) == 0x000034, "Member 'BarParent_C_ExecuteUbergraph_BarParent::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(BarParent_C_ExecuteUbergraph_BarParent, K2Node_CreateDelegate_OutputDelegate_2) == 0x00003C, "Member 'BarParent_C_ExecuteUbergraph_BarParent::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BarParent_C_ExecuteUbergraph_BarParent, K2Node_CustomEvent_NotifyName_1) == 0x00004C, "Member 'BarParent_C_ExecuteUbergraph_BarParent::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(BarParent_C_ExecuteUbergraph_BarParent, K2Node_CreateDelegate_OutputDelegate_3) == 0x000054, "Member 'BarParent_C_ExecuteUbergraph_BarParent::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BarParent_C_ExecuteUbergraph_BarParent, K2Node_CustomEvent_NotifyName) == 0x000064, "Member 'BarParent_C_ExecuteUbergraph_BarParent::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(BarParent_C_ExecuteUbergraph_BarParent, K2Node_CreateDelegate_OutputDelegate_4) == 0x00006C, "Member 'BarParent_C_ExecuteUbergraph_BarParent::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BarParent_C_ExecuteUbergraph_BarParent, Temp_name_Variable) == 0x00007C, "Member 'BarParent_C_ExecuteUbergraph_BarParent::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BarParent_C_ExecuteUbergraph_BarParent, K2Node_CreateDelegate_OutputDelegate_5) == 0x000084, "Member 'BarParent_C_ExecuteUbergraph_BarParent::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BarParent_C_ExecuteUbergraph_BarParent, Temp_bool_Variable) == 0x000094, "Member 'BarParent_C_ExecuteUbergraph_BarParent::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BarParent_C_ExecuteUbergraph_BarParent, Temp_object_Variable) == 0x000098, "Member 'BarParent_C_ExecuteUbergraph_BarParent::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BarParent_C_ExecuteUbergraph_BarParent, Temp_object_Variable_1) == 0x0000A0, "Member 'BarParent_C_ExecuteUbergraph_BarParent::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BarParent_C_ExecuteUbergraph_BarParent, Temp_bool_Variable_1) == 0x0000A8, "Member 'BarParent_C_ExecuteUbergraph_BarParent::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BarParent_C_ExecuteUbergraph_BarParent, Temp_bool_Variable_2) == 0x0000A9, "Member 'BarParent_C_ExecuteUbergraph_BarParent::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BarParent_C_ExecuteUbergraph_BarParent, Temp_byte_Variable) == 0x0000AA, "Member 'BarParent_C_ExecuteUbergraph_BarParent::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BarParent_C_ExecuteUbergraph_BarParent, Temp_byte_Variable_1) == 0x0000AB, "Member 'BarParent_C_ExecuteUbergraph_BarParent::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BarParent_C_ExecuteUbergraph_BarParent, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000B0, "Member 'BarParent_C_ExecuteUbergraph_BarParent::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
