#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BasicDecals_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BasicDecals_BP.BasicDecals_BP_C.ExecuteUbergraph_BasicDecals_BP
// 0x0028 (0x0028 - 0x0000)
struct BasicDecals_BP_C_ExecuteUbergraph_BasicDecals_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_2; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_3; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BasicDecals_BP_C_ExecuteUbergraph_BasicDecals_BP) == 0x000008, "Wrong alignment on BasicDecals_BP_C_ExecuteUbergraph_BasicDecals_BP");
static_assert(sizeof(BasicDecals_BP_C_ExecuteUbergraph_BasicDecals_BP) == 0x000028, "Wrong size on BasicDecals_BP_C_ExecuteUbergraph_BasicDecals_BP");
static_assert(offsetof(BasicDecals_BP_C_ExecuteUbergraph_BasicDecals_BP, EntryPoint) == 0x000000, "Member 'BasicDecals_BP_C_ExecuteUbergraph_BasicDecals_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_ExecuteUbergraph_BasicDecals_BP, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'BasicDecals_BP_C_ExecuteUbergraph_BasicDecals_BP::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_ExecuteUbergraph_BasicDecals_BP, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000010, "Member 'BasicDecals_BP_C_ExecuteUbergraph_BasicDecals_BP::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_ExecuteUbergraph_BasicDecals_BP, CallFunc_CreateDynamicMaterialInstance_ReturnValue_2) == 0x000018, "Member 'BasicDecals_BP_C_ExecuteUbergraph_BasicDecals_BP::CallFunc_CreateDynamicMaterialInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_ExecuteUbergraph_BasicDecals_BP, CallFunc_CreateDynamicMaterialInstance_ReturnValue_3) == 0x000020, "Member 'BasicDecals_BP_C_ExecuteUbergraph_BasicDecals_BP::CallFunc_CreateDynamicMaterialInstance_ReturnValue_3' has a wrong offset!");

// Function BasicDecals_BP.BasicDecals_BP_C.SetParams
// 0x01E0 (0x01E0 - 0x0000)
struct BasicDecals_BP_C_SetParams final
{
public:
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentScale_ReturnValue;         // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0030(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakRotIntoAxes_X;                       // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakRotIntoAxes_Y;                       // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakRotIntoAxes_Z;                       // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorInt_ReturnValue;           // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorInt_ReturnValue_1;         // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue_1;   // 0x0160(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue_2;   // 0x0170(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorInt_ReturnValue_2;         // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue_3;   // 0x0198(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_2; // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_3; // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_4; // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_5; // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_6; // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_7; // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_8; // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_9; // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_10; // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_11; // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BasicDecals_BP_C_SetParams) == 0x000010, "Wrong alignment on BasicDecals_BP_C_SetParams");
static_assert(sizeof(BasicDecals_BP_C_SetParams) == 0x0001E0, "Wrong size on BasicDecals_BP_C_SetParams");
static_assert(offsetof(BasicDecals_BP_C_SetParams, CallFunc_SelectFloat_ReturnValue) == 0x000000, "Member 'BasicDecals_BP_C_SetParams::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_SetParams, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BasicDecals_BP_C_SetParams::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_SetParams, CallFunc_K2_GetComponentScale_ReturnValue) == 0x000010, "Member 'BasicDecals_BP_C_SetParams::CallFunc_K2_GetComponentScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_SetParams, CallFunc_GetTransform_ReturnValue) == 0x000030, "Member 'BasicDecals_BP_C_SetParams::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_SetParams, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x000090, "Member 'BasicDecals_BP_C_SetParams::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_SetParams, CallFunc_BreakTransform_Location) == 0x0000A0, "Member 'BasicDecals_BP_C_SetParams::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_SetParams, CallFunc_BreakTransform_Rotation) == 0x0000B8, "Member 'BasicDecals_BP_C_SetParams::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_SetParams, CallFunc_BreakTransform_Scale) == 0x0000D0, "Member 'BasicDecals_BP_C_SetParams::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_SetParams, CallFunc_BreakRotIntoAxes_X) == 0x0000E8, "Member 'BasicDecals_BP_C_SetParams::CallFunc_BreakRotIntoAxes_X' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_SetParams, CallFunc_BreakRotIntoAxes_Y) == 0x000100, "Member 'BasicDecals_BP_C_SetParams::CallFunc_BreakRotIntoAxes_Y' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_SetParams, CallFunc_BreakRotIntoAxes_Z) == 0x000118, "Member 'BasicDecals_BP_C_SetParams::CallFunc_BreakRotIntoAxes_Z' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_SetParams, CallFunc_Multiply_VectorInt_ReturnValue) == 0x000130, "Member 'BasicDecals_BP_C_SetParams::CallFunc_Multiply_VectorInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_SetParams, CallFunc_Multiply_VectorInt_ReturnValue_1) == 0x000148, "Member 'BasicDecals_BP_C_SetParams::CallFunc_Multiply_VectorInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_SetParams, CallFunc_Conv_VectorToLinearColor_ReturnValue_1) == 0x000160, "Member 'BasicDecals_BP_C_SetParams::CallFunc_Conv_VectorToLinearColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_SetParams, CallFunc_Conv_VectorToLinearColor_ReturnValue_2) == 0x000170, "Member 'BasicDecals_BP_C_SetParams::CallFunc_Conv_VectorToLinearColor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_SetParams, CallFunc_Multiply_VectorInt_ReturnValue_2) == 0x000180, "Member 'BasicDecals_BP_C_SetParams::CallFunc_Multiply_VectorInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_SetParams, CallFunc_Conv_VectorToLinearColor_ReturnValue_3) == 0x000198, "Member 'BasicDecals_BP_C_SetParams::CallFunc_Conv_VectorToLinearColor_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_SetParams, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x0001A8, "Member 'BasicDecals_BP_C_SetParams::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_SetParams, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x0001AC, "Member 'BasicDecals_BP_C_SetParams::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_SetParams, CallFunc_SetScalarParameterValue_Value_ImplicitCast_2) == 0x0001B0, "Member 'BasicDecals_BP_C_SetParams::CallFunc_SetScalarParameterValue_Value_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_SetParams, CallFunc_SetScalarParameterValue_Value_ImplicitCast_3) == 0x0001B4, "Member 'BasicDecals_BP_C_SetParams::CallFunc_SetScalarParameterValue_Value_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_SetParams, CallFunc_SetScalarParameterValue_Value_ImplicitCast_4) == 0x0001B8, "Member 'BasicDecals_BP_C_SetParams::CallFunc_SetScalarParameterValue_Value_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_SetParams, CallFunc_SetScalarParameterValue_Value_ImplicitCast_5) == 0x0001BC, "Member 'BasicDecals_BP_C_SetParams::CallFunc_SetScalarParameterValue_Value_ImplicitCast_5' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_SetParams, CallFunc_SetScalarParameterValue_Value_ImplicitCast_6) == 0x0001C0, "Member 'BasicDecals_BP_C_SetParams::CallFunc_SetScalarParameterValue_Value_ImplicitCast_6' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_SetParams, CallFunc_SetScalarParameterValue_Value_ImplicitCast_7) == 0x0001C4, "Member 'BasicDecals_BP_C_SetParams::CallFunc_SetScalarParameterValue_Value_ImplicitCast_7' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_SetParams, CallFunc_SetScalarParameterValue_Value_ImplicitCast_8) == 0x0001C8, "Member 'BasicDecals_BP_C_SetParams::CallFunc_SetScalarParameterValue_Value_ImplicitCast_8' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_SetParams, CallFunc_SetScalarParameterValue_Value_ImplicitCast_9) == 0x0001CC, "Member 'BasicDecals_BP_C_SetParams::CallFunc_SetScalarParameterValue_Value_ImplicitCast_9' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_SetParams, CallFunc_SetScalarParameterValue_Value_ImplicitCast_10) == 0x0001D0, "Member 'BasicDecals_BP_C_SetParams::CallFunc_SetScalarParameterValue_Value_ImplicitCast_10' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_SetParams, CallFunc_SetScalarParameterValue_Value_ImplicitCast_11) == 0x0001D4, "Member 'BasicDecals_BP_C_SetParams::CallFunc_SetScalarParameterValue_Value_ImplicitCast_11' has a wrong offset!");

// Function BasicDecals_BP.BasicDecals_BP_C.UpdateTransforms
// 0x0360 (0x0360 - 0x0000)
struct BasicDecals_BP_C_UpdateTransforms final
{
public:
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentScale_ReturnValue;         // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_GetAbs_ReturnValue;                // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue;              // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_GetAbs_ReturnValue_1;              // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue_1;               // 0x01D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x01F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_208[0x8];                                      // 0x0208(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0210(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x0270(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BasicDecals_BP_C_UpdateTransforms) == 0x000010, "Wrong alignment on BasicDecals_BP_C_UpdateTransforms");
static_assert(sizeof(BasicDecals_BP_C_UpdateTransforms) == 0x000360, "Wrong size on BasicDecals_BP_C_UpdateTransforms");
static_assert(offsetof(BasicDecals_BP_C_UpdateTransforms, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000000, "Member 'BasicDecals_BP_C_UpdateTransforms::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_UpdateTransforms, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000008, "Member 'BasicDecals_BP_C_UpdateTransforms::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_UpdateTransforms, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'BasicDecals_BP_C_UpdateTransforms::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_UpdateTransforms, CallFunc_BreakTransform_Location) == 0x000070, "Member 'BasicDecals_BP_C_UpdateTransforms::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_UpdateTransforms, CallFunc_BreakTransform_Rotation) == 0x000088, "Member 'BasicDecals_BP_C_UpdateTransforms::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_UpdateTransforms, CallFunc_BreakTransform_Scale) == 0x0000A0, "Member 'BasicDecals_BP_C_UpdateTransforms::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_UpdateTransforms, CallFunc_Conv_RotatorToVector_ReturnValue) == 0x0000B8, "Member 'BasicDecals_BP_C_UpdateTransforms::CallFunc_Conv_RotatorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_UpdateTransforms, CallFunc_K2_GetComponentScale_ReturnValue) == 0x0000D0, "Member 'BasicDecals_BP_C_UpdateTransforms::CallFunc_K2_GetComponentScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_UpdateTransforms, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000E8, "Member 'BasicDecals_BP_C_UpdateTransforms::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_UpdateTransforms, CallFunc_Vector_GetAbs_ReturnValue) == 0x000100, "Member 'BasicDecals_BP_C_UpdateTransforms::CallFunc_Vector_GetAbs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_UpdateTransforms, CallFunc_Add_VectorVector_ReturnValue) == 0x000118, "Member 'BasicDecals_BP_C_UpdateTransforms::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_UpdateTransforms, CallFunc_BreakVector_X) == 0x000130, "Member 'BasicDecals_BP_C_UpdateTransforms::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_UpdateTransforms, CallFunc_BreakVector_Y) == 0x000138, "Member 'BasicDecals_BP_C_UpdateTransforms::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_UpdateTransforms, CallFunc_BreakVector_Z) == 0x000140, "Member 'BasicDecals_BP_C_UpdateTransforms::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_UpdateTransforms, CallFunc_MakeVector_ReturnValue) == 0x000148, "Member 'BasicDecals_BP_C_UpdateTransforms::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_UpdateTransforms, CallFunc_GetActorScale3D_ReturnValue) == 0x000160, "Member 'BasicDecals_BP_C_UpdateTransforms::CallFunc_GetActorScale3D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_UpdateTransforms, CallFunc_Vector_GetAbs_ReturnValue_1) == 0x000178, "Member 'BasicDecals_BP_C_UpdateTransforms::CallFunc_Vector_GetAbs_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_UpdateTransforms, CallFunc_SelectVector_ReturnValue) == 0x000190, "Member 'BasicDecals_BP_C_UpdateTransforms::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_UpdateTransforms, CallFunc_BreakVector_X_1) == 0x0001A8, "Member 'BasicDecals_BP_C_UpdateTransforms::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_UpdateTransforms, CallFunc_BreakVector_Y_1) == 0x0001B0, "Member 'BasicDecals_BP_C_UpdateTransforms::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_UpdateTransforms, CallFunc_BreakVector_Z_1) == 0x0001B8, "Member 'BasicDecals_BP_C_UpdateTransforms::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_UpdateTransforms, CallFunc_MakeVector_ReturnValue_1) == 0x0001C0, "Member 'BasicDecals_BP_C_UpdateTransforms::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_UpdateTransforms, CallFunc_SelectVector_ReturnValue_1) == 0x0001D8, "Member 'BasicDecals_BP_C_UpdateTransforms::CallFunc_SelectVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_UpdateTransforms, CallFunc_MakeVector_ReturnValue_2) == 0x0001F0, "Member 'BasicDecals_BP_C_UpdateTransforms::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_UpdateTransforms, CallFunc_MakeTransform_ReturnValue) == 0x000210, "Member 'BasicDecals_BP_C_UpdateTransforms::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_UpdateTransforms, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x000270, "Member 'BasicDecals_BP_C_UpdateTransforms::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_UpdateTransforms, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000358, "Member 'BasicDecals_BP_C_UpdateTransforms::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BasicDecals_BP.BasicDecals_BP_C.UserConstructionScript
// 0x0020 (0x0020 - 0x0000)
struct BasicDecals_BP_C_UserConstructionScript final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_2; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_3; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BasicDecals_BP_C_UserConstructionScript) == 0x000008, "Wrong alignment on BasicDecals_BP_C_UserConstructionScript");
static_assert(sizeof(BasicDecals_BP_C_UserConstructionScript) == 0x000020, "Wrong size on BasicDecals_BP_C_UserConstructionScript");
static_assert(offsetof(BasicDecals_BP_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'BasicDecals_BP_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000008, "Member 'BasicDecals_BP_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_2) == 0x000010, "Member 'BasicDecals_BP_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BasicDecals_BP_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_3) == 0x000018, "Member 'BasicDecals_BP_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_3' has a wrong offset!");

}

