#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bear

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Bear.Bear_C
// 0x0030 (0x0660 - 0x0630)
class ABear_C final : public ACharacter
{
public:
	uint8                                         Pad_628[0x8];                                      // 0x0628(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Health_RN;                                         // 0x0630(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Dead_R;                                            // 0x0638(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_639[0x7];                                      // 0x0639(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Direction_R;                                       // 0x0640(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsActive_;                                         // 0x0648(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_649[0x7];                                      // 0x0649(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Damage_R;                                          // 0x0650(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Bear_C">();
	}
	static class ABear_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABear_C>();
	}
};
static_assert(alignof(ABear_C) == 0x000010, "Wrong alignment on ABear_C");
static_assert(sizeof(ABear_C) == 0x000660, "Wrong size on ABear_C");
static_assert(offsetof(ABear_C, Health_RN) == 0x000630, "Member 'ABear_C::Health_RN' has a wrong offset!");
static_assert(offsetof(ABear_C, Dead_R) == 0x000638, "Member 'ABear_C::Dead_R' has a wrong offset!");
static_assert(offsetof(ABear_C, Direction_R) == 0x000640, "Member 'ABear_C::Direction_R' has a wrong offset!");
static_assert(offsetof(ABear_C, IsActive_) == 0x000648, "Member 'ABear_C::IsActive_' has a wrong offset!");
static_assert(offsetof(ABear_C, Damage_R) == 0x000650, "Member 'ABear_C::Damage_R' has a wrong offset!");

}

