#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BaseDragOperation

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FItemInfo_structs.hpp"
#include "ContainerPickupsInfo_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BaseDragOperation.BP_BaseDragOperation_C
// 0x02B8 (0x0348 - 0x0090)
class UBP_BaseDragOperation_C final : public UDragDropOperation
{
public:
	struct FContainerPickupsInfo                  DragItemData;                                      // 0x0090(0x0068)(Edit, BlueprintVisible, ContainsInstancedReference, ExposeOnSpawn, HasGetValueTypeHash)
	struct FVector2D                              DragOffset;                                        // 0x00F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         PivotIndex;                                        // 0x0108(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_BaseContainer_C*                     SenderContainer;                                   // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FFItemInfo                             SenderItemInfo;                                    // 0x0118(0x0220)(Edit, BlueprintVisible, ContainsInstancedReference, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bIsRotated;                                        // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_BaseSlot_C*                          ReceiverSlot;                                      // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BaseDragOperation_C">();
	}
	static class UBP_BaseDragOperation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_BaseDragOperation_C>();
	}
};
static_assert(alignof(UBP_BaseDragOperation_C) == 0x000008, "Wrong alignment on UBP_BaseDragOperation_C");
static_assert(sizeof(UBP_BaseDragOperation_C) == 0x000348, "Wrong size on UBP_BaseDragOperation_C");
static_assert(offsetof(UBP_BaseDragOperation_C, DragItemData) == 0x000090, "Member 'UBP_BaseDragOperation_C::DragItemData' has a wrong offset!");
static_assert(offsetof(UBP_BaseDragOperation_C, DragOffset) == 0x0000F8, "Member 'UBP_BaseDragOperation_C::DragOffset' has a wrong offset!");
static_assert(offsetof(UBP_BaseDragOperation_C, PivotIndex) == 0x000108, "Member 'UBP_BaseDragOperation_C::PivotIndex' has a wrong offset!");
static_assert(offsetof(UBP_BaseDragOperation_C, SenderContainer) == 0x000110, "Member 'UBP_BaseDragOperation_C::SenderContainer' has a wrong offset!");
static_assert(offsetof(UBP_BaseDragOperation_C, SenderItemInfo) == 0x000118, "Member 'UBP_BaseDragOperation_C::SenderItemInfo' has a wrong offset!");
static_assert(offsetof(UBP_BaseDragOperation_C, bIsRotated) == 0x000338, "Member 'UBP_BaseDragOperation_C::bIsRotated' has a wrong offset!");
static_assert(offsetof(UBP_BaseDragOperation_C, ReceiverSlot) == 0x000340, "Member 'UBP_BaseDragOperation_C::ReceiverSlot' has a wrong offset!");

}

