#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Binoculars

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Binoculars.BP_Binoculars_C
// 0x0018 (0x02A8 - 0x0290)
class ABP_Binoculars_C final : public AActor
{
public:
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SceneRoot;                                         // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ABP_LinearMotionBlurCage_C*             MB_Cage;                                           // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Binoculars_C">();
	}
	static class ABP_Binoculars_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Binoculars_C>();
	}
};
static_assert(alignof(ABP_Binoculars_C) == 0x000008, "Wrong alignment on ABP_Binoculars_C");
static_assert(sizeof(ABP_Binoculars_C) == 0x0002A8, "Wrong size on ABP_Binoculars_C");
static_assert(offsetof(ABP_Binoculars_C, StaticMesh) == 0x000290, "Member 'ABP_Binoculars_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_Binoculars_C, SceneRoot) == 0x000298, "Member 'ABP_Binoculars_C::SceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Binoculars_C, MB_Cage) == 0x0002A0, "Member 'ABP_Binoculars_C::MB_Cage' has a wrong offset!");

}

