#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BaseProjectile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BPS_HitDecals_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "PenetrationData_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FMODStudio_structs.hpp"
#include "S_Float_structs.hpp"
#include "BPS_HitParticles_structs.hpp"
#include "BPS_DamageInfo_structs.hpp"
#include "S_BulletInfo_structs.hpp"
#include "S_GameplaySettings_structs.hpp"
#include "S_SimplifiedHitInfo_structs.hpp"


namespace SDK::Params
{

// Function BP_BaseProjectile.BP_BaseProjectile_C.AngleBetweenVectorsInDegrees
// 0x0078 (0x0078 - 0x0000)
struct BP_BaseProjectile_C_AngleBetweenVectorsInDegrees final
{
public:
	struct FVector                                Vector1;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Vector2;                                           // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Angle;                                             // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Dot_VectorVector_ReturnValue;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_DegAcos_ReturnValue;                      // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BaseProjectile_C_AngleBetweenVectorsInDegrees) == 0x000008, "Wrong alignment on BP_BaseProjectile_C_AngleBetweenVectorsInDegrees");
static_assert(sizeof(BP_BaseProjectile_C_AngleBetweenVectorsInDegrees) == 0x000078, "Wrong size on BP_BaseProjectile_C_AngleBetweenVectorsInDegrees");
static_assert(offsetof(BP_BaseProjectile_C_AngleBetweenVectorsInDegrees, Vector1) == 0x000000, "Member 'BP_BaseProjectile_C_AngleBetweenVectorsInDegrees::Vector1' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_AngleBetweenVectorsInDegrees, Vector2) == 0x000018, "Member 'BP_BaseProjectile_C_AngleBetweenVectorsInDegrees::Vector2' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_AngleBetweenVectorsInDegrees, Angle) == 0x000030, "Member 'BP_BaseProjectile_C_AngleBetweenVectorsInDegrees::Angle' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_AngleBetweenVectorsInDegrees, CallFunc_Normal_ReturnValue) == 0x000038, "Member 'BP_BaseProjectile_C_AngleBetweenVectorsInDegrees::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_AngleBetweenVectorsInDegrees, CallFunc_Normal_ReturnValue_1) == 0x000050, "Member 'BP_BaseProjectile_C_AngleBetweenVectorsInDegrees::CallFunc_Normal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_AngleBetweenVectorsInDegrees, CallFunc_Dot_VectorVector_ReturnValue) == 0x000068, "Member 'BP_BaseProjectile_C_AngleBetweenVectorsInDegrees::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_AngleBetweenVectorsInDegrees, CallFunc_DegAcos_ReturnValue) == 0x000070, "Member 'BP_BaseProjectile_C_AngleBetweenVectorsInDegrees::CallFunc_DegAcos_ReturnValue' has a wrong offset!");

// Function BP_BaseProjectile.BP_BaseProjectile_C.BndEvt__BP_BaseProjectile_ProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileBounceDelegate__DelegateSignature
// 0x0100 (0x0100 - 0x0000)
struct BP_BaseProjectile_C_BndEvt__BP_BaseProjectile_ProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileBounceDelegate__DelegateSignature final
{
public:
	struct FHitResult                             ImpactResult;                                      // 0x0000(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                ImpactVelocity;                                    // 0x00E8(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BaseProjectile_C_BndEvt__BP_BaseProjectile_ProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileBounceDelegate__DelegateSignature) == 0x000008, "Wrong alignment on BP_BaseProjectile_C_BndEvt__BP_BaseProjectile_ProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileBounceDelegate__DelegateSignature");
static_assert(sizeof(BP_BaseProjectile_C_BndEvt__BP_BaseProjectile_ProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileBounceDelegate__DelegateSignature) == 0x000100, "Wrong size on BP_BaseProjectile_C_BndEvt__BP_BaseProjectile_ProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileBounceDelegate__DelegateSignature");
static_assert(offsetof(BP_BaseProjectile_C_BndEvt__BP_BaseProjectile_ProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileBounceDelegate__DelegateSignature, ImpactResult) == 0x000000, "Member 'BP_BaseProjectile_C_BndEvt__BP_BaseProjectile_ProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileBounceDelegate__DelegateSignature::ImpactResult' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_BndEvt__BP_BaseProjectile_ProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileBounceDelegate__DelegateSignature, ImpactVelocity) == 0x0000E8, "Member 'BP_BaseProjectile_C_BndEvt__BP_BaseProjectile_ProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileBounceDelegate__DelegateSignature::ImpactVelocity' has a wrong offset!");

// Function BP_BaseProjectile.BP_BaseProjectile_C.BndEvt__BP_BaseProjectile_Sphere_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct BP_BaseProjectile_C_BndEvt__BP_BaseProjectile_Sphere_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_BaseProjectile_C_BndEvt__BP_BaseProjectile_Sphere_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_BaseProjectile_C_BndEvt__BP_BaseProjectile_Sphere_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_BaseProjectile_C_BndEvt__BP_BaseProjectile_Sphere_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on BP_BaseProjectile_C_BndEvt__BP_BaseProjectile_Sphere_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_BaseProjectile_C_BndEvt__BP_BaseProjectile_Sphere_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_BaseProjectile_C_BndEvt__BP_BaseProjectile_Sphere_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_BndEvt__BP_BaseProjectile_Sphere_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_BaseProjectile_C_BndEvt__BP_BaseProjectile_Sphere_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_BndEvt__BP_BaseProjectile_Sphere_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_BaseProjectile_C_BndEvt__BP_BaseProjectile_Sphere_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_BndEvt__BP_BaseProjectile_Sphere_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_BaseProjectile_C_BndEvt__BP_BaseProjectile_Sphere_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_BndEvt__BP_BaseProjectile_Sphere_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_BaseProjectile_C_BndEvt__BP_BaseProjectile_Sphere_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_BndEvt__BP_BaseProjectile_Sphere_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_BaseProjectile_C_BndEvt__BP_BaseProjectile_Sphere_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_BaseProjectile.BP_BaseProjectile_C.BndEvt__BP_BaseProjectile_Sphere_K2Node_ComponentBoundEvent_3_ComponentHitSignature__DelegateSignature
// 0x0118 (0x0118 - 0x0000)
struct BP_BaseProjectile_C_BndEvt__BP_BaseProjectile_Sphere_K2Node_ComponentBoundEvent_3_ComponentHitSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0030(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_BaseProjectile_C_BndEvt__BP_BaseProjectile_Sphere_K2Node_ComponentBoundEvent_3_ComponentHitSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_BaseProjectile_C_BndEvt__BP_BaseProjectile_Sphere_K2Node_ComponentBoundEvent_3_ComponentHitSignature__DelegateSignature");
static_assert(sizeof(BP_BaseProjectile_C_BndEvt__BP_BaseProjectile_Sphere_K2Node_ComponentBoundEvent_3_ComponentHitSignature__DelegateSignature) == 0x000118, "Wrong size on BP_BaseProjectile_C_BndEvt__BP_BaseProjectile_Sphere_K2Node_ComponentBoundEvent_3_ComponentHitSignature__DelegateSignature");
static_assert(offsetof(BP_BaseProjectile_C_BndEvt__BP_BaseProjectile_Sphere_K2Node_ComponentBoundEvent_3_ComponentHitSignature__DelegateSignature, HitComponent) == 0x000000, "Member 'BP_BaseProjectile_C_BndEvt__BP_BaseProjectile_Sphere_K2Node_ComponentBoundEvent_3_ComponentHitSignature__DelegateSignature::HitComponent' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_BndEvt__BP_BaseProjectile_Sphere_K2Node_ComponentBoundEvent_3_ComponentHitSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_BaseProjectile_C_BndEvt__BP_BaseProjectile_Sphere_K2Node_ComponentBoundEvent_3_ComponentHitSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_BndEvt__BP_BaseProjectile_Sphere_K2Node_ComponentBoundEvent_3_ComponentHitSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_BaseProjectile_C_BndEvt__BP_BaseProjectile_Sphere_K2Node_ComponentBoundEvent_3_ComponentHitSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_BndEvt__BP_BaseProjectile_Sphere_K2Node_ComponentBoundEvent_3_ComponentHitSignature__DelegateSignature, NormalImpulse) == 0x000018, "Member 'BP_BaseProjectile_C_BndEvt__BP_BaseProjectile_Sphere_K2Node_ComponentBoundEvent_3_ComponentHitSignature__DelegateSignature::NormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_BndEvt__BP_BaseProjectile_Sphere_K2Node_ComponentBoundEvent_3_ComponentHitSignature__DelegateSignature, Hit) == 0x000030, "Member 'BP_BaseProjectile_C_BndEvt__BP_BaseProjectile_Sphere_K2Node_ComponentBoundEvent_3_ComponentHitSignature__DelegateSignature::Hit' has a wrong offset!");

// Function BP_BaseProjectile.BP_BaseProjectile_C.CalculateDamageBySpeed
// 0x0060 (0x0060 - 0x0000)
struct BP_BaseProjectile_C_CalculateDamageBySpeed final
{
public:
	double                                        Param_Damage;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Result;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CalculatedDmg;                                     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_OutRangeB_ImplicitCast;   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BaseProjectile_C_CalculateDamageBySpeed) == 0x000008, "Wrong alignment on BP_BaseProjectile_C_CalculateDamageBySpeed");
static_assert(sizeof(BP_BaseProjectile_C_CalculateDamageBySpeed) == 0x000060, "Wrong size on BP_BaseProjectile_C_CalculateDamageBySpeed");
static_assert(offsetof(BP_BaseProjectile_C_CalculateDamageBySpeed, Param_Damage) == 0x000000, "Member 'BP_BaseProjectile_C_CalculateDamageBySpeed::Param_Damage' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_CalculateDamageBySpeed, Result) == 0x000008, "Member 'BP_BaseProjectile_C_CalculateDamageBySpeed::Result' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_CalculateDamageBySpeed, CalculatedDmg) == 0x000010, "Member 'BP_BaseProjectile_C_CalculateDamageBySpeed::CalculatedDmg' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_CalculateDamageBySpeed, CallFunc_VSize_ReturnValue) == 0x000018, "Member 'BP_BaseProjectile_C_CalculateDamageBySpeed::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_CalculateDamageBySpeed, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000020, "Member 'BP_BaseProjectile_C_CalculateDamageBySpeed::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_CalculateDamageBySpeed, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000028, "Member 'BP_BaseProjectile_C_CalculateDamageBySpeed::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_CalculateDamageBySpeed, CallFunc_MapRangeClamped_ReturnValue) == 0x000030, "Member 'BP_BaseProjectile_C_CalculateDamageBySpeed::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_CalculateDamageBySpeed, CallFunc_SelectFloat_ReturnValue) == 0x000038, "Member 'BP_BaseProjectile_C_CalculateDamageBySpeed::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_CalculateDamageBySpeed, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000040, "Member 'BP_BaseProjectile_C_CalculateDamageBySpeed::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_CalculateDamageBySpeed, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000048, "Member 'BP_BaseProjectile_C_CalculateDamageBySpeed::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_CalculateDamageBySpeed, CallFunc_MapRangeClamped_OutRangeB_ImplicitCast) == 0x000050, "Member 'BP_BaseProjectile_C_CalculateDamageBySpeed::CallFunc_MapRangeClamped_OutRangeB_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_CalculateDamageBySpeed, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x000058, "Member 'BP_BaseProjectile_C_CalculateDamageBySpeed::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function BP_BaseProjectile.BP_BaseProjectile_C.CalculateDistance
// 0x0028 (0x0028 - 0x0000)
struct BP_BaseProjectile_C_CalculateDistance final
{
public:
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BaseProjectile_C_CalculateDistance) == 0x000008, "Wrong alignment on BP_BaseProjectile_C_CalculateDistance");
static_assert(sizeof(BP_BaseProjectile_C_CalculateDistance) == 0x000028, "Wrong size on BP_BaseProjectile_C_CalculateDistance");
static_assert(offsetof(BP_BaseProjectile_C_CalculateDistance, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000000, "Member 'BP_BaseProjectile_C_CalculateDistance::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_CalculateDistance, CallFunc_Vector_Distance_ReturnValue) == 0x000018, "Member 'BP_BaseProjectile_C_CalculateDistance::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_CalculateDistance, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000020, "Member 'BP_BaseProjectile_C_CalculateDistance::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");

// Function BP_BaseProjectile.BP_BaseProjectile_C.CalculateSpeed
// 0x0028 (0x0028 - 0x0000)
struct BP_BaseProjectile_C_CalculateSpeed final
{
public:
	double                                        CurrentSpeed;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_OutRangeB_ImplicitCast;   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_OutRangeA_ImplicitCast;   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_MaxSpeed_ImplicitCast;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BaseProjectile_C_CalculateSpeed) == 0x000008, "Wrong alignment on BP_BaseProjectile_C_CalculateSpeed");
static_assert(sizeof(BP_BaseProjectile_C_CalculateSpeed) == 0x000028, "Wrong size on BP_BaseProjectile_C_CalculateSpeed");
static_assert(offsetof(BP_BaseProjectile_C_CalculateSpeed, CurrentSpeed) == 0x000000, "Member 'BP_BaseProjectile_C_CalculateSpeed::CurrentSpeed' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_CalculateSpeed, CallFunc_MapRangeClamped_ReturnValue) == 0x000008, "Member 'BP_BaseProjectile_C_CalculateSpeed::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_CalculateSpeed, CallFunc_MapRangeClamped_OutRangeB_ImplicitCast) == 0x000010, "Member 'BP_BaseProjectile_C_CalculateSpeed::CallFunc_MapRangeClamped_OutRangeB_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_CalculateSpeed, CallFunc_MapRangeClamped_OutRangeA_ImplicitCast) == 0x000018, "Member 'BP_BaseProjectile_C_CalculateSpeed::CallFunc_MapRangeClamped_OutRangeA_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_CalculateSpeed, K2Node_VariableSet_MaxSpeed_ImplicitCast) == 0x000020, "Member 'BP_BaseProjectile_C_CalculateSpeed::K2Node_VariableSet_MaxSpeed_ImplicitCast' has a wrong offset!");

// Function BP_BaseProjectile.BP_BaseProjectile_C.ComputeExitLocation
// 0x06E0 (0x06E0 - 0x0000)
struct BP_BaseProjectile_C_ComputeExitLocation final
{
public:
	struct FHitResult                             Param_HitResult;                                   // 0x0000(0x00E8)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                ImpactVelocity;                                    // 0x00E8(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ExitLocation;                                      // 0x0100(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ResultFound;                                       // 0x0118(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ExitNormal;                                        // 0x0120(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0138(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_162[0x2];                                      // 0x0162(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0220(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0238(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0250(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0268(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x0280(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29A[0x2];                                      // 0x029A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x02A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x02C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x02D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x02F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0308(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0310(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0318(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName_1;                // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33C[0x4];                                      // 0x033C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x0340(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x0358(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0370(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0388(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x03A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BC[0x4];                                      // 0x03BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x03C0(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x03D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D4[0x4];                                      // 0x03D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable_1;                            // 0x03D8(0x0010)(ConstParm, ReferenceParm)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x03E8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D1[0x7];                                      // 0x04D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array_1;                          // 0x04D8(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FHitResult>                     CallFunc_SphereTraceMultiForObjects_OutHits;       // 0x04E8(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceMultiForObjects_ReturnValue;   // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F9[0x3];                                      // 0x04F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x04FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0500(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_501[0x3];                                      // 0x0501(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0504(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_Array_Get_Item;                           // 0x0508(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_2;            // 0x05F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_2;         // 0x05F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F2[0x2];                                      // 0x05F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_2;                    // 0x05F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_2;                // 0x05F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5FC[0x4];                                      // 0x05FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location_2;                // 0x0600(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_2;             // 0x0618(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_2;                  // 0x0630(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_2;            // 0x0648(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_2;                 // 0x0660(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_2;                // 0x0668(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_2;            // 0x0670(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_2;             // 0x0678(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName_2;                // 0x0680(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_2;                 // 0x0688(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_2;            // 0x068C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_2;               // 0x0690(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_694[0x4];                                      // 0x0694(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart_2;              // 0x0698(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_2;                // 0x06B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x06C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C9[0x7];                                      // 0x06C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x06D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x06D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x06D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BaseProjectile_C_ComputeExitLocation) == 0x000008, "Wrong alignment on BP_BaseProjectile_C_ComputeExitLocation");
static_assert(sizeof(BP_BaseProjectile_C_ComputeExitLocation) == 0x0006E0, "Wrong size on BP_BaseProjectile_C_ComputeExitLocation");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, Param_HitResult) == 0x000000, "Member 'BP_BaseProjectile_C_ComputeExitLocation::Param_HitResult' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, ImpactVelocity) == 0x0000E8, "Member 'BP_BaseProjectile_C_ComputeExitLocation::ImpactVelocity' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, ExitLocation) == 0x000100, "Member 'BP_BaseProjectile_C_ComputeExitLocation::ExitLocation' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, ResultFound) == 0x000118, "Member 'BP_BaseProjectile_C_ComputeExitLocation::ResultFound' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, ExitNormal) == 0x000120, "Member 'BP_BaseProjectile_C_ComputeExitLocation::ExitNormal' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, Temp_object_Variable) == 0x000138, "Member 'BP_BaseProjectile_C_ComputeExitLocation::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_Normal_ReturnValue) == 0x000148, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_BreakHitResult_bBlockingHit) == 0x000160, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_BreakHitResult_bInitialOverlap) == 0x000161, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_BreakHitResult_Time) == 0x000164, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_BreakHitResult_Distance) == 0x000168, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_BreakHitResult_Location) == 0x000170, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_BreakHitResult_ImpactPoint) == 0x000188, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_BreakHitResult_Normal) == 0x0001A0, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_BreakHitResult_ImpactNormal) == 0x0001B8, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_BreakHitResult_PhysMat) == 0x0001D0, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_BreakHitResult_HitActor) == 0x0001D8, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_BreakHitResult_HitComponent) == 0x0001E0, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_BreakHitResult_HitBoneName) == 0x0001E8, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_BreakHitResult_BoneName) == 0x0001F0, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_BreakHitResult_HitItem) == 0x0001F8, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_BreakHitResult_ElementIndex) == 0x0001FC, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_BreakHitResult_FaceIndex) == 0x000200, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_BreakHitResult_TraceStart) == 0x000208, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_BreakHitResult_TraceEnd) == 0x000220, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000238, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000250, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_Add_VectorVector_ReturnValue) == 0x000268, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_Normal_ReturnValue_1) == 0x000280, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_Normal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_BreakHitResult_bBlockingHit_1) == 0x000298, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x000299, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_BreakHitResult_Time_1) == 0x00029C, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_BreakHitResult_Distance_1) == 0x0002A0, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_BreakHitResult_Location_1) == 0x0002A8, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_BreakHitResult_ImpactPoint_1) == 0x0002C0, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_BreakHitResult_Normal_1) == 0x0002D8, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_BreakHitResult_ImpactNormal_1) == 0x0002F0, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_BreakHitResult_PhysMat_1) == 0x000308, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_BreakHitResult_HitActor_1) == 0x000310, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_BreakHitResult_HitComponent_1) == 0x000318, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_BreakHitResult_HitBoneName_1) == 0x000320, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_BreakHitResult_BoneName_1) == 0x000328, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_BreakHitResult_BoneName_1' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_BreakHitResult_HitItem_1) == 0x000330, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_BreakHitResult_ElementIndex_1) == 0x000334, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_BreakHitResult_ElementIndex_1' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_BreakHitResult_FaceIndex_1) == 0x000338, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_BreakHitResult_TraceStart_1) == 0x000340, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_BreakHitResult_TraceStart_1' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_BreakHitResult_TraceEnd_1) == 0x000358, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_BreakHitResult_TraceEnd_1' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000370, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000388, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0003A0, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, Temp_int_Variable) == 0x0003B8, "Member 'BP_BaseProjectile_C_ComputeExitLocation::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, K2Node_MakeArray_Array) == 0x0003C0, "Member 'BP_BaseProjectile_C_ComputeExitLocation::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_Add_IntInt_ReturnValue) == 0x0003D0, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, Temp_object_Variable_1) == 0x0003D8, "Member 'BP_BaseProjectile_C_ComputeExitLocation::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_LineTraceSingleForObjects_OutHit) == 0x0003E8, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x0004D0, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, K2Node_MakeArray_Array_1) == 0x0004D8, "Member 'BP_BaseProjectile_C_ComputeExitLocation::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_SphereTraceMultiForObjects_OutHits) == 0x0004E8, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_SphereTraceMultiForObjects_OutHits' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_SphereTraceMultiForObjects_ReturnValue) == 0x0004F8, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_SphereTraceMultiForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_Array_LastIndex_ReturnValue) == 0x0004FC, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000500, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_Subtract_IntInt_ReturnValue) == 0x000504, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_Array_Get_Item) == 0x000508, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_BreakHitResult_bBlockingHit_2) == 0x0005F0, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_BreakHitResult_bBlockingHit_2' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_BreakHitResult_bInitialOverlap_2) == 0x0005F1, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_BreakHitResult_bInitialOverlap_2' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_BreakHitResult_Time_2) == 0x0005F4, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_BreakHitResult_Time_2' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_BreakHitResult_Distance_2) == 0x0005F8, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_BreakHitResult_Distance_2' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_BreakHitResult_Location_2) == 0x000600, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_BreakHitResult_Location_2' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_BreakHitResult_ImpactPoint_2) == 0x000618, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_BreakHitResult_ImpactPoint_2' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_BreakHitResult_Normal_2) == 0x000630, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_BreakHitResult_Normal_2' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_BreakHitResult_ImpactNormal_2) == 0x000648, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_BreakHitResult_ImpactNormal_2' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_BreakHitResult_PhysMat_2) == 0x000660, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_BreakHitResult_PhysMat_2' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_BreakHitResult_HitActor_2) == 0x000668, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_BreakHitResult_HitActor_2' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_BreakHitResult_HitComponent_2) == 0x000670, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_BreakHitResult_HitComponent_2' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_BreakHitResult_HitBoneName_2) == 0x000678, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_BreakHitResult_HitBoneName_2' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_BreakHitResult_BoneName_2) == 0x000680, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_BreakHitResult_BoneName_2' has a wrong offset!");
static_assert(offsetof(BP_BaseProjectile_C_ComputeExitLocation, CallFunc_BreakHitResult_HitItem_2) == 0x000688, "Member 'BP_BaseProjectile_C_ComputeExitLocation::CallFunc_BreakHitResult_HitItem_2' has a wrong offset!");
