#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Camp

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Camp.BP_Camp_C.BndEvt__RemoveCamp_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_Camp_C_BndEvt__RemoveCamp_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Camp_C_BndEvt__RemoveCamp_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Camp_C_BndEvt__RemoveCamp_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_Camp_C_BndEvt__RemoveCamp_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BP_Camp_C_BndEvt__RemoveCamp_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_Camp_C_BndEvt__RemoveCamp_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_Camp_C_BndEvt__RemoveCamp_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_BndEvt__RemoveCamp_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_Camp_C_BndEvt__RemoveCamp_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_BndEvt__RemoveCamp_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_Camp_C_BndEvt__RemoveCamp_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_BndEvt__RemoveCamp_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_Camp_C_BndEvt__RemoveCamp_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BP_Camp.BP_Camp_C.CanBeRemoved
// 0x0018 (0x0018 - 0x0000)
struct BP_Camp_C_CanBeRemoved final
{
public:
	bool                                          Can;                                               // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ChairsAreFree;                                     // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TentIsFree;                                        // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BonfireIsFree;                                     // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CampBonfire_C*                      K2Node_DynamicCast_AsBP_Camp_Bonfire;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Camp_C_CanBeRemoved) == 0x000008, "Wrong alignment on BP_Camp_C_CanBeRemoved");
static_assert(sizeof(BP_Camp_C_CanBeRemoved) == 0x000018, "Wrong size on BP_Camp_C_CanBeRemoved");
static_assert(offsetof(BP_Camp_C_CanBeRemoved, Can) == 0x000000, "Member 'BP_Camp_C_CanBeRemoved::Can' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_CanBeRemoved, ChairsAreFree) == 0x000001, "Member 'BP_Camp_C_CanBeRemoved::ChairsAreFree' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_CanBeRemoved, TentIsFree) == 0x000002, "Member 'BP_Camp_C_CanBeRemoved::TentIsFree' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_CanBeRemoved, BonfireIsFree) == 0x000003, "Member 'BP_Camp_C_CanBeRemoved::BonfireIsFree' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_CanBeRemoved, K2Node_DynamicCast_AsBP_Camp_Bonfire) == 0x000008, "Member 'BP_Camp_C_CanBeRemoved::K2Node_DynamicCast_AsBP_Camp_Bonfire' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_CanBeRemoved, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_Camp_C_CanBeRemoved::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_CanBeRemoved, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'BP_Camp_C_CanBeRemoved::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_Camp.BP_Camp_C.ExecuteUbergraph_BP_Camp
// 0x0190 (0x0190 - 0x0000)
struct BP_Camp_C_ExecuteUbergraph_BP_Camp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UChildActorComponent*>           CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UChildActorComponent*>           CallFunc_K2_GetComponentsByClass_ReturnValue_1;    // 0x0040(0x0010)(ReferenceParm, ContainsInstancedReference)
	class APawn*                                  K2Node_CustomEvent_Player_2;                       // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_CampClient_C*                       CallFunc_GetComponentByClass_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CampPart_C*                         K2Node_DynamicCast_AsBP_Camp_Part;                 // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_CustomEvent_Player_1;                       // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_CustomEvent_Player;                         // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetClosestPoint_Actor;                    // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_CampClient_C*                       CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_CampClient_C*                       CallFunc_GetComponentByClass_ReturnValue_2;        // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA[0x2];                                       // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CampBonfire_C*                      K2Node_DynamicCast_AsBP_Camp_Bonfire;              // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UChildActorComponent*>           CallFunc_K2_GetComponentsByClass_ReturnValue_2;    // 0x00D8(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UChildActorComponent*                   CallFunc_Array_Get_Item_1;                         // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   CallFunc_Array_Get_Item_2;                         // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMeshComponent*>           CallFunc_GetChildActorMeshes_Meshes;               // 0x0100(0x0010)(ReferenceParm, ContainsInstancedReference)
	class ABP_CampPart_C*                         K2Node_DynamicCast_AsBP_Camp_Part_1;               // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumChildrenComponents_ReturnValue;     // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_GetChildComponent_ReturnValue;            // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UChildActorComponent*                   K2Node_DynamicCast_AsChild_Actor_Component;        // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0150(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0160(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CampPart_C*                         K2Node_DynamicCast_AsBP_Camp_Part_2;               // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17A[0x6];                                      // 0x017A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CampBonfire_C*                      K2Node_DynamicCast_AsBP_Camp_Bonfire_1;            // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Camp_C_ExecuteUbergraph_BP_Camp) == 0x000008, "Wrong alignment on BP_Camp_C_ExecuteUbergraph_BP_Camp");
static_assert(sizeof(BP_Camp_C_ExecuteUbergraph_BP_Camp) == 0x000190, "Wrong size on BP_Camp_C_ExecuteUbergraph_BP_Camp");
static_assert(offsetof(BP_Camp_C_ExecuteUbergraph_BP_Camp, EntryPoint) == 0x000000, "Member 'BP_Camp_C_ExecuteUbergraph_BP_Camp::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_ExecuteUbergraph_BP_Camp, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BP_Camp_C_ExecuteUbergraph_BP_Camp::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_ExecuteUbergraph_BP_Camp, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_Camp_C_ExecuteUbergraph_BP_Camp::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_ExecuteUbergraph_BP_Camp, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_Camp_C_ExecuteUbergraph_BP_Camp::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_ExecuteUbergraph_BP_Camp, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_Camp_C_ExecuteUbergraph_BP_Camp::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_ExecuteUbergraph_BP_Camp, Temp_int_Array_Index_Variable_1) == 0x000014, "Member 'BP_Camp_C_ExecuteUbergraph_BP_Camp::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_ExecuteUbergraph_BP_Camp, Temp_int_Variable) == 0x000018, "Member 'BP_Camp_C_ExecuteUbergraph_BP_Camp::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_ExecuteUbergraph_BP_Camp, CallFunc_Add_IntInt_ReturnValue_1) == 0x00001C, "Member 'BP_Camp_C_ExecuteUbergraph_BP_Camp::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_ExecuteUbergraph_BP_Camp, CallFunc_HasAuthority_ReturnValue_1) == 0x000020, "Member 'BP_Camp_C_ExecuteUbergraph_BP_Camp::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_ExecuteUbergraph_BP_Camp, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000028, "Member 'BP_Camp_C_ExecuteUbergraph_BP_Camp::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_ExecuteUbergraph_BP_Camp, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'BP_Camp_C_ExecuteUbergraph_BP_Camp::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_ExecuteUbergraph_BP_Camp, CallFunc_K2_GetComponentsByClass_ReturnValue_1) == 0x000040, "Member 'BP_Camp_C_ExecuteUbergraph_BP_Camp::CallFunc_K2_GetComponentsByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_ExecuteUbergraph_BP_Camp, K2Node_CustomEvent_Player_2) == 0x000050, "Member 'BP_Camp_C_ExecuteUbergraph_BP_Camp::K2Node_CustomEvent_Player_2' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_ExecuteUbergraph_BP_Camp, CallFunc_Array_Get_Item) == 0x000058, "Member 'BP_Camp_C_ExecuteUbergraph_BP_Camp::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_ExecuteUbergraph_BP_Camp, CallFunc_GetComponentByClass_ReturnValue) == 0x000060, "Member 'BP_Camp_C_ExecuteUbergraph_BP_Camp::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_ExecuteUbergraph_BP_Camp, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'BP_Camp_C_ExecuteUbergraph_BP_Camp::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_ExecuteUbergraph_BP_Camp, K2Node_DynamicCast_AsBP_Camp_Part) == 0x000070, "Member 'BP_Camp_C_ExecuteUbergraph_BP_Camp::K2Node_DynamicCast_AsBP_Camp_Part' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_ExecuteUbergraph_BP_Camp, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'BP_Camp_C_ExecuteUbergraph_BP_Camp::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_ExecuteUbergraph_BP_Camp, CallFunc_Array_Length_ReturnValue_1) == 0x00007C, "Member 'BP_Camp_C_ExecuteUbergraph_BP_Camp::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_ExecuteUbergraph_BP_Camp, K2Node_CustomEvent_Player_1) == 0x000080, "Member 'BP_Camp_C_ExecuteUbergraph_BP_Camp::K2Node_CustomEvent_Player_1' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_ExecuteUbergraph_BP_Camp, K2Node_CustomEvent_Player) == 0x000088, "Member 'BP_Camp_C_ExecuteUbergraph_BP_Camp::K2Node_CustomEvent_Player' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_ExecuteUbergraph_BP_Camp, CallFunc_GetClosestPoint_Actor) == 0x000090, "Member 'BP_Camp_C_ExecuteUbergraph_BP_Camp::CallFunc_GetClosestPoint_Actor' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_ExecuteUbergraph_BP_Camp, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000098, "Member 'BP_Camp_C_ExecuteUbergraph_BP_Camp::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_ExecuteUbergraph_BP_Camp, CallFunc_GetComponentByClass_ReturnValue_2) == 0x0000A0, "Member 'BP_Camp_C_ExecuteUbergraph_BP_Camp::CallFunc_GetComponentByClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_ExecuteUbergraph_BP_Camp, CallFunc_IsValid_ReturnValue_1) == 0x0000A8, "Member 'BP_Camp_C_ExecuteUbergraph_BP_Camp::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_ExecuteUbergraph_BP_Camp, CallFunc_IsValid_ReturnValue_2) == 0x0000A9, "Member 'BP_Camp_C_ExecuteUbergraph_BP_Camp::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_ExecuteUbergraph_BP_Camp, Temp_int_Loop_Counter_Variable_1) == 0x0000AC, "Member 'BP_Camp_C_ExecuteUbergraph_BP_Camp::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_ExecuteUbergraph_BP_Camp, CallFunc_Less_IntInt_ReturnValue) == 0x0000B0, "Member 'BP_Camp_C_ExecuteUbergraph_BP_Camp::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_ExecuteUbergraph_BP_Camp, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000B4, "Member 'BP_Camp_C_ExecuteUbergraph_BP_Camp::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_ExecuteUbergraph_BP_Camp, Temp_int_Loop_Counter_Variable_2) == 0x0000B8, "Member 'BP_Camp_C_ExecuteUbergraph_BP_Camp::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_ExecuteUbergraph_BP_Camp, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000BC, "Member 'BP_Camp_C_ExecuteUbergraph_BP_Camp::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_ExecuteUbergraph_BP_Camp, CallFunc_Add_IntInt_ReturnValue_3) == 0x0000C0, "Member 'BP_Camp_C_ExecuteUbergraph_BP_Camp::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_ExecuteUbergraph_BP_Camp, K2Node_DynamicCast_AsBP_Camp_Bonfire) == 0x0000C8, "Member 'BP_Camp_C_ExecuteUbergraph_BP_Camp::K2Node_DynamicCast_AsBP_Camp_Bonfire' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_ExecuteUbergraph_BP_Camp, K2Node_DynamicCast_bSuccess_1) == 0x0000D0, "Member 'BP_Camp_C_ExecuteUbergraph_BP_Camp::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_ExecuteUbergraph_BP_Camp, CallFunc_K2_GetComponentsByClass_ReturnValue_2) == 0x0000D8, "Member 'BP_Camp_C_ExecuteUbergraph_BP_Camp::CallFunc_K2_GetComponentsByClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_ExecuteUbergraph_BP_Camp, Temp_int_Array_Index_Variable_2) == 0x0000E8, "Member 'BP_Camp_C_ExecuteUbergraph_BP_Camp::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_ExecuteUbergraph_BP_Camp, CallFunc_Array_Get_Item_1) == 0x0000F0, "Member 'BP_Camp_C_ExecuteUbergraph_BP_Camp::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_ExecuteUbergraph_BP_Camp, CallFunc_Array_Get_Item_2) == 0x0000F8, "Member 'BP_Camp_C_ExecuteUbergraph_BP_Camp::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_ExecuteUbergraph_BP_Camp, CallFunc_GetChildActorMeshes_Meshes) == 0x000100, "Member 'BP_Camp_C_ExecuteUbergraph_BP_Camp::CallFunc_GetChildActorMeshes_Meshes' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_ExecuteUbergraph_BP_Camp, K2Node_DynamicCast_AsBP_Camp_Part_1) == 0x000110, "Member 'BP_Camp_C_ExecuteUbergraph_BP_Camp::K2Node_DynamicCast_AsBP_Camp_Part_1' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_ExecuteUbergraph_BP_Camp, K2Node_DynamicCast_bSuccess_2) == 0x000118, "Member 'BP_Camp_C_ExecuteUbergraph_BP_Camp::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_ExecuteUbergraph_BP_Camp, CallFunc_Array_Length_ReturnValue_2) == 0x00011C, "Member 'BP_Camp_C_ExecuteUbergraph_BP_Camp::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_ExecuteUbergraph_BP_Camp, CallFunc_Less_IntInt_ReturnValue_2) == 0x000120, "Member 'BP_Camp_C_ExecuteUbergraph_BP_Camp::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_ExecuteUbergraph_BP_Camp, CallFunc_GetNumChildrenComponents_ReturnValue) == 0x000124, "Member 'BP_Camp_C_ExecuteUbergraph_BP_Camp::CallFunc_GetNumChildrenComponents_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_ExecuteUbergraph_BP_Camp, CallFunc_Subtract_IntInt_ReturnValue) == 0x000128, "Member 'BP_Camp_C_ExecuteUbergraph_BP_Camp::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_ExecuteUbergraph_BP_Camp, CallFunc_GetChildComponent_ReturnValue) == 0x000130, "Member 'BP_Camp_C_ExecuteUbergraph_BP_Camp::CallFunc_GetChildComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_ExecuteUbergraph_BP_Camp, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000138, "Member 'BP_Camp_C_ExecuteUbergraph_BP_Camp::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_ExecuteUbergraph_BP_Camp, K2Node_DynamicCast_AsChild_Actor_Component) == 0x000140, "Member 'BP_Camp_C_ExecuteUbergraph_BP_Camp::K2Node_DynamicCast_AsChild_Actor_Component' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_ExecuteUbergraph_BP_Camp, K2Node_DynamicCast_bSuccess_3) == 0x000148, "Member 'BP_Camp_C_ExecuteUbergraph_BP_Camp::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_ExecuteUbergraph_BP_Camp, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000150, "Member 'BP_Camp_C_ExecuteUbergraph_BP_Camp::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_ExecuteUbergraph_BP_Camp, K2Node_ComponentBoundEvent_OtherActor) == 0x000158, "Member 'BP_Camp_C_ExecuteUbergraph_BP_Camp::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_ExecuteUbergraph_BP_Camp, K2Node_ComponentBoundEvent_OtherComp) == 0x000160, "Member 'BP_Camp_C_ExecuteUbergraph_BP_Camp::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_ExecuteUbergraph_BP_Camp, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000168, "Member 'BP_Camp_C_ExecuteUbergraph_BP_Camp::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_ExecuteUbergraph_BP_Camp, K2Node_DynamicCast_AsBP_Camp_Part_2) == 0x000170, "Member 'BP_Camp_C_ExecuteUbergraph_BP_Camp::K2Node_DynamicCast_AsBP_Camp_Part_2' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_ExecuteUbergraph_BP_Camp, K2Node_DynamicCast_bSuccess_4) == 0x000178, "Member 'BP_Camp_C_ExecuteUbergraph_BP_Camp::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_ExecuteUbergraph_BP_Camp, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000179, "Member 'BP_Camp_C_ExecuteUbergraph_BP_Camp::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_ExecuteUbergraph_BP_Camp, K2Node_DynamicCast_AsBP_Camp_Bonfire_1) == 0x000180, "Member 'BP_Camp_C_ExecuteUbergraph_BP_Camp::K2Node_DynamicCast_AsBP_Camp_Bonfire_1' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_ExecuteUbergraph_BP_Camp, K2Node_DynamicCast_bSuccess_5) == 0x000188, "Member 'BP_Camp_C_ExecuteUbergraph_BP_Camp::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");

// Function BP_Camp.BP_Camp_C.GetChairs
// 0x0068 (0x0068 - 0x0000)
struct BP_Camp_C_GetChairs final
{
public:
	TArray<class ABP_CampChair_C*>                Result;                                            // 0x0000(0x0010)(Parm, OutParm)
	TArray<class ABP_CampChair_C*>                Chairs;                                            // 0x0010(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UChildActorComponent*>           CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UChildActorComponent*                   CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CampChair_C*                        K2Node_DynamicCast_AsBP_Camp_Chair;                // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Camp_C_GetChairs) == 0x000008, "Wrong alignment on BP_Camp_C_GetChairs");
static_assert(sizeof(BP_Camp_C_GetChairs) == 0x000068, "Wrong size on BP_Camp_C_GetChairs");
static_assert(offsetof(BP_Camp_C_GetChairs, Result) == 0x000000, "Member 'BP_Camp_C_GetChairs::Result' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_GetChairs, Chairs) == 0x000010, "Member 'BP_Camp_C_GetChairs::Chairs' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_GetChairs, Temp_int_Array_Index_Variable) == 0x000020, "Member 'BP_Camp_C_GetChairs::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_GetChairs, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'BP_Camp_C_GetChairs::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_GetChairs, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'BP_Camp_C_GetChairs::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_GetChairs, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000030, "Member 'BP_Camp_C_GetChairs::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_GetChairs, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'BP_Camp_C_GetChairs::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_GetChairs, CallFunc_Array_Get_Item) == 0x000048, "Member 'BP_Camp_C_GetChairs::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_GetChairs, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'BP_Camp_C_GetChairs::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_GetChairs, K2Node_DynamicCast_AsBP_Camp_Chair) == 0x000058, "Member 'BP_Camp_C_GetChairs::K2Node_DynamicCast_AsBP_Camp_Chair' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_GetChairs, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'BP_Camp_C_GetChairs::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_GetChairs, CallFunc_Array_Add_ReturnValue) == 0x000064, "Member 'BP_Camp_C_GetChairs::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_Camp.BP_Camp_C.GetChildActorMeshes
// 0x0030 (0x0030 - 0x0000)
struct BP_Camp_C_GetChildActorMeshes final
{
public:
	class UChildActorComponent*                   ChildActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMeshComponent*>           Param_Meshes;                                      // 0x0008(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<class UStaticMeshComponent*>           CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Camp_C_GetChildActorMeshes) == 0x000008, "Wrong alignment on BP_Camp_C_GetChildActorMeshes");
static_assert(sizeof(BP_Camp_C_GetChildActorMeshes) == 0x000030, "Wrong size on BP_Camp_C_GetChildActorMeshes");
static_assert(offsetof(BP_Camp_C_GetChildActorMeshes, ChildActor) == 0x000000, "Member 'BP_Camp_C_GetChildActorMeshes::ChildActor' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_GetChildActorMeshes, Param_Meshes) == 0x000008, "Member 'BP_Camp_C_GetChildActorMeshes::Param_Meshes' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_GetChildActorMeshes, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000018, "Member 'BP_Camp_C_GetChildActorMeshes::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_GetChildActorMeshes, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BP_Camp_C_GetChildActorMeshes::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_Camp.BP_Camp_C.GetClosestPoint
// 0x0098 (0x0098 - 0x0000)
struct BP_Camp_C_GetClosestPoint final
{
public:
	class AActor*                                 Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue_1;            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Select_Default;                             // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Camp_C_GetClosestPoint) == 0x000008, "Wrong alignment on BP_Camp_C_GetClosestPoint");
static_assert(sizeof(BP_Camp_C_GetClosestPoint) == 0x000098, "Wrong size on BP_Camp_C_GetClosestPoint");
static_assert(offsetof(BP_Camp_C_GetClosestPoint, Player) == 0x000000, "Member 'BP_Camp_C_GetClosestPoint::Player' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_GetClosestPoint, Actor) == 0x000008, "Member 'BP_Camp_C_GetClosestPoint::Actor' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_GetClosestPoint, Temp_bool_Variable) == 0x000010, "Member 'BP_Camp_C_GetClosestPoint::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_GetClosestPoint, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000018, "Member 'BP_Camp_C_GetClosestPoint::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_GetClosestPoint, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000030, "Member 'BP_Camp_C_GetClosestPoint::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_GetClosestPoint, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000048, "Member 'BP_Camp_C_GetClosestPoint::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_GetClosestPoint, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000060, "Member 'BP_Camp_C_GetClosestPoint::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_GetClosestPoint, CallFunc_Vector_Distance_ReturnValue) == 0x000078, "Member 'BP_Camp_C_GetClosestPoint::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_GetClosestPoint, CallFunc_Vector_Distance_ReturnValue_1) == 0x000080, "Member 'BP_Camp_C_GetClosestPoint::CallFunc_Vector_Distance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_GetClosestPoint, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000088, "Member 'BP_Camp_C_GetClosestPoint::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_GetClosestPoint, K2Node_Select_Default) == 0x000090, "Member 'BP_Camp_C_GetClosestPoint::K2Node_Select_Default' has a wrong offset!");

// Function BP_Camp.BP_Camp_C.GetFreeChair
// 0x0060 (0x0060 - 0x0000)
struct BP_Camp_C_GetFreeChair final
{
public:
	bool                                          Found;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CampChair_C*                        Chair;                                             // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          FoundChair;                                        // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CampChair_C*                        ResultChair;                                       // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_CampChair_C*>                CallFunc_GetChairs_Result;                         // 0x0038(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CampChair_C*                        CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPlayer_Has;                            // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Camp_C_GetFreeChair) == 0x000008, "Wrong alignment on BP_Camp_C_GetFreeChair");
static_assert(sizeof(BP_Camp_C_GetFreeChair) == 0x000060, "Wrong size on BP_Camp_C_GetFreeChair");
static_assert(offsetof(BP_Camp_C_GetFreeChair, Found) == 0x000000, "Member 'BP_Camp_C_GetFreeChair::Found' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_GetFreeChair, Chair) == 0x000008, "Member 'BP_Camp_C_GetFreeChair::Chair' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_GetFreeChair, FoundChair) == 0x000010, "Member 'BP_Camp_C_GetFreeChair::FoundChair' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_GetFreeChair, ResultChair) == 0x000018, "Member 'BP_Camp_C_GetFreeChair::ResultChair' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_GetFreeChair, Temp_bool_True_if_break_was_hit_Variable) == 0x000020, "Member 'BP_Camp_C_GetFreeChair::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_GetFreeChair, Temp_int_Array_Index_Variable) == 0x000024, "Member 'BP_Camp_C_GetFreeChair::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_GetFreeChair, CallFunc_Not_PreBool_ReturnValue) == 0x000028, "Member 'BP_Camp_C_GetFreeChair::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_GetFreeChair, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'BP_Camp_C_GetFreeChair::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_GetFreeChair, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'BP_Camp_C_GetFreeChair::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_GetFreeChair, CallFunc_GetChairs_Result) == 0x000038, "Member 'BP_Camp_C_GetFreeChair::CallFunc_GetChairs_Result' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_GetFreeChair, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'BP_Camp_C_GetFreeChair::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_GetFreeChair, CallFunc_Array_Get_Item) == 0x000050, "Member 'BP_Camp_C_GetFreeChair::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_GetFreeChair, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'BP_Camp_C_GetFreeChair::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_GetFreeChair, CallFunc_BooleanAND_ReturnValue) == 0x000059, "Member 'BP_Camp_C_GetFreeChair::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Camp_C_GetFreeChair, CallFunc_HasPlayer_Has) == 0x00005A, "Member 'BP_Camp_C_GetFreeChair::CallFunc_HasPlayer_Has' has a wrong offset!");

// Function BP_Camp.BP_Camp_C.TogglePlayerBonfireCamera
// 0x0008 (0x0008 - 0x0000)
struct BP_Camp_C_TogglePlayerBonfireCamera final
{
public:
	class APawn*                                  Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Camp_C_TogglePlayerBonfireCamera) == 0x000008, "Wrong alignment on BP_Camp_C_TogglePlayerBonfireCamera");
static_assert(sizeof(BP_Camp_C_TogglePlayerBonfireCamera) == 0x000008, "Wrong size on BP_Camp_C_TogglePlayerBonfireCamera");
static_assert(offsetof(BP_Camp_C_TogglePlayerBonfireCamera, Player) == 0x000000, "Member 'BP_Camp_C_TogglePlayerBonfireCamera::Player' has a wrong offset!");

// Function BP_Camp.BP_Camp_C.TogglePlayerCamera
// 0x0008 (0x0008 - 0x0000)
struct BP_Camp_C_TogglePlayerCamera final
{
public:
	class APawn*                                  Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Camp_C_TogglePlayerCamera) == 0x000008, "Wrong alignment on BP_Camp_C_TogglePlayerCamera");
static_assert(sizeof(BP_Camp_C_TogglePlayerCamera) == 0x000008, "Wrong size on BP_Camp_C_TogglePlayerCamera");
static_assert(offsetof(BP_Camp_C_TogglePlayerCamera, Player) == 0x000000, "Member 'BP_Camp_C_TogglePlayerCamera::Player' has a wrong offset!");

// Function BP_Camp.BP_Camp_C.TogglePlayerChairCamera
// 0x0008 (0x0008 - 0x0000)
struct BP_Camp_C_TogglePlayerChairCamera final
{
public:
	class APawn*                                  Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Camp_C_TogglePlayerChairCamera) == 0x000008, "Wrong alignment on BP_Camp_C_TogglePlayerChairCamera");
static_assert(sizeof(BP_Camp_C_TogglePlayerChairCamera) == 0x000008, "Wrong size on BP_Camp_C_TogglePlayerChairCamera");
static_assert(offsetof(BP_Camp_C_TogglePlayerChairCamera, Player) == 0x000000, "Member 'BP_Camp_C_TogglePlayerChairCamera::Player' has a wrong offset!");

}

