#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CampStubPlacer

#include "Basic.hpp"

#include "E_InteractType_structs.hpp"
#include "Engine_structs.hpp"
#include "BP_CampPart_classes.hpp"
#include "E_ActorType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CampStubPlacer.BP_CampStubPlacer_C
// 0x0028 (0x02C8 - 0x02A0)
class ABP_CampStubPlacer_C final : public ABP_CampPart_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_CampStubPlacer_C;                // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        Duration;                                          // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFMODAudioComponent*                    Sound;                                             // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_Camp_C*                             Camp;                                              // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BuildingStateUpd();
	void DestroyInteractable();
	void ExecuteUbergraph_BP_CampStubPlacer(int32 EntryPoint);
	void GetActorType(E_ActorType* ActorType);
	void GetCampS(class ABP_Camp_C** Param_Camp);
	void IsLocked_(bool* Result);
	void OnBeginInteract(class APawn* Player);
	void OnBuildingState();
	void OnFocused(class APawn* Player, class AActor* HighlightActor, class UActorComponent* HighlightActorComponent, E_InteractType* InteractType, double* LateTime);
	void OnInteract(class APawn* Player);
	void OnInteract2(class APawn* Player);
	void OnInteract3(class APawn* Player);
	void OnInteractVehicle(class APawn* Player, int32 SitIndex, bool SkipAnimation);
	void OnLocalInteract(class APawn* Player);
	void OnLostFocus(class APawn* Player);
	void OnSeen(class APawn* Player);
	void OnSquadCheckComplete();
	void OnStopInteract(class APawn* Player);
	void Run_Lockpicking();
	void Set3DWidgetVisibility(bool Visible);
	void SetTutorial3DWidgetVisibility(bool Visible);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CampStubPlacer_C">();
	}
	static class ABP_CampStubPlacer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CampStubPlacer_C>();
	}
};
static_assert(alignof(ABP_CampStubPlacer_C) == 0x000008, "Wrong alignment on ABP_CampStubPlacer_C");
static_assert(sizeof(ABP_CampStubPlacer_C) == 0x0002C8, "Wrong size on ABP_CampStubPlacer_C");
static_assert(offsetof(ABP_CampStubPlacer_C, UberGraphFrame_BP_CampStubPlacer_C) == 0x0002A0, "Member 'ABP_CampStubPlacer_C::UberGraphFrame_BP_CampStubPlacer_C' has a wrong offset!");
static_assert(offsetof(ABP_CampStubPlacer_C, Box) == 0x0002A8, "Member 'ABP_CampStubPlacer_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_CampStubPlacer_C, Duration) == 0x0002B0, "Member 'ABP_CampStubPlacer_C::Duration' has a wrong offset!");
static_assert(offsetof(ABP_CampStubPlacer_C, Sound) == 0x0002B8, "Member 'ABP_CampStubPlacer_C::Sound' has a wrong offset!");
static_assert(offsetof(ABP_CampStubPlacer_C, Camp) == 0x0002C0, "Member 'ABP_CampStubPlacer_C::Camp' has a wrong offset!");

}

