#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ChooseCharacter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ChooseCharacter.BP_ChooseCharacter_C
// 0x0188 (0x04A0 - 0x0318)
class ABP_ChooseCharacter_C final : public APawn
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0318(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 Weapon1;                                           // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Weapon2;                                           // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Weapon3;                                           // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Rukzak;                                            // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Kaska;                                             // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Bronik;                                            // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCineCameraComponent*                   CineCamera;                                        // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 beard;                                             // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 HeadChoose;                                        // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Mesh;                                              // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Hair2;                                             // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Hair1;                                             // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 OuterwearSlot;                                     // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 PantsSlot;                                         // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         StartGameTimeline_NewTrack_0_E619DACE45627DF64934F8811A030508; // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            StartGameTimeline__Direction_E619DACE45627DF64934F8811A030508; // 0x0394(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_395[0x3];                                      // 0x0395(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     StartGameTimeline;                                 // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         MoveBackFromCreateCharacter_NewTrack_0_9DEFCAE7499E2FA0DC641A849737BDA0; // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            MoveBackFromCreateCharacter__Direction_9DEFCAE7499E2FA0DC641A849737BDA0; // 0x03A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A5[0x3];                                      // 0x03A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     MoveBackFromCreateCharacter;                       // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         MoveBack_NewTrack_0_1CF421A24C325BFA48E3029E44FAF884; // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            MoveBack__Direction_1CF421A24C325BFA48E3029E44FAF884; // 0x03B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B5[0x3];                                      // 0x03B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     MoveBack;                                          // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CanRotate_;                                        // 0x03C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C1[0x7];                                      // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              StartLocation;                                     // 0x03C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D8[0x8];                                      // 0x03D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             DefaultTransform;                                  // 0x03E0(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                EndPoint;                                          // 0x0440(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                StartPoint;                                        // 0x0458(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               ChooseCharacterDynMat;                             // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DM_BodyMan;                                        // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DM_LegsMan;                                        // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DW_BodyGirl;                                       // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DM_LegsGirl;                                       // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCharacterCreateSave_C*                 Character_Save_Ref;                                // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void CallDefaultMeshes();
	void Change_Material_Param_Color(TArray<class USkeletalMeshComponent*>& Array, class FName ParameterName, const struct FLinearColor& Value);
	void CheckBlack(bool Woman);
	void CheckBlendshapes();
	void CheckSex(class USkeletalMesh* Param_beard, bool Woman_);
	void CheckSkinTone(bool Black, bool Woman);
	void ExecuteUbergraph_BP_ChooseCharacter(int32 EntryPoint);
	void GetSlotName(bool IsWoman, class FName* MaterialSlotName);
	void GetSourceMaterial(bool IsWoman, bool IsBlack, class UMaterialInterface** SourceMaterial);
	void MoveBack__FinishedFunc();
	void MoveBack__UpdateFunc();
	void MoveBackFromCreateCharacter__FinishedFunc();
	void MoveBackFromCreateCharacter__UpdateFunc();
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void RefreshMesh(bool LocalCharacter, class UCharacterCreateSave_C* Param_Character_Save_Ref);
	void RestoreDefaultMaterials();
	void SetSuitDefault();
	void SetWomanScalar();
	void StartGameTimeline__FinishedFunc();
	void StartGameTimeline__UpdateFunc();
	void UpdateOutwear(bool IsWoman, bool IsBlack);
	void UpdatePants(bool IsWoman, bool IsBlack);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ChooseCharacter_C">();
	}
	static class ABP_ChooseCharacter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ChooseCharacter_C>();
	}
};
static_assert(alignof(ABP_ChooseCharacter_C) == 0x000010, "Wrong alignment on ABP_ChooseCharacter_C");
static_assert(sizeof(ABP_ChooseCharacter_C) == 0x0004A0, "Wrong size on ABP_ChooseCharacter_C");
static_assert(offsetof(ABP_ChooseCharacter_C, UberGraphFrame) == 0x000318, "Member 'ABP_ChooseCharacter_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ChooseCharacter_C, Weapon1) == 0x000320, "Member 'ABP_ChooseCharacter_C::Weapon1' has a wrong offset!");
static_assert(offsetof(ABP_ChooseCharacter_C, Weapon2) == 0x000328, "Member 'ABP_ChooseCharacter_C::Weapon2' has a wrong offset!");
static_assert(offsetof(ABP_ChooseCharacter_C, Weapon3) == 0x000330, "Member 'ABP_ChooseCharacter_C::Weapon3' has a wrong offset!");
static_assert(offsetof(ABP_ChooseCharacter_C, Rukzak) == 0x000338, "Member 'ABP_ChooseCharacter_C::Rukzak' has a wrong offset!");
static_assert(offsetof(ABP_ChooseCharacter_C, Kaska) == 0x000340, "Member 'ABP_ChooseCharacter_C::Kaska' has a wrong offset!");
static_assert(offsetof(ABP_ChooseCharacter_C, Bronik) == 0x000348, "Member 'ABP_ChooseCharacter_C::Bronik' has a wrong offset!");
static_assert(offsetof(ABP_ChooseCharacter_C, CineCamera) == 0x000350, "Member 'ABP_ChooseCharacter_C::CineCamera' has a wrong offset!");
static_assert(offsetof(ABP_ChooseCharacter_C, beard) == 0x000358, "Member 'ABP_ChooseCharacter_C::beard' has a wrong offset!");
static_assert(offsetof(ABP_ChooseCharacter_C, HeadChoose) == 0x000360, "Member 'ABP_ChooseCharacter_C::HeadChoose' has a wrong offset!");
static_assert(offsetof(ABP_ChooseCharacter_C, Mesh) == 0x000368, "Member 'ABP_ChooseCharacter_C::Mesh' has a wrong offset!");
static_assert(offsetof(ABP_ChooseCharacter_C, Hair2) == 0x000370, "Member 'ABP_ChooseCharacter_C::Hair2' has a wrong offset!");
static_assert(offsetof(ABP_ChooseCharacter_C, Hair1) == 0x000378, "Member 'ABP_ChooseCharacter_C::Hair1' has a wrong offset!");
static_assert(offsetof(ABP_ChooseCharacter_C, OuterwearSlot) == 0x000380, "Member 'ABP_ChooseCharacter_C::OuterwearSlot' has a wrong offset!");
static_assert(offsetof(ABP_ChooseCharacter_C, PantsSlot) == 0x000388, "Member 'ABP_ChooseCharacter_C::PantsSlot' has a wrong offset!");
static_assert(offsetof(ABP_ChooseCharacter_C, StartGameTimeline_NewTrack_0_E619DACE45627DF64934F8811A030508) == 0x000390, "Member 'ABP_ChooseCharacter_C::StartGameTimeline_NewTrack_0_E619DACE45627DF64934F8811A030508' has a wrong offset!");
static_assert(offsetof(ABP_ChooseCharacter_C, StartGameTimeline__Direction_E619DACE45627DF64934F8811A030508) == 0x000394, "Member 'ABP_ChooseCharacter_C::StartGameTimeline__Direction_E619DACE45627DF64934F8811A030508' has a wrong offset!");
static_assert(offsetof(ABP_ChooseCharacter_C, StartGameTimeline) == 0x000398, "Member 'ABP_ChooseCharacter_C::StartGameTimeline' has a wrong offset!");
static_assert(offsetof(ABP_ChooseCharacter_C, MoveBackFromCreateCharacter_NewTrack_0_9DEFCAE7499E2FA0DC641A849737BDA0) == 0x0003A0, "Member 'ABP_ChooseCharacter_C::MoveBackFromCreateCharacter_NewTrack_0_9DEFCAE7499E2FA0DC641A849737BDA0' has a wrong offset!");
static_assert(offsetof(ABP_ChooseCharacter_C, MoveBackFromCreateCharacter__Direction_9DEFCAE7499E2FA0DC641A849737BDA0) == 0x0003A4, "Member 'ABP_ChooseCharacter_C::MoveBackFromCreateCharacter__Direction_9DEFCAE7499E2FA0DC641A849737BDA0' has a wrong offset!");
static_assert(offsetof(ABP_ChooseCharacter_C, MoveBackFromCreateCharacter) == 0x0003A8, "Member 'ABP_ChooseCharacter_C::MoveBackFromCreateCharacter' has a wrong offset!");
static_assert(offsetof(ABP_ChooseCharacter_C, MoveBack_NewTrack_0_1CF421A24C325BFA48E3029E44FAF884) == 0x0003B0, "Member 'ABP_ChooseCharacter_C::MoveBack_NewTrack_0_1CF421A24C325BFA48E3029E44FAF884' has a wrong offset!");
static_assert(offsetof(ABP_ChooseCharacter_C, MoveBack__Direction_1CF421A24C325BFA48E3029E44FAF884) == 0x0003B4, "Member 'ABP_ChooseCharacter_C::MoveBack__Direction_1CF421A24C325BFA48E3029E44FAF884' has a wrong offset!");
static_assert(offsetof(ABP_ChooseCharacter_C, MoveBack) == 0x0003B8, "Member 'ABP_ChooseCharacter_C::MoveBack' has a wrong offset!");
static_assert(offsetof(ABP_ChooseCharacter_C, CanRotate_) == 0x0003C0, "Member 'ABP_ChooseCharacter_C::CanRotate_' has a wrong offset!");
static_assert(offsetof(ABP_ChooseCharacter_C, StartLocation) == 0x0003C8, "Member 'ABP_ChooseCharacter_C::StartLocation' has a wrong offset!");
static_assert(offsetof(ABP_ChooseCharacter_C, DefaultTransform) == 0x0003E0, "Member 'ABP_ChooseCharacter_C::DefaultTransform' has a wrong offset!");
static_assert(offsetof(ABP_ChooseCharacter_C, EndPoint) == 0x000440, "Member 'ABP_ChooseCharacter_C::EndPoint' has a wrong offset!");
static_assert(offsetof(ABP_ChooseCharacter_C, StartPoint) == 0x000458, "Member 'ABP_ChooseCharacter_C::StartPoint' has a wrong offset!");
static_assert(offsetof(ABP_ChooseCharacter_C, ChooseCharacterDynMat) == 0x000470, "Member 'ABP_ChooseCharacter_C::ChooseCharacterDynMat' has a wrong offset!");
static_assert(offsetof(ABP_ChooseCharacter_C, DM_BodyMan) == 0x000478, "Member 'ABP_ChooseCharacter_C::DM_BodyMan' has a wrong offset!");
static_assert(offsetof(ABP_ChooseCharacter_C, DM_LegsMan) == 0x000480, "Member 'ABP_ChooseCharacter_C::DM_LegsMan' has a wrong offset!");
static_assert(offsetof(ABP_ChooseCharacter_C, DW_BodyGirl) == 0x000488, "Member 'ABP_ChooseCharacter_C::DW_BodyGirl' has a wrong offset!");
static_assert(offsetof(ABP_ChooseCharacter_C, DM_LegsGirl) == 0x000490, "Member 'ABP_ChooseCharacter_C::DM_LegsGirl' has a wrong offset!");
static_assert(offsetof(ABP_ChooseCharacter_C, Character_Save_Ref) == 0x000498, "Member 'ABP_ChooseCharacter_C::Character_Save_Ref' has a wrong offset!");

}

