#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CarDoorNavModifier

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_CarDoorNavModifier.BP_CarDoorNavModifier_C.ExecuteUbergraph_BP_CarDoorNavModifier
// 0x0070 (0x0070 - 0x0000)
struct BP_CarDoorNavModifier_C_ExecuteUbergraph_BP_CarDoorNavModifier final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_Event_SocketTransform;                      // 0x0010(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CarDoorNavModifier_C_ExecuteUbergraph_BP_CarDoorNavModifier) == 0x000010, "Wrong alignment on BP_CarDoorNavModifier_C_ExecuteUbergraph_BP_CarDoorNavModifier");
static_assert(sizeof(BP_CarDoorNavModifier_C_ExecuteUbergraph_BP_CarDoorNavModifier) == 0x000070, "Wrong size on BP_CarDoorNavModifier_C_ExecuteUbergraph_BP_CarDoorNavModifier");
static_assert(offsetof(BP_CarDoorNavModifier_C_ExecuteUbergraph_BP_CarDoorNavModifier, EntryPoint) == 0x000000, "Member 'BP_CarDoorNavModifier_C_ExecuteUbergraph_BP_CarDoorNavModifier::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CarDoorNavModifier_C_ExecuteUbergraph_BP_CarDoorNavModifier, K2Node_Event_SocketTransform) == 0x000010, "Member 'BP_CarDoorNavModifier_C_ExecuteUbergraph_BP_CarDoorNavModifier::K2Node_Event_SocketTransform' has a wrong offset!");

// Function BP_CarDoorNavModifier.BP_CarDoorNavModifier_C.SetCarNavModifierExtent
// 0x0060 (0x0060 - 0x0000)
struct BP_CarDoorNavModifier_C_SetCarNavModifierExtent final
{
public:
	struct FTransform                             SocketTransform;                                   // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CarDoorNavModifier_C_SetCarNavModifierExtent) == 0x000010, "Wrong alignment on BP_CarDoorNavModifier_C_SetCarNavModifierExtent");
static_assert(sizeof(BP_CarDoorNavModifier_C_SetCarNavModifierExtent) == 0x000060, "Wrong size on BP_CarDoorNavModifier_C_SetCarNavModifierExtent");
static_assert(offsetof(BP_CarDoorNavModifier_C_SetCarNavModifierExtent, SocketTransform) == 0x000000, "Member 'BP_CarDoorNavModifier_C_SetCarNavModifierExtent::SocketTransform' has a wrong offset!");

}

