#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CreateCharacter

#include "Basic.hpp"

#include "WE_BodyTypes_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_CreateCharacter.BP_CreateCharacter_C.ChangeSex
// 0x0002 (0x0002 - 0x0000)
struct BP_CreateCharacter_C_ChangeSex final
{
public:
	EWE_BodyTypes                                 IsMan_;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Param_Woman_;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CreateCharacter_C_ChangeSex) == 0x000001, "Wrong alignment on BP_CreateCharacter_C_ChangeSex");
static_assert(sizeof(BP_CreateCharacter_C_ChangeSex) == 0x000002, "Wrong size on BP_CreateCharacter_C_ChangeSex");
static_assert(offsetof(BP_CreateCharacter_C_ChangeSex, IsMan_) == 0x000000, "Member 'BP_CreateCharacter_C_ChangeSex::IsMan_' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ChangeSex, Param_Woman_) == 0x000001, "Member 'BP_CreateCharacter_C_ChangeSex::Param_Woman_' has a wrong offset!");

// Function BP_CreateCharacter.BP_CreateCharacter_C.CheckBlack
// 0x0018 (0x0018 - 0x0000)
struct BP_CreateCharacter_C_CheckBlack final
{
public:
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CreateCharacter_C_CheckBlack) == 0x000008, "Wrong alignment on BP_CreateCharacter_C_CheckBlack");
static_assert(sizeof(BP_CreateCharacter_C_CheckBlack) == 0x000018, "Wrong size on BP_CreateCharacter_C_CheckBlack");
static_assert(offsetof(BP_CreateCharacter_C_CheckBlack, CallFunc_GetGameInstance_ReturnValue) == 0x000000, "Member 'BP_CreateCharacter_C_CheckBlack::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_CheckBlack, K2Node_DynamicCast_AsGI_Survival) == 0x000008, "Member 'BP_CreateCharacter_C_CheckBlack::K2Node_DynamicCast_AsGI_Survival' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_CheckBlack, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_CreateCharacter_C_CheckBlack::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_CreateCharacter.BP_CreateCharacter_C.CheckSkinTone
// 0x00D0 (0x00D0 - 0x0000)
struct BP_CreateCharacter_C_CheckSkinTone final
{
public:
	bool                                          Black;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0004(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x000C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x0014(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_3;                              // 0x001C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival;                  // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetMaterialSlotNames_ReturnValue;         // 0x0040(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetMaterialSlotNames_ReturnValue_1;       // 0x0060(0x0010)(ReferenceParm)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue_1;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival_1;                // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetMaterialSlotNames_ReturnValue_2;       // 0x0098(0x0010)(ReferenceParm)
	TArray<class FName>                           CallFunc_GetMaterialSlotNames_ReturnValue_3;       // 0x00A8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Find_ReturnValue_2;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue_3;                 // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_2; // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_3; // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CreateCharacter_C_CheckSkinTone) == 0x000008, "Wrong alignment on BP_CreateCharacter_C_CheckSkinTone");
static_assert(sizeof(BP_CreateCharacter_C_CheckSkinTone) == 0x0000D0, "Wrong size on BP_CreateCharacter_C_CheckSkinTone");
static_assert(offsetof(BP_CreateCharacter_C_CheckSkinTone, Black) == 0x000000, "Member 'BP_CreateCharacter_C_CheckSkinTone::Black' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_CheckSkinTone, Temp_name_Variable) == 0x000004, "Member 'BP_CreateCharacter_C_CheckSkinTone::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_CheckSkinTone, Temp_name_Variable_1) == 0x00000C, "Member 'BP_CreateCharacter_C_CheckSkinTone::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_CheckSkinTone, Temp_name_Variable_2) == 0x000014, "Member 'BP_CreateCharacter_C_CheckSkinTone::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_CheckSkinTone, Temp_name_Variable_3) == 0x00001C, "Member 'BP_CreateCharacter_C_CheckSkinTone::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_CheckSkinTone, CallFunc_GetGameInstance_ReturnValue) == 0x000028, "Member 'BP_CreateCharacter_C_CheckSkinTone::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_CheckSkinTone, K2Node_DynamicCast_AsGI_Survival) == 0x000030, "Member 'BP_CreateCharacter_C_CheckSkinTone::K2Node_DynamicCast_AsGI_Survival' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_CheckSkinTone, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_CreateCharacter_C_CheckSkinTone::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_CheckSkinTone, CallFunc_GetMaterialSlotNames_ReturnValue) == 0x000040, "Member 'BP_CreateCharacter_C_CheckSkinTone::CallFunc_GetMaterialSlotNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_CheckSkinTone, CallFunc_Array_Find_ReturnValue) == 0x000050, "Member 'BP_CreateCharacter_C_CheckSkinTone::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_CheckSkinTone, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000058, "Member 'BP_CreateCharacter_C_CheckSkinTone::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_CheckSkinTone, CallFunc_GetMaterialSlotNames_ReturnValue_1) == 0x000060, "Member 'BP_CreateCharacter_C_CheckSkinTone::CallFunc_GetMaterialSlotNames_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_CheckSkinTone, CallFunc_GetGameInstance_ReturnValue_1) == 0x000070, "Member 'BP_CreateCharacter_C_CheckSkinTone::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_CheckSkinTone, CallFunc_Array_Find_ReturnValue_1) == 0x000078, "Member 'BP_CreateCharacter_C_CheckSkinTone::CallFunc_Array_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_CheckSkinTone, K2Node_DynamicCast_AsGI_Survival_1) == 0x000080, "Member 'BP_CreateCharacter_C_CheckSkinTone::K2Node_DynamicCast_AsGI_Survival_1' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_CheckSkinTone, K2Node_DynamicCast_bSuccess_1) == 0x000088, "Member 'BP_CreateCharacter_C_CheckSkinTone::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_CheckSkinTone, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000090, "Member 'BP_CreateCharacter_C_CheckSkinTone::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_CheckSkinTone, CallFunc_GetMaterialSlotNames_ReturnValue_2) == 0x000098, "Member 'BP_CreateCharacter_C_CheckSkinTone::CallFunc_GetMaterialSlotNames_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_CheckSkinTone, CallFunc_GetMaterialSlotNames_ReturnValue_3) == 0x0000A8, "Member 'BP_CreateCharacter_C_CheckSkinTone::CallFunc_GetMaterialSlotNames_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_CheckSkinTone, CallFunc_Array_Find_ReturnValue_2) == 0x0000B8, "Member 'BP_CreateCharacter_C_CheckSkinTone::CallFunc_Array_Find_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_CheckSkinTone, CallFunc_Array_Find_ReturnValue_3) == 0x0000BC, "Member 'BP_CreateCharacter_C_CheckSkinTone::CallFunc_Array_Find_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_CheckSkinTone, CallFunc_CreateDynamicMaterialInstance_ReturnValue_2) == 0x0000C0, "Member 'BP_CreateCharacter_C_CheckSkinTone::CallFunc_CreateDynamicMaterialInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_CheckSkinTone, CallFunc_CreateDynamicMaterialInstance_ReturnValue_3) == 0x0000C8, "Member 'BP_CreateCharacter_C_CheckSkinTone::CallFunc_CreateDynamicMaterialInstance_ReturnValue_3' has a wrong offset!");

// Function BP_CreateCharacter.BP_CreateCharacter_C.ExecuteUbergraph_BP_CreateCharacter
// 0x0430 (0x0430 - 0x0000)
struct BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0078(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x00C8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x00D0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_3;                              // 0x00D8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_4;                              // 0x00E0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_5;                              // 0x00E8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_6;                              // 0x00F0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded_2;                       // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable;                               // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded_1;                       // 0x0108(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_1;                             // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded;                         // 0x0118(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_2;                             // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Girl_;                          // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x012C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetMaterialSlotNames_ReturnValue;         // 0x0140(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetMaterialSlotNames_ReturnValue_1;       // 0x0168(0x0010)(ReferenceParm)
	TArray<class FName>                           CallFunc_GetMaterialSlotNames_ReturnValue_2;       // 0x0178(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Find_ReturnValue_1;                 // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue_2;                 // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_2; // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_3; // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_4; // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A8[0x8];                                      // 0x01A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetRelativeTransform_ReturnValue;         // 0x01B0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x0210(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x0228(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x0240(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0258(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival;                  // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0288(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0370(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival_1;                // 0x0378(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWE_BodyTypes                                 K2Node_CustomEvent_isMan_;                         // 0x0381(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Woman_;                         // 0x0382(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_383[0x1];                                      // 0x0383(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0384(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_394[0x4];                                      // 0x0394(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetPostProcessInstance_ReturnValue;       // 0x0398(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetMaterialSlotNames_ReturnValue_3;       // 0x03A0(0x0010)(ReferenceParm)
	TScriptInterface<class IBPI_ABPHead_C>        K2Node_DynamicCast_AsBPI_ABPHead;                  // 0x03B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C1[0x3];                                      // 0x03C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue_3;                 // 0x03C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetMaterialSlotNames_ReturnValue_4;       // 0x03C8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Find_ReturnValue_4;                 // 0x03D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DC[0x4];                                      // 0x03DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetMaterialSlotNames_ReturnValue_5;       // 0x03E0(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Find_ReturnValue_5;                 // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F4[0x4];                                      // 0x03F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_5; // 0x03F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_6; // 0x0400(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetMaterialSlotNames_ReturnValue_6;       // 0x0408(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Find_ReturnValue_6;                 // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41C[0x4];                                      // 0x041C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_7; // 0x0420(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter) == 0x000010, "Wrong alignment on BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter");
static_assert(sizeof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter) == 0x000430, "Wrong size on BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, EntryPoint) == 0x000000, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000008, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, CallFunc_BreakTransform_Location) == 0x000030, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, CallFunc_BreakTransform_Rotation) == 0x000048, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, CallFunc_BreakTransform_Scale) == 0x000060, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, Temp_name_Variable) == 0x000078, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, CallFunc_Conv_RotatorToVector_ReturnValue) == 0x000080, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::CallFunc_Conv_RotatorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000098, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, CallFunc_Add_VectorVector_ReturnValue) == 0x0000B0, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, Temp_name_Variable_1) == 0x0000C8, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, Temp_name_Variable_2) == 0x0000D0, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, Temp_name_Variable_3) == 0x0000D8, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, Temp_name_Variable_4) == 0x0000E0, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::Temp_name_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, Temp_name_Variable_5) == 0x0000E8, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::Temp_name_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, Temp_name_Variable_6) == 0x0000F0, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::Temp_name_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, K2Node_CustomEvent_Loaded_2) == 0x0000F8, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::K2Node_CustomEvent_Loaded_2' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, Temp_class_Variable) == 0x000100, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, K2Node_CustomEvent_Loaded_1) == 0x000108, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, Temp_class_Variable_1) == 0x000110, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::Temp_class_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, K2Node_CustomEvent_Loaded) == 0x000118, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, Temp_class_Variable_2) == 0x000120, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::Temp_class_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, K2Node_CustomEvent_Girl_) == 0x000128, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::K2Node_CustomEvent_Girl_' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, K2Node_CreateDelegate_OutputDelegate_1) == 0x00012C, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, CallFunc_GetMaterialSlotNames_ReturnValue) == 0x000140, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::CallFunc_GetMaterialSlotNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, CallFunc_Array_Find_ReturnValue) == 0x000150, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000158, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000160, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, CallFunc_GetMaterialSlotNames_ReturnValue_1) == 0x000168, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::CallFunc_GetMaterialSlotNames_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, CallFunc_GetMaterialSlotNames_ReturnValue_2) == 0x000178, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::CallFunc_GetMaterialSlotNames_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, CallFunc_Array_Find_ReturnValue_1) == 0x000188, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::CallFunc_Array_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, CallFunc_Array_Find_ReturnValue_2) == 0x00018C, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::CallFunc_Array_Find_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, CallFunc_CreateDynamicMaterialInstance_ReturnValue_2) == 0x000190, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::CallFunc_CreateDynamicMaterialInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, CallFunc_CreateDynamicMaterialInstance_ReturnValue_3) == 0x000198, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::CallFunc_CreateDynamicMaterialInstance_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, CallFunc_CreateDynamicMaterialInstance_ReturnValue_4) == 0x0001A0, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::CallFunc_CreateDynamicMaterialInstance_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, CallFunc_GetRelativeTransform_ReturnValue) == 0x0001B0, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::CallFunc_GetRelativeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, CallFunc_BreakTransform_Location_1) == 0x000210, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, CallFunc_BreakTransform_Rotation_1) == 0x000228, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, CallFunc_BreakTransform_Scale_1) == 0x000240, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, CallFunc_VLerp_ReturnValue) == 0x000258, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, CallFunc_GetGameInstance_ReturnValue) == 0x000270, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, K2Node_DynamicCast_AsGI_Survival) == 0x000278, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::K2Node_DynamicCast_AsGI_Survival' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, K2Node_DynamicCast_bSuccess) == 0x000280, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000288, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, CallFunc_GetGameInstance_ReturnValue_1) == 0x000370, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, K2Node_DynamicCast_AsGI_Survival_1) == 0x000378, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::K2Node_DynamicCast_AsGI_Survival_1' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, K2Node_DynamicCast_bSuccess_1) == 0x000380, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, K2Node_CustomEvent_isMan_) == 0x000381, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::K2Node_CustomEvent_isMan_' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, K2Node_CustomEvent_Woman_) == 0x000382, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::K2Node_CustomEvent_Woman_' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, K2Node_CreateDelegate_OutputDelegate_2) == 0x000384, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, CallFunc_GetPostProcessInstance_ReturnValue) == 0x000398, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::CallFunc_GetPostProcessInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, CallFunc_GetMaterialSlotNames_ReturnValue_3) == 0x0003A0, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::CallFunc_GetMaterialSlotNames_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, K2Node_DynamicCast_AsBPI_ABPHead) == 0x0003B0, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::K2Node_DynamicCast_AsBPI_ABPHead' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, K2Node_DynamicCast_bSuccess_2) == 0x0003C0, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, CallFunc_Array_Find_ReturnValue_3) == 0x0003C4, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::CallFunc_Array_Find_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, CallFunc_GetMaterialSlotNames_ReturnValue_4) == 0x0003C8, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::CallFunc_GetMaterialSlotNames_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, CallFunc_Array_Find_ReturnValue_4) == 0x0003D8, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::CallFunc_Array_Find_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, CallFunc_GetMaterialSlotNames_ReturnValue_5) == 0x0003E0, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::CallFunc_GetMaterialSlotNames_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, CallFunc_Array_Find_ReturnValue_5) == 0x0003F0, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::CallFunc_Array_Find_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, CallFunc_CreateDynamicMaterialInstance_ReturnValue_5) == 0x0003F8, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::CallFunc_CreateDynamicMaterialInstance_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, CallFunc_CreateDynamicMaterialInstance_ReturnValue_6) == 0x000400, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::CallFunc_CreateDynamicMaterialInstance_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, CallFunc_GetMaterialSlotNames_ReturnValue_6) == 0x000408, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::CallFunc_GetMaterialSlotNames_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, CallFunc_Array_Find_ReturnValue_6) == 0x000418, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::CallFunc_Array_Find_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter, CallFunc_CreateDynamicMaterialInstance_ReturnValue_7) == 0x000420, "Member 'BP_CreateCharacter_C_ExecuteUbergraph_BP_CreateCharacter::CallFunc_CreateDynamicMaterialInstance_ReturnValue_7' has a wrong offset!");

// Function BP_CreateCharacter.BP_CreateCharacter_C.OnLoaded_1BB5864D47EB05B5E11B9F9B66035C96
// 0x0008 (0x0008 - 0x0000)
struct BP_CreateCharacter_C_OnLoaded_1BB5864D47EB05B5E11B9F9B66035C96 final
{
public:
	TSubclassOf<class UObject>                    Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(BP_CreateCharacter_C_OnLoaded_1BB5864D47EB05B5E11B9F9B66035C96) == 0x000008, "Wrong alignment on BP_CreateCharacter_C_OnLoaded_1BB5864D47EB05B5E11B9F9B66035C96");
static_assert(sizeof(BP_CreateCharacter_C_OnLoaded_1BB5864D47EB05B5E11B9F9B66035C96) == 0x000008, "Wrong size on BP_CreateCharacter_C_OnLoaded_1BB5864D47EB05B5E11B9F9B66035C96");
static_assert(offsetof(BP_CreateCharacter_C_OnLoaded_1BB5864D47EB05B5E11B9F9B66035C96, Loaded) == 0x000000, "Member 'BP_CreateCharacter_C_OnLoaded_1BB5864D47EB05B5E11B9F9B66035C96::Loaded' has a wrong offset!");

// Function BP_CreateCharacter.BP_CreateCharacter_C.OnLoaded_60A63591423815B8C614FDB7879E6A36
// 0x0008 (0x0008 - 0x0000)
struct BP_CreateCharacter_C_OnLoaded_60A63591423815B8C614FDB7879E6A36 final
{
public:
	TSubclassOf<class UObject>                    Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(BP_CreateCharacter_C_OnLoaded_60A63591423815B8C614FDB7879E6A36) == 0x000008, "Wrong alignment on BP_CreateCharacter_C_OnLoaded_60A63591423815B8C614FDB7879E6A36");
static_assert(sizeof(BP_CreateCharacter_C_OnLoaded_60A63591423815B8C614FDB7879E6A36) == 0x000008, "Wrong size on BP_CreateCharacter_C_OnLoaded_60A63591423815B8C614FDB7879E6A36");
static_assert(offsetof(BP_CreateCharacter_C_OnLoaded_60A63591423815B8C614FDB7879E6A36, Loaded) == 0x000000, "Member 'BP_CreateCharacter_C_OnLoaded_60A63591423815B8C614FDB7879E6A36::Loaded' has a wrong offset!");

// Function BP_CreateCharacter.BP_CreateCharacter_C.OnLoaded_74BE9FF84D7CEA07053F3F8B7F500CCB
// 0x0008 (0x0008 - 0x0000)
struct BP_CreateCharacter_C_OnLoaded_74BE9FF84D7CEA07053F3F8B7F500CCB final
{
public:
	TSubclassOf<class UObject>                    Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(BP_CreateCharacter_C_OnLoaded_74BE9FF84D7CEA07053F3F8B7F500CCB) == 0x000008, "Wrong alignment on BP_CreateCharacter_C_OnLoaded_74BE9FF84D7CEA07053F3F8B7F500CCB");
static_assert(sizeof(BP_CreateCharacter_C_OnLoaded_74BE9FF84D7CEA07053F3F8B7F500CCB) == 0x000008, "Wrong size on BP_CreateCharacter_C_OnLoaded_74BE9FF84D7CEA07053F3F8B7F500CCB");
static_assert(offsetof(BP_CreateCharacter_C_OnLoaded_74BE9FF84D7CEA07053F3F8B7F500CCB, Loaded) == 0x000000, "Member 'BP_CreateCharacter_C_OnLoaded_74BE9FF84D7CEA07053F3F8B7F500CCB::Loaded' has a wrong offset!");

// Function BP_CreateCharacter.BP_CreateCharacter_C.RestoreMaterials
// 0x0058 (0x0058 - 0x0000)
struct BP_CreateCharacter_C_RestoreMaterials final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue;                 // 0x0038(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CreateCharacter_C_RestoreMaterials) == 0x000008, "Wrong alignment on BP_CreateCharacter_C_RestoreMaterials");
static_assert(sizeof(BP_CreateCharacter_C_RestoreMaterials) == 0x000058, "Wrong size on BP_CreateCharacter_C_RestoreMaterials");
static_assert(offsetof(BP_CreateCharacter_C_RestoreMaterials, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_CreateCharacter_C_RestoreMaterials::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_RestoreMaterials, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_CreateCharacter_C_RestoreMaterials::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_RestoreMaterials, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_CreateCharacter_C_RestoreMaterials::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_RestoreMaterials, Temp_int_Array_Index_Variable_1) == 0x00000C, "Member 'BP_CreateCharacter_C_RestoreMaterials::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_RestoreMaterials, Temp_int_Loop_Counter_Variable_1) == 0x000010, "Member 'BP_CreateCharacter_C_RestoreMaterials::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_RestoreMaterials, K2Node_MakeArray_Array) == 0x000018, "Member 'BP_CreateCharacter_C_RestoreMaterials::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_RestoreMaterials, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_CreateCharacter_C_RestoreMaterials::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_RestoreMaterials, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'BP_CreateCharacter_C_RestoreMaterials::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_RestoreMaterials, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'BP_CreateCharacter_C_RestoreMaterials::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_RestoreMaterials, CallFunc_GetMaterials_ReturnValue) == 0x000038, "Member 'BP_CreateCharacter_C_RestoreMaterials::CallFunc_GetMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_RestoreMaterials, CallFunc_Array_Length_ReturnValue_1) == 0x000048, "Member 'BP_CreateCharacter_C_RestoreMaterials::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_RestoreMaterials, CallFunc_Add_IntInt_ReturnValue_1) == 0x00004C, "Member 'BP_CreateCharacter_C_RestoreMaterials::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CreateCharacter_C_RestoreMaterials, CallFunc_Less_IntInt_ReturnValue_1) == 0x000050, "Member 'BP_CreateCharacter_C_RestoreMaterials::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_CreateCharacter.BP_CreateCharacter_C.SetGirlFace
// 0x0001 (0x0001 - 0x0000)
struct BP_CreateCharacter_C_SetGirlFace final
{
public:
	bool                                          Girl_;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CreateCharacter_C_SetGirlFace) == 0x000001, "Wrong alignment on BP_CreateCharacter_C_SetGirlFace");
static_assert(sizeof(BP_CreateCharacter_C_SetGirlFace) == 0x000001, "Wrong size on BP_CreateCharacter_C_SetGirlFace");
static_assert(offsetof(BP_CreateCharacter_C_SetGirlFace, Girl_) == 0x000000, "Member 'BP_CreateCharacter_C_SetGirlFace::Girl_' has a wrong offset!");

}

