#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DayCycle

#include "Basic.hpp"

#include "S_TimeSettings_structs.hpp"


namespace SDK::Params
{

// Function BP_DayCycle.BP_DayCycle_C.ExecuteUbergraph_BP_DayCycle
// 0x02B0 (0x02B0 - 0x0000)
struct BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_TimeSettings                        CallFunc_GetDataTableRowFromName_OutRow;           // 0x0008(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_TimeSettings                        CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0028(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_TimeSettings                        CallFunc_GetDataTableRowFromName_OutRow_2;         // 0x0048(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_2;    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_TimeSettings                        CallFunc_GetDataTableRowFromName_OutRow_3;         // 0x0078(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_3;    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_TimeSettings                        CallFunc_GetDataTableRowFromName_OutRow_4;         // 0x00A0(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_4;    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_2;      // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_2;        // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue_1;        // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class AUltra_Dynamic_Sky_BP_C*>        CallFunc_GetAllActorsOfClass_OutActors;            // 0x0138(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FS_TimeSettings                        CallFunc_GetDataTableRowFromName_OutRow_5;         // 0x0170(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_5;    // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x018A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18B[0x5];                                      // 0x018B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19A[0x6];                                      // 0x019A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue_2;        // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x01B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_3;        // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x01C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_4;        // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_5;        // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_2;          // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_3;          // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1;  // 0x01FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x01FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue_3;        // 0x0200(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x0210(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_7;              // 0x0220(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FS_TimeSettings                        CallFunc_GetDataTableRowFromName_OutRow_6;         // 0x0230(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_6;    // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_2;  // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24A[0x6];                                      // 0x024A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue_4;        // 0x0250(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_8;              // 0x0260(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1;   // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2;   // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast_1;     // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_3;   // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_SecondsInDay_ImplicitCast;      // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle) == 0x000008, "Wrong alignment on BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle");
static_assert(sizeof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle) == 0x0002B0, "Wrong size on BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, EntryPoint) == 0x000000, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_GetDataTableRowFromName_OutRow) == 0x000008, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000020, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000028, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000040, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_GetDataTableRowFromName_OutRow_2) == 0x000048, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_GetDataTableRowFromName_OutRow_2' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_GetDataTableRowFromName_ReturnValue_2) == 0x000060, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_GetDataTableRowFromName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000068, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, K2Node_Event_DeltaSeconds) == 0x000070, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_GetDataTableRowFromName_OutRow_3) == 0x000078, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_GetDataTableRowFromName_OutRow_3' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_GetDataTableRowFromName_ReturnValue_3) == 0x000090, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_GetDataTableRowFromName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000098, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_GetDataTableRowFromName_OutRow_4) == 0x0000A0, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_GetDataTableRowFromName_OutRow_4' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_GetDataTableRowFromName_ReturnValue_4) == 0x0000B8, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_GetDataTableRowFromName_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0000C0, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0000C8, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x0000D0, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x0000D8, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_Subtract_DoubleDouble_ReturnValue_2) == 0x0000E0, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_Subtract_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x0000E8, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_Conv_DoubleToString_ReturnValue) == 0x0000F0, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_Conv_DoubleToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_Divide_DoubleDouble_ReturnValue_2) == 0x000100, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_Divide_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_Concat_StrStr_ReturnValue) == 0x000108, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000118, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_Conv_DoubleToString_ReturnValue_1) == 0x000128, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_Conv_DoubleToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_GetAllActorsOfClass_OutActors) == 0x000138, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000148, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000158, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000160, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_GetDataTableRowFromName_OutRow_5) == 0x000170, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_GetDataTableRowFromName_OutRow_5' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_GetDataTableRowFromName_ReturnValue_5) == 0x000188, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_GetDataTableRowFromName_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000189, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x00018A, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000190, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000198, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_BooleanAND_ReturnValue) == 0x000199, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_Conv_DoubleToString_ReturnValue_2) == 0x0001A0, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_Conv_DoubleToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_Concat_StrStr_ReturnValue_4) == 0x0001B0, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_Divide_DoubleDouble_ReturnValue_3) == 0x0001C0, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_Divide_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_Concat_StrStr_ReturnValue_5) == 0x0001C8, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_Divide_DoubleDouble_ReturnValue_4) == 0x0001D8, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_Divide_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x0001E0, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x0001E8, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_Divide_DoubleDouble_ReturnValue_5) == 0x0001F0, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_Divide_DoubleDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_Less_DoubleDouble_ReturnValue_2) == 0x0001F8, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_Less_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_Less_DoubleDouble_ReturnValue_3) == 0x0001F9, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_Less_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1) == 0x0001FA, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_BooleanAND_ReturnValue_1) == 0x0001FB, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_Conv_DoubleToString_ReturnValue_3) == 0x000200, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_Conv_DoubleToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_Concat_StrStr_ReturnValue_6) == 0x000210, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_Concat_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_Concat_StrStr_ReturnValue_7) == 0x000220, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_Concat_StrStr_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_GetDataTableRowFromName_OutRow_6) == 0x000230, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_GetDataTableRowFromName_OutRow_6' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_GetDataTableRowFromName_ReturnValue_6) == 0x000248, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_GetDataTableRowFromName_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_2) == 0x000249, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_Conv_DoubleToString_ReturnValue_4) == 0x000250, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_Conv_DoubleToString_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_Concat_StrStr_ReturnValue_8) == 0x000260, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_Concat_StrStr_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000270, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1) == 0x000278, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000280, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000288, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2) == 0x000290, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_Divide_DoubleDouble_A_ImplicitCast_1) == 0x000298, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_Divide_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_3) == 0x0002A0, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle, K2Node_VariableSet_SecondsInDay_ImplicitCast) == 0x0002A8, "Member 'BP_DayCycle_C_ExecuteUbergraph_BP_DayCycle::K2Node_VariableSet_SecondsInDay_ImplicitCast' has a wrong offset!");

// Function BP_DayCycle.BP_DayCycle_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_DayCycle_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DayCycle_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_DayCycle_C_ReceiveTick");
static_assert(sizeof(BP_DayCycle_C_ReceiveTick) == 0x000004, "Wrong size on BP_DayCycle_C_ReceiveTick");
static_assert(offsetof(BP_DayCycle_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_DayCycle_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

