#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DeathCamera

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DeathCamera.BP_DeathCamera_C
// 0x00A8 (0x0338 - 0x0290)
class ABP_DeathCamera_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCameraComponent*                       Camera;                                            // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         LerpCameraRotation__by_survivor__Alpha_EC57B88F448D2717B6F0D39B3740E325; // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            LerpCameraRotation__by_survivor___Direction_EC57B88F448D2717B6F0D39B3740E325; // 0x02AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AD[0x3];                                      // 0x02AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     LerpCameraRotation__by_survivor_;                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Length_29FA8DA3415AB27CC6538D8516D74477; // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_29FA8DA3415AB27CC6538D8516D74477; // 0x02BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BD[0x3];                                      // 0x02BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         LerpCameraRotation_NewTrack_0_1946A67A4DE8DE3FC6713AA50FE07F78; // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            LerpCameraRotation__Direction_1946A67A4DE8DE3FC6713AA50FE07F78; // 0x02CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CD[0x3];                                      // 0x02CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     LerpCameraRotation;                                // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         FocusCameraDeadthSurv_NewTrack_0_7A25834A44495F7BC0E766944AB62F99; // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            FocusCameraDeadthSurv__Direction_7A25834A44495F7BC0E766944AB62F99; // 0x02DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DD[0x3];                                      // 0x02DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     FocusCameraDeadthSurv;                             // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DeadBody;                                          // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class APawn*                                  Killer;                                            // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        OffsetZ;                                           // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DirectionCamera;                                   // 0x0300(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DelayPlayShake;                                    // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   FocusSoketName;                                    // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerDeadBodyV2_C*                    CastedDeadBody;                                    // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      As_SurvivalPlayer;                                 // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void CheckKiller(bool* Result);
	void ExecuteUbergraph_BP_DeathCamera(int32 EntryPoint);
	void FocusCameraDeadthSurv__FinishedFunc();
	void FocusCameraDeadthSurv__UpdateFunc();
	void LerpCameraRotation__by_survivor___FinishedFunc();
	void LerpCameraRotation__by_survivor___UpdateFunc();
	void LerpCameraRotation__FinishedFunc();
	void LerpCameraRotation__UpdateFunc();
	void ReceiveBeginPlay();
	void ReceiveDestroyed();
	void SetNewCameraInPP();
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DeathCamera_C">();
	}
	static class ABP_DeathCamera_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DeathCamera_C>();
	}
};
static_assert(alignof(ABP_DeathCamera_C) == 0x000008, "Wrong alignment on ABP_DeathCamera_C");
static_assert(sizeof(ABP_DeathCamera_C) == 0x000338, "Wrong size on ABP_DeathCamera_C");
static_assert(offsetof(ABP_DeathCamera_C, UberGraphFrame) == 0x000290, "Member 'ABP_DeathCamera_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_DeathCamera_C, Camera) == 0x000298, "Member 'ABP_DeathCamera_C::Camera' has a wrong offset!");
static_assert(offsetof(ABP_DeathCamera_C, DefaultSceneRoot) == 0x0002A0, "Member 'ABP_DeathCamera_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_DeathCamera_C, LerpCameraRotation__by_survivor__Alpha_EC57B88F448D2717B6F0D39B3740E325) == 0x0002A8, "Member 'ABP_DeathCamera_C::LerpCameraRotation__by_survivor__Alpha_EC57B88F448D2717B6F0D39B3740E325' has a wrong offset!");
static_assert(offsetof(ABP_DeathCamera_C, LerpCameraRotation__by_survivor___Direction_EC57B88F448D2717B6F0D39B3740E325) == 0x0002AC, "Member 'ABP_DeathCamera_C::LerpCameraRotation__by_survivor___Direction_EC57B88F448D2717B6F0D39B3740E325' has a wrong offset!");
static_assert(offsetof(ABP_DeathCamera_C, LerpCameraRotation__by_survivor_) == 0x0002B0, "Member 'ABP_DeathCamera_C::LerpCameraRotation__by_survivor_' has a wrong offset!");
static_assert(offsetof(ABP_DeathCamera_C, Timeline_0_Length_29FA8DA3415AB27CC6538D8516D74477) == 0x0002B8, "Member 'ABP_DeathCamera_C::Timeline_0_Length_29FA8DA3415AB27CC6538D8516D74477' has a wrong offset!");
static_assert(offsetof(ABP_DeathCamera_C, Timeline_0__Direction_29FA8DA3415AB27CC6538D8516D74477) == 0x0002BC, "Member 'ABP_DeathCamera_C::Timeline_0__Direction_29FA8DA3415AB27CC6538D8516D74477' has a wrong offset!");
static_assert(offsetof(ABP_DeathCamera_C, Timeline_0) == 0x0002C0, "Member 'ABP_DeathCamera_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_DeathCamera_C, LerpCameraRotation_NewTrack_0_1946A67A4DE8DE3FC6713AA50FE07F78) == 0x0002C8, "Member 'ABP_DeathCamera_C::LerpCameraRotation_NewTrack_0_1946A67A4DE8DE3FC6713AA50FE07F78' has a wrong offset!");
static_assert(offsetof(ABP_DeathCamera_C, LerpCameraRotation__Direction_1946A67A4DE8DE3FC6713AA50FE07F78) == 0x0002CC, "Member 'ABP_DeathCamera_C::LerpCameraRotation__Direction_1946A67A4DE8DE3FC6713AA50FE07F78' has a wrong offset!");
static_assert(offsetof(ABP_DeathCamera_C, LerpCameraRotation) == 0x0002D0, "Member 'ABP_DeathCamera_C::LerpCameraRotation' has a wrong offset!");
static_assert(offsetof(ABP_DeathCamera_C, FocusCameraDeadthSurv_NewTrack_0_7A25834A44495F7BC0E766944AB62F99) == 0x0002D8, "Member 'ABP_DeathCamera_C::FocusCameraDeadthSurv_NewTrack_0_7A25834A44495F7BC0E766944AB62F99' has a wrong offset!");
static_assert(offsetof(ABP_DeathCamera_C, FocusCameraDeadthSurv__Direction_7A25834A44495F7BC0E766944AB62F99) == 0x0002DC, "Member 'ABP_DeathCamera_C::FocusCameraDeadthSurv__Direction_7A25834A44495F7BC0E766944AB62F99' has a wrong offset!");
static_assert(offsetof(ABP_DeathCamera_C, FocusCameraDeadthSurv) == 0x0002E0, "Member 'ABP_DeathCamera_C::FocusCameraDeadthSurv' has a wrong offset!");
static_assert(offsetof(ABP_DeathCamera_C, DeadBody) == 0x0002E8, "Member 'ABP_DeathCamera_C::DeadBody' has a wrong offset!");
static_assert(offsetof(ABP_DeathCamera_C, Killer) == 0x0002F0, "Member 'ABP_DeathCamera_C::Killer' has a wrong offset!");
static_assert(offsetof(ABP_DeathCamera_C, OffsetZ) == 0x0002F8, "Member 'ABP_DeathCamera_C::OffsetZ' has a wrong offset!");
static_assert(offsetof(ABP_DeathCamera_C, DirectionCamera) == 0x000300, "Member 'ABP_DeathCamera_C::DirectionCamera' has a wrong offset!");
static_assert(offsetof(ABP_DeathCamera_C, DelayPlayShake) == 0x000318, "Member 'ABP_DeathCamera_C::DelayPlayShake' has a wrong offset!");
static_assert(offsetof(ABP_DeathCamera_C, FocusSoketName) == 0x000320, "Member 'ABP_DeathCamera_C::FocusSoketName' has a wrong offset!");
static_assert(offsetof(ABP_DeathCamera_C, CastedDeadBody) == 0x000328, "Member 'ABP_DeathCamera_C::CastedDeadBody' has a wrong offset!");
static_assert(offsetof(ABP_DeathCamera_C, As_SurvivalPlayer) == 0x000330, "Member 'ABP_DeathCamera_C::As_SurvivalPlayer' has a wrong offset!");

}

