#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DeerV2

#include "Basic.hpp"

#include "Survival_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "E_AdditiveDamage_structs.hpp"
#include "E_DeerSpawnType_structs.hpp"
#include "F_MovementSettings_structs.hpp"
#include "E_DeerState_structs.hpp"
#include "F_MontagePartName_structs.hpp"
#include "F_DeerProperties_structs.hpp"


namespace SDK::Params
{

// Function BP_DeerV2.BP_DeerV2_C.ActivateDeer
// 0x0188 (0x0188 - 0x0000)
struct BP_DeerV2_C_ActivateDeer final
{
public:
	E_DeerSpawnType                               Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   Temp_softclass_Variable;                           // 0x0008(0x0030)(HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Temp_softclass_Variable_1;                         // 0x0038(0x0030)(HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Temp_softclass_Variable_2;                         // 0x0068(0x0030)(HasGetValueTypeHash)
	E_DeerSpawnType                               Temp_byte_Variable_1;                              // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<Survival::EMovementType, struct FF_MovementSettings> Temp_byte_Variable_2;                              // 0x00A0(0x0050)()
	TMap<Survival::EMovementType, struct FF_MovementSettings> K2Node_Select_Default;                             // 0x00F0(0x0050)()
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   K2Node_Select_Default_1;                           // 0x0148(0x0030)(HasGetValueTypeHash)
	class UClass*                                 CallFunc_LoadClassAsset_Blocking_ReturnValue;      // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_AdditiveDamageMontagePlayRate_ImplicitCast; // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DeerV2_C_ActivateDeer) == 0x000008, "Wrong alignment on BP_DeerV2_C_ActivateDeer");
static_assert(sizeof(BP_DeerV2_C_ActivateDeer) == 0x000188, "Wrong size on BP_DeerV2_C_ActivateDeer");
static_assert(offsetof(BP_DeerV2_C_ActivateDeer, Temp_byte_Variable) == 0x000000, "Member 'BP_DeerV2_C_ActivateDeer::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ActivateDeer, Temp_softclass_Variable) == 0x000008, "Member 'BP_DeerV2_C_ActivateDeer::Temp_softclass_Variable' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ActivateDeer, Temp_softclass_Variable_1) == 0x000038, "Member 'BP_DeerV2_C_ActivateDeer::Temp_softclass_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ActivateDeer, Temp_softclass_Variable_2) == 0x000068, "Member 'BP_DeerV2_C_ActivateDeer::Temp_softclass_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ActivateDeer, Temp_byte_Variable_1) == 0x000098, "Member 'BP_DeerV2_C_ActivateDeer::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ActivateDeer, Temp_byte_Variable_2) == 0x0000A0, "Member 'BP_DeerV2_C_ActivateDeer::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ActivateDeer, K2Node_Select_Default) == 0x0000F0, "Member 'BP_DeerV2_C_ActivateDeer::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ActivateDeer, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000140, "Member 'BP_DeerV2_C_ActivateDeer::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ActivateDeer, K2Node_Select_Default_1) == 0x000148, "Member 'BP_DeerV2_C_ActivateDeer::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ActivateDeer, CallFunc_LoadClassAsset_Blocking_ReturnValue) == 0x000178, "Member 'BP_DeerV2_C_ActivateDeer::CallFunc_LoadClassAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ActivateDeer, K2Node_VariableSet_AdditiveDamageMontagePlayRate_ImplicitCast) == 0x000180, "Member 'BP_DeerV2_C_ActivateDeer::K2Node_VariableSet_AdditiveDamageMontagePlayRate_ImplicitCast' has a wrong offset!");

// Function BP_DeerV2.BP_DeerV2_C.BehaviorFInished__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BP_DeerV2_C_BehaviorFInished__DelegateSignature final
{
public:
	E_DeerState                                   FromState;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DeerV2_C_BehaviorFInished__DelegateSignature) == 0x000001, "Wrong alignment on BP_DeerV2_C_BehaviorFInished__DelegateSignature");
static_assert(sizeof(BP_DeerV2_C_BehaviorFInished__DelegateSignature) == 0x000001, "Wrong size on BP_DeerV2_C_BehaviorFInished__DelegateSignature");
static_assert(offsetof(BP_DeerV2_C_BehaviorFInished__DelegateSignature, FromState) == 0x000000, "Member 'BP_DeerV2_C_BehaviorFInished__DelegateSignature::FromState' has a wrong offset!");

// Function BP_DeerV2.BP_DeerV2_C.CheckFreeAdditiveMontage
// 0x0004 (0x0004 - 0x0000)
struct BP_DeerV2_C_CheckFreeAdditiveMontage final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DeerV2_C_CheckFreeAdditiveMontage) == 0x000001, "Wrong alignment on BP_DeerV2_C_CheckFreeAdditiveMontage");
static_assert(sizeof(BP_DeerV2_C_CheckFreeAdditiveMontage) == 0x000004, "Wrong size on BP_DeerV2_C_CheckFreeAdditiveMontage");
static_assert(offsetof(BP_DeerV2_C_CheckFreeAdditiveMontage, ReturnValue) == 0x000000, "Member 'BP_DeerV2_C_CheckFreeAdditiveMontage::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_CheckFreeAdditiveMontage, CallFunc_BooleanAND_ReturnValue) == 0x000001, "Member 'BP_DeerV2_C_CheckFreeAdditiveMontage::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_CheckFreeAdditiveMontage, CallFunc_BooleanAND_ReturnValue_1) == 0x000002, "Member 'BP_DeerV2_C_CheckFreeAdditiveMontage::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_CheckFreeAdditiveMontage, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'BP_DeerV2_C_CheckFreeAdditiveMontage::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_DeerV2.BP_DeerV2_C.DeerLookAtRandomPoint
// 0x0028 (0x0028 - 0x0000)
struct BP_DeerV2_C_DeerLookAtRandomPoint final
{
public:
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimer_Time_ImplicitCast;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DeerV2_C_DeerLookAtRandomPoint) == 0x000008, "Wrong alignment on BP_DeerV2_C_DeerLookAtRandomPoint");
static_assert(sizeof(BP_DeerV2_C_DeerLookAtRandomPoint) == 0x000028, "Wrong size on BP_DeerV2_C_DeerLookAtRandomPoint");
static_assert(offsetof(BP_DeerV2_C_DeerLookAtRandomPoint, CallFunc_RandomFloatInRange_ReturnValue) == 0x000000, "Member 'BP_DeerV2_C_DeerLookAtRandomPoint::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_DeerLookAtRandomPoint, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000008, "Member 'BP_DeerV2_C_DeerLookAtRandomPoint::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_DeerLookAtRandomPoint, CallFunc_K2_SetTimer_ReturnValue) == 0x000010, "Member 'BP_DeerV2_C_DeerLookAtRandomPoint::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_DeerLookAtRandomPoint, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000018, "Member 'BP_DeerV2_C_DeerLookAtRandomPoint::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_DeerLookAtRandomPoint, CallFunc_K2_SetTimer_Time_ImplicitCast) == 0x000020, "Member 'BP_DeerV2_C_DeerLookAtRandomPoint::CallFunc_K2_SetTimer_Time_ImplicitCast' has a wrong offset!");

// Function BP_DeerV2.BP_DeerV2_C.Define Montage Section
// 0x00C0 (0x00C0 - 0x0000)
struct BP_DeerV2_C_Define_Montage_Section final
{
public:
	class FName                                   BoneName;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	struct FF_MontagePartName                     ReturnValue;                                       // 0x0010(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_AdditiveDamage                              Part;                                              // 0x001C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FF_MontagePartName                     ResultStructure;                                   // 0x0020(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   MontageSectionSide;                                // 0x002C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   MontageSectionLimb;                                // 0x0034(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   MontageSectionName;                                // 0x003C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FF_MontagePartName                     K2Node_MakeStruct_F_MontagePartName;               // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetAngleToActor_Angle;                    // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_2;             // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x2];                                       // 0x00B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x00B4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DeerV2_C_Define_Montage_Section) == 0x000008, "Wrong alignment on BP_DeerV2_C_Define_Montage_Section");
static_assert(sizeof(BP_DeerV2_C_Define_Montage_Section) == 0x0000C0, "Wrong size on BP_DeerV2_C_Define_Montage_Section");
static_assert(offsetof(BP_DeerV2_C_Define_Montage_Section, BoneName) == 0x000000, "Member 'BP_DeerV2_C_Define_Montage_Section::BoneName' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_Define_Montage_Section, DamageCauser) == 0x000008, "Member 'BP_DeerV2_C_Define_Montage_Section::DamageCauser' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_Define_Montage_Section, ReturnValue) == 0x000010, "Member 'BP_DeerV2_C_Define_Montage_Section::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_Define_Montage_Section, Part) == 0x00001C, "Member 'BP_DeerV2_C_Define_Montage_Section::Part' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_Define_Montage_Section, ResultStructure) == 0x000020, "Member 'BP_DeerV2_C_Define_Montage_Section::ResultStructure' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_Define_Montage_Section, MontageSectionSide) == 0x00002C, "Member 'BP_DeerV2_C_Define_Montage_Section::MontageSectionSide' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_Define_Montage_Section, MontageSectionLimb) == 0x000034, "Member 'BP_DeerV2_C_Define_Montage_Section::MontageSectionLimb' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_Define_Montage_Section, MontageSectionName) == 0x00003C, "Member 'BP_DeerV2_C_Define_Montage_Section::MontageSectionName' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_Define_Montage_Section, Temp_name_Variable) == 0x000044, "Member 'BP_DeerV2_C_Define_Montage_Section::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_Define_Montage_Section, Temp_name_Variable_1) == 0x00004C, "Member 'BP_DeerV2_C_Define_Montage_Section::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_Define_Montage_Section, Temp_bool_Variable) == 0x000054, "Member 'BP_DeerV2_C_Define_Montage_Section::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_Define_Montage_Section, K2Node_MakeStruct_F_MontagePartName) == 0x000058, "Member 'BP_DeerV2_C_Define_Montage_Section::K2Node_MakeStruct_F_MontagePartName' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_Define_Montage_Section, CallFunc_Conv_NameToString_ReturnValue) == 0x000068, "Member 'BP_DeerV2_C_Define_Montage_Section::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_Define_Montage_Section, CallFunc_Conv_NameToString_ReturnValue_1) == 0x000078, "Member 'BP_DeerV2_C_Define_Montage_Section::CallFunc_Conv_NameToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_Define_Montage_Section, CallFunc_Concat_StrStr_ReturnValue) == 0x000088, "Member 'BP_DeerV2_C_Define_Montage_Section::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_Define_Montage_Section, CallFunc_Conv_StringToName_ReturnValue) == 0x000098, "Member 'BP_DeerV2_C_Define_Montage_Section::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_Define_Montage_Section, CallFunc_Array_Contains_ReturnValue) == 0x0000A0, "Member 'BP_DeerV2_C_Define_Montage_Section::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_Define_Montage_Section, CallFunc_Array_Contains_ReturnValue_1) == 0x0000A1, "Member 'BP_DeerV2_C_Define_Montage_Section::CallFunc_Array_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_Define_Montage_Section, CallFunc_GetAngleToActor_Angle) == 0x0000A8, "Member 'BP_DeerV2_C_Define_Montage_Section::CallFunc_GetAngleToActor_Angle' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_Define_Montage_Section, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0000B0, "Member 'BP_DeerV2_C_Define_Montage_Section::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_Define_Montage_Section, CallFunc_Array_Contains_ReturnValue_2) == 0x0000B1, "Member 'BP_DeerV2_C_Define_Montage_Section::CallFunc_Array_Contains_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_Define_Montage_Section, K2Node_Select_Default) == 0x0000B4, "Member 'BP_DeerV2_C_Define_Montage_Section::K2Node_Select_Default' has a wrong offset!");

// Function BP_DeerV2.BP_DeerV2_C.ExecuteUbergraph_BP_DeerV2
// 0x07B8 (0x07B8 - 0x0000)
struct BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_24;                  // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_23;                  // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_22;                  // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_21;                  // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_20;                  // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x005C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x0074(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_19;                  // 0x0084(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_18;                  // 0x008C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x0094(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_17;                  // 0x00A4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_6;            // 0x00AC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_16;                  // 0x00BC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_7;            // 0x00C4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_15;                  // 0x00D4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_8;            // 0x00DC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x00EC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_9;            // 0x00F4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_14;                  // 0x0104(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_13;                  // 0x010C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_10;           // 0x0114(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_12;                  // 0x0124(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_11;           // 0x012C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_11;                  // 0x013C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_12;           // 0x0144(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_10;                  // 0x0154(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_13;           // 0x015C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x016C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_175[0x3];                                      // 0x0175(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_9;                   // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_14;           // 0x0180(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_8;                   // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_15;           // 0x0198(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_7;                   // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_16;           // 0x01B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_6;                   // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_17;           // 0x01C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_5;                   // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_18;           // 0x01E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_3;                              // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_19;           // 0x01F8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_20;           // 0x0218(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_21;           // 0x0230(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_22;           // 0x0248(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_23;           // 0x0260(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_4;                              // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          K2Node_DynamicCast_AsSkeletal_Mesh;                // 0x0288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_1;                            // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage;                 // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_2;                       // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_24;           // 0x02BC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_2;                              // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_3;                              // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_2;                            // 0x02D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage_1;               // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E9[0x3];                                      // 0x02E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable_4;                              // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_5;                              // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x02F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Damage;                               // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UDamageType*                      K2Node_Event_DamageType;                           // 0x0308(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitLocation;                          // 0x0310(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x0328(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_HitComponent;                         // 0x0340(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_BoneName;                             // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_ShotFromDirection;                    // 0x0350(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            K2Node_Event_InstigatedBy;                         // 0x0368(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x0370(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x0378(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FF_MontagePartName                     K2Node_CustomEvent_MontagePartName;                // 0x0460(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46C[0x4];                                      // 0x046C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_3;                       // 0x0470(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	E_DeerState                                   Temp_byte_Variable;                                // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0479(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47A[0x2];                                      // 0x047A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x047C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x0480(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_489[0x3];                                      // 0x0489(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_25;           // 0x048C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49C[0x4];                                      // 0x049C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1; // 0x04A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A9[0x3];                                      // 0x04A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_26;           // 0x04AC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BC[0x4];                                      // 0x04BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_2; // 0x04C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_3; // 0x04C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x04D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D2[0x6];                                      // 0x04D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_4; // 0x04D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x04E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_2;        // 0x04E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E3[0x5];                                      // 0x04E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_3;                            // 0x04E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage_2;               // 0x04F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_DeerSpawnType                               K2Node_CustomEvent_DeerType;                       // 0x04F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FA[0x2];                                      // 0x04FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_ManagerIndex;                   // 0x04FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Location;                       // 0x0500(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_CustomEvent_Rotation;                       // 0x0518(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorLocationAndRotation_SweepHitResult; // 0x0530(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocationAndRotation_ReturnValue; // 0x0618(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_619[0x7];                                      // 0x0619(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0620(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0630(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FF_DeerProperties                      CallFunc_GetDataTableRowFromName_OutRow;           // 0x0638(0x00E0)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0718(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_719[0x7];                                      // 0x0719(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x0720(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_27;           // 0x0728(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0738(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ATDB_GameMode_C*                        K2Node_DynamicCast_AsTDB_Game_Mode;                // 0x0740(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0748(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0749(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74A[0x6];                                      // 0x074A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ADeerManager_C*                         CallFunc_GetDeerManager_ReturnValue;               // 0x0750(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ADeerManager_C*                         K2Node_DynamicCast_AsDeer_Manager;                 // 0x0758(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0760(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0761(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_762[0x6];                                      // 0x0762(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0768(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_28;           // 0x0770(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAIC_Deer_C*                            K2Node_DynamicCast_AsAIC_Deer;                     // 0x0780(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0788(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0789(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_78A[0x6];                                      // 0x078A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetHomeLocation_ReturnValue;              // 0x0790(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x07A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A9[0x7];                                      // 0x07A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_OnDamage_Damage_ImplicitCast;             // 0x07B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2) == 0x000008, "Wrong alignment on BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2");
static_assert(sizeof(BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2) == 0x0007B8, "Wrong size on BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2");
static_assert(offsetof(BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2, EntryPoint) == 0x000000, "Member 'BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2, K2Node_CustomEvent_NotifyName_24) == 0x000004, "Member 'BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2::K2Node_CustomEvent_NotifyName_24' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2, K2Node_CustomEvent_NotifyName_23) == 0x00000C, "Member 'BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2::K2Node_CustomEvent_NotifyName_23' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2, K2Node_CustomEvent_NotifyName_22) == 0x000024, "Member 'BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2::K2Node_CustomEvent_NotifyName_22' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2, K2Node_CreateDelegate_OutputDelegate_1) == 0x00002C, "Member 'BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2, K2Node_CustomEvent_NotifyName_21) == 0x00003C, "Member 'BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2::K2Node_CustomEvent_NotifyName_21' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2, K2Node_CreateDelegate_OutputDelegate_2) == 0x000044, "Member 'BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2, K2Node_CustomEvent_NotifyName_20) == 0x000054, "Member 'BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2::K2Node_CustomEvent_NotifyName_20' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2, K2Node_CreateDelegate_OutputDelegate_3) == 0x00005C, "Member 'BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2, Temp_name_Variable) == 0x00006C, "Member 'BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2, K2Node_CreateDelegate_OutputDelegate_4) == 0x000074, "Member 'BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2, K2Node_CustomEvent_NotifyName_19) == 0x000084, "Member 'BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2::K2Node_CustomEvent_NotifyName_19' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2, K2Node_CustomEvent_NotifyName_18) == 0x00008C, "Member 'BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2::K2Node_CustomEvent_NotifyName_18' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2, K2Node_CreateDelegate_OutputDelegate_5) == 0x000094, "Member 'BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2, K2Node_CustomEvent_NotifyName_17) == 0x0000A4, "Member 'BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2::K2Node_CustomEvent_NotifyName_17' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2, K2Node_CreateDelegate_OutputDelegate_6) == 0x0000AC, "Member 'BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2, K2Node_CustomEvent_NotifyName_16) == 0x0000BC, "Member 'BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2::K2Node_CustomEvent_NotifyName_16' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2, K2Node_CreateDelegate_OutputDelegate_7) == 0x0000C4, "Member 'BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2, K2Node_CustomEvent_NotifyName_15) == 0x0000D4, "Member 'BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2::K2Node_CustomEvent_NotifyName_15' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2, K2Node_CreateDelegate_OutputDelegate_8) == 0x0000DC, "Member 'BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2, Temp_name_Variable_1) == 0x0000EC, "Member 'BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2, K2Node_CreateDelegate_OutputDelegate_9) == 0x0000F4, "Member 'BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2, K2Node_CustomEvent_NotifyName_14) == 0x000104, "Member 'BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2::K2Node_CustomEvent_NotifyName_14' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2, K2Node_CustomEvent_NotifyName_13) == 0x00010C, "Member 'BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2::K2Node_CustomEvent_NotifyName_13' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2, K2Node_CreateDelegate_OutputDelegate_10) == 0x000114, "Member 'BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2, K2Node_CustomEvent_NotifyName_12) == 0x000124, "Member 'BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2::K2Node_CustomEvent_NotifyName_12' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2, K2Node_CreateDelegate_OutputDelegate_11) == 0x00012C, "Member 'BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2, K2Node_CustomEvent_NotifyName_11) == 0x00013C, "Member 'BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2::K2Node_CustomEvent_NotifyName_11' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2, K2Node_CreateDelegate_OutputDelegate_12) == 0x000144, "Member 'BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2, K2Node_CustomEvent_NotifyName_10) == 0x000154, "Member 'BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2::K2Node_CustomEvent_NotifyName_10' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2, K2Node_CreateDelegate_OutputDelegate_13) == 0x00015C, "Member 'BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2::K2Node_CreateDelegate_OutputDelegate_13' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2, Temp_name_Variable_2) == 0x00016C, "Member 'BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2, K2Node_SwitchEnum_CmpSuccess) == 0x000174, "Member 'BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2, K2Node_CustomEvent_NotifyName_9) == 0x000178, "Member 'BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2::K2Node_CustomEvent_NotifyName_9' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2, K2Node_CreateDelegate_OutputDelegate_14) == 0x000180, "Member 'BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2::K2Node_CreateDelegate_OutputDelegate_14' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2, K2Node_CustomEvent_NotifyName_8) == 0x000190, "Member 'BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2::K2Node_CustomEvent_NotifyName_8' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2, K2Node_CreateDelegate_OutputDelegate_15) == 0x000198, "Member 'BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2::K2Node_CreateDelegate_OutputDelegate_15' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2, K2Node_CustomEvent_NotifyName_7) == 0x0001A8, "Member 'BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2::K2Node_CustomEvent_NotifyName_7' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2, K2Node_CreateDelegate_OutputDelegate_16) == 0x0001B0, "Member 'BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2::K2Node_CreateDelegate_OutputDelegate_16' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2, K2Node_CustomEvent_NotifyName_6) == 0x0001C0, "Member 'BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2::K2Node_CustomEvent_NotifyName_6' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2, K2Node_CreateDelegate_OutputDelegate_17) == 0x0001C8, "Member 'BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2::K2Node_CreateDelegate_OutputDelegate_17' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2, K2Node_CustomEvent_NotifyName_5) == 0x0001D8, "Member 'BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2::K2Node_CustomEvent_NotifyName_5' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2, K2Node_CreateDelegate_OutputDelegate_18) == 0x0001E0, "Member 'BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2::K2Node_CreateDelegate_OutputDelegate_18' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2, Temp_name_Variable_3) == 0x0001F0, "Member 'BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2, K2Node_CreateDelegate_OutputDelegate_19) == 0x0001F8, "Member 'BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2::K2Node_CreateDelegate_OutputDelegate_19' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2, K2Node_CustomEvent_NotifyName_4) == 0x000208, "Member 'BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2, K2Node_CustomEvent_NotifyName_3) == 0x000210, "Member 'BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2, K2Node_CreateDelegate_OutputDelegate_20) == 0x000218, "Member 'BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2::K2Node_CreateDelegate_OutputDelegate_20' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2, K2Node_CustomEvent_NotifyName_2) == 0x000228, "Member 'BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2, K2Node_CreateDelegate_OutputDelegate_21) == 0x000230, "Member 'BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2::K2Node_CreateDelegate_OutputDelegate_21' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2, K2Node_CustomEvent_NotifyName_1) == 0x000240, "Member 'BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2, K2Node_CreateDelegate_OutputDelegate_22) == 0x000248, "Member 'BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2::K2Node_CreateDelegate_OutputDelegate_22' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2, K2Node_CustomEvent_NotifyName) == 0x000258, "Member 'BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2, K2Node_CreateDelegate_OutputDelegate_23) == 0x000260, "Member 'BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2::K2Node_CreateDelegate_OutputDelegate_23' has a wrong offset!");
static_assert(offsetof(BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2, Temp_name_Variable_4) == 0x000270, "Member 'BP_DeerV2_C_ExecuteUbergraph_BP_DeerV2::Temp_name_Variable_4' has a wrong offset!");
