#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_D2S_Manager

#include "Basic.hpp"

#include "S_D2S_Decals_structs.hpp"


namespace SDK::Params
{

// Function BP_D2S_Manager.BP_D2S_Manager_C.AddDecal
// 0x0158 (0x0158 - 0x0000)
struct BP_D2S_Manager_C_AddDecal final
{
public:
	class USceneComponent*                        Mesh;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_D2S_Glass_C*                        Decal;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_D2S_Glass_C*>                LocArray;                                          // 0x0010(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_D2S_Glass_C*>                K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ReferenceParm)
	struct FS_D2S_Decals                          K2Node_MakeStruct_S_D2S_Decals;                    // 0x0038(0x0010)(HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USceneComponent*>                CallFunc_Map_Keys_Keys;                            // 0x0090(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USceneComponent*                        CallFunc_Array_Get_Item;                           // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                CallFunc_Map_Keys_Keys_1;                          // 0x00A8(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_Array_Get_Item_1;                         // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USceneComponent*>                CallFunc_Map_Keys_Keys_2;                          // 0x00D0(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Variable_3;                               // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_Array_Get_Item_2;                         // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FS_D2S_Decals                          CallFunc_Map_Find_Value;                           // 0x00F0(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_1;                           // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_D2S_Decals                          K2Node_SetFieldsInStruct_StructOut;                // 0x0108(0x0010)(HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_D2S_Glass_C*                        CallFunc_Array_Get_Item_3;                         // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_D2S_Decals                          CallFunc_Map_Find_Value_1;                         // 0x0130(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_D2S_Decals                          K2Node_SetFieldsInStruct_StructOut_1;              // 0x0148(0x0010)(HasGetValueTypeHash)
};
static_assert(alignof(BP_D2S_Manager_C_AddDecal) == 0x000008, "Wrong alignment on BP_D2S_Manager_C_AddDecal");
static_assert(sizeof(BP_D2S_Manager_C_AddDecal) == 0x000158, "Wrong size on BP_D2S_Manager_C_AddDecal");
static_assert(offsetof(BP_D2S_Manager_C_AddDecal, Mesh) == 0x000000, "Member 'BP_D2S_Manager_C_AddDecal::Mesh' has a wrong offset!");
static_assert(offsetof(BP_D2S_Manager_C_AddDecal, Decal) == 0x000008, "Member 'BP_D2S_Manager_C_AddDecal::Decal' has a wrong offset!");
static_assert(offsetof(BP_D2S_Manager_C_AddDecal, LocArray) == 0x000010, "Member 'BP_D2S_Manager_C_AddDecal::LocArray' has a wrong offset!");
static_assert(offsetof(BP_D2S_Manager_C_AddDecal, Temp_bool_Variable) == 0x000020, "Member 'BP_D2S_Manager_C_AddDecal::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_D2S_Manager_C_AddDecal, K2Node_MakeArray_Array) == 0x000028, "Member 'BP_D2S_Manager_C_AddDecal::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_D2S_Manager_C_AddDecal, K2Node_MakeStruct_S_D2S_Decals) == 0x000038, "Member 'BP_D2S_Manager_C_AddDecal::K2Node_MakeStruct_S_D2S_Decals' has a wrong offset!");
static_assert(offsetof(BP_D2S_Manager_C_AddDecal, Temp_int_Variable) == 0x000048, "Member 'BP_D2S_Manager_C_AddDecal::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_D2S_Manager_C_AddDecal, Temp_int_Variable_1) == 0x00004C, "Member 'BP_D2S_Manager_C_AddDecal::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_D2S_Manager_C_AddDecal, K2Node_Select_Default) == 0x000050, "Member 'BP_D2S_Manager_C_AddDecal::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_D2S_Manager_C_AddDecal, CallFunc_Conv_IntToString_ReturnValue) == 0x000058, "Member 'BP_D2S_Manager_C_AddDecal::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_D2S_Manager_C_AddDecal, Temp_bool_Variable_1) == 0x000068, "Member 'BP_D2S_Manager_C_AddDecal::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_D2S_Manager_C_AddDecal, CallFunc_Array_Add_ReturnValue) == 0x00006C, "Member 'BP_D2S_Manager_C_AddDecal::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_D2S_Manager_C_AddDecal, CallFunc_Add_IntInt_ReturnValue) == 0x000070, "Member 'BP_D2S_Manager_C_AddDecal::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_D2S_Manager_C_AddDecal, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000078, "Member 'BP_D2S_Manager_C_AddDecal::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_D2S_Manager_C_AddDecal, Temp_int_Variable_2) == 0x000088, "Member 'BP_D2S_Manager_C_AddDecal::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_D2S_Manager_C_AddDecal, CallFunc_Map_Keys_Keys) == 0x000090, "Member 'BP_D2S_Manager_C_AddDecal::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(BP_D2S_Manager_C_AddDecal, CallFunc_Array_Get_Item) == 0x0000A0, "Member 'BP_D2S_Manager_C_AddDecal::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_D2S_Manager_C_AddDecal, CallFunc_Map_Keys_Keys_1) == 0x0000A8, "Member 'BP_D2S_Manager_C_AddDecal::CallFunc_Map_Keys_Keys_1' has a wrong offset!");
static_assert(offsetof(BP_D2S_Manager_C_AddDecal, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000B8, "Member 'BP_D2S_Manager_C_AddDecal::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_D2S_Manager_C_AddDecal, CallFunc_Array_Get_Item_1) == 0x0000C0, "Member 'BP_D2S_Manager_C_AddDecal::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_D2S_Manager_C_AddDecal, CallFunc_Map_Remove_ReturnValue) == 0x0000C8, "Member 'BP_D2S_Manager_C_AddDecal::CallFunc_Map_Remove_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_D2S_Manager_C_AddDecal, CallFunc_Map_Keys_Keys_2) == 0x0000D0, "Member 'BP_D2S_Manager_C_AddDecal::CallFunc_Map_Keys_Keys_2' has a wrong offset!");
static_assert(offsetof(BP_D2S_Manager_C_AddDecal, Temp_int_Variable_3) == 0x0000E0, "Member 'BP_D2S_Manager_C_AddDecal::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_D2S_Manager_C_AddDecal, CallFunc_Array_Get_Item_2) == 0x0000E8, "Member 'BP_D2S_Manager_C_AddDecal::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_D2S_Manager_C_AddDecal, CallFunc_Map_Find_Value) == 0x0000F0, "Member 'BP_D2S_Manager_C_AddDecal::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_D2S_Manager_C_AddDecal, CallFunc_Map_Find_ReturnValue) == 0x000100, "Member 'BP_D2S_Manager_C_AddDecal::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_D2S_Manager_C_AddDecal, K2Node_Select_Default_1) == 0x000104, "Member 'BP_D2S_Manager_C_AddDecal::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_D2S_Manager_C_AddDecal, K2Node_SetFieldsInStruct_StructOut) == 0x000108, "Member 'BP_D2S_Manager_C_AddDecal::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");
static_assert(offsetof(BP_D2S_Manager_C_AddDecal, CallFunc_Add_IntInt_ReturnValue_1) == 0x000118, "Member 'BP_D2S_Manager_C_AddDecal::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_D2S_Manager_C_AddDecal, CallFunc_Array_Get_Item_3) == 0x000120, "Member 'BP_D2S_Manager_C_AddDecal::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BP_D2S_Manager_C_AddDecal, CallFunc_Array_Length_ReturnValue) == 0x000128, "Member 'BP_D2S_Manager_C_AddDecal::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_D2S_Manager_C_AddDecal, CallFunc_Greater_IntInt_ReturnValue) == 0x00012C, "Member 'BP_D2S_Manager_C_AddDecal::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_D2S_Manager_C_AddDecal, CallFunc_Map_Find_Value_1) == 0x000130, "Member 'BP_D2S_Manager_C_AddDecal::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(BP_D2S_Manager_C_AddDecal, CallFunc_Map_Find_ReturnValue_1) == 0x000140, "Member 'BP_D2S_Manager_C_AddDecal::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_D2S_Manager_C_AddDecal, K2Node_SetFieldsInStruct_StructOut_1) == 0x000148, "Member 'BP_D2S_Manager_C_AddDecal::K2Node_SetFieldsInStruct_StructOut_1' has a wrong offset!");

// Function BP_D2S_Manager.BP_D2S_Manager_C.ExecuteUbergraph_BP_D2S_Manager
// 0x0080 (0x0080 - 0x0000)
struct BP_D2S_Manager_C_ExecuteUbergraph_BP_D2S_Manager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class USceneComponent*                        K2Node_CustomEvent_Mesh;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FS_D2S_Decals                          CallFunc_Map_Find_Value;                           // 0x0030(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_D2S_Glass_C*                        CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USceneComponent*>                CallFunc_Map_Keys_Keys;                            // 0x0068(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USceneComponent*                        CallFunc_Array_Get_Item_1;                         // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_D2S_Manager_C_ExecuteUbergraph_BP_D2S_Manager) == 0x000008, "Wrong alignment on BP_D2S_Manager_C_ExecuteUbergraph_BP_D2S_Manager");
static_assert(sizeof(BP_D2S_Manager_C_ExecuteUbergraph_BP_D2S_Manager) == 0x000080, "Wrong size on BP_D2S_Manager_C_ExecuteUbergraph_BP_D2S_Manager");
static_assert(offsetof(BP_D2S_Manager_C_ExecuteUbergraph_BP_D2S_Manager, EntryPoint) == 0x000000, "Member 'BP_D2S_Manager_C_ExecuteUbergraph_BP_D2S_Manager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_D2S_Manager_C_ExecuteUbergraph_BP_D2S_Manager, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_D2S_Manager_C_ExecuteUbergraph_BP_D2S_Manager::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_D2S_Manager_C_ExecuteUbergraph_BP_D2S_Manager, Temp_int_Variable) == 0x000008, "Member 'BP_D2S_Manager_C_ExecuteUbergraph_BP_D2S_Manager::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_D2S_Manager_C_ExecuteUbergraph_BP_D2S_Manager, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_D2S_Manager_C_ExecuteUbergraph_BP_D2S_Manager::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_D2S_Manager_C_ExecuteUbergraph_BP_D2S_Manager, Temp_int_Variable_1) == 0x000010, "Member 'BP_D2S_Manager_C_ExecuteUbergraph_BP_D2S_Manager::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_D2S_Manager_C_ExecuteUbergraph_BP_D2S_Manager, Temp_int_Array_Index_Variable) == 0x000014, "Member 'BP_D2S_Manager_C_ExecuteUbergraph_BP_D2S_Manager::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_D2S_Manager_C_ExecuteUbergraph_BP_D2S_Manager, CallFunc_Conv_IntToString_ReturnValue) == 0x000018, "Member 'BP_D2S_Manager_C_ExecuteUbergraph_BP_D2S_Manager::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_D2S_Manager_C_ExecuteUbergraph_BP_D2S_Manager, K2Node_CustomEvent_Mesh) == 0x000028, "Member 'BP_D2S_Manager_C_ExecuteUbergraph_BP_D2S_Manager::K2Node_CustomEvent_Mesh' has a wrong offset!");
static_assert(offsetof(BP_D2S_Manager_C_ExecuteUbergraph_BP_D2S_Manager, CallFunc_Map_Find_Value) == 0x000030, "Member 'BP_D2S_Manager_C_ExecuteUbergraph_BP_D2S_Manager::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_D2S_Manager_C_ExecuteUbergraph_BP_D2S_Manager, CallFunc_Map_Find_ReturnValue) == 0x000040, "Member 'BP_D2S_Manager_C_ExecuteUbergraph_BP_D2S_Manager::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_D2S_Manager_C_ExecuteUbergraph_BP_D2S_Manager, CallFunc_Array_Get_Item) == 0x000048, "Member 'BP_D2S_Manager_C_ExecuteUbergraph_BP_D2S_Manager::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_D2S_Manager_C_ExecuteUbergraph_BP_D2S_Manager, CallFunc_Map_Remove_ReturnValue) == 0x000050, "Member 'BP_D2S_Manager_C_ExecuteUbergraph_BP_D2S_Manager::CallFunc_Map_Remove_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_D2S_Manager_C_ExecuteUbergraph_BP_D2S_Manager, CallFunc_Array_Length_ReturnValue) == 0x000054, "Member 'BP_D2S_Manager_C_ExecuteUbergraph_BP_D2S_Manager::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_D2S_Manager_C_ExecuteUbergraph_BP_D2S_Manager, Temp_bool_Variable) == 0x000058, "Member 'BP_D2S_Manager_C_ExecuteUbergraph_BP_D2S_Manager::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_D2S_Manager_C_ExecuteUbergraph_BP_D2S_Manager, CallFunc_Less_IntInt_ReturnValue) == 0x000059, "Member 'BP_D2S_Manager_C_ExecuteUbergraph_BP_D2S_Manager::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_D2S_Manager_C_ExecuteUbergraph_BP_D2S_Manager, K2Node_Select_Default) == 0x00005C, "Member 'BP_D2S_Manager_C_ExecuteUbergraph_BP_D2S_Manager::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_D2S_Manager_C_ExecuteUbergraph_BP_D2S_Manager, CallFunc_Add_IntInt_ReturnValue_1) == 0x000060, "Member 'BP_D2S_Manager_C_ExecuteUbergraph_BP_D2S_Manager::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_D2S_Manager_C_ExecuteUbergraph_BP_D2S_Manager, CallFunc_Map_Keys_Keys) == 0x000068, "Member 'BP_D2S_Manager_C_ExecuteUbergraph_BP_D2S_Manager::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(BP_D2S_Manager_C_ExecuteUbergraph_BP_D2S_Manager, CallFunc_Array_Get_Item_1) == 0x000078, "Member 'BP_D2S_Manager_C_ExecuteUbergraph_BP_D2S_Manager::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function BP_D2S_Manager.BP_D2S_Manager_C.MeshDestroyed
// 0x0008 (0x0008 - 0x0000)
struct BP_D2S_Manager_C_MeshDestroyed final
{
public:
	class USceneComponent*                        Mesh;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_D2S_Manager_C_MeshDestroyed) == 0x000008, "Wrong alignment on BP_D2S_Manager_C_MeshDestroyed");
static_assert(sizeof(BP_D2S_Manager_C_MeshDestroyed) == 0x000008, "Wrong size on BP_D2S_Manager_C_MeshDestroyed");
static_assert(offsetof(BP_D2S_Manager_C_MeshDestroyed, Mesh) == 0x000000, "Member 'BP_D2S_Manager_C_MeshDestroyed::Mesh' has a wrong offset!");

// Function BP_D2S_Manager.BP_D2S_Manager_C.RemoveDecal
// 0x0080 (0x0080 - 0x0000)
struct BP_D2S_Manager_C_RemoveDecal final
{
public:
	const class USceneComponent*                  Mesh;                                              // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	const class ABP_D2S_Glass_C*                  Decal;                                             // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_D2S_Glass_C*>                LocArray;                                          // 0x0010(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_D2S_Decals                          CallFunc_Map_Find_Value;                           // 0x0050(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_D2S_Decals                          K2Node_SetFieldsInStruct_StructOut;                // 0x0070(0x0010)(HasGetValueTypeHash)
};
static_assert(alignof(BP_D2S_Manager_C_RemoveDecal) == 0x000008, "Wrong alignment on BP_D2S_Manager_C_RemoveDecal");
static_assert(sizeof(BP_D2S_Manager_C_RemoveDecal) == 0x000080, "Wrong size on BP_D2S_Manager_C_RemoveDecal");
static_assert(offsetof(BP_D2S_Manager_C_RemoveDecal, Mesh) == 0x000000, "Member 'BP_D2S_Manager_C_RemoveDecal::Mesh' has a wrong offset!");
static_assert(offsetof(BP_D2S_Manager_C_RemoveDecal, Decal) == 0x000008, "Member 'BP_D2S_Manager_C_RemoveDecal::Decal' has a wrong offset!");
static_assert(offsetof(BP_D2S_Manager_C_RemoveDecal, LocArray) == 0x000010, "Member 'BP_D2S_Manager_C_RemoveDecal::LocArray' has a wrong offset!");
static_assert(offsetof(BP_D2S_Manager_C_RemoveDecal, Temp_int_Variable) == 0x000020, "Member 'BP_D2S_Manager_C_RemoveDecal::Temp_int_Variable' has a wrong offset!");
