#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_D2S_Manager

#include "Basic.hpp"

#include "S_D2S_Decals_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_D2S_Manager.BP_D2S_Manager_C
// 0x0078 (0x0308 - 0x0290)
class ABP_D2S_Manager_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_D2S_Glass_C*>                Decals;                                            // 0x02A0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TMap<class USceneComponent*, struct FS_D2S_Decals> Meshes;                                            // 0x02B0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         DecalCount;                                        // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddDecal(class USceneComponent* Mesh, class ABP_D2S_Glass_C* Decal);
	void ExecuteUbergraph_BP_D2S_Manager(int32 EntryPoint);
	void MeshDestroyed(class USceneComponent* Mesh);
	void RemoveDecal(const class USceneComponent*& Mesh, const class ABP_D2S_Glass_C*& Decal);
	void TestDestroy1Mesh();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_D2S_Manager_C">();
	}
	static class ABP_D2S_Manager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_D2S_Manager_C>();
	}
};
static_assert(alignof(ABP_D2S_Manager_C) == 0x000008, "Wrong alignment on ABP_D2S_Manager_C");
static_assert(sizeof(ABP_D2S_Manager_C) == 0x000308, "Wrong size on ABP_D2S_Manager_C");
static_assert(offsetof(ABP_D2S_Manager_C, UberGraphFrame) == 0x000290, "Member 'ABP_D2S_Manager_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_D2S_Manager_C, DefaultSceneRoot) == 0x000298, "Member 'ABP_D2S_Manager_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_D2S_Manager_C, Decals) == 0x0002A0, "Member 'ABP_D2S_Manager_C::Decals' has a wrong offset!");
static_assert(offsetof(ABP_D2S_Manager_C, Meshes) == 0x0002B0, "Member 'ABP_D2S_Manager_C::Meshes' has a wrong offset!");
static_assert(offsetof(ABP_D2S_Manager_C, DecalCount) == 0x000300, "Member 'ABP_D2S_Manager_C::DecalCount' has a wrong offset!");

}

