#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ExplosiveMine

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ExplosiveMine.BP_ExplosiveMine_C.ExecuteUbergraph_BP_ExplosiveMine
// 0x0090 (0x0090 - 0x0000)
struct BP_ExplosiveMine_C_ExecuteUbergraph_BP_ExplosiveMine final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0020(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AExplosive_F1_C*                        CallFunc_FinishSpawningActor_ReturnValue;          // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExplosiveMine_C_ExecuteUbergraph_BP_ExplosiveMine) == 0x000010, "Wrong alignment on BP_ExplosiveMine_C_ExecuteUbergraph_BP_ExplosiveMine");
static_assert(sizeof(BP_ExplosiveMine_C_ExecuteUbergraph_BP_ExplosiveMine) == 0x000090, "Wrong size on BP_ExplosiveMine_C_ExecuteUbergraph_BP_ExplosiveMine");
static_assert(offsetof(BP_ExplosiveMine_C_ExecuteUbergraph_BP_ExplosiveMine, EntryPoint) == 0x000000, "Member 'BP_ExplosiveMine_C_ExecuteUbergraph_BP_ExplosiveMine::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ExplosiveMine_C_ExecuteUbergraph_BP_ExplosiveMine, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'BP_ExplosiveMine_C_ExecuteUbergraph_BP_ExplosiveMine::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExplosiveMine_C_ExecuteUbergraph_BP_ExplosiveMine, CallFunc_MakeTransform_ReturnValue) == 0x000020, "Member 'BP_ExplosiveMine_C_ExecuteUbergraph_BP_ExplosiveMine::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExplosiveMine_C_ExecuteUbergraph_BP_ExplosiveMine, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000080, "Member 'BP_ExplosiveMine_C_ExecuteUbergraph_BP_ExplosiveMine::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExplosiveMine_C_ExecuteUbergraph_BP_ExplosiveMine, CallFunc_FinishSpawningActor_ReturnValue) == 0x000088, "Member 'BP_ExplosiveMine_C_ExecuteUbergraph_BP_ExplosiveMine::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

}

