#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EntranceToRoom

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_InteractType_structs.hpp"
#include "E_ActorType_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_EntranceToRoom.BP_EntranceToRoom_C.BndEvt__BP_DoorTeleport_TipBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct BP_EntranceToRoom_C_BndEvt__BP_DoorTeleport_TipBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_EntranceToRoom_C_BndEvt__BP_DoorTeleport_TipBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_EntranceToRoom_C_BndEvt__BP_DoorTeleport_TipBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_EntranceToRoom_C_BndEvt__BP_DoorTeleport_TipBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on BP_EntranceToRoom_C_BndEvt__BP_DoorTeleport_TipBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_EntranceToRoom_C_BndEvt__BP_DoorTeleport_TipBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_EntranceToRoom_C_BndEvt__BP_DoorTeleport_TipBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_BndEvt__BP_DoorTeleport_TipBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_EntranceToRoom_C_BndEvt__BP_DoorTeleport_TipBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_BndEvt__BP_DoorTeleport_TipBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_EntranceToRoom_C_BndEvt__BP_DoorTeleport_TipBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_BndEvt__BP_DoorTeleport_TipBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_EntranceToRoom_C_BndEvt__BP_DoorTeleport_TipBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_BndEvt__BP_DoorTeleport_TipBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_EntranceToRoom_C_BndEvt__BP_DoorTeleport_TipBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_BndEvt__BP_DoorTeleport_TipBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_EntranceToRoom_C_BndEvt__BP_DoorTeleport_TipBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_EntranceToRoom.BP_EntranceToRoom_C.ExecuteUbergraph_BP_EntranceToRoom
// 0x0400 (0x0400 - 0x0000)
struct BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayerCutsceneComponent_C*             CallFunc_GetComponentByClass_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_Player_8;                             // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_PlayerMain_C*                      K2Node_CustomEvent_FocusOver;                      // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0090(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_Event_Visible_1;                            // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Visible;                              // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17A[0x6];                                      // 0x017A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_GameHUD_C*                          K2Node_DynamicCast_AsBP_Game_HUD;                  // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_Player_7;                             // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BD[0x3];                                      // 0x01BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x01C0(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class APawn*                                  K2Node_Event_Player_6;                             // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SitIndex;                             // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_SkipAnimation;                        // 0x02B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B5[0x3];                                      // 0x02B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_Player_5;                             // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_Player_4;                             // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_Player_3;                             // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSomethingOnA_Way_ReturnValue;           // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x02D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x02D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D3[0x5];                                      // 0x02D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_Player_2;                             // 0x02D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_Player_1;                             // 0x02E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x02F0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0300(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_308[0x8];                                      // 0x0308(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0310(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_V2_C*                   K2Node_DynamicCast_AsSurvival_Player_V2;           // 0x0370(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_379[0x7];                                      // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0380(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0398(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x03B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayerCutsceneComponent_C*             CallFunc_GetComponentByClass_ReturnValue_1;        // 0x03C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_Player;                               // 0x03D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player_1;            // 0x03D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x03E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E2[0x6];                                      // 0x03E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom) == 0x000010, "Wrong alignment on BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom");
static_assert(sizeof(BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom) == 0x000400, "Wrong size on BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom");
static_assert(offsetof(BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom, EntryPoint) == 0x000000, "Member 'BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom, CallFunc_K2_GetPawn_ReturnValue) == 0x000038, "Member 'BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom, K2Node_DynamicCast_AsSurvival_Player) == 0x000040, "Member 'BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom, CallFunc_Array_Length_ReturnValue) == 0x00004C, "Member 'BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom, CallFunc_GetComponentByClass_ReturnValue) == 0x000050, "Member 'BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000058, "Member 'BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom, K2Node_Event_Player_8) == 0x000060, "Member 'BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom::K2Node_Event_Player_8' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000068, "Member 'BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom, K2Node_CustomEvent_FocusOver) == 0x000070, "Member 'BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom::K2Node_CustomEvent_FocusOver' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom, CallFunc_MakeRotator_ReturnValue) == 0x000078, "Member 'BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000090, "Member 'BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom, K2Node_Event_Visible_1) == 0x000178, "Member 'BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom::K2Node_Event_Visible_1' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom, K2Node_Event_Visible) == 0x000179, "Member 'BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom::K2Node_Event_Visible' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom, CallFunc_GetHUD_ReturnValue) == 0x000180, "Member 'BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom, K2Node_DynamicCast_AsBP_Game_HUD) == 0x000188, "Member 'BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom::K2Node_DynamicCast_AsBP_Game_HUD' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom, K2Node_DynamicCast_bSuccess_1) == 0x000190, "Member 'BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom, K2Node_Event_Player_7) == 0x000198, "Member 'BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom::K2Node_Event_Player_7' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0001A0, "Member 'BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom, K2Node_ComponentBoundEvent_OtherActor) == 0x0001A8, "Member 'BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom, K2Node_ComponentBoundEvent_OtherComp) == 0x0001B0, "Member 'BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x0001B8, "Member 'BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom, K2Node_ComponentBoundEvent_bFromSweep) == 0x0001BC, "Member 'BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom, K2Node_ComponentBoundEvent_SweepResult) == 0x0001C0, "Member 'BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom, K2Node_Event_Player_6) == 0x0002A8, "Member 'BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom::K2Node_Event_Player_6' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom, K2Node_Event_SitIndex) == 0x0002B0, "Member 'BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom::K2Node_Event_SitIndex' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom, K2Node_Event_SkipAnimation) == 0x0002B4, "Member 'BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom::K2Node_Event_SkipAnimation' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom, K2Node_Event_Player_5) == 0x0002B8, "Member 'BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom::K2Node_Event_Player_5' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom, K2Node_Event_Player_4) == 0x0002C0, "Member 'BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom::K2Node_Event_Player_4' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom, K2Node_Event_Player_3) == 0x0002C8, "Member 'BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom::K2Node_Event_Player_3' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom, CallFunc_IsSomethingOnA_Way_ReturnValue) == 0x0002D0, "Member 'BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom::CallFunc_IsSomethingOnA_Way_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom, CallFunc_Not_PreBool_ReturnValue) == 0x0002D1, "Member 'BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom, CallFunc_IsInViewport_ReturnValue) == 0x0002D2, "Member 'BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom::CallFunc_IsInViewport_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom, K2Node_Event_Player_2) == 0x0002D8, "Member 'BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom::K2Node_Event_Player_2' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom, CallFunc_BooleanAND_ReturnValue) == 0x0002E0, "Member 'BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom, K2Node_Event_Player_1) == 0x0002E8, "Member 'BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom::K2Node_Event_Player_1' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom, K2Node_CreateDelegate_OutputDelegate_2) == 0x0002F0, "Member 'BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000300, "Member 'BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom, CallFunc_GetTransform_ReturnValue) == 0x000310, "Member 'BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom, K2Node_DynamicCast_AsSurvival_Player_V2) == 0x000370, "Member 'BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom::K2Node_DynamicCast_AsSurvival_Player_V2' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom, K2Node_DynamicCast_bSuccess_2) == 0x000378, "Member 'BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom, CallFunc_BreakTransform_Location) == 0x000380, "Member 'BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom, CallFunc_BreakTransform_Rotation) == 0x000398, "Member 'BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom, CallFunc_BreakTransform_Scale) == 0x0003B0, "Member 'BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom, CallFunc_GetComponentByClass_ReturnValue_1) == 0x0003C8, "Member 'BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom, K2Node_Event_Player) == 0x0003D0, "Member 'BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom::K2Node_Event_Player' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom, K2Node_DynamicCast_AsSurvival_Player_1) == 0x0003D8, "Member 'BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom::K2Node_DynamicCast_AsSurvival_Player_1' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom, K2Node_DynamicCast_bSuccess_3) == 0x0003E0, "Member 'BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom, CallFunc_IsLocallyControlled_ReturnValue) == 0x0003E1, "Member 'BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x0003E8, "Member 'BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x0003F0, "Member 'BP_EntranceToRoom_C_ExecuteUbergraph_BP_EntranceToRoom::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");

// Function BP_EntranceToRoom.BP_EntranceToRoom_C.FocusOver
// 0x0008 (0x0008 - 0x0000)
struct BP_EntranceToRoom_C_FocusOver final
{
public:
	class UUIW_PlayerMain_C*                      Param_FocusOver;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EntranceToRoom_C_FocusOver) == 0x000008, "Wrong alignment on BP_EntranceToRoom_C_FocusOver");
static_assert(sizeof(BP_EntranceToRoom_C_FocusOver) == 0x000008, "Wrong size on BP_EntranceToRoom_C_FocusOver");
static_assert(offsetof(BP_EntranceToRoom_C_FocusOver, Param_FocusOver) == 0x000000, "Member 'BP_EntranceToRoom_C_FocusOver::Param_FocusOver' has a wrong offset!");

// Function BP_EntranceToRoom.BP_EntranceToRoom_C.GetActorType
// 0x0001 (0x0001 - 0x0000)
struct BP_EntranceToRoom_C_GetActorType final
{
public:
	E_ActorType                                   ActorType;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EntranceToRoom_C_GetActorType) == 0x000001, "Wrong alignment on BP_EntranceToRoom_C_GetActorType");
static_assert(sizeof(BP_EntranceToRoom_C_GetActorType) == 0x000001, "Wrong size on BP_EntranceToRoom_C_GetActorType");
static_assert(offsetof(BP_EntranceToRoom_C_GetActorType, ActorType) == 0x000000, "Member 'BP_EntranceToRoom_C_GetActorType::ActorType' has a wrong offset!");

// Function BP_EntranceToRoom.BP_EntranceToRoom_C.IsInViewport
// 0x0078 (0x0078 - 0x0000)
struct BP_EntranceToRoom_C_IsInViewport final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetViewportSize_ReturnValue;              // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_ProjectWorldLocationToWidgetPosition_ScreenPosition; // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ProjectWorldLocationToWidgetPosition_ReturnValue; // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_2;       // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_3;       // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EntranceToRoom_C_IsInViewport) == 0x000008, "Wrong alignment on BP_EntranceToRoom_C_IsInViewport");
static_assert(sizeof(BP_EntranceToRoom_C_IsInViewport) == 0x000078, "Wrong size on BP_EntranceToRoom_C_IsInViewport");
static_assert(offsetof(BP_EntranceToRoom_C_IsInViewport, ReturnValue) == 0x000000, "Member 'BP_EntranceToRoom_C_IsInViewport::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_IsInViewport, CallFunc_GetViewportSize_ReturnValue) == 0x000008, "Member 'BP_EntranceToRoom_C_IsInViewport::CallFunc_GetViewportSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_IsInViewport, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000018, "Member 'BP_EntranceToRoom_C_IsInViewport::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_IsInViewport, CallFunc_BreakVector2D_X) == 0x000030, "Member 'BP_EntranceToRoom_C_IsInViewport::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_IsInViewport, CallFunc_BreakVector2D_Y) == 0x000038, "Member 'BP_EntranceToRoom_C_IsInViewport::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_IsInViewport, CallFunc_GetPlayerController_ReturnValue) == 0x000040, "Member 'BP_EntranceToRoom_C_IsInViewport::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_IsInViewport, CallFunc_ProjectWorldLocationToWidgetPosition_ScreenPosition) == 0x000048, "Member 'BP_EntranceToRoom_C_IsInViewport::CallFunc_ProjectWorldLocationToWidgetPosition_ScreenPosition' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_IsInViewport, CallFunc_ProjectWorldLocationToWidgetPosition_ReturnValue) == 0x000058, "Member 'BP_EntranceToRoom_C_IsInViewport::CallFunc_ProjectWorldLocationToWidgetPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_IsInViewport, CallFunc_BreakVector2D_X_1) == 0x000060, "Member 'BP_EntranceToRoom_C_IsInViewport::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_IsInViewport, CallFunc_BreakVector2D_Y_1) == 0x000068, "Member 'BP_EntranceToRoom_C_IsInViewport::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_IsInViewport, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000070, "Member 'BP_EntranceToRoom_C_IsInViewport::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_IsInViewport, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000071, "Member 'BP_EntranceToRoom_C_IsInViewport::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_IsInViewport, CallFunc_Greater_DoubleDouble_ReturnValue_2) == 0x000072, "Member 'BP_EntranceToRoom_C_IsInViewport::CallFunc_Greater_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_IsInViewport, CallFunc_Greater_DoubleDouble_ReturnValue_3) == 0x000073, "Member 'BP_EntranceToRoom_C_IsInViewport::CallFunc_Greater_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_IsInViewport, CallFunc_BooleanAND_ReturnValue) == 0x000074, "Member 'BP_EntranceToRoom_C_IsInViewport::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_IsInViewport, CallFunc_BooleanAND_ReturnValue_1) == 0x000075, "Member 'BP_EntranceToRoom_C_IsInViewport::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_IsInViewport, CallFunc_BooleanAND_ReturnValue_2) == 0x000076, "Member 'BP_EntranceToRoom_C_IsInViewport::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");

// Function BP_EntranceToRoom.BP_EntranceToRoom_C.IsLocked?
// 0x0001 (0x0001 - 0x0000)
struct BP_EntranceToRoom_C_IsLocked_ final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EntranceToRoom_C_IsLocked_) == 0x000001, "Wrong alignment on BP_EntranceToRoom_C_IsLocked_");
static_assert(sizeof(BP_EntranceToRoom_C_IsLocked_) == 0x000001, "Wrong size on BP_EntranceToRoom_C_IsLocked_");
static_assert(offsetof(BP_EntranceToRoom_C_IsLocked_, Result) == 0x000000, "Member 'BP_EntranceToRoom_C_IsLocked_::Result' has a wrong offset!");

// Function BP_EntranceToRoom.BP_EntranceToRoom_C.IsSomethingOnA Way
// 0x0140 (0x0140 - 0x0000)
struct BP_EntranceToRoom_C_IsSomethingOnA_Way final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0050(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EntranceToRoom_C_IsSomethingOnA_Way) == 0x000008, "Wrong alignment on BP_EntranceToRoom_C_IsSomethingOnA_Way");
static_assert(sizeof(BP_EntranceToRoom_C_IsSomethingOnA_Way) == 0x000140, "Wrong size on BP_EntranceToRoom_C_IsSomethingOnA_Way");
static_assert(offsetof(BP_EntranceToRoom_C_IsSomethingOnA_Way, ReturnValue) == 0x000000, "Member 'BP_EntranceToRoom_C_IsSomethingOnA_Way::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_IsSomethingOnA_Way, Temp_object_Variable) == 0x000008, "Member 'BP_EntranceToRoom_C_IsSomethingOnA_Way::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_IsSomethingOnA_Way, CallFunc_GetPlayerController_ReturnValue) == 0x000018, "Member 'BP_EntranceToRoom_C_IsSomethingOnA_Way::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_IsSomethingOnA_Way, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000020, "Member 'BP_EntranceToRoom_C_IsSomethingOnA_Way::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_IsSomethingOnA_Way, CallFunc_GetCameraLocation_ReturnValue) == 0x000038, "Member 'BP_EntranceToRoom_C_IsSomethingOnA_Way::CallFunc_GetCameraLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_IsSomethingOnA_Way, CallFunc_LineTraceSingle_OutHit) == 0x000050, "Member 'BP_EntranceToRoom_C_IsSomethingOnA_Way::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_IsSomethingOnA_Way, CallFunc_LineTraceSingle_ReturnValue) == 0x000138, "Member 'BP_EntranceToRoom_C_IsSomethingOnA_Way::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");

// Function BP_EntranceToRoom.BP_EntranceToRoom_C.On Black Screen Opened
// 0x0240 (0x0240 - 0x0000)
struct BP_EntranceToRoom_C_On_Black_Screen_Opened final
{
public:
	TArray<class ABP_PlayerSpawnPoint_C*>         RandomRegions;                                     // 0x0000(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class ABP_PlayerSpawnPoint_C*                 Random_Region;                                     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_PlayerSpawnPoint_C*>         K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0040(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocationAndRotation_SweepHitResult; // 0x0110(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocationAndRotation_ReturnValue; // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerSpawnPoint_C*                 CallFunc_Array_Random_OutItem;                     // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211[0x3];                                      // 0x0211(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerSpawnPoint_C*                 CallFunc_Array_Get_Item;                           // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_229[0x3];                                      // 0x0229(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0234(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EntranceToRoom_C_On_Black_Screen_Opened) == 0x000010, "Wrong alignment on BP_EntranceToRoom_C_On_Black_Screen_Opened");
static_assert(sizeof(BP_EntranceToRoom_C_On_Black_Screen_Opened) == 0x000240, "Wrong size on BP_EntranceToRoom_C_On_Black_Screen_Opened");
static_assert(offsetof(BP_EntranceToRoom_C_On_Black_Screen_Opened, RandomRegions) == 0x000000, "Member 'BP_EntranceToRoom_C_On_Black_Screen_Opened::RandomRegions' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_On_Black_Screen_Opened, Random_Region) == 0x000010, "Member 'BP_EntranceToRoom_C_On_Black_Screen_Opened::Random_Region' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_On_Black_Screen_Opened, K2Node_MakeArray_Array) == 0x000018, "Member 'BP_EntranceToRoom_C_On_Black_Screen_Opened::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_On_Black_Screen_Opened, CallFunc_GetPlayerController_ReturnValue) == 0x000028, "Member 'BP_EntranceToRoom_C_On_Black_Screen_Opened::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_On_Black_Screen_Opened, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'BP_EntranceToRoom_C_On_Black_Screen_Opened::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_On_Black_Screen_Opened, CallFunc_Subtract_IntInt_ReturnValue) == 0x000034, "Member 'BP_EntranceToRoom_C_On_Black_Screen_Opened::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_On_Black_Screen_Opened, CallFunc_GetTransform_ReturnValue) == 0x000040, "Member 'BP_EntranceToRoom_C_On_Black_Screen_Opened::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_On_Black_Screen_Opened, CallFunc_Max_ReturnValue) == 0x0000A0, "Member 'BP_EntranceToRoom_C_On_Black_Screen_Opened::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_On_Black_Screen_Opened, CallFunc_BreakTransform_Location) == 0x0000A8, "Member 'BP_EntranceToRoom_C_On_Black_Screen_Opened::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_On_Black_Screen_Opened, CallFunc_BreakTransform_Rotation) == 0x0000C0, "Member 'BP_EntranceToRoom_C_On_Black_Screen_Opened::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_On_Black_Screen_Opened, CallFunc_BreakTransform_Scale) == 0x0000D8, "Member 'BP_EntranceToRoom_C_On_Black_Screen_Opened::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_On_Black_Screen_Opened, CallFunc_GetPlayerPawn_ReturnValue) == 0x0000F0, "Member 'BP_EntranceToRoom_C_On_Black_Screen_Opened::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_On_Black_Screen_Opened, CallFunc_Add_VectorVector_ReturnValue) == 0x0000F8, "Member 'BP_EntranceToRoom_C_On_Black_Screen_Opened::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_On_Black_Screen_Opened, CallFunc_K2_SetActorLocationAndRotation_SweepHitResult) == 0x000110, "Member 'BP_EntranceToRoom_C_On_Black_Screen_Opened::CallFunc_K2_SetActorLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_On_Black_Screen_Opened, CallFunc_K2_SetActorLocationAndRotation_ReturnValue) == 0x0001F8, "Member 'BP_EntranceToRoom_C_On_Black_Screen_Opened::CallFunc_K2_SetActorLocationAndRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_On_Black_Screen_Opened, CallFunc_Array_Random_OutItem) == 0x000200, "Member 'BP_EntranceToRoom_C_On_Black_Screen_Opened::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_On_Black_Screen_Opened, CallFunc_Array_Random_OutIndex) == 0x000208, "Member 'BP_EntranceToRoom_C_On_Black_Screen_Opened::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_On_Black_Screen_Opened, CallFunc_Array_Length_ReturnValue_1) == 0x00020C, "Member 'BP_EntranceToRoom_C_On_Black_Screen_Opened::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_On_Black_Screen_Opened, CallFunc_Greater_IntInt_ReturnValue) == 0x000210, "Member 'BP_EntranceToRoom_C_On_Black_Screen_Opened::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_On_Black_Screen_Opened, Temp_int_Array_Index_Variable) == 0x000214, "Member 'BP_EntranceToRoom_C_On_Black_Screen_Opened::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_On_Black_Screen_Opened, CallFunc_IsValid_ReturnValue) == 0x000218, "Member 'BP_EntranceToRoom_C_On_Black_Screen_Opened::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_On_Black_Screen_Opened, CallFunc_Array_Get_Item) == 0x000220, "Member 'BP_EntranceToRoom_C_On_Black_Screen_Opened::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_On_Black_Screen_Opened, CallFunc_IsValid_ReturnValue_1) == 0x000228, "Member 'BP_EntranceToRoom_C_On_Black_Screen_Opened::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_On_Black_Screen_Opened, Temp_int_Loop_Counter_Variable) == 0x00022C, "Member 'BP_EntranceToRoom_C_On_Black_Screen_Opened::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_On_Black_Screen_Opened, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000230, "Member 'BP_EntranceToRoom_C_On_Black_Screen_Opened::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_On_Black_Screen_Opened, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000234, "Member 'BP_EntranceToRoom_C_On_Black_Screen_Opened::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_EntranceToRoom.BP_EntranceToRoom_C.OnBeginInteract
// 0x0008 (0x0008 - 0x0000)
struct BP_EntranceToRoom_C_OnBeginInteract final
{
public:
	class APawn*                                  Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EntranceToRoom_C_OnBeginInteract) == 0x000008, "Wrong alignment on BP_EntranceToRoom_C_OnBeginInteract");
static_assert(sizeof(BP_EntranceToRoom_C_OnBeginInteract) == 0x000008, "Wrong size on BP_EntranceToRoom_C_OnBeginInteract");
static_assert(offsetof(BP_EntranceToRoom_C_OnBeginInteract, Player) == 0x000000, "Member 'BP_EntranceToRoom_C_OnBeginInteract::Player' has a wrong offset!");

// Function BP_EntranceToRoom.BP_EntranceToRoom_C.OnFocused
// 0x0028 (0x0028 - 0x0000)
struct BP_EntranceToRoom_C_OnFocused final
{
public:
	class APawn*                                  Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 HighlightActor;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UActorComponent*                        HighlightActorComponent;                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	E_InteractType                                InteractType;                                      // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        LateTime;                                          // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EntranceToRoom_C_OnFocused) == 0x000008, "Wrong alignment on BP_EntranceToRoom_C_OnFocused");
static_assert(sizeof(BP_EntranceToRoom_C_OnFocused) == 0x000028, "Wrong size on BP_EntranceToRoom_C_OnFocused");
static_assert(offsetof(BP_EntranceToRoom_C_OnFocused, Player) == 0x000000, "Member 'BP_EntranceToRoom_C_OnFocused::Player' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_OnFocused, HighlightActor) == 0x000008, "Member 'BP_EntranceToRoom_C_OnFocused::HighlightActor' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_OnFocused, HighlightActorComponent) == 0x000010, "Member 'BP_EntranceToRoom_C_OnFocused::HighlightActorComponent' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_OnFocused, InteractType) == 0x000018, "Member 'BP_EntranceToRoom_C_OnFocused::InteractType' has a wrong offset!");
static_assert(offsetof(BP_EntranceToRoom_C_OnFocused, LateTime) == 0x000020, "Member 'BP_EntranceToRoom_C_OnFocused::LateTime' has a wrong offset!");

// Function BP_EntranceToRoom.BP_EntranceToRoom_C.OnInteract
// 0x0008 (0x0008 - 0x0000)
struct BP_EntranceToRoom_C_OnInteract final
{
public:
	class APawn*                                  Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EntranceToRoom_C_OnInteract) == 0x000008, "Wrong alignment on BP_EntranceToRoom_C_OnInteract");
static_assert(sizeof(BP_EntranceToRoom_C_OnInteract) == 0x000008, "Wrong size on BP_EntranceToRoom_C_OnInteract");
static_assert(offsetof(BP_EntranceToRoom_C_OnInteract, Player) == 0x000000, "Member 'BP_EntranceToRoom_C_OnInteract::Player' has a wrong offset!");

// Function BP_EntranceToRoom.BP_EntranceToRoom_C.OnInteract2
// 0x0008 (0x0008 - 0x0000)
struct BP_EntranceToRoom_C_OnInteract2 final
