#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Falling_Leavess

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Falling_Leavess.BP_Falling_Leavess_C
// 0x0050 (0x02E0 - 0x0290)
class ABP_Falling_Leavess_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Niagara;                                           // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Min_Size;                                          // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Max_Size;                                          // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Min_Spawn_Rate;                                    // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Max_Spawn_rate;                                    // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Lifetime;                                          // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Falling_Leavess(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Falling_Leavess_C">();
	}
	static class ABP_Falling_Leavess_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Falling_Leavess_C>();
	}
};
static_assert(alignof(ABP_Falling_Leavess_C) == 0x000008, "Wrong alignment on ABP_Falling_Leavess_C");
static_assert(sizeof(ABP_Falling_Leavess_C) == 0x0002E0, "Wrong size on ABP_Falling_Leavess_C");
static_assert(offsetof(ABP_Falling_Leavess_C, UberGraphFrame) == 0x000290, "Member 'ABP_Falling_Leavess_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Falling_Leavess_C, Niagara) == 0x000298, "Member 'ABP_Falling_Leavess_C::Niagara' has a wrong offset!");
static_assert(offsetof(ABP_Falling_Leavess_C, DefaultSceneRoot) == 0x0002A0, "Member 'ABP_Falling_Leavess_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Falling_Leavess_C, Color) == 0x0002A8, "Member 'ABP_Falling_Leavess_C::Color' has a wrong offset!");
static_assert(offsetof(ABP_Falling_Leavess_C, Min_Size) == 0x0002B8, "Member 'ABP_Falling_Leavess_C::Min_Size' has a wrong offset!");
static_assert(offsetof(ABP_Falling_Leavess_C, Max_Size) == 0x0002C0, "Member 'ABP_Falling_Leavess_C::Max_Size' has a wrong offset!");
static_assert(offsetof(ABP_Falling_Leavess_C, Min_Spawn_Rate) == 0x0002C8, "Member 'ABP_Falling_Leavess_C::Min_Spawn_Rate' has a wrong offset!");
static_assert(offsetof(ABP_Falling_Leavess_C, Max_Spawn_rate) == 0x0002D0, "Member 'ABP_Falling_Leavess_C::Max_Spawn_rate' has a wrong offset!");
static_assert(offsetof(ABP_Falling_Leavess_C, Lifetime) == 0x0002D8, "Member 'ABP_Falling_Leavess_C::Lifetime' has a wrong offset!");

}

