#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GPS_FP

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_GPS_FP.BP_GPS_FP_C.ExecuteUbergraph_BP_GPS_FP
// 0x0020 (0x0020 - 0x0000)
struct BP_GPS_FP_C_ExecuteUbergraph_BP_GPS_FP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue;                    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_GPSMain_C*                         K2Node_DynamicCast_AsWBP_GPSMain;                  // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GPS_FP_C_ExecuteUbergraph_BP_GPS_FP) == 0x000008, "Wrong alignment on BP_GPS_FP_C_ExecuteUbergraph_BP_GPS_FP");
static_assert(sizeof(BP_GPS_FP_C_ExecuteUbergraph_BP_GPS_FP) == 0x000020, "Wrong size on BP_GPS_FP_C_ExecuteUbergraph_BP_GPS_FP");
static_assert(offsetof(BP_GPS_FP_C_ExecuteUbergraph_BP_GPS_FP, EntryPoint) == 0x000000, "Member 'BP_GPS_FP_C_ExecuteUbergraph_BP_GPS_FP::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GPS_FP_C_ExecuteUbergraph_BP_GPS_FP, CallFunc_GetWidget_ReturnValue) == 0x000008, "Member 'BP_GPS_FP_C_ExecuteUbergraph_BP_GPS_FP::CallFunc_GetWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GPS_FP_C_ExecuteUbergraph_BP_GPS_FP, K2Node_DynamicCast_AsWBP_GPSMain) == 0x000010, "Member 'BP_GPS_FP_C_ExecuteUbergraph_BP_GPS_FP::K2Node_DynamicCast_AsWBP_GPSMain' has a wrong offset!");
static_assert(offsetof(BP_GPS_FP_C_ExecuteUbergraph_BP_GPS_FP, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_GPS_FP_C_ExecuteUbergraph_BP_GPS_FP::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_GPS_FP.BP_GPS_FP_C.GetGPSWidget
// 0x0008 (0x0008 - 0x0000)
struct BP_GPS_FP_C_GetGPSWidget final
{
public:
	class UWBP_GPSMain_C*                         Param_As_WBP_GPSMain;                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GPS_FP_C_GetGPSWidget) == 0x000008, "Wrong alignment on BP_GPS_FP_C_GetGPSWidget");
static_assert(sizeof(BP_GPS_FP_C_GetGPSWidget) == 0x000008, "Wrong size on BP_GPS_FP_C_GetGPSWidget");
static_assert(offsetof(BP_GPS_FP_C_GetGPSWidget, Param_As_WBP_GPSMain) == 0x000000, "Member 'BP_GPS_FP_C_GetGPSWidget::Param_As_WBP_GPSMain' has a wrong offset!");

}

