#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GarageSpace

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_GarageSpace.BP_GarageSpace_C.InitCar
// 0x0130 (0x0130 - 0x0000)
struct BP_GarageSpace_C_InitCar final
{
public:
	class ASurvivalPlayer_V2_C*                   Param_Owner;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CarRef;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_PlayerSpawnPoint_C*>         Regions;                                           // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsAVS_Vehicle_Master;      // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00C0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAVS_VehicleMaster_C*                   CallFunc_FinishSpawningActor_ReturnValue;          // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GarageSpace_C_InitCar) == 0x000010, "Wrong alignment on BP_GarageSpace_C_InitCar");
static_assert(sizeof(BP_GarageSpace_C_InitCar) == 0x000130, "Wrong size on BP_GarageSpace_C_InitCar");
static_assert(offsetof(BP_GarageSpace_C_InitCar, Param_Owner) == 0x000000, "Member 'BP_GarageSpace_C_InitCar::Param_Owner' has a wrong offset!");
static_assert(offsetof(BP_GarageSpace_C_InitCar, CarRef) == 0x000008, "Member 'BP_GarageSpace_C_InitCar::CarRef' has a wrong offset!");
static_assert(offsetof(BP_GarageSpace_C_InitCar, Regions) == 0x000010, "Member 'BP_GarageSpace_C_InitCar::Regions' has a wrong offset!");
static_assert(offsetof(BP_GarageSpace_C_InitCar, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000020, "Member 'BP_GarageSpace_C_InitCar::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GarageSpace_C_InitCar, K2Node_ClassDynamicCast_AsAVS_Vehicle_Master) == 0x000038, "Member 'BP_GarageSpace_C_InitCar::K2Node_ClassDynamicCast_AsAVS_Vehicle_Master' has a wrong offset!");
static_assert(offsetof(BP_GarageSpace_C_InitCar, K2Node_ClassDynamicCast_bSuccess) == 0x000040, "Member 'BP_GarageSpace_C_InitCar::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GarageSpace_C_InitCar, CallFunc_IsValid_ReturnValue) == 0x000041, "Member 'BP_GarageSpace_C_InitCar::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GarageSpace_C_InitCar, CallFunc_GetDisplayName_ReturnValue) == 0x000048, "Member 'BP_GarageSpace_C_InitCar::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GarageSpace_C_InitCar, CallFunc_GetForwardVector_ReturnValue) == 0x000058, "Member 'BP_GarageSpace_C_InitCar::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GarageSpace_C_InitCar, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000070, "Member 'BP_GarageSpace_C_InitCar::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GarageSpace_C_InitCar, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000088, "Member 'BP_GarageSpace_C_InitCar::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GarageSpace_C_InitCar, CallFunc_FindLookAtRotation_ReturnValue) == 0x0000A0, "Member 'BP_GarageSpace_C_InitCar::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GarageSpace_C_InitCar, CallFunc_MakeTransform_ReturnValue) == 0x0000C0, "Member 'BP_GarageSpace_C_InitCar::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GarageSpace_C_InitCar, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000120, "Member 'BP_GarageSpace_C_InitCar::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GarageSpace_C_InitCar, CallFunc_FinishSpawningActor_ReturnValue) == 0x000128, "Member 'BP_GarageSpace_C_InitCar::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

}

