#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GameHUD

#include "Basic.hpp"

#include "E_HouseType_structs.hpp"
#include "TranzitZone_Enum_structs.hpp"
#include "InfoType_structs.hpp"
#include "WE_UIMode_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "MarkType_structs.hpp"
#include "E_NotificationType_structs.hpp"
#include "E_StaticInteractType_structs.hpp"
#include "E_ActorType_structs.hpp"
#include "E_NewLocation_structs.hpp"
#include "FMODStudio_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BP_GameHUD.BP_GameHUD_C.AcceptInvideHome
// 0x0048 (0x0048 - 0x0000)
struct BP_GameHUD_C_AcceptInvideHome final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_inviteHomeOffer_C*                 K2Node_DynamicCast_AsWBP_Invite_Home_Offer;        // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameHUD_C_AcceptInvideHome) == 0x000008, "Wrong alignment on BP_GameHUD_C_AcceptInvideHome");
static_assert(sizeof(BP_GameHUD_C_AcceptInvideHome) == 0x000048, "Wrong size on BP_GameHUD_C_AcceptInvideHome");
static_assert(offsetof(BP_GameHUD_C_AcceptInvideHome, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_GameHUD_C_AcceptInvideHome::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_AcceptInvideHome, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_GameHUD_C_AcceptInvideHome::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_AcceptInvideHome, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_GameHUD_C_AcceptInvideHome::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_AcceptInvideHome, CallFunc_GetAllChildren_ReturnValue) == 0x000010, "Member 'BP_GameHUD_C_AcceptInvideHome::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_AcceptInvideHome, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_GameHUD_C_AcceptInvideHome::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_AcceptInvideHome, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_GameHUD_C_AcceptInvideHome::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_AcceptInvideHome, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'BP_GameHUD_C_AcceptInvideHome::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_AcceptInvideHome, K2Node_DynamicCast_AsWBP_Invite_Home_Offer) == 0x000038, "Member 'BP_GameHUD_C_AcceptInvideHome::K2Node_DynamicCast_AsWBP_Invite_Home_Offer' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_AcceptInvideHome, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_GameHUD_C_AcceptInvideHome::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_GameHUD.BP_GameHUD_C.AcceptLastOffer
// 0x0028 (0x0028 - 0x0000)
struct BP_GameHUD_C_AcceptLastOffer final
{
public:
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLeaveCheckDisplayed_LeaveQueueDisplayed; // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APS_TDB_C*                              K2Node_DynamicCast_AsPS_TDB;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Offer_C*                           CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameHUD_C_AcceptLastOffer) == 0x000008, "Wrong alignment on BP_GameHUD_C_AcceptLastOffer");
static_assert(sizeof(BP_GameHUD_C_AcceptLastOffer) == 0x000028, "Wrong size on BP_GameHUD_C_AcceptLastOffer");
static_assert(offsetof(BP_GameHUD_C_AcceptLastOffer, CallFunc_GetPlayerController_ReturnValue) == 0x000000, "Member 'BP_GameHUD_C_AcceptLastOffer::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_AcceptLastOffer, CallFunc_GetLeaveCheckDisplayed_LeaveQueueDisplayed) == 0x000008, "Member 'BP_GameHUD_C_AcceptLastOffer::CallFunc_GetLeaveCheckDisplayed_LeaveQueueDisplayed' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_AcceptLastOffer, K2Node_DynamicCast_AsPS_TDB) == 0x000010, "Member 'BP_GameHUD_C_AcceptLastOffer::K2Node_DynamicCast_AsPS_TDB' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_AcceptLastOffer, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_GameHUD_C_AcceptLastOffer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_AcceptLastOffer, CallFunc_Array_LastIndex_ReturnValue) == 0x00001C, "Member 'BP_GameHUD_C_AcceptLastOffer::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_AcceptLastOffer, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_GameHUD_C_AcceptLastOffer::CallFunc_Array_Get_Item' has a wrong offset!");

// Function BP_GameHUD.BP_GameHUD_C.AddGymBarWidget
// 0x0018 (0x0018 - 0x0000)
struct BP_GameHUD_C_AddGymBarWidget final
{
public:
	class UW_GymBar_C*                            CallFunc_Create_ReturnValue;                       // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameHUD_C_AddGymBarWidget) == 0x000008, "Wrong alignment on BP_GameHUD_C_AddGymBarWidget");
static_assert(sizeof(BP_GameHUD_C_AddGymBarWidget) == 0x000018, "Wrong size on BP_GameHUD_C_AddGymBarWidget");
static_assert(offsetof(BP_GameHUD_C_AddGymBarWidget, CallFunc_Create_ReturnValue) == 0x000000, "Member 'BP_GameHUD_C_AddGymBarWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_AddGymBarWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_GameHUD_C_AddGymBarWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function BP_GameHUD.BP_GameHUD_C.AddInviteHomeWidget
// 0x0028 (0x0028 - 0x0000)
struct BP_GameHUD_C_AddInviteHomeWidget final
{
public:
	int32                                         InviteIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PlayerNameOfferer;                                 // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class APS_TDB_C*                              NewVar;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_inviteHomeOffer_C*                 CallFunc_AddInvideToHomeOffer_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameHUD_C_AddInviteHomeWidget) == 0x000008, "Wrong alignment on BP_GameHUD_C_AddInviteHomeWidget");
static_assert(sizeof(BP_GameHUD_C_AddInviteHomeWidget) == 0x000028, "Wrong size on BP_GameHUD_C_AddInviteHomeWidget");
static_assert(offsetof(BP_GameHUD_C_AddInviteHomeWidget, InviteIndex) == 0x000000, "Member 'BP_GameHUD_C_AddInviteHomeWidget::InviteIndex' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_AddInviteHomeWidget, PlayerNameOfferer) == 0x000008, "Member 'BP_GameHUD_C_AddInviteHomeWidget::PlayerNameOfferer' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_AddInviteHomeWidget, NewVar) == 0x000018, "Member 'BP_GameHUD_C_AddInviteHomeWidget::NewVar' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_AddInviteHomeWidget, CallFunc_AddInvideToHomeOffer_ReturnValue) == 0x000020, "Member 'BP_GameHUD_C_AddInviteHomeWidget::CallFunc_AddInvideToHomeOffer_ReturnValue' has a wrong offset!");

// Function BP_GameHUD.BP_GameHUD_C.AddInviteWidget
// 0x0028 (0x0028 - 0x0000)
struct BP_GameHUD_C_AddInviteWidget final
{
public:
	int32                                         InvitedSquadIndex;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PlayerNameInviter;                                 // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UWBP_Offer_C*                           CallFunc_AddInvite_InviteWidget;                   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameHUD_C_AddInviteWidget) == 0x000008, "Wrong alignment on BP_GameHUD_C_AddInviteWidget");
static_assert(sizeof(BP_GameHUD_C_AddInviteWidget) == 0x000028, "Wrong size on BP_GameHUD_C_AddInviteWidget");
static_assert(offsetof(BP_GameHUD_C_AddInviteWidget, InvitedSquadIndex) == 0x000000, "Member 'BP_GameHUD_C_AddInviteWidget::InvitedSquadIndex' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_AddInviteWidget, PlayerNameInviter) == 0x000008, "Member 'BP_GameHUD_C_AddInviteWidget::PlayerNameInviter' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_AddInviteWidget, CallFunc_AddInvite_InviteWidget) == 0x000018, "Member 'BP_GameHUD_C_AddInviteWidget::CallFunc_AddInvite_InviteWidget' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_AddInviteWidget, CallFunc_Array_Add_ReturnValue) == 0x000020, "Member 'BP_GameHUD_C_AddInviteWidget::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_GameHUD.BP_GameHUD_C.AddLoanWidget
// 0x0018 (0x0018 - 0x0000)
struct BP_GameHUD_C_AddLoanWidget final
{
public:
	class UW_Loan_C*                              CallFunc_Create_ReturnValue;                       // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameHUD_C_AddLoanWidget) == 0x000008, "Wrong alignment on BP_GameHUD_C_AddLoanWidget");
static_assert(sizeof(BP_GameHUD_C_AddLoanWidget) == 0x000018, "Wrong size on BP_GameHUD_C_AddLoanWidget");
static_assert(offsetof(BP_GameHUD_C_AddLoanWidget, CallFunc_Create_ReturnValue) == 0x000000, "Member 'BP_GameHUD_C_AddLoanWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_AddLoanWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_GameHUD_C_AddLoanWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function BP_GameHUD.BP_GameHUD_C.AddMark
// 0x0048 (0x0048 - 0x0000)
struct BP_GameHUD_C_AddMark final
{
public:
	class FName                                   Key;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 ActorRef;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Quest;                                             // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowByLocation;                                    // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Location;                                          // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMarkType                                     Type;                                              // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0031(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_Mark_C*                              WMark;                                             // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_Mark_C*                              CallFunc_AddMark_WMark;                            // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameHUD_C_AddMark) == 0x000008, "Wrong alignment on BP_GameHUD_C_AddMark");
static_assert(sizeof(BP_GameHUD_C_AddMark) == 0x000048, "Wrong size on BP_GameHUD_C_AddMark");
static_assert(offsetof(BP_GameHUD_C_AddMark, Key) == 0x000000, "Member 'BP_GameHUD_C_AddMark::Key' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_AddMark, ActorRef) == 0x000008, "Member 'BP_GameHUD_C_AddMark::ActorRef' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_AddMark, Quest) == 0x000010, "Member 'BP_GameHUD_C_AddMark::Quest' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_AddMark, ShowByLocation) == 0x000011, "Member 'BP_GameHUD_C_AddMark::ShowByLocation' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_AddMark, Location) == 0x000018, "Member 'BP_GameHUD_C_AddMark::Location' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_AddMark, Type) == 0x000030, "Member 'BP_GameHUD_C_AddMark::Type' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_AddMark, Success) == 0x000031, "Member 'BP_GameHUD_C_AddMark::Success' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_AddMark, WMark) == 0x000038, "Member 'BP_GameHUD_C_AddMark::WMark' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_AddMark, CallFunc_AddMark_WMark) == 0x000040, "Member 'BP_GameHUD_C_AddMark::CallFunc_AddMark_WMark' has a wrong offset!");

// Function BP_GameHUD.BP_GameHUD_C.AddNewNotification
// 0x0040 (0x0040 - 0x0000)
struct BP_GameHUD_C_AddNewNotification final
{
public:
	E_NotificationType                            NotificationType;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Title;                                             // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Body;                                              // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Success;                                           // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameHUD_C_AddNewNotification) == 0x000008, "Wrong alignment on BP_GameHUD_C_AddNewNotification");
static_assert(sizeof(BP_GameHUD_C_AddNewNotification) == 0x000040, "Wrong size on BP_GameHUD_C_AddNewNotification");
static_assert(offsetof(BP_GameHUD_C_AddNewNotification, NotificationType) == 0x000000, "Member 'BP_GameHUD_C_AddNewNotification::NotificationType' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_AddNewNotification, Title) == 0x000008, "Member 'BP_GameHUD_C_AddNewNotification::Title' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_AddNewNotification, Body) == 0x000020, "Member 'BP_GameHUD_C_AddNewNotification::Body' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_AddNewNotification, Success) == 0x000038, "Member 'BP_GameHUD_C_AddNewNotification::Success' has a wrong offset!");

// Function BP_GameHUD.BP_GameHUD_C.AddSquadMessage
// 0x0018 (0x0018 - 0x0000)
struct BP_GameHUD_C_AddSquadMessage final
{
public:
	int32                                         MessageIndex;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PlayerName;                                        // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameHUD_C_AddSquadMessage) == 0x000008, "Wrong alignment on BP_GameHUD_C_AddSquadMessage");
static_assert(sizeof(BP_GameHUD_C_AddSquadMessage) == 0x000018, "Wrong size on BP_GameHUD_C_AddSquadMessage");
static_assert(offsetof(BP_GameHUD_C_AddSquadMessage, MessageIndex) == 0x000000, "Member 'BP_GameHUD_C_AddSquadMessage::MessageIndex' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_AddSquadMessage, PlayerName) == 0x000008, "Member 'BP_GameHUD_C_AddSquadMessage::PlayerName' has a wrong offset!");

// Function BP_GameHUD.BP_GameHUD_C.AddStaticInteractWidget
// 0x0020 (0x0020 - 0x0000)
struct BP_GameHUD_C_AddStaticInteractWidget final
{
public:
	E_StaticInteractType                          TypeInteract;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_StaticInteract_C*                    CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameHUD_C_AddStaticInteractWidget) == 0x000008, "Wrong alignment on BP_GameHUD_C_AddStaticInteractWidget");
static_assert(sizeof(BP_GameHUD_C_AddStaticInteractWidget) == 0x000020, "Wrong size on BP_GameHUD_C_AddStaticInteractWidget");
static_assert(offsetof(BP_GameHUD_C_AddStaticInteractWidget, TypeInteract) == 0x000000, "Member 'BP_GameHUD_C_AddStaticInteractWidget::TypeInteract' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_AddStaticInteractWidget, CallFunc_Create_ReturnValue) == 0x000008, "Member 'BP_GameHUD_C_AddStaticInteractWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_AddStaticInteractWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BP_GameHUD_C_AddStaticInteractWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function BP_GameHUD.BP_GameHUD_C.AddTradeOfferWidget
// 0x0028 (0x0028 - 0x0000)
struct BP_GameHUD_C_AddTradeOfferWidget final
{
public:
	class FString                                 PlayerNameOfferer;                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      TradeOfferer;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Offer_C*                           CallFunc_AddTradeOffer_TradeOfferWidget;           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameHUD_C_AddTradeOfferWidget) == 0x000008, "Wrong alignment on BP_GameHUD_C_AddTradeOfferWidget");
static_assert(sizeof(BP_GameHUD_C_AddTradeOfferWidget) == 0x000028, "Wrong size on BP_GameHUD_C_AddTradeOfferWidget");
static_assert(offsetof(BP_GameHUD_C_AddTradeOfferWidget, PlayerNameOfferer) == 0x000000, "Member 'BP_GameHUD_C_AddTradeOfferWidget::PlayerNameOfferer' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_AddTradeOfferWidget, TradeOfferer) == 0x000010, "Member 'BP_GameHUD_C_AddTradeOfferWidget::TradeOfferer' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_AddTradeOfferWidget, CallFunc_AddTradeOffer_TradeOfferWidget) == 0x000018, "Member 'BP_GameHUD_C_AddTradeOfferWidget::CallFunc_AddTradeOffer_TradeOfferWidget' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_AddTradeOfferWidget, CallFunc_Array_Add_ReturnValue) == 0x000020, "Member 'BP_GameHUD_C_AddTradeOfferWidget::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_GameHUD.BP_GameHUD_C.AddTranzitZoneW
// 0x0028 (0x0028 - 0x0000)
struct BP_GameHUD_C_AddTranzitZoneW final
{
public:
	class ABP_TeleporterDoorMaster_C*             DoorRef;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ETranzitZone_Enum                             SetTranzit;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_TranzitZone_C*                     CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameHUD_C_AddTranzitZoneW) == 0x000008, "Wrong alignment on BP_GameHUD_C_AddTranzitZoneW");
static_assert(sizeof(BP_GameHUD_C_AddTranzitZoneW) == 0x000028, "Wrong size on BP_GameHUD_C_AddTranzitZoneW");
static_assert(offsetof(BP_GameHUD_C_AddTranzitZoneW, DoorRef) == 0x000000, "Member 'BP_GameHUD_C_AddTranzitZoneW::DoorRef' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_AddTranzitZoneW, SetTranzit) == 0x000008, "Member 'BP_GameHUD_C_AddTranzitZoneW::SetTranzit' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_AddTranzitZoneW, CallFunc_Create_ReturnValue) == 0x000010, "Member 'BP_GameHUD_C_AddTranzitZoneW::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_AddTranzitZoneW, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'BP_GameHUD_C_AddTranzitZoneW::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function BP_GameHUD.BP_GameHUD_C.AddWorkRPMessage
// 0x0070 (0x0070 - 0x0000)
struct BP_GameHUD_C_AddWorkRPMessage final
{
public:
	double                                        TotalTime;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   WorkRPName;                                        // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   WorkRPDescription;                                 // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   WorkRP_Count_current;                              // 0x0038(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   WorkRP_Count_total;                                // 0x0050(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UW_WorkRPNotification_C*                CallFunc_AddWorkRPMessage_ReturnValue;             // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameHUD_C_AddWorkRPMessage) == 0x000008, "Wrong alignment on BP_GameHUD_C_AddWorkRPMessage");
static_assert(sizeof(BP_GameHUD_C_AddWorkRPMessage) == 0x000070, "Wrong size on BP_GameHUD_C_AddWorkRPMessage");
static_assert(offsetof(BP_GameHUD_C_AddWorkRPMessage, TotalTime) == 0x000000, "Member 'BP_GameHUD_C_AddWorkRPMessage::TotalTime' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_AddWorkRPMessage, WorkRPName) == 0x000008, "Member 'BP_GameHUD_C_AddWorkRPMessage::WorkRPName' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_AddWorkRPMessage, WorkRPDescription) == 0x000020, "Member 'BP_GameHUD_C_AddWorkRPMessage::WorkRPDescription' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_AddWorkRPMessage, WorkRP_Count_current) == 0x000038, "Member 'BP_GameHUD_C_AddWorkRPMessage::WorkRP_Count_current' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_AddWorkRPMessage, WorkRP_Count_total) == 0x000050, "Member 'BP_GameHUD_C_AddWorkRPMessage::WorkRP_Count_total' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_AddWorkRPMessage, CallFunc_AddWorkRPMessage_ReturnValue) == 0x000068, "Member 'BP_GameHUD_C_AddWorkRPMessage::CallFunc_AddWorkRPMessage_ReturnValue' has a wrong offset!");

// Function BP_GameHUD.BP_GameHUD_C.BannerNewLocation
// 0x0001 (0x0001 - 0x0000)
struct BP_GameHUD_C_BannerNewLocation final
{
public:
	E_NewLocation                                 Location;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameHUD_C_BannerNewLocation) == 0x000001, "Wrong alignment on BP_GameHUD_C_BannerNewLocation");
static_assert(sizeof(BP_GameHUD_C_BannerNewLocation) == 0x000001, "Wrong size on BP_GameHUD_C_BannerNewLocation");
static_assert(offsetof(BP_GameHUD_C_BannerNewLocation, Location) == 0x000000, "Member 'BP_GameHUD_C_BannerNewLocation::Location' has a wrong offset!");

// Function BP_GameHUD.BP_GameHUD_C.CanEnterVehicle
// 0x0008 (0x0008 - 0x0000)
struct BP_GameHUD_C_CanEnterVehicle final
{
public:
	bool                                          bCan;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SeatIndex;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameHUD_C_CanEnterVehicle) == 0x000004, "Wrong alignment on BP_GameHUD_C_CanEnterVehicle");
static_assert(sizeof(BP_GameHUD_C_CanEnterVehicle) == 0x000008, "Wrong size on BP_GameHUD_C_CanEnterVehicle");
static_assert(offsetof(BP_GameHUD_C_CanEnterVehicle, bCan) == 0x000000, "Member 'BP_GameHUD_C_CanEnterVehicle::bCan' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_CanEnterVehicle, SeatIndex) == 0x000004, "Member 'BP_GameHUD_C_CanEnterVehicle::SeatIndex' has a wrong offset!");

// Function BP_GameHUD.BP_GameHUD_C.CheckPlayerBusy
// 0x0030 (0x0030 - 0x0000)
struct BP_GameHUD_C_CheckPlayerBusy final
{
public:
	class APS_TDB_C*                              PlayerState;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Out;                                               // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_V2_C*                   CallFunc_GetCharRef_OutputCharRef;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameHUD_C>        K2Node_DynamicCast_AsBPI_Game_HUD;                 // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStashWidgetOpen_IsStashOpen;            // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_5;                  // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameHUD_C_CheckPlayerBusy) == 0x000008, "Wrong alignment on BP_GameHUD_C_CheckPlayerBusy");
static_assert(sizeof(BP_GameHUD_C_CheckPlayerBusy) == 0x000030, "Wrong size on BP_GameHUD_C_CheckPlayerBusy");
static_assert(offsetof(BP_GameHUD_C_CheckPlayerBusy, PlayerState) == 0x000000, "Member 'BP_GameHUD_C_CheckPlayerBusy::PlayerState' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_CheckPlayerBusy, Out) == 0x000008, "Member 'BP_GameHUD_C_CheckPlayerBusy::Out' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_CheckPlayerBusy, CallFunc_GetCharRef_OutputCharRef) == 0x000010, "Member 'BP_GameHUD_C_CheckPlayerBusy::CallFunc_GetCharRef_OutputCharRef' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_CheckPlayerBusy, K2Node_DynamicCast_AsBPI_Game_HUD) == 0x000018, "Member 'BP_GameHUD_C_CheckPlayerBusy::K2Node_DynamicCast_AsBPI_Game_HUD' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_CheckPlayerBusy, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_GameHUD_C_CheckPlayerBusy::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_CheckPlayerBusy, CallFunc_IsStashWidgetOpen_IsStashOpen) == 0x000029, "Member 'BP_GameHUD_C_CheckPlayerBusy::CallFunc_IsStashWidgetOpen_IsStashOpen' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_CheckPlayerBusy, CallFunc_BooleanOR_ReturnValue) == 0x00002A, "Member 'BP_GameHUD_C_CheckPlayerBusy::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_CheckPlayerBusy, CallFunc_BooleanOR_ReturnValue_1) == 0x00002B, "Member 'BP_GameHUD_C_CheckPlayerBusy::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_CheckPlayerBusy, CallFunc_BooleanOR_ReturnValue_2) == 0x00002C, "Member 'BP_GameHUD_C_CheckPlayerBusy::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_CheckPlayerBusy, CallFunc_BooleanOR_ReturnValue_3) == 0x00002D, "Member 'BP_GameHUD_C_CheckPlayerBusy::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_CheckPlayerBusy, CallFunc_BooleanOR_ReturnValue_4) == 0x00002E, "Member 'BP_GameHUD_C_CheckPlayerBusy::CallFunc_BooleanOR_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_CheckPlayerBusy, CallFunc_BooleanOR_ReturnValue_5) == 0x00002F, "Member 'BP_GameHUD_C_CheckPlayerBusy::CallFunc_BooleanOR_ReturnValue_5' has a wrong offset!");

// Function BP_GameHUD.BP_GameHUD_C.CreateLeaveCheck
// 0x0010 (0x0010 - 0x0000)
struct BP_GameHUD_C_CreateLeaveCheck final
{
public:
	TArray<class APS_TDB_C*>                      Members;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_GameHUD_C_CreateLeaveCheck) == 0x000008, "Wrong alignment on BP_GameHUD_C_CreateLeaveCheck");
static_assert(sizeof(BP_GameHUD_C_CreateLeaveCheck) == 0x000010, "Wrong size on BP_GameHUD_C_CreateLeaveCheck");
static_assert(offsetof(BP_GameHUD_C_CreateLeaveCheck, Members) == 0x000000, "Member 'BP_GameHUD_C_CreateLeaveCheck::Members' has a wrong offset!");

// Function BP_GameHUD.BP_GameHUD_C.CreateWidgets
// 0x0118 (0x0118 - 0x0000)
struct BP_GameHUD_C_CreateWidgets final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_KilledByNotification_C*            CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_SimpleFadeIn_C*                    CallFunc_Create_ReturnValue_1;                     // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Surrender_C*                       CallFunc_Create_ReturnValue_2;                     // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_NewDeathScreen_C*                  CallFunc_Create_ReturnValue_3;                     // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_QuestCompleate_C*                  CallFunc_Create_ReturnValue_4;                     // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_New_Location_C*                    CallFunc_Create_ReturnValue_5;                     // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_TeleportTimer_C*                     CallFunc_Create_ReturnValue_6;                     // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_CarGame_C*                         CallFunc_Create_ReturnValue_7;                     // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_VoiceIndication_C*                   CallFunc_Create_ReturnValue_8;                     // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_PauseMenu_C*                         CallFunc_Create_ReturnValue_9;                     // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_CapacityMessage_C*                   CallFunc_Create_ReturnValue_10;                    // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_ChooseRegion_C*                      CallFunc_Create_ReturnValue_11;                    // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_ChoosePoint_C*                       CallFunc_Create_ReturnValue_12;                    // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_AlarmSystem_C*                     CallFunc_Create_ReturnValue_13;                    // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_ItemInfo_C*                          CallFunc_Create_ReturnValue_14;                    // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_CampTimer_C*                         CallFunc_Create_ReturnValue_15;                    // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_CampTent_C*                          CallFunc_Create_ReturnValue_16;                    // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_CampCooking_C*                       CallFunc_Create_ReturnValue_17;                    // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_CraftWindow_C*                      CallFunc_Create_ReturnValue_18;                    // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_TabsWindow_C*                        CallFunc_Create_ReturnValue_19;                    // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_ScreenMarkers_C*                     CallFunc_Create_ReturnValue_20;                    // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMPInGameInventory_C*                   CallFunc_Create_ReturnValue_21;                    // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_BlackScreen_C*                       CallFunc_Create_ReturnValue_22;                    // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_CarUpgradeMenu_C*                    CallFunc_Create_ReturnValue_23;                    // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_NewLocationBanner_C*               CallFunc_Create_ReturnValue_24;                    // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_BaseBuilding_C*                    CallFunc_Create_ReturnValue_25;                    // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_PointerHint_C*                     CallFunc_Create_ReturnValue_26;                    // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_CutsceneTips_C*                    CallFunc_Create_ReturnValue_27;                    // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_TutorialItemReward_C*              CallFunc_Create_ReturnValue_28;                    // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_SlidesTutorial_C*                  CallFunc_Create_ReturnValue_29;                    // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_BinocularUI_C*                     CallFunc_Create_ReturnValue_30;                    // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameHUD_C_CreateWidgets) == 0x000008, "Wrong alignment on BP_GameHUD_C_CreateWidgets");
static_assert(sizeof(BP_GameHUD_C_CreateWidgets) == 0x000118, "Wrong size on BP_GameHUD_C_CreateWidgets");
static_assert(offsetof(BP_GameHUD_C_CreateWidgets, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'BP_GameHUD_C_CreateWidgets::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_CreateWidgets, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'BP_GameHUD_C_CreateWidgets::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_CreateWidgets, CallFunc_Create_ReturnValue) == 0x000020, "Member 'BP_GameHUD_C_CreateWidgets::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_CreateWidgets, CallFunc_Create_ReturnValue_1) == 0x000028, "Member 'BP_GameHUD_C_CreateWidgets::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_CreateWidgets, CallFunc_Create_ReturnValue_2) == 0x000030, "Member 'BP_GameHUD_C_CreateWidgets::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_CreateWidgets, CallFunc_Create_ReturnValue_3) == 0x000038, "Member 'BP_GameHUD_C_CreateWidgets::CallFunc_Create_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_CreateWidgets, CallFunc_Create_ReturnValue_4) == 0x000040, "Member 'BP_GameHUD_C_CreateWidgets::CallFunc_Create_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_CreateWidgets, CallFunc_Create_ReturnValue_5) == 0x000048, "Member 'BP_GameHUD_C_CreateWidgets::CallFunc_Create_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_CreateWidgets, CallFunc_Create_ReturnValue_6) == 0x000050, "Member 'BP_GameHUD_C_CreateWidgets::CallFunc_Create_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_CreateWidgets, CallFunc_Create_ReturnValue_7) == 0x000058, "Member 'BP_GameHUD_C_CreateWidgets::CallFunc_Create_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_CreateWidgets, CallFunc_Create_ReturnValue_8) == 0x000060, "Member 'BP_GameHUD_C_CreateWidgets::CallFunc_Create_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_CreateWidgets, CallFunc_Create_ReturnValue_9) == 0x000068, "Member 'BP_GameHUD_C_CreateWidgets::CallFunc_Create_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_CreateWidgets, CallFunc_Create_ReturnValue_10) == 0x000070, "Member 'BP_GameHUD_C_CreateWidgets::CallFunc_Create_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_CreateWidgets, CallFunc_Create_ReturnValue_11) == 0x000078, "Member 'BP_GameHUD_C_CreateWidgets::CallFunc_Create_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_CreateWidgets, CallFunc_Create_ReturnValue_12) == 0x000080, "Member 'BP_GameHUD_C_CreateWidgets::CallFunc_Create_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_CreateWidgets, CallFunc_Create_ReturnValue_13) == 0x000088, "Member 'BP_GameHUD_C_CreateWidgets::CallFunc_Create_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_CreateWidgets, CallFunc_Create_ReturnValue_14) == 0x000090, "Member 'BP_GameHUD_C_CreateWidgets::CallFunc_Create_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_CreateWidgets, CallFunc_Create_ReturnValue_15) == 0x000098, "Member 'BP_GameHUD_C_CreateWidgets::CallFunc_Create_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_CreateWidgets, CallFunc_Create_ReturnValue_16) == 0x0000A0, "Member 'BP_GameHUD_C_CreateWidgets::CallFunc_Create_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_CreateWidgets, CallFunc_Create_ReturnValue_17) == 0x0000A8, "Member 'BP_GameHUD_C_CreateWidgets::CallFunc_Create_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_CreateWidgets, CallFunc_Create_ReturnValue_18) == 0x0000B0, "Member 'BP_GameHUD_C_CreateWidgets::CallFunc_Create_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_CreateWidgets, CallFunc_Create_ReturnValue_19) == 0x0000B8, "Member 'BP_GameHUD_C_CreateWidgets::CallFunc_Create_ReturnValue_19' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_CreateWidgets, CallFunc_Create_ReturnValue_20) == 0x0000C0, "Member 'BP_GameHUD_C_CreateWidgets::CallFunc_Create_ReturnValue_20' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_CreateWidgets, CallFunc_Create_ReturnValue_21) == 0x0000C8, "Member 'BP_GameHUD_C_CreateWidgets::CallFunc_Create_ReturnValue_21' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_CreateWidgets, CallFunc_Create_ReturnValue_22) == 0x0000D0, "Member 'BP_GameHUD_C_CreateWidgets::CallFunc_Create_ReturnValue_22' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_CreateWidgets, CallFunc_Create_ReturnValue_23) == 0x0000D8, "Member 'BP_GameHUD_C_CreateWidgets::CallFunc_Create_ReturnValue_23' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_CreateWidgets, CallFunc_Create_ReturnValue_24) == 0x0000E0, "Member 'BP_GameHUD_C_CreateWidgets::CallFunc_Create_ReturnValue_24' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_CreateWidgets, CallFunc_Create_ReturnValue_25) == 0x0000E8, "Member 'BP_GameHUD_C_CreateWidgets::CallFunc_Create_ReturnValue_25' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_CreateWidgets, CallFunc_Create_ReturnValue_26) == 0x0000F0, "Member 'BP_GameHUD_C_CreateWidgets::CallFunc_Create_ReturnValue_26' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_CreateWidgets, CallFunc_Create_ReturnValue_27) == 0x0000F8, "Member 'BP_GameHUD_C_CreateWidgets::CallFunc_Create_ReturnValue_27' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_CreateWidgets, CallFunc_Create_ReturnValue_28) == 0x000100, "Member 'BP_GameHUD_C_CreateWidgets::CallFunc_Create_ReturnValue_28' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_CreateWidgets, CallFunc_Create_ReturnValue_29) == 0x000108, "Member 'BP_GameHUD_C_CreateWidgets::CallFunc_Create_ReturnValue_29' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_CreateWidgets, CallFunc_Create_ReturnValue_30) == 0x000110, "Member 'BP_GameHUD_C_CreateWidgets::CallFunc_Create_ReturnValue_30' has a wrong offset!");

// Function BP_GameHUD.BP_GameHUD_C.DeclineLastOffer
// 0x0028 (0x0028 - 0x0000)
struct BP_GameHUD_C_DeclineLastOffer final
{
public:
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLeaveCheckDisplayed_LeaveQueueDisplayed; // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APS_TDB_C*                              K2Node_DynamicCast_AsPS_TDB;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Offer_C*                           CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameHUD_C_DeclineLastOffer) == 0x000008, "Wrong alignment on BP_GameHUD_C_DeclineLastOffer");
static_assert(sizeof(BP_GameHUD_C_DeclineLastOffer) == 0x000028, "Wrong size on BP_GameHUD_C_DeclineLastOffer");
static_assert(offsetof(BP_GameHUD_C_DeclineLastOffer, CallFunc_GetPlayerController_ReturnValue) == 0x000000, "Member 'BP_GameHUD_C_DeclineLastOffer::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_DeclineLastOffer, CallFunc_GetLeaveCheckDisplayed_LeaveQueueDisplayed) == 0x000008, "Member 'BP_GameHUD_C_DeclineLastOffer::CallFunc_GetLeaveCheckDisplayed_LeaveQueueDisplayed' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_DeclineLastOffer, K2Node_DynamicCast_AsPS_TDB) == 0x000010, "Member 'BP_GameHUD_C_DeclineLastOffer::K2Node_DynamicCast_AsPS_TDB' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_DeclineLastOffer, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_GameHUD_C_DeclineLastOffer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_DeclineLastOffer, CallFunc_Array_LastIndex_ReturnValue) == 0x00001C, "Member 'BP_GameHUD_C_DeclineLastOffer::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameHUD_C_DeclineLastOffer, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_GameHUD_C_DeclineLastOffer::CallFunc_Array_Get_Item' has a wrong offset!");

// Function BP_GameHUD.BP_GameHUD_C.ExecuteUbergraph_BP_GameHUD
// 0x0600 (0x0600 - 0x0000)
struct BP_GameHUD_C_ExecuteUbergraph_BP_GameHUD final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_TutorHint_C*                         CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCurrentLevelName_ReturnValue;          // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Cold_Actor;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_RagActor;                             // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EWE_UIMode NewMode)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_ItemName;                       // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue_1;              // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Chat_C*                            CallFunc_Create_ReturnValue_1;                     // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller_1;          // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Squad_C*                           CallFunc_Create_ReturnValue_2;                     // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_PlayerMain_C*                      CallFunc_Create_ReturnValue_3;                     // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_CustomEvent_PlayerPawn;                     // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bHide;                          // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Hide;                           // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      K2Node_CustomEvent_Player;                         // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_In_Is_Open;                           // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InIsOpen;                             // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
