#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Interier_Toggler

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Interier_Toggler.BP_Interier_Toggler_C.BndEvt__OutterBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct BP_Interier_Toggler_C_BndEvt__OutterBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Interier_Toggler_C_BndEvt__OutterBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Interier_Toggler_C_BndEvt__OutterBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_Interier_Toggler_C_BndEvt__OutterBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on BP_Interier_Toggler_C_BndEvt__OutterBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_Interier_Toggler_C_BndEvt__OutterBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_Interier_Toggler_C_BndEvt__OutterBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_BndEvt__OutterBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_Interier_Toggler_C_BndEvt__OutterBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_BndEvt__OutterBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_Interier_Toggler_C_BndEvt__OutterBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_BndEvt__OutterBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_Interier_Toggler_C_BndEvt__OutterBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_BndEvt__OutterBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_Interier_Toggler_C_BndEvt__OutterBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_BndEvt__OutterBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_Interier_Toggler_C_BndEvt__OutterBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_Interier_Toggler.BP_Interier_Toggler_C.BndEvt__OutterBox_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_Interier_Toggler_C_BndEvt__OutterBox_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Interier_Toggler_C_BndEvt__OutterBox_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Interier_Toggler_C_BndEvt__OutterBox_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_Interier_Toggler_C_BndEvt__OutterBox_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BP_Interier_Toggler_C_BndEvt__OutterBox_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_Interier_Toggler_C_BndEvt__OutterBox_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_Interier_Toggler_C_BndEvt__OutterBox_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_BndEvt__OutterBox_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_Interier_Toggler_C_BndEvt__OutterBox_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_BndEvt__OutterBox_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_Interier_Toggler_C_BndEvt__OutterBox_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_BndEvt__OutterBox_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_Interier_Toggler_C_BndEvt__OutterBox_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BP_Interier_Toggler.BP_Interier_Toggler_C.ExecuteUbergraph_BP_Interier_Toggler
// 0x02D8 (0x02D8 - 0x0000)
struct BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_5;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_6;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0078(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0160(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0170(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             K2Node_DynamicCast_AsCharacter_1;                  // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19A[0x6];                                      // 0x019A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_1;        // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AA[0x2];                                      // 0x01AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_5;                  // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AStaticMeshActor*                       CallFunc_Array_Get_Item;                           // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x3];                                      // 0x01C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AStaticMeshActor*                       CallFunc_Array_Get_Item_1;                         // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x01E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E6[0x2];                                      // 0x01E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_7;                   // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AStaticMeshActor*                       CallFunc_Array_Get_Item_2;                         // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AStaticMeshActor*                       CallFunc_Array_Get_Item_3;                         // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AStaticMeshActor*                       CallFunc_Array_Get_Item_4;                         // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Window_C*                           CallFunc_Array_Get_Item_5;                         // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_6;               // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x022C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x022D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x022E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22F[0x1];                                      // 0x022F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_6;                  // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AStaticMeshActor*                       CallFunc_Array_Get_Item_6;                         // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x3];                                      // 0x0241(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_7;                 // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_7;               // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_7;                  // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_6;                // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_252[0x2];                                      // 0x0252(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_8;                 // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_8;                  // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_7;                // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25D[0x3];                                      // 0x025D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_9;                 // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0264(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0265(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_266[0x2];                                      // 0x0266(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_8;                   // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Door_C*                             CallFunc_Array_Get_Item_7;                         // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AStaticMeshActor*                       CallFunc_Array_Get_Item_8;                         // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_282[0x2];                                      // 0x0282(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0298(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_8;               // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x02A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A5[0x3];                                      // 0x02A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable_1;        // 0x02B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B5[0x3];                                      // 0x02B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_9;               // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x02BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x02BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x02BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BF[0x1];                                      // 0x02BF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_10;              // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C4[0x4];                                      // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AStaticMeshActor*                       CallFunc_Array_Get_Item_9;                         // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_8;                // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler) == 0x000008, "Wrong alignment on BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler");
static_assert(sizeof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler) == 0x0002D8, "Wrong size on BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, EntryPoint) == 0x000000, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, Temp_int_Array_Index_Variable_1) == 0x000008, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, Temp_int_Array_Index_Variable_2) == 0x00000C, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, Temp_bool_True_if_break_was_hit_Variable) == 0x000018, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, Temp_int_Array_Index_Variable_3) == 0x00001C, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_Not_PreBool_ReturnValue) == 0x000020, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, Temp_int_Loop_Counter_Variable_1) == 0x000024, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_Add_IntInt_ReturnValue_1) == 0x000028, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, Temp_int_Array_Index_Variable_4) == 0x00002C, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, Temp_int_Loop_Counter_Variable_2) == 0x000030, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_Add_IntInt_ReturnValue_2) == 0x000034, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, Temp_int_Loop_Counter_Variable_3) == 0x000038, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_Add_IntInt_ReturnValue_3) == 0x00003C, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, Temp_int_Variable) == 0x000040, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_Add_IntInt_ReturnValue_4) == 0x000044, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, Temp_int_Array_Index_Variable_5) == 0x000048, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::Temp_int_Array_Index_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, Temp_int_Loop_Counter_Variable_4) == 0x00004C, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::Temp_int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_Add_IntInt_ReturnValue_5) == 0x000050, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, Temp_int_Array_Index_Variable_6) == 0x000054, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::Temp_int_Array_Index_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000058, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000060, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000068, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000070, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, K2Node_ComponentBoundEvent_bFromSweep) == 0x000074, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, K2Node_ComponentBoundEvent_SweepResult) == 0x000078, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000160, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, K2Node_ComponentBoundEvent_OtherActor) == 0x000168, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, K2Node_ComponentBoundEvent_OtherComp) == 0x000170, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000178, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, K2Node_DynamicCast_AsCharacter) == 0x000180, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, K2Node_DynamicCast_bSuccess) == 0x000188, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, K2Node_DynamicCast_AsCharacter_1) == 0x000190, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::K2Node_DynamicCast_AsCharacter_1' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, K2Node_DynamicCast_bSuccess_1) == 0x000198, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_IsLocallyControlled_ReturnValue) == 0x000199, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, K2Node_DynamicCast_AsSurvival_Player) == 0x0001A0, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, K2Node_DynamicCast_bSuccess_2) == 0x0001A8, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_IsLocallyControlled_ReturnValue_1) == 0x0001A9, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_IsLocallyControlled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, Temp_int_Loop_Counter_Variable_5) == 0x0001AC, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::Temp_int_Loop_Counter_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_Array_Length_ReturnValue) == 0x0001B0, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_Add_IntInt_ReturnValue_6) == 0x0001B4, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_Add_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_Array_Length_ReturnValue_1) == 0x0001B8, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_Array_Get_Item) == 0x0001C0, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_Less_IntInt_ReturnValue) == 0x0001C8, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_Array_Length_ReturnValue_2) == 0x0001CC, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_Less_IntInt_ReturnValue_1) == 0x0001D0, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_Array_Get_Item_1) == 0x0001D8, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_Array_Length_ReturnValue_3) == 0x0001E0, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_IsValid_ReturnValue) == 0x0001E4, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_Less_IntInt_ReturnValue_2) == 0x0001E5, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, Temp_int_Array_Index_Variable_7) == 0x0001E8, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::Temp_int_Array_Index_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_Array_Get_Item_2) == 0x0001F0, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_IsValid_ReturnValue_1) == 0x0001F8, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_Array_Get_Item_3) == 0x000200, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_Array_Length_ReturnValue_4) == 0x000208, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_Array_Get_Item_4) == 0x000210, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_Array_Length_ReturnValue_5) == 0x000218, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_Array_Length_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_Array_Get_Item_5) == 0x000220, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_Array_Length_ReturnValue_6) == 0x000228, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_Array_Length_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_IsValid_ReturnValue_2) == 0x00022C, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_Less_IntInt_ReturnValue_3) == 0x00022D, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_BooleanAND_ReturnValue) == 0x00022E, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, Temp_int_Loop_Counter_Variable_6) == 0x000230, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::Temp_int_Loop_Counter_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_Array_Get_Item_6) == 0x000238, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_Array_Get_Item_6' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_Less_IntInt_ReturnValue_4) == 0x000240, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_Less_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_Add_IntInt_ReturnValue_7) == 0x000244, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_Add_IntInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_Array_Length_ReturnValue_7) == 0x000248, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_Array_Length_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, Temp_int_Loop_Counter_Variable_7) == 0x00024C, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::Temp_int_Loop_Counter_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_Less_IntInt_ReturnValue_5) == 0x000250, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_Less_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_Less_IntInt_ReturnValue_6) == 0x000251, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_Less_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_Add_IntInt_ReturnValue_8) == 0x000254, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_Add_IntInt_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, Temp_int_Loop_Counter_Variable_8) == 0x000258, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::Temp_int_Loop_Counter_Variable_8' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_Less_IntInt_ReturnValue_7) == 0x00025C, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_Less_IntInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_Add_IntInt_ReturnValue_9) == 0x000260, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_Add_IntInt_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_Not_PreBool_ReturnValue_1) == 0x000264, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_Not_PreBool_ReturnValue_2) == 0x000265, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, Temp_int_Array_Index_Variable_8) == 0x000268, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::Temp_int_Array_Index_Variable_8' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_Array_Get_Item_7) == 0x000270, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_Array_Get_Item_7' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_Array_Get_Item_8) == 0x000278, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_Array_Get_Item_8' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_IsValid_ReturnValue_3) == 0x000280, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_IsValid_ReturnValue_4) == 0x000281, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_Array_LastIndex_ReturnValue) == 0x000284, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_Subtract_IntInt_ReturnValue) == 0x000288, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_Max_ReturnValue) == 0x00028C, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000290, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_K2_SetTimer_ReturnValue) == 0x000298, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_Array_Length_ReturnValue_8) == 0x0002A0, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_Array_Length_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_Greater_IntInt_ReturnValue) == 0x0002A4, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_Array_Add_ReturnValue) == 0x0002A8, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_Array_Add_ReturnValue_1) == 0x0002AC, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_Array_Add_ReturnValue_2) == 0x0002B0, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, Temp_bool_True_if_break_was_hit_Variable_1) == 0x0002B4, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::Temp_bool_True_if_break_was_hit_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_Array_Length_ReturnValue_9) == 0x0002B8, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_Array_Length_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_Greater_IntInt_ReturnValue_1) == 0x0002BC, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_Not_PreBool_ReturnValue_3) == 0x0002BD, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_BooleanAND_ReturnValue_1) == 0x0002BE, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_Array_Length_ReturnValue_10) == 0x0002C0, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_Array_Length_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_Array_Get_Item_9) == 0x0002C8, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_Array_Get_Item_9' has a wrong offset!");
static_assert(offsetof(BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler, CallFunc_Less_IntInt_ReturnValue_8) == 0x0002D0, "Member 'BP_Interier_Toggler_C_ExecuteUbergraph_BP_Interier_Toggler::CallFunc_Less_IntInt_ReturnValue_8' has a wrong offset!");

// Function BP_Interier_Toggler.BP_Interier_Toggler_C.Toggle
// 0x0098 (0x0098 - 0x0000)
struct BP_Interier_Toggler_C_Toggle final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
