#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Interier_Toggler

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Interier_Toggler.BP_Interier_Toggler_C
// 0x0068 (0x02F8 - 0x0290)
class ABP_Interier_Toggler_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          OutterBox;                                         // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class AStaticMeshActor*>               Meshes;                                            // 0x02B0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, ExposeOnSpawn)
	TArray<class ABP_Door_C*>                     Doors;                                             // 0x02C0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, ExposeOnSpawn)
	TArray<class ABP_Window_C*>                   Windows;                                           // 0x02D0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	bool                                          Visibled;                                          // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LoadingByDoors;                                    // 0x02E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E2[0x6];                                      // 0x02E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AStaticMeshActor*>               MeshesToLoad;                                      // 0x02E8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)

public:
	void BndEvt__OutterBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__OutterBox_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void CustomLoad();
	void CustomUnload();
	void ExecuteUbergraph_BP_Interier_Toggler(int32 EntryPoint);
	void ReceiveBeginPlay();
	void SetInvisible();
	void SetVisible();
	void SetVisibleForce();
	void Toggle();
	void Toggle_Window_();
	void UpdateQueue();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Interier_Toggler_C">();
	}
	static class ABP_Interier_Toggler_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Interier_Toggler_C>();
	}
};
static_assert(alignof(ABP_Interier_Toggler_C) == 0x000008, "Wrong alignment on ABP_Interier_Toggler_C");
static_assert(sizeof(ABP_Interier_Toggler_C) == 0x0002F8, "Wrong size on ABP_Interier_Toggler_C");
static_assert(offsetof(ABP_Interier_Toggler_C, UberGraphFrame) == 0x000290, "Member 'ABP_Interier_Toggler_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Interier_Toggler_C, OutterBox) == 0x000298, "Member 'ABP_Interier_Toggler_C::OutterBox' has a wrong offset!");
static_assert(offsetof(ABP_Interier_Toggler_C, Box) == 0x0002A0, "Member 'ABP_Interier_Toggler_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_Interier_Toggler_C, DefaultSceneRoot) == 0x0002A8, "Member 'ABP_Interier_Toggler_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Interier_Toggler_C, Meshes) == 0x0002B0, "Member 'ABP_Interier_Toggler_C::Meshes' has a wrong offset!");
static_assert(offsetof(ABP_Interier_Toggler_C, Doors) == 0x0002C0, "Member 'ABP_Interier_Toggler_C::Doors' has a wrong offset!");
static_assert(offsetof(ABP_Interier_Toggler_C, Windows) == 0x0002D0, "Member 'ABP_Interier_Toggler_C::Windows' has a wrong offset!");
static_assert(offsetof(ABP_Interier_Toggler_C, Visibled) == 0x0002E0, "Member 'ABP_Interier_Toggler_C::Visibled' has a wrong offset!");
static_assert(offsetof(ABP_Interier_Toggler_C, LoadingByDoors) == 0x0002E1, "Member 'ABP_Interier_Toggler_C::LoadingByDoors' has a wrong offset!");
static_assert(offsetof(ABP_Interier_Toggler_C, MeshesToLoad) == 0x0002E8, "Member 'ABP_Interier_Toggler_C::MeshesToLoad' has a wrong offset!");

}

