#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_IconManufacturer

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FItemInfo_structs.hpp"
#include "AttachmentInfo_structs.hpp"
#include "Engine_structs.hpp"
#include "S_Attachment_structs.hpp"
#include "BPS_WeaponData_structs.hpp"


namespace SDK::Params
{

// Function BP_IconManufacturer.BP_IconManufacturer_C.Configurate Target Texture
// 0x02B0 (0x02B0 - 0x0000)
struct BP_IconManufacturer_C_Configurate_Target_Texture final
{
public:
	struct FFItemInfo                             FItemInfo;                                         // 0x0000(0x0220)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	double                                        RenderTargetResolutionMultiplier;                  // 0x0220(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        IconBaseSize;                                      // 0x0228(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_242[0x6];                                      // 0x0242(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_2;                // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_2;                     // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 CallFunc_CreateRenderTarget2D_ReturnValue;         // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_3;                // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_3;                     // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 CallFunc_CreateRenderTarget2D_ReturnValue_1;       // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IconManufacturer_C_Configurate_Target_Texture) == 0x000008, "Wrong alignment on BP_IconManufacturer_C_Configurate_Target_Texture");
static_assert(sizeof(BP_IconManufacturer_C_Configurate_Target_Texture) == 0x0002B0, "Wrong size on BP_IconManufacturer_C_Configurate_Target_Texture");
static_assert(offsetof(BP_IconManufacturer_C_Configurate_Target_Texture, FItemInfo) == 0x000000, "Member 'BP_IconManufacturer_C_Configurate_Target_Texture::FItemInfo' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Configurate_Target_Texture, RenderTargetResolutionMultiplier) == 0x000220, "Member 'BP_IconManufacturer_C_Configurate_Target_Texture::RenderTargetResolutionMultiplier' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Configurate_Target_Texture, IconBaseSize) == 0x000228, "Member 'BP_IconManufacturer_C_Configurate_Target_Texture::IconBaseSize' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Configurate_Target_Texture, CallFunc_BreakVector2D_X) == 0x000230, "Member 'BP_IconManufacturer_C_Configurate_Target_Texture::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Configurate_Target_Texture, CallFunc_BreakVector2D_Y) == 0x000238, "Member 'BP_IconManufacturer_C_Configurate_Target_Texture::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Configurate_Target_Texture, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000240, "Member 'BP_IconManufacturer_C_Configurate_Target_Texture::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Configurate_Target_Texture, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000241, "Member 'BP_IconManufacturer_C_Configurate_Target_Texture::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Configurate_Target_Texture, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000248, "Member 'BP_IconManufacturer_C_Configurate_Target_Texture::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Configurate_Target_Texture, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000250, "Member 'BP_IconManufacturer_C_Configurate_Target_Texture::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Configurate_Target_Texture, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000258, "Member 'BP_IconManufacturer_C_Configurate_Target_Texture::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Configurate_Target_Texture, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x000260, "Member 'BP_IconManufacturer_C_Configurate_Target_Texture::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Configurate_Target_Texture, CallFunc_SelectFloat_ReturnValue) == 0x000268, "Member 'BP_IconManufacturer_C_Configurate_Target_Texture::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Configurate_Target_Texture, CallFunc_FTrunc_ReturnValue) == 0x000270, "Member 'BP_IconManufacturer_C_Configurate_Target_Texture::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Configurate_Target_Texture, CallFunc_SelectFloat_ReturnValue_1) == 0x000278, "Member 'BP_IconManufacturer_C_Configurate_Target_Texture::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Configurate_Target_Texture, CallFunc_SelectFloat_ReturnValue_2) == 0x000280, "Member 'BP_IconManufacturer_C_Configurate_Target_Texture::CallFunc_SelectFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Configurate_Target_Texture, CallFunc_FTrunc_ReturnValue_1) == 0x000288, "Member 'BP_IconManufacturer_C_Configurate_Target_Texture::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Configurate_Target_Texture, CallFunc_FTrunc_ReturnValue_2) == 0x00028C, "Member 'BP_IconManufacturer_C_Configurate_Target_Texture::CallFunc_FTrunc_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Configurate_Target_Texture, CallFunc_CreateRenderTarget2D_ReturnValue) == 0x000290, "Member 'BP_IconManufacturer_C_Configurate_Target_Texture::CallFunc_CreateRenderTarget2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Configurate_Target_Texture, CallFunc_SelectFloat_ReturnValue_3) == 0x000298, "Member 'BP_IconManufacturer_C_Configurate_Target_Texture::CallFunc_SelectFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Configurate_Target_Texture, CallFunc_FTrunc_ReturnValue_3) == 0x0002A0, "Member 'BP_IconManufacturer_C_Configurate_Target_Texture::CallFunc_FTrunc_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Configurate_Target_Texture, CallFunc_CreateRenderTarget2D_ReturnValue_1) == 0x0002A8, "Member 'BP_IconManufacturer_C_Configurate_Target_Texture::CallFunc_CreateRenderTarget2D_ReturnValue_1' has a wrong offset!");

// Function BP_IconManufacturer.BP_IconManufacturer_C.ExecuteUbergraph_BP_IconManufacturer
// 0x0070 (0x0070 - 0x0000)
struct BP_IconManufacturer_C_ExecuteUbergraph_BP_IconManufacturer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AWeaponPlaceholder_C*                   K2Node_DynamicCast_AsWeapon_Placeholder;           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_Select_Default;                             // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalPlayerController_ReturnValue;      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IconManufacturer_C_ExecuteUbergraph_BP_IconManufacturer) == 0x000008, "Wrong alignment on BP_IconManufacturer_C_ExecuteUbergraph_BP_IconManufacturer");
static_assert(sizeof(BP_IconManufacturer_C_ExecuteUbergraph_BP_IconManufacturer) == 0x000070, "Wrong size on BP_IconManufacturer_C_ExecuteUbergraph_BP_IconManufacturer");
static_assert(offsetof(BP_IconManufacturer_C_ExecuteUbergraph_BP_IconManufacturer, EntryPoint) == 0x000000, "Member 'BP_IconManufacturer_C_ExecuteUbergraph_BP_IconManufacturer::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_ExecuteUbergraph_BP_IconManufacturer, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'BP_IconManufacturer_C_ExecuteUbergraph_BP_IconManufacturer::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_ExecuteUbergraph_BP_IconManufacturer, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000010, "Member 'BP_IconManufacturer_C_ExecuteUbergraph_BP_IconManufacturer::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_ExecuteUbergraph_BP_IconManufacturer, CallFunc_K2_GetPawn_ReturnValue) == 0x000028, "Member 'BP_IconManufacturer_C_ExecuteUbergraph_BP_IconManufacturer::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_ExecuteUbergraph_BP_IconManufacturer, K2Node_DynamicCast_AsSurvival_Player) == 0x000030, "Member 'BP_IconManufacturer_C_ExecuteUbergraph_BP_IconManufacturer::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_ExecuteUbergraph_BP_IconManufacturer, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_IconManufacturer_C_ExecuteUbergraph_BP_IconManufacturer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_ExecuteUbergraph_BP_IconManufacturer, K2Node_DynamicCast_AsWeapon_Placeholder) == 0x000040, "Member 'BP_IconManufacturer_C_ExecuteUbergraph_BP_IconManufacturer::K2Node_DynamicCast_AsWeapon_Placeholder' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_ExecuteUbergraph_BP_IconManufacturer, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BP_IconManufacturer_C_ExecuteUbergraph_BP_IconManufacturer::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_ExecuteUbergraph_BP_IconManufacturer, Temp_bool_Variable) == 0x000049, "Member 'BP_IconManufacturer_C_ExecuteUbergraph_BP_IconManufacturer::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_ExecuteUbergraph_BP_IconManufacturer, CallFunc_IsValid_ReturnValue) == 0x00004A, "Member 'BP_IconManufacturer_C_ExecuteUbergraph_BP_IconManufacturer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_ExecuteUbergraph_BP_IconManufacturer, CallFunc_GetPlayerController_ReturnValue_1) == 0x000050, "Member 'BP_IconManufacturer_C_ExecuteUbergraph_BP_IconManufacturer::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_ExecuteUbergraph_BP_IconManufacturer, CallFunc_IsValid_ReturnValue_1) == 0x000058, "Member 'BP_IconManufacturer_C_ExecuteUbergraph_BP_IconManufacturer::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_ExecuteUbergraph_BP_IconManufacturer, K2Node_Select_Default) == 0x000060, "Member 'BP_IconManufacturer_C_ExecuteUbergraph_BP_IconManufacturer::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_ExecuteUbergraph_BP_IconManufacturer, CallFunc_IsLocalPlayerController_ReturnValue) == 0x000068, "Member 'BP_IconManufacturer_C_ExecuteUbergraph_BP_IconManufacturer::CallFunc_IsLocalPlayerController_ReturnValue' has a wrong offset!");

// Function BP_IconManufacturer.BP_IconManufacturer_C.Get Weapon Icon
// 0x0278 (0x0278 - 0x0000)
struct BP_IconManufacturer_C_Get_Weapon_Icon final
{
public:
	class ASurvivalPlayer_C*                      Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFItemInfo                             Item_Info;                                         // 0x0008(0x0220)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
	class UMaterialInterface*                     Image;                                             // 0x0228(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             NewLocalVar_0;                                     // 0x0230(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x3];                                      // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BaseAttachment_C*                   CallFunc_Array_Get_Item;                           // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x3];                                      // 0x0259(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      K2Node_Select_Default;                             // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IconManufacturer_C_Get_Weapon_Icon) == 0x000008, "Wrong alignment on BP_IconManufacturer_C_Get_Weapon_Icon");
static_assert(sizeof(BP_IconManufacturer_C_Get_Weapon_Icon) == 0x000278, "Wrong size on BP_IconManufacturer_C_Get_Weapon_Icon");
static_assert(offsetof(BP_IconManufacturer_C_Get_Weapon_Icon, Player) == 0x000000, "Member 'BP_IconManufacturer_C_Get_Weapon_Icon::Player' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Get_Weapon_Icon, Item_Info) == 0x000008, "Member 'BP_IconManufacturer_C_Get_Weapon_Icon::Item_Info' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Get_Weapon_Icon, Image) == 0x000228, "Member 'BP_IconManufacturer_C_Get_Weapon_Icon::Image' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Get_Weapon_Icon, NewLocalVar_0) == 0x000230, "Member 'BP_IconManufacturer_C_Get_Weapon_Icon::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Get_Weapon_Icon, CallFunc_IsValid_ReturnValue) == 0x000238, "Member 'BP_IconManufacturer_C_Get_Weapon_Icon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Get_Weapon_Icon, Temp_int_Array_Index_Variable) == 0x00023C, "Member 'BP_IconManufacturer_C_Get_Weapon_Icon::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Get_Weapon_Icon, CallFunc_Array_Add_ReturnValue) == 0x000240, "Member 'BP_IconManufacturer_C_Get_Weapon_Icon::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Get_Weapon_Icon, Temp_int_Loop_Counter_Variable) == 0x000244, "Member 'BP_IconManufacturer_C_Get_Weapon_Icon::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Get_Weapon_Icon, CallFunc_Array_Get_Item) == 0x000248, "Member 'BP_IconManufacturer_C_Get_Weapon_Icon::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Get_Weapon_Icon, CallFunc_Array_Length_ReturnValue) == 0x000250, "Member 'BP_IconManufacturer_C_Get_Weapon_Icon::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Get_Weapon_Icon, CallFunc_Array_Add_ReturnValue_1) == 0x000254, "Member 'BP_IconManufacturer_C_Get_Weapon_Icon::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Get_Weapon_Icon, CallFunc_Less_IntInt_ReturnValue) == 0x000258, "Member 'BP_IconManufacturer_C_Get_Weapon_Icon::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Get_Weapon_Icon, CallFunc_Add_IntInt_ReturnValue) == 0x00025C, "Member 'BP_IconManufacturer_C_Get_Weapon_Icon::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Get_Weapon_Icon, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000260, "Member 'BP_IconManufacturer_C_Get_Weapon_Icon::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Get_Weapon_Icon, Temp_bool_Variable) == 0x000268, "Member 'BP_IconManufacturer_C_Get_Weapon_Icon::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Get_Weapon_Icon, K2Node_Select_Default) == 0x000270, "Member 'BP_IconManufacturer_C_Get_Weapon_Icon::K2Node_Select_Default' has a wrong offset!");

// Function BP_IconManufacturer.BP_IconManufacturer_C.Set Icon Model
// 0x1890 (0x1890 - 0x0000)
struct BP_IconManufacturer_C_Set_Icon_Model final
{
public:
	class ASurvivalPlayer_C*                      Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFItemInfo                             Item_Info;                                         // 0x0008(0x0220)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
	struct FS_Attachment                          CurrentModeInfo;                                   // 0x0228(0x0080)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	class USC_BaseWeaponAttachment_C*             AttachmentComponent;                               // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     ResultTexture;                                     // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FBPS_WeaponData                        Weapon_Data;                                       // 0x02B8(0x04C0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0778(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x077C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0780(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0784(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0788(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x078C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0790(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0794(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0798(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79C[0x4];                                      // 0x079C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x07A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x07B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x07D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddWorldOffset_SweepHitResult;         // 0x07E8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x08D0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x09B8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0AA0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0AA4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0AA8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class ABP_BaseAttachment_C*                   CallFunc_Array_Get_Item;                           // 0x0B90(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0B98(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9C[0x4];                                      // 0x0B9C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_Attachment                          CallFunc_GetDataTableRowFromName_OutRow;           // 0x0BA0(0x0080)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0C20(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0C21(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0C22(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C23[0x5];                                      // 0x0C23(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_LoadClassAsset_Blocking_ReturnValue;      // 0x0C28(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x0C30(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C31[0x7];                                      // 0x0C31(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsBP_Base_Attachment;      // 0x0C38(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0C40(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0C41(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C42[0x2];                                      // 0x0C42(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0C44(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C48[0x8];                                      // 0x0C48(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0C50(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x0CB0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0CB4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0CB8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CB9[0x3];                                      // 0x0CB9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0CBC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_5;                   // 0x0CC0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC4[0x4];                                      // 0x0CC4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_LoadClassAsset_Blocking_ReturnValue_1;    // 0x0CC8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsBP_Base_Attachment_1;    // 0x0CD0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess_1;                // 0x0CD8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CD9[0x7];                                      // 0x0CD9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0CE0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_BaseAttachment_C*                   CallFunc_FinishSpawningActor_ReturnValue;          // 0x0CE8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0CF0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CF1[0x3];                                      // 0x0CF1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0CF4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMeshComponent*>           CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0CF8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_1;                         // 0x0D08(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0D10(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D11[0x7];                                      // 0x0D11(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue;                 // 0x0D18(0x0010)(ReferenceParm)
	class UMaterialInterface*                     CallFunc_Array_Get_Item_2;                         // 0x0D28(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0D30(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0D34(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D35[0x3];                                      // 0x0D35(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0D38(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0D3C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D3D[0x3];                                      // 0x0D3D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBPS_WeaponData                        CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0D40(0x04C0)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x1200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1201[0x3];                                     // 0x1201(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x1204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x1208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1209[0x3];                                     // 0x1209(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x120C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x1210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1211[0xF];                                     // 0x1211(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x1220(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x1280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_BaseAttachment_C*                   CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x1288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAttachmentInfo                        CallFunc_Array_Get_Item_3;                         // 0x1290(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_1;       // 0x12A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12A1[0x3];                                     // 0x12A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x12A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_Attachment                          CallFunc_GetDataTableRowFromName_OutRow_2;         // 0x12A8(0x0080)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_2;    // 0x1328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1329[0x3];                                     // 0x1329(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x132C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x1330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x1331(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x1332(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1333[0x5];                                     // 0x1333(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue_1;               // 0x1338(0x0010)(ReferenceParm)
	class UMaterialInterface*                     CallFunc_Array_Get_Item_4;                         // 0x1348(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x1350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x1354(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x1355(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1356[0x2];                                     // 0x1356(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumMaterials_ReturnValue;              // 0x1358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x135C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_135D[0x3];                                     // 0x135D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x1360(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          K2Node_DynamicCast_AsSkeletal_Mesh;                // 0x1368(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x1370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1371[0x7];                                     // 0x1371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSkeletalMaterial>              CallFunc_GetMaterials_ReturnValue_2;               // 0x1378(0x0010)(ConstParm, ReferenceParm)
	struct FSkeletalMaterial                      CallFunc_Array_Get_Item_5;                         // 0x1388(0x0028)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x13B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x13B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x13B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x13B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13B7[0x1];                                     // 0x13B7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_5;                  // 0x13B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13BC[0x4];                                     // 0x13BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBPS_WeaponData                        CallFunc_GetDataTableRowFromName_OutRow_3;         // 0x13C0(0x04C0)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_3;    // 0x1880(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x1881(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1882[0x2];                                     // 0x1882(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x1884(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IconManufacturer_C_Set_Icon_Model) == 0x000010, "Wrong alignment on BP_IconManufacturer_C_Set_Icon_Model");
static_assert(sizeof(BP_IconManufacturer_C_Set_Icon_Model) == 0x001890, "Wrong size on BP_IconManufacturer_C_Set_Icon_Model");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, Player) == 0x000000, "Member 'BP_IconManufacturer_C_Set_Icon_Model::Player' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, Item_Info) == 0x000008, "Member 'BP_IconManufacturer_C_Set_Icon_Model::Item_Info' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, CurrentModeInfo) == 0x000228, "Member 'BP_IconManufacturer_C_Set_Icon_Model::CurrentModeInfo' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, AttachmentComponent) == 0x0002A8, "Member 'BP_IconManufacturer_C_Set_Icon_Model::AttachmentComponent' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, ResultTexture) == 0x0002B0, "Member 'BP_IconManufacturer_C_Set_Icon_Model::ResultTexture' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, Weapon_Data) == 0x0002B8, "Member 'BP_IconManufacturer_C_Set_Icon_Model::Weapon_Data' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, Temp_int_Loop_Counter_Variable) == 0x000778, "Member 'BP_IconManufacturer_C_Set_Icon_Model::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, CallFunc_Add_IntInt_ReturnValue) == 0x00077C, "Member 'BP_IconManufacturer_C_Set_Icon_Model::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, Temp_int_Array_Index_Variable) == 0x000780, "Member 'BP_IconManufacturer_C_Set_Icon_Model::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, Temp_int_Loop_Counter_Variable_1) == 0x000784, "Member 'BP_IconManufacturer_C_Set_Icon_Model::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, Temp_int_Loop_Counter_Variable_2) == 0x000788, "Member 'BP_IconManufacturer_C_Set_Icon_Model::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, CallFunc_Add_IntInt_ReturnValue_1) == 0x00078C, "Member 'BP_IconManufacturer_C_Set_Icon_Model::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, CallFunc_Add_IntInt_ReturnValue_2) == 0x000790, "Member 'BP_IconManufacturer_C_Set_Icon_Model::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, Temp_int_Array_Index_Variable_1) == 0x000794, "Member 'BP_IconManufacturer_C_Set_Icon_Model::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, Temp_int_Array_Index_Variable_2) == 0x000798, "Member 'BP_IconManufacturer_C_Set_Icon_Model::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0007A0, "Member 'BP_IconManufacturer_C_Set_Icon_Model::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, CallFunc_GetSocketLocation_ReturnValue) == 0x0007B8, "Member 'BP_IconManufacturer_C_Set_Icon_Model::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0007D0, "Member 'BP_IconManufacturer_C_Set_Icon_Model::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, CallFunc_K2_AddWorldOffset_SweepHitResult) == 0x0007E8, "Member 'BP_IconManufacturer_C_Set_Icon_Model::CallFunc_K2_AddWorldOffset_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x0008D0, "Member 'BP_IconManufacturer_C_Set_Icon_Model::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, CallFunc_K2_SetRelativeLocation_SweepHitResult_1) == 0x0009B8, "Member 'BP_IconManufacturer_C_Set_Icon_Model::CallFunc_K2_SetRelativeLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, CallFunc_Array_Length_ReturnValue) == 0x000AA0, "Member 'BP_IconManufacturer_C_Set_Icon_Model::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, Temp_int_Array_Index_Variable_3) == 0x000AA4, "Member 'BP_IconManufacturer_C_Set_Icon_Model::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000AA8, "Member 'BP_IconManufacturer_C_Set_Icon_Model::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, CallFunc_Array_Get_Item) == 0x000B90, "Member 'BP_IconManufacturer_C_Set_Icon_Model::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, Temp_int_Variable) == 0x000B98, "Member 'BP_IconManufacturer_C_Set_Icon_Model::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, CallFunc_GetDataTableRowFromName_OutRow) == 0x000BA0, "Member 'BP_IconManufacturer_C_Set_Icon_Model::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000C20, "Member 'BP_IconManufacturer_C_Set_Icon_Model::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000C21, "Member 'BP_IconManufacturer_C_Set_Icon_Model::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000C22, "Member 'BP_IconManufacturer_C_Set_Icon_Model::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, CallFunc_LoadClassAsset_Blocking_ReturnValue) == 0x000C28, "Member 'BP_IconManufacturer_C_Set_Icon_Model::CallFunc_LoadClassAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x000C30, "Member 'BP_IconManufacturer_C_Set_Icon_Model::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, K2Node_ClassDynamicCast_AsBP_Base_Attachment) == 0x000C38, "Member 'BP_IconManufacturer_C_Set_Icon_Model::K2Node_ClassDynamicCast_AsBP_Base_Attachment' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, K2Node_ClassDynamicCast_bSuccess) == 0x000C40, "Member 'BP_IconManufacturer_C_Set_Icon_Model::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, CallFunc_BooleanAND_ReturnValue) == 0x000C41, "Member 'BP_IconManufacturer_C_Set_Icon_Model::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, CallFunc_Add_IntInt_ReturnValue_3) == 0x000C44, "Member 'BP_IconManufacturer_C_Set_Icon_Model::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, CallFunc_MakeTransform_ReturnValue) == 0x000C50, "Member 'BP_IconManufacturer_C_Set_Icon_Model::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, Temp_int_Array_Index_Variable_4) == 0x000CB0, "Member 'BP_IconManufacturer_C_Set_Icon_Model::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, Temp_int_Loop_Counter_Variable_3) == 0x000CB4, "Member 'BP_IconManufacturer_C_Set_Icon_Model::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, CallFunc_Less_IntInt_ReturnValue) == 0x000CB8, "Member 'BP_IconManufacturer_C_Set_Icon_Model::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, CallFunc_Add_IntInt_ReturnValue_4) == 0x000CBC, "Member 'BP_IconManufacturer_C_Set_Icon_Model::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, Temp_int_Array_Index_Variable_5) == 0x000CC0, "Member 'BP_IconManufacturer_C_Set_Icon_Model::Temp_int_Array_Index_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, CallFunc_LoadClassAsset_Blocking_ReturnValue_1) == 0x000CC8, "Member 'BP_IconManufacturer_C_Set_Icon_Model::CallFunc_LoadClassAsset_Blocking_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, K2Node_ClassDynamicCast_AsBP_Base_Attachment_1) == 0x000CD0, "Member 'BP_IconManufacturer_C_Set_Icon_Model::K2Node_ClassDynamicCast_AsBP_Base_Attachment_1' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, K2Node_ClassDynamicCast_bSuccess_1) == 0x000CD8, "Member 'BP_IconManufacturer_C_Set_Icon_Model::K2Node_ClassDynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000CE0, "Member 'BP_IconManufacturer_C_Set_Icon_Model::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, CallFunc_FinishSpawningActor_ReturnValue) == 0x000CE8, "Member 'BP_IconManufacturer_C_Set_Icon_Model::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000CF0, "Member 'BP_IconManufacturer_C_Set_Icon_Model::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, CallFunc_Array_Add_ReturnValue) == 0x000CF4, "Member 'BP_IconManufacturer_C_Set_Icon_Model::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000CF8, "Member 'BP_IconManufacturer_C_Set_Icon_Model::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, CallFunc_Array_Get_Item_1) == 0x000D08, "Member 'BP_IconManufacturer_C_Set_Icon_Model::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, CallFunc_IsValid_ReturnValue) == 0x000D10, "Member 'BP_IconManufacturer_C_Set_Icon_Model::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, CallFunc_GetMaterials_ReturnValue) == 0x000D18, "Member 'BP_IconManufacturer_C_Set_Icon_Model::CallFunc_GetMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, CallFunc_Array_Get_Item_2) == 0x000D28, "Member 'BP_IconManufacturer_C_Set_Icon_Model::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, CallFunc_Array_Length_ReturnValue_1) == 0x000D30, "Member 'BP_IconManufacturer_C_Set_Icon_Model::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, CallFunc_IsValid_ReturnValue_1) == 0x000D34, "Member 'BP_IconManufacturer_C_Set_Icon_Model::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, CallFunc_Array_Length_ReturnValue_2) == 0x000D38, "Member 'BP_IconManufacturer_C_Set_Icon_Model::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, CallFunc_Less_IntInt_ReturnValue_1) == 0x000D3C, "Member 'BP_IconManufacturer_C_Set_Icon_Model::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000D40, "Member 'BP_IconManufacturer_C_Set_Icon_Model::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x001200, "Member 'BP_IconManufacturer_C_Set_Icon_Model::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, Temp_int_Loop_Counter_Variable_4) == 0x001204, "Member 'BP_IconManufacturer_C_Set_Icon_Model::Temp_int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, CallFunc_Less_IntInt_ReturnValue_2) == 0x001208, "Member 'BP_IconManufacturer_C_Set_Icon_Model::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_IconManufacturer_C_Set_Icon_Model, CallFunc_Add_IntInt_ReturnValue_5) == 0x00120C, "Member 'BP_IconManufacturer_C_Set_Icon_Model::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
