#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_IconCharacter

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "EquipmentData_structs.hpp"


namespace SDK::Params
{

// Function BP_IconCharacter.BP_IconCharacter_C.Change Material Param Color
// 0x0088 (0x0088 - 0x0000)
struct BP_IconCharacter_C_Change_Material_Param_Color final
{
public:
	TArray<class USkeletalMeshComponent*>         Array;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class FName                                   ParameterName;                                     // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Value;                                             // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue;                 // 0x0050(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_Array_Get_Item_1;                         // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IconCharacter_C_Change_Material_Param_Color) == 0x000008, "Wrong alignment on BP_IconCharacter_C_Change_Material_Param_Color");
static_assert(sizeof(BP_IconCharacter_C_Change_Material_Param_Color) == 0x000088, "Wrong size on BP_IconCharacter_C_Change_Material_Param_Color");
static_assert(offsetof(BP_IconCharacter_C_Change_Material_Param_Color, Array) == 0x000000, "Member 'BP_IconCharacter_C_Change_Material_Param_Color::Array' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_Change_Material_Param_Color, ParameterName) == 0x000010, "Member 'BP_IconCharacter_C_Change_Material_Param_Color::ParameterName' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_Change_Material_Param_Color, Value) == 0x000018, "Member 'BP_IconCharacter_C_Change_Material_Param_Color::Value' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_Change_Material_Param_Color, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_IconCharacter_C_Change_Material_Param_Color::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_Change_Material_Param_Color, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'BP_IconCharacter_C_Change_Material_Param_Color::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_Change_Material_Param_Color, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'BP_IconCharacter_C_Change_Material_Param_Color::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_Change_Material_Param_Color, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'BP_IconCharacter_C_Change_Material_Param_Color::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_Change_Material_Param_Color, Temp_int_Array_Index_Variable) == 0x000038, "Member 'BP_IconCharacter_C_Change_Material_Param_Color::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_Change_Material_Param_Color, Temp_int_Loop_Counter_Variable_1) == 0x00003C, "Member 'BP_IconCharacter_C_Change_Material_Param_Color::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_Change_Material_Param_Color, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_IconCharacter_C_Change_Material_Param_Color::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_Change_Material_Param_Color, CallFunc_Add_IntInt_ReturnValue_1) == 0x000048, "Member 'BP_IconCharacter_C_Change_Material_Param_Color::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_Change_Material_Param_Color, CallFunc_GetMaterials_ReturnValue) == 0x000050, "Member 'BP_IconCharacter_C_Change_Material_Param_Color::CallFunc_GetMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_Change_Material_Param_Color, CallFunc_Array_Length_ReturnValue_1) == 0x000060, "Member 'BP_IconCharacter_C_Change_Material_Param_Color::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_Change_Material_Param_Color, CallFunc_Less_IntInt_ReturnValue_1) == 0x000064, "Member 'BP_IconCharacter_C_Change_Material_Param_Color::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_Change_Material_Param_Color, Temp_int_Array_Index_Variable_1) == 0x000068, "Member 'BP_IconCharacter_C_Change_Material_Param_Color::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_Change_Material_Param_Color, CallFunc_Array_Get_Item_1) == 0x000070, "Member 'BP_IconCharacter_C_Change_Material_Param_Color::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_Change_Material_Param_Color, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'BP_IconCharacter_C_Change_Material_Param_Color::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_Change_Material_Param_Color, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000080, "Member 'BP_IconCharacter_C_Change_Material_Param_Color::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function BP_IconCharacter.BP_IconCharacter_C.CheckBlack
// 0x00A0 (0x00A0 - 0x0000)
struct BP_IconCharacter_C_CheckBlack final
{
public:
	bool                                          Woman;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0004(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x000C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x0014(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_3;                              // 0x001C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetMaterialSlotNames_ReturnValue;         // 0x0028(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetMaterialSlotNames_ReturnValue_1;       // 0x0040(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Find_ReturnValue_1;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetMaterialSlotNames_ReturnValue_2;       // 0x0058(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Find_ReturnValue_2;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetMaterialSlotNames_ReturnValue_3;       // 0x0070(0x0010)(ReferenceParm)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue_3;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival;                  // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IconCharacter_C_CheckBlack) == 0x000008, "Wrong alignment on BP_IconCharacter_C_CheckBlack");
static_assert(sizeof(BP_IconCharacter_C_CheckBlack) == 0x0000A0, "Wrong size on BP_IconCharacter_C_CheckBlack");
static_assert(offsetof(BP_IconCharacter_C_CheckBlack, Woman) == 0x000000, "Member 'BP_IconCharacter_C_CheckBlack::Woman' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlack, Temp_name_Variable) == 0x000004, "Member 'BP_IconCharacter_C_CheckBlack::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlack, Temp_name_Variable_1) == 0x00000C, "Member 'BP_IconCharacter_C_CheckBlack::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlack, Temp_name_Variable_2) == 0x000014, "Member 'BP_IconCharacter_C_CheckBlack::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlack, Temp_name_Variable_3) == 0x00001C, "Member 'BP_IconCharacter_C_CheckBlack::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlack, CallFunc_GetMaterialSlotNames_ReturnValue) == 0x000028, "Member 'BP_IconCharacter_C_CheckBlack::CallFunc_GetMaterialSlotNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlack, CallFunc_Array_Find_ReturnValue) == 0x000038, "Member 'BP_IconCharacter_C_CheckBlack::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlack, CallFunc_GetMaterialSlotNames_ReturnValue_1) == 0x000040, "Member 'BP_IconCharacter_C_CheckBlack::CallFunc_GetMaterialSlotNames_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlack, CallFunc_Array_Find_ReturnValue_1) == 0x000050, "Member 'BP_IconCharacter_C_CheckBlack::CallFunc_Array_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlack, CallFunc_GetMaterialSlotNames_ReturnValue_2) == 0x000058, "Member 'BP_IconCharacter_C_CheckBlack::CallFunc_GetMaterialSlotNames_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlack, CallFunc_Array_Find_ReturnValue_2) == 0x000068, "Member 'BP_IconCharacter_C_CheckBlack::CallFunc_Array_Find_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlack, CallFunc_GetMaterialSlotNames_ReturnValue_3) == 0x000070, "Member 'BP_IconCharacter_C_CheckBlack::CallFunc_GetMaterialSlotNames_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlack, CallFunc_GetGameInstance_ReturnValue) == 0x000080, "Member 'BP_IconCharacter_C_CheckBlack::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlack, CallFunc_Array_Find_ReturnValue_3) == 0x000088, "Member 'BP_IconCharacter_C_CheckBlack::CallFunc_Array_Find_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlack, K2Node_DynamicCast_AsGI_Survival) == 0x000090, "Member 'BP_IconCharacter_C_CheckBlack::K2Node_DynamicCast_AsGI_Survival' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlack, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'BP_IconCharacter_C_CheckBlack::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_IconCharacter.BP_IconCharacter_C.CheckBlendshapes
// 0x0558 (0x0558 - 0x0000)
struct BP_IconCharacter_C_CheckBlendshapes final
{
public:
	TArray<class FName>                           ActiveMorphs;                                      // 0x0000(0x0010)(Edit, BlueprintVisible)
	TArray<class USkeletalMeshComponent*>         SkelMeshes;                                        // 0x0010(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	TArray<class FName>                           Wears;                                             // 0x0020(0x0010)(Edit, BlueprintVisible)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          CallFunc_GetSkeletalMeshAsset_ReturnValue;         // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival;                  // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMorphTarget*>                   CallFunc_GetMorphTargetsPtrConv_ReturnValue;       // 0x0050(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEquipmentData                         CallFunc_GetDataTableRowFromName_OutRow;           // 0x0068(0x0180)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          CallFunc_GetSkeletalMeshAsset_ReturnValue_1;       // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x01F8(0x0010)(ReferenceParm)
	TArray<class UMorphTarget*>                   CallFunc_GetMorphTargetsPtrConv_ReturnValue_1;     // 0x0208(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMorphTarget*                           CallFunc_Array_Get_Item_1;                         // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0238(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0248(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0260(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_2;                         // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_2;        // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x0290(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SelectString_ReturnValue_1;               // 0x02A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x02B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x02C4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x02CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CD[0x3];                                      // 0x02CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x02DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USkeletalMeshComponent*>         K2Node_MakeArray_Array_1;                          // 0x02E0(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x02FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FD[0x3];                                      // 0x02FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMorphTarget*                           CallFunc_Array_Get_Item_3;                         // 0x0308(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetObjectName_ReturnValue_1;              // 0x0310(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0320(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_2;          // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_4;                         // 0x033C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_344[0x4];                                      // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEquipmentData                         CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0348(0x0180)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x04C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x04C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CA[0x2];                                      // 0x04CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x04CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x04D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x04D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D9[0x3];                                      // 0x04D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x04DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x04E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E4[0x4];                                      // 0x04E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item_5;                         // 0x04E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          CallFunc_GetSkeletalMeshAsset_ReturnValue_2;       // 0x04F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F9[0x7];                                      // 0x04F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMorphTarget*>                   CallFunc_GetMorphTargetsPtrConv_ReturnValue_2;     // 0x0500(0x0010)(ReferenceParm)
	class UMorphTarget*                           CallFunc_Array_Get_Item_6;                         // 0x0510(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0518(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51C[0x4];                                      // 0x051C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetObjectName_ReturnValue_2;              // 0x0520(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x0530(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_531[0x3];                                      // 0x0531(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_3;          // 0x0534(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x053C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0540(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_541[0x7];                                      // 0x0541(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0548(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetMorphTarget_Value_ImplicitCast;        // 0x0550(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetMorphTarget_Value_ImplicitCast_1;      // 0x0554(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IconCharacter_C_CheckBlendshapes) == 0x000008, "Wrong alignment on BP_IconCharacter_C_CheckBlendshapes");
static_assert(sizeof(BP_IconCharacter_C_CheckBlendshapes) == 0x000558, "Wrong size on BP_IconCharacter_C_CheckBlendshapes");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, ActiveMorphs) == 0x000000, "Member 'BP_IconCharacter_C_CheckBlendshapes::ActiveMorphs' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, SkelMeshes) == 0x000010, "Member 'BP_IconCharacter_C_CheckBlendshapes::SkelMeshes' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, Wears) == 0x000020, "Member 'BP_IconCharacter_C_CheckBlendshapes::Wears' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, CallFunc_GetGameInstance_ReturnValue) == 0x000030, "Member 'BP_IconCharacter_C_CheckBlendshapes::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, CallFunc_GetSkeletalMeshAsset_ReturnValue) == 0x000038, "Member 'BP_IconCharacter_C_CheckBlendshapes::CallFunc_GetSkeletalMeshAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, K2Node_DynamicCast_AsGI_Survival) == 0x000040, "Member 'BP_IconCharacter_C_CheckBlendshapes::K2Node_DynamicCast_AsGI_Survival' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BP_IconCharacter_C_CheckBlendshapes::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, CallFunc_GetMorphTargetsPtrConv_ReturnValue) == 0x000050, "Member 'BP_IconCharacter_C_CheckBlendshapes::CallFunc_GetMorphTargetsPtrConv_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'BP_IconCharacter_C_CheckBlendshapes::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, CallFunc_GetDataTableRowFromName_OutRow) == 0x000068, "Member 'BP_IconCharacter_C_CheckBlendshapes::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0001E8, "Member 'BP_IconCharacter_C_CheckBlendshapes::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, CallFunc_GetSkeletalMeshAsset_ReturnValue_1) == 0x0001F0, "Member 'BP_IconCharacter_C_CheckBlendshapes::CallFunc_GetSkeletalMeshAsset_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, K2Node_MakeArray_Array) == 0x0001F8, "Member 'BP_IconCharacter_C_CheckBlendshapes::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, CallFunc_GetMorphTargetsPtrConv_ReturnValue_1) == 0x000208, "Member 'BP_IconCharacter_C_CheckBlendshapes::CallFunc_GetMorphTargetsPtrConv_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, CallFunc_Array_Length_ReturnValue_1) == 0x000218, "Member 'BP_IconCharacter_C_CheckBlendshapes::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, Temp_int_Array_Index_Variable) == 0x00021C, "Member 'BP_IconCharacter_C_CheckBlendshapes::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, CallFunc_Array_Get_Item) == 0x000220, "Member 'BP_IconCharacter_C_CheckBlendshapes::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, CallFunc_Array_Get_Item_1) == 0x000228, "Member 'BP_IconCharacter_C_CheckBlendshapes::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000230, "Member 'BP_IconCharacter_C_CheckBlendshapes::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, CallFunc_GetObjectName_ReturnValue) == 0x000238, "Member 'BP_IconCharacter_C_CheckBlendshapes::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, CallFunc_Conv_NameToString_ReturnValue) == 0x000248, "Member 'BP_IconCharacter_C_CheckBlendshapes::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, CallFunc_Conv_StringToName_ReturnValue) == 0x000258, "Member 'BP_IconCharacter_C_CheckBlendshapes::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, CallFunc_SelectString_ReturnValue) == 0x000260, "Member 'BP_IconCharacter_C_CheckBlendshapes::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x000270, "Member 'BP_IconCharacter_C_CheckBlendshapes::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, CallFunc_SelectFloat_ReturnValue) == 0x000278, "Member 'BP_IconCharacter_C_CheckBlendshapes::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, CallFunc_Array_Get_Item_2) == 0x000280, "Member 'BP_IconCharacter_C_CheckBlendshapes::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, CallFunc_EqualEqual_NameName_ReturnValue_2) == 0x000288, "Member 'BP_IconCharacter_C_CheckBlendshapes::CallFunc_EqualEqual_NameName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, CallFunc_Conv_NameToString_ReturnValue_1) == 0x000290, "Member 'BP_IconCharacter_C_CheckBlendshapes::CallFunc_Conv_NameToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, CallFunc_SelectString_ReturnValue_1) == 0x0002A0, "Member 'BP_IconCharacter_C_CheckBlendshapes::CallFunc_SelectString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, CallFunc_Concat_StrStr_ReturnValue) == 0x0002B0, "Member 'BP_IconCharacter_C_CheckBlendshapes::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, Temp_int_Loop_Counter_Variable) == 0x0002C0, "Member 'BP_IconCharacter_C_CheckBlendshapes::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, CallFunc_Conv_StringToName_ReturnValue_1) == 0x0002C4, "Member 'BP_IconCharacter_C_CheckBlendshapes::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, CallFunc_Less_IntInt_ReturnValue) == 0x0002CC, "Member 'BP_IconCharacter_C_CheckBlendshapes::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, CallFunc_Add_IntInt_ReturnValue) == 0x0002D0, "Member 'BP_IconCharacter_C_CheckBlendshapes::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, CallFunc_Array_Length_ReturnValue_2) == 0x0002D4, "Member 'BP_IconCharacter_C_CheckBlendshapes::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, CallFunc_Array_Length_ReturnValue_3) == 0x0002D8, "Member 'BP_IconCharacter_C_CheckBlendshapes::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, Temp_int_Loop_Counter_Variable_1) == 0x0002DC, "Member 'BP_IconCharacter_C_CheckBlendshapes::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, K2Node_MakeArray_Array_1) == 0x0002E0, "Member 'BP_IconCharacter_C_CheckBlendshapes::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, CallFunc_Add_IntInt_ReturnValue_1) == 0x0002F0, "Member 'BP_IconCharacter_C_CheckBlendshapes::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, Temp_int_Array_Index_Variable_1) == 0x0002F4, "Member 'BP_IconCharacter_C_CheckBlendshapes::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, Temp_int_Loop_Counter_Variable_2) == 0x0002F8, "Member 'BP_IconCharacter_C_CheckBlendshapes::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, CallFunc_Less_IntInt_ReturnValue_1) == 0x0002FC, "Member 'BP_IconCharacter_C_CheckBlendshapes::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, CallFunc_Add_IntInt_ReturnValue_2) == 0x000300, "Member 'BP_IconCharacter_C_CheckBlendshapes::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, Temp_int_Array_Index_Variable_2) == 0x000304, "Member 'BP_IconCharacter_C_CheckBlendshapes::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, CallFunc_Array_Get_Item_3) == 0x000308, "Member 'BP_IconCharacter_C_CheckBlendshapes::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, CallFunc_GetObjectName_ReturnValue_1) == 0x000310, "Member 'BP_IconCharacter_C_CheckBlendshapes::CallFunc_GetObjectName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, Temp_name_Variable) == 0x000320, "Member 'BP_IconCharacter_C_CheckBlendshapes::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, CallFunc_Conv_StringToName_ReturnValue_2) == 0x000328, "Member 'BP_IconCharacter_C_CheckBlendshapes::CallFunc_Conv_StringToName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, CallFunc_Array_Add_ReturnValue) == 0x000330, "Member 'BP_IconCharacter_C_CheckBlendshapes::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, Temp_int_Loop_Counter_Variable_3) == 0x000334, "Member 'BP_IconCharacter_C_CheckBlendshapes::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, Temp_int_Array_Index_Variable_3) == 0x000338, "Member 'BP_IconCharacter_C_CheckBlendshapes::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, CallFunc_Array_Get_Item_4) == 0x00033C, "Member 'BP_IconCharacter_C_CheckBlendshapes::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000348, "Member 'BP_IconCharacter_C_CheckBlendshapes::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x0004C8, "Member 'BP_IconCharacter_C_CheckBlendshapes::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, CallFunc_Less_IntInt_ReturnValue_2) == 0x0004C9, "Member 'BP_IconCharacter_C_CheckBlendshapes::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, CallFunc_Add_IntInt_ReturnValue_3) == 0x0004CC, "Member 'BP_IconCharacter_C_CheckBlendshapes::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, CallFunc_Array_AddUnique_ReturnValue) == 0x0004D0, "Member 'BP_IconCharacter_C_CheckBlendshapes::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, Temp_int_Loop_Counter_Variable_4) == 0x0004D4, "Member 'BP_IconCharacter_C_CheckBlendshapes::Temp_int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, CallFunc_Less_IntInt_ReturnValue_3) == 0x0004D8, "Member 'BP_IconCharacter_C_CheckBlendshapes::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, CallFunc_Add_IntInt_ReturnValue_4) == 0x0004DC, "Member 'BP_IconCharacter_C_CheckBlendshapes::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, Temp_int_Array_Index_Variable_4) == 0x0004E0, "Member 'BP_IconCharacter_C_CheckBlendshapes::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, CallFunc_Array_Get_Item_5) == 0x0004E8, "Member 'BP_IconCharacter_C_CheckBlendshapes::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, CallFunc_GetSkeletalMeshAsset_ReturnValue_2) == 0x0004F0, "Member 'BP_IconCharacter_C_CheckBlendshapes::CallFunc_GetSkeletalMeshAsset_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, CallFunc_IsValid_ReturnValue) == 0x0004F8, "Member 'BP_IconCharacter_C_CheckBlendshapes::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, CallFunc_GetMorphTargetsPtrConv_ReturnValue_2) == 0x000500, "Member 'BP_IconCharacter_C_CheckBlendshapes::CallFunc_GetMorphTargetsPtrConv_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, CallFunc_Array_Get_Item_6) == 0x000510, "Member 'BP_IconCharacter_C_CheckBlendshapes::CallFunc_Array_Get_Item_6' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, CallFunc_Array_Length_ReturnValue_4) == 0x000518, "Member 'BP_IconCharacter_C_CheckBlendshapes::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, CallFunc_GetObjectName_ReturnValue_2) == 0x000520, "Member 'BP_IconCharacter_C_CheckBlendshapes::CallFunc_GetObjectName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, CallFunc_Less_IntInt_ReturnValue_4) == 0x000530, "Member 'BP_IconCharacter_C_CheckBlendshapes::CallFunc_Less_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, CallFunc_Conv_StringToName_ReturnValue_3) == 0x000534, "Member 'BP_IconCharacter_C_CheckBlendshapes::CallFunc_Conv_StringToName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, CallFunc_Array_Find_ReturnValue) == 0x00053C, "Member 'BP_IconCharacter_C_CheckBlendshapes::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, CallFunc_Greater_IntInt_ReturnValue) == 0x000540, "Member 'BP_IconCharacter_C_CheckBlendshapes::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, CallFunc_SelectFloat_ReturnValue_1) == 0x000548, "Member 'BP_IconCharacter_C_CheckBlendshapes::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, CallFunc_SetMorphTarget_Value_ImplicitCast) == 0x000550, "Member 'BP_IconCharacter_C_CheckBlendshapes::CallFunc_SetMorphTarget_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckBlendshapes, CallFunc_SetMorphTarget_Value_ImplicitCast_1) == 0x000554, "Member 'BP_IconCharacter_C_CheckBlendshapes::CallFunc_SetMorphTarget_Value_ImplicitCast_1' has a wrong offset!");

// Function BP_IconCharacter.BP_IconCharacter_C.CheckSex
// 0x00F8 (0x00F8 - 0x0000)
struct BP_IconCharacter_C_CheckSex final
{
public:
	class USkeletalMesh*                          Param_beard;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Woman_;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x000C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x0014(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival;                  // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival_1;                // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetMaterialSlotNames_ReturnValue;         // 0x0050(0x0010)(ReferenceParm)
	TArray<class FName>                           CallFunc_GetMaterialSlotNames_ReturnValue_1;       // 0x0060(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue_1;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_2;            // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival_2;                // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_93[0x5];                                       // 0x0093(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_3;            // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival_3;                // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_2; // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_3; // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA[0x2];                                       // 0x00CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_2; // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_3; // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_4; // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_5; // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_6; // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_7; // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_8; // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_9; // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IconCharacter_C_CheckSex) == 0x000008, "Wrong alignment on BP_IconCharacter_C_CheckSex");
static_assert(sizeof(BP_IconCharacter_C_CheckSex) == 0x0000F8, "Wrong size on BP_IconCharacter_C_CheckSex");
static_assert(offsetof(BP_IconCharacter_C_CheckSex, Param_beard) == 0x000000, "Member 'BP_IconCharacter_C_CheckSex::Param_beard' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckSex, Woman_) == 0x000008, "Member 'BP_IconCharacter_C_CheckSex::Woman_' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckSex, Temp_name_Variable) == 0x00000C, "Member 'BP_IconCharacter_C_CheckSex::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckSex, Temp_name_Variable_1) == 0x000014, "Member 'BP_IconCharacter_C_CheckSex::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckSex, CallFunc_GetGameInstance_ReturnValue) == 0x000020, "Member 'BP_IconCharacter_C_CheckSex::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckSex, K2Node_DynamicCast_AsGI_Survival) == 0x000028, "Member 'BP_IconCharacter_C_CheckSex::K2Node_DynamicCast_AsGI_Survival' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckSex, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_IconCharacter_C_CheckSex::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckSex, CallFunc_GetGameInstance_ReturnValue_1) == 0x000038, "Member 'BP_IconCharacter_C_CheckSex::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckSex, K2Node_DynamicCast_AsGI_Survival_1) == 0x000040, "Member 'BP_IconCharacter_C_CheckSex::K2Node_DynamicCast_AsGI_Survival_1' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckSex, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BP_IconCharacter_C_CheckSex::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckSex, CallFunc_GetMaterialSlotNames_ReturnValue) == 0x000050, "Member 'BP_IconCharacter_C_CheckSex::CallFunc_GetMaterialSlotNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckSex, CallFunc_GetMaterialSlotNames_ReturnValue_1) == 0x000060, "Member 'BP_IconCharacter_C_CheckSex::CallFunc_GetMaterialSlotNames_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckSex, CallFunc_Array_Find_ReturnValue) == 0x000070, "Member 'BP_IconCharacter_C_CheckSex::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckSex, CallFunc_Array_Find_ReturnValue_1) == 0x000074, "Member 'BP_IconCharacter_C_CheckSex::CallFunc_Array_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckSex, CallFunc_GetGameInstance_ReturnValue_2) == 0x000078, "Member 'BP_IconCharacter_C_CheckSex::CallFunc_GetGameInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckSex, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000080, "Member 'BP_IconCharacter_C_CheckSex::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IconCharacter_C_CheckSex, K2Node_DynamicCast_AsGI_Survival_2) == 0x000088, "Member 'BP_IconCharacter_C_CheckSex::K2Node_DynamicCast_AsGI_Survival_2' has a wrong offset!");
