#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LeadChriss

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Shops_classes.hpp"
#include "E_ActorType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LeadChriss.BP_LeadChriss_C
// 0x0050 (0x0708 - 0x06B8)
class ABP_LeadChriss_C final : public ABP_Shops_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_LeadChriss_C;                    // 0x06B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URectLightComponent*                    RectLight1_0;                                      // 0x06C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight_0;                                       // 0x06C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   R_wep_attachment;                                  // 0x06D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          IsQuestActive;                                     // 0x06D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasThisItem;                                       // 0x06D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DA[0x6];                                      // 0x06DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_Quest_C*>                    Quests;                                            // 0x06E0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         ItemUniqID;                                        // 0x06F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F4[0x4];                                      // 0x06F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULegacyCameraShake*                     ShakeInstance;                                     // 0x06F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        ShopFOV;                                           // 0x0700(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CustomEvent();
	void CustomEvent_1();
	void DialogueReset();
	void ExecuteUbergraph_BP_LeadChriss(int32 EntryPoint);
	void GetActorType(E_ActorType* ActorType);
	void IsLocked_(bool* Result);
	void StartDialogue();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_LeadChriss_C">();
	}
	static class ABP_LeadChriss_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_LeadChriss_C>();
	}
};
static_assert(alignof(ABP_LeadChriss_C) == 0x000008, "Wrong alignment on ABP_LeadChriss_C");
static_assert(sizeof(ABP_LeadChriss_C) == 0x000708, "Wrong size on ABP_LeadChriss_C");
static_assert(offsetof(ABP_LeadChriss_C, UberGraphFrame_BP_LeadChriss_C) == 0x0006B8, "Member 'ABP_LeadChriss_C::UberGraphFrame_BP_LeadChriss_C' has a wrong offset!");
static_assert(offsetof(ABP_LeadChriss_C, RectLight1_0) == 0x0006C0, "Member 'ABP_LeadChriss_C::RectLight1_0' has a wrong offset!");
static_assert(offsetof(ABP_LeadChriss_C, RectLight_0) == 0x0006C8, "Member 'ABP_LeadChriss_C::RectLight_0' has a wrong offset!");
static_assert(offsetof(ABP_LeadChriss_C, R_wep_attachment) == 0x0006D0, "Member 'ABP_LeadChriss_C::R_wep_attachment' has a wrong offset!");
static_assert(offsetof(ABP_LeadChriss_C, IsQuestActive) == 0x0006D8, "Member 'ABP_LeadChriss_C::IsQuestActive' has a wrong offset!");
static_assert(offsetof(ABP_LeadChriss_C, HasThisItem) == 0x0006D9, "Member 'ABP_LeadChriss_C::HasThisItem' has a wrong offset!");
static_assert(offsetof(ABP_LeadChriss_C, Quests) == 0x0006E0, "Member 'ABP_LeadChriss_C::Quests' has a wrong offset!");
static_assert(offsetof(ABP_LeadChriss_C, ItemUniqID) == 0x0006F0, "Member 'ABP_LeadChriss_C::ItemUniqID' has a wrong offset!");
static_assert(offsetof(ABP_LeadChriss_C, ShakeInstance) == 0x0006F8, "Member 'ABP_LeadChriss_C::ShakeInstance' has a wrong offset!");
static_assert(offsetof(ABP_LeadChriss_C, ShopFOV) == 0x000700, "Member 'ABP_LeadChriss_C::ShopFOV' has a wrong offset!");

}

