#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LabBombExplosion

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_LabBombExplosion.BP_LabBombExplosion_C.ExecuteUbergraph_BP_LabBombExplosion
// 0x0060 (0x0060 - 0x0000)
struct BP_LabBombExplosion_C_ExecuteUbergraph_BP_LabBombExplosion final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ApplyRadialDamage_ReturnValue;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFMODAudioComponent*                    CallFunc_PlayEventAttached_ReturnValue;            // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LabBombExplosion_C_ExecuteUbergraph_BP_LabBombExplosion) == 0x000008, "Wrong alignment on BP_LabBombExplosion_C_ExecuteUbergraph_BP_LabBombExplosion");
static_assert(sizeof(BP_LabBombExplosion_C_ExecuteUbergraph_BP_LabBombExplosion) == 0x000060, "Wrong size on BP_LabBombExplosion_C_ExecuteUbergraph_BP_LabBombExplosion");
static_assert(offsetof(BP_LabBombExplosion_C_ExecuteUbergraph_BP_LabBombExplosion, EntryPoint) == 0x000000, "Member 'BP_LabBombExplosion_C_ExecuteUbergraph_BP_LabBombExplosion::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LabBombExplosion_C_ExecuteUbergraph_BP_LabBombExplosion, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BP_LabBombExplosion_C_ExecuteUbergraph_BP_LabBombExplosion::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LabBombExplosion_C_ExecuteUbergraph_BP_LabBombExplosion, Temp_object_Variable) == 0x000008, "Member 'BP_LabBombExplosion_C_ExecuteUbergraph_BP_LabBombExplosion::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_LabBombExplosion_C_ExecuteUbergraph_BP_LabBombExplosion, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000018, "Member 'BP_LabBombExplosion_C_ExecuteUbergraph_BP_LabBombExplosion::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LabBombExplosion_C_ExecuteUbergraph_BP_LabBombExplosion, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000030, "Member 'BP_LabBombExplosion_C_ExecuteUbergraph_BP_LabBombExplosion::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LabBombExplosion_C_ExecuteUbergraph_BP_LabBombExplosion, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000048, "Member 'BP_LabBombExplosion_C_ExecuteUbergraph_BP_LabBombExplosion::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LabBombExplosion_C_ExecuteUbergraph_BP_LabBombExplosion, CallFunc_ApplyRadialDamage_ReturnValue) == 0x000050, "Member 'BP_LabBombExplosion_C_ExecuteUbergraph_BP_LabBombExplosion::CallFunc_ApplyRadialDamage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LabBombExplosion_C_ExecuteUbergraph_BP_LabBombExplosion, CallFunc_PlayEventAttached_ReturnValue) == 0x000058, "Member 'BP_LabBombExplosion_C_ExecuteUbergraph_BP_LabBombExplosion::CallFunc_PlayEventAttached_ReturnValue' has a wrong offset!");

}

