#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_M4_main_menu

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_M4_main_menu.BP_M4_main_menu_C
// 0x0048 (0x02D8 - 0x0290)
class ABP_M4_main_menu_C final : public AActor
{
public:
	class UStaticMeshComponent*                   BCM_Gunfighter_AR15_FDE;                           // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   M4A1_PistolGrip;                                   // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   M4A1_Silencer;                                     // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   M4A1_CarbonHandguard;                              // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   PMAG30;                                            // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Front_Reflex_Sight_Down;                           // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sight_4X;                                          // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 M4_SkeletalMesh;                                   // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_M4_main_menu_C">();
	}
	static class ABP_M4_main_menu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_M4_main_menu_C>();
	}
};
static_assert(alignof(ABP_M4_main_menu_C) == 0x000008, "Wrong alignment on ABP_M4_main_menu_C");
static_assert(sizeof(ABP_M4_main_menu_C) == 0x0002D8, "Wrong size on ABP_M4_main_menu_C");
static_assert(offsetof(ABP_M4_main_menu_C, BCM_Gunfighter_AR15_FDE) == 0x000290, "Member 'ABP_M4_main_menu_C::BCM_Gunfighter_AR15_FDE' has a wrong offset!");
static_assert(offsetof(ABP_M4_main_menu_C, M4A1_PistolGrip) == 0x000298, "Member 'ABP_M4_main_menu_C::M4A1_PistolGrip' has a wrong offset!");
static_assert(offsetof(ABP_M4_main_menu_C, M4A1_Silencer) == 0x0002A0, "Member 'ABP_M4_main_menu_C::M4A1_Silencer' has a wrong offset!");
static_assert(offsetof(ABP_M4_main_menu_C, M4A1_CarbonHandguard) == 0x0002A8, "Member 'ABP_M4_main_menu_C::M4A1_CarbonHandguard' has a wrong offset!");
static_assert(offsetof(ABP_M4_main_menu_C, PMAG30) == 0x0002B0, "Member 'ABP_M4_main_menu_C::PMAG30' has a wrong offset!");
static_assert(offsetof(ABP_M4_main_menu_C, Front_Reflex_Sight_Down) == 0x0002B8, "Member 'ABP_M4_main_menu_C::Front_Reflex_Sight_Down' has a wrong offset!");
static_assert(offsetof(ABP_M4_main_menu_C, Sight_4X) == 0x0002C0, "Member 'ABP_M4_main_menu_C::Sight_4X' has a wrong offset!");
static_assert(offsetof(ABP_M4_main_menu_C, M4_SkeletalMesh) == 0x0002C8, "Member 'ABP_M4_main_menu_C::M4_SkeletalMesh' has a wrong offset!");
static_assert(offsetof(ABP_M4_main_menu_C, DefaultSceneRoot) == 0x0002D0, "Member 'ABP_M4_main_menu_C::DefaultSceneRoot' has a wrong offset!");

}

