#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MedicShop_Tutorial

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_InteractType_structs.hpp"
#include "E_ActorType_structs.hpp"


namespace SDK::Params
{

// Function BP_MedicShop_Tutorial.BP_MedicShop_Tutorial_C.ExecuteUbergraph_BP_MedicShop_Tutorial
// 0x0040 (0x0040 - 0x0000)
struct BP_MedicShop_Tutorial_C_ExecuteUbergraph_BP_MedicShop_Tutorial final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_Player;                               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvPC_C*                              K2Node_DynamicCast_AsSurv_PC;                      // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue;              // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MedicShop_Tutorial_C_ExecuteUbergraph_BP_MedicShop_Tutorial) == 0x000008, "Wrong alignment on BP_MedicShop_Tutorial_C_ExecuteUbergraph_BP_MedicShop_Tutorial");
static_assert(sizeof(BP_MedicShop_Tutorial_C_ExecuteUbergraph_BP_MedicShop_Tutorial) == 0x000040, "Wrong size on BP_MedicShop_Tutorial_C_ExecuteUbergraph_BP_MedicShop_Tutorial");
static_assert(offsetof(BP_MedicShop_Tutorial_C_ExecuteUbergraph_BP_MedicShop_Tutorial, EntryPoint) == 0x000000, "Member 'BP_MedicShop_Tutorial_C_ExecuteUbergraph_BP_MedicShop_Tutorial::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MedicShop_Tutorial_C_ExecuteUbergraph_BP_MedicShop_Tutorial, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_MedicShop_Tutorial_C_ExecuteUbergraph_BP_MedicShop_Tutorial::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_MedicShop_Tutorial_C_ExecuteUbergraph_BP_MedicShop_Tutorial, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'BP_MedicShop_Tutorial_C_ExecuteUbergraph_BP_MedicShop_Tutorial::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MedicShop_Tutorial_C_ExecuteUbergraph_BP_MedicShop_Tutorial, K2Node_Event_Player) == 0x000020, "Member 'BP_MedicShop_Tutorial_C_ExecuteUbergraph_BP_MedicShop_Tutorial::K2Node_Event_Player' has a wrong offset!");
static_assert(offsetof(BP_MedicShop_Tutorial_C_ExecuteUbergraph_BP_MedicShop_Tutorial, CallFunc_GetController_ReturnValue) == 0x000028, "Member 'BP_MedicShop_Tutorial_C_ExecuteUbergraph_BP_MedicShop_Tutorial::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MedicShop_Tutorial_C_ExecuteUbergraph_BP_MedicShop_Tutorial, K2Node_DynamicCast_AsSurv_PC) == 0x000030, "Member 'BP_MedicShop_Tutorial_C_ExecuteUbergraph_BP_MedicShop_Tutorial::K2Node_DynamicCast_AsSurv_PC' has a wrong offset!");
static_assert(offsetof(BP_MedicShop_Tutorial_C_ExecuteUbergraph_BP_MedicShop_Tutorial, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_MedicShop_Tutorial_C_ExecuteUbergraph_BP_MedicShop_Tutorial::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_MedicShop_Tutorial_C_ExecuteUbergraph_BP_MedicShop_Tutorial, CallFunc_NotEqual_StrStr_ReturnValue) == 0x000039, "Member 'BP_MedicShop_Tutorial_C_ExecuteUbergraph_BP_MedicShop_Tutorial::CallFunc_NotEqual_StrStr_ReturnValue' has a wrong offset!");

// Function BP_MedicShop_Tutorial.BP_MedicShop_Tutorial_C.GetActorType
// 0x0001 (0x0001 - 0x0000)
struct BP_MedicShop_Tutorial_C_GetActorType final
{
public:
	E_ActorType                                   ActorType;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MedicShop_Tutorial_C_GetActorType) == 0x000001, "Wrong alignment on BP_MedicShop_Tutorial_C_GetActorType");
static_assert(sizeof(BP_MedicShop_Tutorial_C_GetActorType) == 0x000001, "Wrong size on BP_MedicShop_Tutorial_C_GetActorType");
static_assert(offsetof(BP_MedicShop_Tutorial_C_GetActorType, ActorType) == 0x000000, "Member 'BP_MedicShop_Tutorial_C_GetActorType::ActorType' has a wrong offset!");

// Function BP_MedicShop_Tutorial.BP_MedicShop_Tutorial_C.IsLocked?
// 0x0001 (0x0001 - 0x0000)
struct BP_MedicShop_Tutorial_C_IsLocked_ final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MedicShop_Tutorial_C_IsLocked_) == 0x000001, "Wrong alignment on BP_MedicShop_Tutorial_C_IsLocked_");
static_assert(sizeof(BP_MedicShop_Tutorial_C_IsLocked_) == 0x000001, "Wrong size on BP_MedicShop_Tutorial_C_IsLocked_");
static_assert(offsetof(BP_MedicShop_Tutorial_C_IsLocked_, Result) == 0x000000, "Member 'BP_MedicShop_Tutorial_C_IsLocked_::Result' has a wrong offset!");

// Function BP_MedicShop_Tutorial.BP_MedicShop_Tutorial_C.OnFocused
// 0x00B0 (0x00B0 - 0x0000)
struct BP_MedicShop_Tutorial_C_OnFocused final
{
public:
	class APawn*                                  Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 HighlightActor;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UActorComponent*                        HighlightActorComponent;                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	E_InteractType                                InteractType;                                      // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        LateTime;                                          // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC;                  // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_GameHUD_C>        K2Node_DynamicCast_AsBPI_Game_HUD;                 // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTutorStage_StageName;                  // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsShopWidgetOpen_IsOpen;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue;              // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_83[0x5];                                       // 0x0083(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_GameHUD_C>        K2Node_DynamicCast_AsBPI_Game_HUD_1;               // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_PlayerMain_C*                      CallFunc_GetGUI_GUI;                               // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSomethingOnA_Way_ReturnValue;           // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MedicShop_Tutorial_C_OnFocused) == 0x000008, "Wrong alignment on BP_MedicShop_Tutorial_C_OnFocused");
static_assert(sizeof(BP_MedicShop_Tutorial_C_OnFocused) == 0x0000B0, "Wrong size on BP_MedicShop_Tutorial_C_OnFocused");
static_assert(offsetof(BP_MedicShop_Tutorial_C_OnFocused, Player) == 0x000000, "Member 'BP_MedicShop_Tutorial_C_OnFocused::Player' has a wrong offset!");
static_assert(offsetof(BP_MedicShop_Tutorial_C_OnFocused, HighlightActor) == 0x000008, "Member 'BP_MedicShop_Tutorial_C_OnFocused::HighlightActor' has a wrong offset!");
static_assert(offsetof(BP_MedicShop_Tutorial_C_OnFocused, HighlightActorComponent) == 0x000010, "Member 'BP_MedicShop_Tutorial_C_OnFocused::HighlightActorComponent' has a wrong offset!");
static_assert(offsetof(BP_MedicShop_Tutorial_C_OnFocused, InteractType) == 0x000018, "Member 'BP_MedicShop_Tutorial_C_OnFocused::InteractType' has a wrong offset!");
static_assert(offsetof(BP_MedicShop_Tutorial_C_OnFocused, LateTime) == 0x000020, "Member 'BP_MedicShop_Tutorial_C_OnFocused::LateTime' has a wrong offset!");
static_assert(offsetof(BP_MedicShop_Tutorial_C_OnFocused, CallFunc_GetPlayerController_ReturnValue) == 0x000028, "Member 'BP_MedicShop_Tutorial_C_OnFocused::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MedicShop_Tutorial_C_OnFocused, CallFunc_GetController_ReturnValue) == 0x000030, "Member 'BP_MedicShop_Tutorial_C_OnFocused::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MedicShop_Tutorial_C_OnFocused, CallFunc_GetHUD_ReturnValue) == 0x000038, "Member 'BP_MedicShop_Tutorial_C_OnFocused::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MedicShop_Tutorial_C_OnFocused, K2Node_DynamicCast_AsBPI_Surv_PC) == 0x000040, "Member 'BP_MedicShop_Tutorial_C_OnFocused::K2Node_DynamicCast_AsBPI_Surv_PC' has a wrong offset!");
static_assert(offsetof(BP_MedicShop_Tutorial_C_OnFocused, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BP_MedicShop_Tutorial_C_OnFocused::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_MedicShop_Tutorial_C_OnFocused, K2Node_DynamicCast_AsBPI_Game_HUD) == 0x000058, "Member 'BP_MedicShop_Tutorial_C_OnFocused::K2Node_DynamicCast_AsBPI_Game_HUD' has a wrong offset!");
static_assert(offsetof(BP_MedicShop_Tutorial_C_OnFocused, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'BP_MedicShop_Tutorial_C_OnFocused::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_MedicShop_Tutorial_C_OnFocused, CallFunc_GetTutorStage_StageName) == 0x000070, "Member 'BP_MedicShop_Tutorial_C_OnFocused::CallFunc_GetTutorStage_StageName' has a wrong offset!");
static_assert(offsetof(BP_MedicShop_Tutorial_C_OnFocused, CallFunc_IsShopWidgetOpen_IsOpen) == 0x000080, "Member 'BP_MedicShop_Tutorial_C_OnFocused::CallFunc_IsShopWidgetOpen_IsOpen' has a wrong offset!");
static_assert(offsetof(BP_MedicShop_Tutorial_C_OnFocused, CallFunc_Not_PreBool_ReturnValue) == 0x000081, "Member 'BP_MedicShop_Tutorial_C_OnFocused::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MedicShop_Tutorial_C_OnFocused, CallFunc_NotEqual_StrStr_ReturnValue) == 0x000082, "Member 'BP_MedicShop_Tutorial_C_OnFocused::CallFunc_NotEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MedicShop_Tutorial_C_OnFocused, K2Node_DynamicCast_AsBPI_Game_HUD_1) == 0x000088, "Member 'BP_MedicShop_Tutorial_C_OnFocused::K2Node_DynamicCast_AsBPI_Game_HUD_1' has a wrong offset!");
static_assert(offsetof(BP_MedicShop_Tutorial_C_OnFocused, K2Node_DynamicCast_bSuccess_2) == 0x000098, "Member 'BP_MedicShop_Tutorial_C_OnFocused::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_MedicShop_Tutorial_C_OnFocused, CallFunc_GetGUI_GUI) == 0x0000A0, "Member 'BP_MedicShop_Tutorial_C_OnFocused::CallFunc_GetGUI_GUI' has a wrong offset!");
static_assert(offsetof(BP_MedicShop_Tutorial_C_OnFocused, CallFunc_IsValid_ReturnValue) == 0x0000A8, "Member 'BP_MedicShop_Tutorial_C_OnFocused::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MedicShop_Tutorial_C_OnFocused, CallFunc_IsSomethingOnA_Way_ReturnValue) == 0x0000A9, "Member 'BP_MedicShop_Tutorial_C_OnFocused::CallFunc_IsSomethingOnA_Way_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MedicShop_Tutorial_C_OnFocused, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000AA, "Member 'BP_MedicShop_Tutorial_C_OnFocused::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");

// Function BP_MedicShop_Tutorial.BP_MedicShop_Tutorial_C.OnLocalInteract
// 0x0008 (0x0008 - 0x0000)
struct BP_MedicShop_Tutorial_C_OnLocalInteract final
{
public:
	class APawn*                                  Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MedicShop_Tutorial_C_OnLocalInteract) == 0x000008, "Wrong alignment on BP_MedicShop_Tutorial_C_OnLocalInteract");
static_assert(sizeof(BP_MedicShop_Tutorial_C_OnLocalInteract) == 0x000008, "Wrong size on BP_MedicShop_Tutorial_C_OnLocalInteract");
static_assert(offsetof(BP_MedicShop_Tutorial_C_OnLocalInteract, Player) == 0x000000, "Member 'BP_MedicShop_Tutorial_C_OnLocalInteract::Player' has a wrong offset!");

}

