#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_New_NV_Water

#include "Basic.hpp"

#include "FMODStudio_structs.hpp"
#include "E_Shapes_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_New_NV_Water.BP_New_NV_Water_C.BndEvt__WaterVolume_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_New_NV_Water_C_BndEvt__WaterVolume_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_New_NV_Water_C_BndEvt__WaterVolume_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_New_NV_Water_C_BndEvt__WaterVolume_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_New_NV_Water_C_BndEvt__WaterVolume_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BP_New_NV_Water_C_BndEvt__WaterVolume_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_New_NV_Water_C_BndEvt__WaterVolume_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_New_NV_Water_C_BndEvt__WaterVolume_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_BndEvt__WaterVolume_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_New_NV_Water_C_BndEvt__WaterVolume_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_BndEvt__WaterVolume_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_New_NV_Water_C_BndEvt__WaterVolume_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_BndEvt__WaterVolume_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_New_NV_Water_C_BndEvt__WaterVolume_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BP_New_NV_Water.BP_New_NV_Water_C.BndEvt__WaterVolume_K2Node_ComponentBoundEvent_17_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct BP_New_NV_Water_C_BndEvt__WaterVolume_K2Node_ComponentBoundEvent_17_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_New_NV_Water_C_BndEvt__WaterVolume_K2Node_ComponentBoundEvent_17_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_New_NV_Water_C_BndEvt__WaterVolume_K2Node_ComponentBoundEvent_17_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_New_NV_Water_C_BndEvt__WaterVolume_K2Node_ComponentBoundEvent_17_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on BP_New_NV_Water_C_BndEvt__WaterVolume_K2Node_ComponentBoundEvent_17_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_New_NV_Water_C_BndEvt__WaterVolume_K2Node_ComponentBoundEvent_17_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_New_NV_Water_C_BndEvt__WaterVolume_K2Node_ComponentBoundEvent_17_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_BndEvt__WaterVolume_K2Node_ComponentBoundEvent_17_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_New_NV_Water_C_BndEvt__WaterVolume_K2Node_ComponentBoundEvent_17_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_BndEvt__WaterVolume_K2Node_ComponentBoundEvent_17_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_New_NV_Water_C_BndEvt__WaterVolume_K2Node_ComponentBoundEvent_17_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_BndEvt__WaterVolume_K2Node_ComponentBoundEvent_17_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_New_NV_Water_C_BndEvt__WaterVolume_K2Node_ComponentBoundEvent_17_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_BndEvt__WaterVolume_K2Node_ComponentBoundEvent_17_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_New_NV_Water_C_BndEvt__WaterVolume_K2Node_ComponentBoundEvent_17_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_BndEvt__WaterVolume_K2Node_ComponentBoundEvent_17_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_New_NV_Water_C_BndEvt__WaterVolume_K2Node_ComponentBoundEvent_17_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_New_NV_Water.BP_New_NV_Water_C.ExecuteUbergraph_BP_New_NV_Water
// 0x0800 (0x0800 - 0x0000)
struct BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0028(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_ComponentHasTag_ReturnValue;              // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_122[0x6];                                      // 0x0122(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AExplosive_Item_C*                      K2Node_DynamicCast_AsExplosive_Item;               // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFMODAudioComponent*                    CallFunc_PlayEventWithOcclusion_FMODAudioComponent; // 0x0180(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RebaseLocalOriginOntoZero_ReturnValue;    // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFMODAudioComponent*                    CallFunc_PlayEventWithOcclusion_FMODAudioComponent_1; // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A8[0x8];                                      // 0x01A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x01B0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_WaterGrenadeOverlap_C*              CallFunc_FinishSpawningActor_ReturnValue;          // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0220(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_238[0x8];                                      // 0x0238(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Conv_VectorToTransform_ReturnValue;       // 0x0240(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player_1;            // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x02A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x02AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x02B0(0x0010)(ReferenceParm)
	struct FVector                                K2Node_CustomEvent_Location_1;                     // 0x02C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Velocity;                       // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Modifier;                       // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_1;            // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0310(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x0328(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x035C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35D[0x3];                                      // 0x035D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_Location;                       // 0x0360(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_379[0x7];                                      // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X_1;                          // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_399[0x3];                                      // 0x0399(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetLinearColorValue_ReturnValue;          // 0x039C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AC[0x4];                                      // 0x03AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x03B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_2;                          // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_2;                          // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_2;                          // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x03E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0400(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0404(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_405[0x3];                                      // 0x0405(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x040C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors_1; // 0x0410(0x0010)(ReferenceParm)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0420(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0428(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_434[0x4];                                      // 0x0434(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAVS_VehicleMaster_C*                   K2Node_DynamicCast_AsAVS_Vehicle_Master;           // 0x0438(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0441(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_442[0x6];                                      // 0x0442(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0448(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x0460(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_2;          // 0x0478(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_3;          // 0x0490(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACutsceneCar_C*                         K2Node_DynamicCast_AsCutscene_Car;                 // 0x04A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B1[0x7];                                      // 0x04B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player_2;            // 0x04B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C1[0x7];                                      // 0x04C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x04C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_4;          // 0x04E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_5;          // 0x04F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_6;          // 0x0510(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_7;          // 0x0528(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_8;          // 0x0540(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSwimming_ReturnValue;                   // 0x0558(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_559[0x7];                                      // 0x0559(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_9;          // 0x0560(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_10;         // 0x0578(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_11;         // 0x0590(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x05A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x05C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C4[0x4];                                      // 0x05C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_VSize_ReturnValue;                        // 0x05C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x05D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x05D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x05D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x05D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D4[0x4];                                      // 0x05D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x05D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x05E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E1[0x7];                                      // 0x05E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue_1;     // 0x05E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x05F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x05F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0600(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0608(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ComponentHasTag_ReturnValue_1;            // 0x060C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60D[0x3];                                      // 0x060D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player_3;            // 0x0610(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0618(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_1;        // 0x0619(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61A[0x6];                                      // 0x061A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player_4;            // 0x0620(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0628(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0629(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x062A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62B[0x1];                                      // 0x062B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x062C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63C[0x4];                                      // 0x063C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0640(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0648(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_3;                          // 0x0660(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_3;                          // 0x0668(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_3;                          // 0x0670(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0678(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0680(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0698(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69C[0x4];                                      // 0x069C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x06A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAVS_VehicleMaster_C*                   K2Node_DynamicCast_AsAVS_Vehicle_Master_1;         // 0x06A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x06B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B1[0x7];                                      // 0x06B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player_5;            // 0x06B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x06C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C1[0x7];                                      // 0x06C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x06C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_12;         // 0x06E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_13;         // 0x06F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_14;         // 0x0710(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_15;         // 0x0728(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSwimming_ReturnValue_1;                 // 0x0740(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_741[0x7];                                      // 0x0741(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_16;         // 0x0748(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_17;         // 0x0760(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue_1;                // 0x0778(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue_2;     // 0x0790(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue_1;                      // 0x0798(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue_3;     // 0x07A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x07A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x07B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B1[0x3];                                      // 0x07B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x07B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x07B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B9[0x3];                                      // 0x07B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x07BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetLinearColorValue_ReturnValue_1;        // 0x07C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x07D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D1[0x7];                                      // 0x07D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x07D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_1;                // 0x07E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x07E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E9[0x3];                                      // 0x07E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x07EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLinearColorValue_InTime_ImplicitCast;  // 0x07F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLinearColorValue_InTime_ImplicitCast_1; // 0x07F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water) == 0x000010, "Wrong alignment on BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water");
static_assert(sizeof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water) == 0x000800, "Wrong size on BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, EntryPoint) == 0x000000, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, CallFunc_IsServer_ReturnValue) == 0x000004, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000008, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000010, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000018, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000020, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, K2Node_ComponentBoundEvent_bFromSweep) == 0x000024, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, K2Node_ComponentBoundEvent_SweepResult) == 0x000028, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, CallFunc_ComponentHasTag_ReturnValue) == 0x000110, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::CallFunc_ComponentHasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, K2Node_DynamicCast_AsSurvival_Player) == 0x000118, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, K2Node_DynamicCast_bSuccess) == 0x000120, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, CallFunc_IsLocallyControlled_ReturnValue) == 0x000121, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, K2Node_DynamicCast_AsExplosive_Item) == 0x000128, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::K2Node_DynamicCast_AsExplosive_Item' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, K2Node_DynamicCast_bSuccess_1) == 0x000130, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, CallFunc_BreakTransform_Location) == 0x000138, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, CallFunc_BreakTransform_Rotation) == 0x000150, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, CallFunc_BreakTransform_Scale) == 0x000168, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, CallFunc_PlayEventWithOcclusion_FMODAudioComponent) == 0x000180, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::CallFunc_PlayEventWithOcclusion_FMODAudioComponent' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, CallFunc_RebaseLocalOriginOntoZero_ReturnValue) == 0x000188, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::CallFunc_RebaseLocalOriginOntoZero_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, CallFunc_PlayEventWithOcclusion_FMODAudioComponent_1) == 0x0001A0, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::CallFunc_PlayEventWithOcclusion_FMODAudioComponent_1' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, CallFunc_MakeTransform_ReturnValue) == 0x0001B0, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000210, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, CallFunc_FinishSpawningActor_ReturnValue) == 0x000218, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000220, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, CallFunc_Conv_VectorToTransform_ReturnValue) == 0x000240, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::CallFunc_Conv_VectorToTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, K2Node_DynamicCast_AsSurvival_Player_1) == 0x0002A0, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::K2Node_DynamicCast_AsSurvival_Player_1' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, K2Node_DynamicCast_bSuccess_2) == 0x0002A8, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, Temp_bool_Has_Been_Initd_Variable) == 0x0002A9, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, Temp_bool_IsClosed_Variable) == 0x0002AA, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, CallFunc_IsValid_ReturnValue_1) == 0x0002AB, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, CallFunc_GetOverlappingActors_OverlappingActors) == 0x0002B0, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, K2Node_CustomEvent_Location_1) == 0x0002C0, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::K2Node_CustomEvent_Location_1' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, K2Node_CustomEvent_Velocity) == 0x0002D8, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::K2Node_CustomEvent_Velocity' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, K2Node_CustomEvent_Modifier) == 0x0002E0, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::K2Node_CustomEvent_Modifier' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, CallFunc_Array_Length_ReturnValue) == 0x0002E8, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, CallFunc_MapRangeClamped_ReturnValue) == 0x0002F0, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, CallFunc_MapRangeClamped_ReturnValue_1) == 0x0002F8, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::CallFunc_MapRangeClamped_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000300, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000308, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000310, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, CallFunc_Conv_DoubleToVector_ReturnValue_1) == 0x000328, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::CallFunc_Conv_DoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, CallFunc_BreakVector_X) == 0x000340, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, CallFunc_BreakVector_Y) == 0x000348, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, CallFunc_BreakVector_Z) == 0x000350, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, CallFunc_Array_Length_ReturnValue_1) == 0x000358, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, CallFunc_Greater_IntInt_ReturnValue) == 0x00035C, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, K2Node_CustomEvent_Location) == 0x000360, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::K2Node_CustomEvent_Location' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, CallFunc_IsValid_ReturnValue_2) == 0x000378, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, CallFunc_BreakVector_X_1) == 0x000380, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, CallFunc_BreakVector_Y_1) == 0x000388, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, CallFunc_BreakVector_Z_1) == 0x000390, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, CallFunc_IsValid_ReturnValue_3) == 0x000398, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, CallFunc_GetLinearColorValue_ReturnValue) == 0x00039C, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::CallFunc_GetLinearColorValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0003B0, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, CallFunc_BreakVector_X_2) == 0x0003C8, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, CallFunc_BreakVector_Y_2) == 0x0003D0, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, CallFunc_BreakVector_Z_2) == 0x0003D8, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0003E0, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, CallFunc_MakeVector_ReturnValue) == 0x0003E8, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, Temp_int_Array_Index_Variable) == 0x000400, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, CallFunc_IsValid_ReturnValue_4) == 0x000404, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, Temp_int_Loop_Counter_Variable) == 0x000408, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, CallFunc_Add_IntInt_ReturnValue) == 0x00040C, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, CallFunc_GetOverlappingActors_OverlappingActors_1) == 0x000410, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::CallFunc_GetOverlappingActors_OverlappingActors_1' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000420, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, CallFunc_Array_Get_Item) == 0x000428, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, CallFunc_Array_Length_ReturnValue_2) == 0x000430, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, K2Node_DynamicCast_AsAVS_Vehicle_Master) == 0x000438, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::K2Node_DynamicCast_AsAVS_Vehicle_Master' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, K2Node_DynamicCast_bSuccess_3) == 0x000440, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, CallFunc_Less_IntInt_ReturnValue) == 0x000441, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, CallFunc_GetSocketLocation_ReturnValue) == 0x000448, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, CallFunc_GetSocketLocation_ReturnValue_1) == 0x000460, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::CallFunc_GetSocketLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, CallFunc_GetSocketLocation_ReturnValue_2) == 0x000478, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::CallFunc_GetSocketLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, CallFunc_GetSocketLocation_ReturnValue_3) == 0x000490, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::CallFunc_GetSocketLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, K2Node_DynamicCast_AsCutscene_Car) == 0x0004A8, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::K2Node_DynamicCast_AsCutscene_Car' has a wrong offset!");
static_assert(offsetof(BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water, K2Node_DynamicCast_bSuccess_4) == 0x0004B0, "Member 'BP_New_NV_Water_C_ExecuteUbergraph_BP_New_NV_Water::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
