#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Objective

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Objective.BP_Objective_C
// 0x0088 (0x00B0 - 0x0028)
class UBP_Objective_C : public UObject
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0028(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FText                                   ObjectiveName;                                     // 0x0030(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ExposeOnSpawn)
	bool                                          IsActive;                                          // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsComplete;                                        // 0x0049(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnCompleted;                                       // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class AActor*                                 QuestActor;                                        // 0x0060(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class AHUD*                                   HUD;                                               // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnActivated;                                       // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          PlaySound;                                         // 0x0080(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                MarkLocation;                                      // 0x0088(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UW_Mark_C*                              Mark;                                              // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Simultaneously;                                    // 0x00A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ActivateObjective(class AHUD* Param_HUD);
	void DeactivateObjective(double Delay);
	void ExecuteUbergraph_BP_Objective(int32 EntryPoint);
	void OnActivated__DelegateSignature(class UBP_Objective_C* Objective);
	void OnCompleted__DelegateSignature(class UBP_Objective_C* Objective);
	void PlaySoundWithDelay();

	void GetIsActive(bool* Param_IsActive) const;
	void GetIsComplete(bool* Param_IsComplete) const;
	void GetObjectiveName(class FText* Param_ObjectiveName) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Objective_C">();
	}
	static class UBP_Objective_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Objective_C>();
	}
};
static_assert(alignof(UBP_Objective_C) == 0x000008, "Wrong alignment on UBP_Objective_C");
static_assert(sizeof(UBP_Objective_C) == 0x0000B0, "Wrong size on UBP_Objective_C");
static_assert(offsetof(UBP_Objective_C, UberGraphFrame) == 0x000028, "Member 'UBP_Objective_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Objective_C, ObjectiveName) == 0x000030, "Member 'UBP_Objective_C::ObjectiveName' has a wrong offset!");
static_assert(offsetof(UBP_Objective_C, IsActive) == 0x000048, "Member 'UBP_Objective_C::IsActive' has a wrong offset!");
static_assert(offsetof(UBP_Objective_C, IsComplete) == 0x000049, "Member 'UBP_Objective_C::IsComplete' has a wrong offset!");
static_assert(offsetof(UBP_Objective_C, OnCompleted) == 0x000050, "Member 'UBP_Objective_C::OnCompleted' has a wrong offset!");
static_assert(offsetof(UBP_Objective_C, QuestActor) == 0x000060, "Member 'UBP_Objective_C::QuestActor' has a wrong offset!");
static_assert(offsetof(UBP_Objective_C, HUD) == 0x000068, "Member 'UBP_Objective_C::HUD' has a wrong offset!");
static_assert(offsetof(UBP_Objective_C, OnActivated) == 0x000070, "Member 'UBP_Objective_C::OnActivated' has a wrong offset!");
static_assert(offsetof(UBP_Objective_C, PlaySound) == 0x000080, "Member 'UBP_Objective_C::PlaySound' has a wrong offset!");
static_assert(offsetof(UBP_Objective_C, MarkLocation) == 0x000088, "Member 'UBP_Objective_C::MarkLocation' has a wrong offset!");
static_assert(offsetof(UBP_Objective_C, Mark) == 0x0000A0, "Member 'UBP_Objective_C::Mark' has a wrong offset!");
static_assert(offsetof(UBP_Objective_C, Simultaneously) == 0x0000A8, "Member 'UBP_Objective_C::Simultaneously' has a wrong offset!");

}

