#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_QuestItemsSpawnZone

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_QuestItemsSpawnZone.BP_QuestItemsSpawnZone_C
// 0x0098 (0x0328 - 0x0290)
class ABP_QuestItemsSpawnZone_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       Sphere;                                            // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         In_Sphere_Radius;                                  // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class UQuest*>                           Quests;                                            // 0x02B0(0x0050)(Edit, BlueprintVisible)
	double                                        SpawnChance;                                       // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Array_Element;                                     // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Icon;                                              // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              IconSize;                                          // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_QuestItemsSpawnZone(int32 EntryPoint);
	void GetMapIcon(struct FVector* Location, class UTexture2D** Param_Icon, struct FVector2D* Param_IconSize, class AActor** WorldActor, double* Rotation);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_QuestItemsSpawnZone_C">();
	}
	static class ABP_QuestItemsSpawnZone_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_QuestItemsSpawnZone_C>();
	}
};
static_assert(alignof(ABP_QuestItemsSpawnZone_C) == 0x000008, "Wrong alignment on ABP_QuestItemsSpawnZone_C");
static_assert(sizeof(ABP_QuestItemsSpawnZone_C) == 0x000328, "Wrong size on ABP_QuestItemsSpawnZone_C");
static_assert(offsetof(ABP_QuestItemsSpawnZone_C, UberGraphFrame) == 0x000290, "Member 'ABP_QuestItemsSpawnZone_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_QuestItemsSpawnZone_C, Sphere) == 0x000298, "Member 'ABP_QuestItemsSpawnZone_C::Sphere' has a wrong offset!");
static_assert(offsetof(ABP_QuestItemsSpawnZone_C, DefaultSceneRoot) == 0x0002A0, "Member 'ABP_QuestItemsSpawnZone_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_QuestItemsSpawnZone_C, In_Sphere_Radius) == 0x0002A8, "Member 'ABP_QuestItemsSpawnZone_C::In_Sphere_Radius' has a wrong offset!");
static_assert(offsetof(ABP_QuestItemsSpawnZone_C, Quests) == 0x0002B0, "Member 'ABP_QuestItemsSpawnZone_C::Quests' has a wrong offset!");
static_assert(offsetof(ABP_QuestItemsSpawnZone_C, SpawnChance) == 0x000300, "Member 'ABP_QuestItemsSpawnZone_C::SpawnChance' has a wrong offset!");
static_assert(offsetof(ABP_QuestItemsSpawnZone_C, Array_Element) == 0x000308, "Member 'ABP_QuestItemsSpawnZone_C::Array_Element' has a wrong offset!");
static_assert(offsetof(ABP_QuestItemsSpawnZone_C, Icon) == 0x000310, "Member 'ABP_QuestItemsSpawnZone_C::Icon' has a wrong offset!");
static_assert(offsetof(ABP_QuestItemsSpawnZone_C, IconSize) == 0x000318, "Member 'ABP_QuestItemsSpawnZone_C::IconSize' has a wrong offset!");

}

