#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_QuestAreaIcon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_QuestAreaIcon.BP_QuestAreaIcon_C
// 0x0028 (0x02B8 - 0x0290)
class ABP_QuestAreaIcon_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Icon;                                              // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              IconSize;                                          // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_QuestAreaIcon(int32 EntryPoint);
	void GetMapIconData(struct FVector* Location, class UTexture2D** Param_Icon, struct FVector2D* Param_IconSize, double* RotationYaw, class AActor** WorldActor, class FText* Param_Name, class FText* Description);
	void UpdateIconPosition(const struct FVector2D& Position);
	void Zoom(bool Out);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_QuestAreaIcon_C">();
	}
	static class ABP_QuestAreaIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_QuestAreaIcon_C>();
	}
};
static_assert(alignof(ABP_QuestAreaIcon_C) == 0x000008, "Wrong alignment on ABP_QuestAreaIcon_C");
static_assert(sizeof(ABP_QuestAreaIcon_C) == 0x0002B8, "Wrong size on ABP_QuestAreaIcon_C");
static_assert(offsetof(ABP_QuestAreaIcon_C, UberGraphFrame) == 0x000290, "Member 'ABP_QuestAreaIcon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_QuestAreaIcon_C, DefaultSceneRoot) == 0x000298, "Member 'ABP_QuestAreaIcon_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_QuestAreaIcon_C, Icon) == 0x0002A0, "Member 'ABP_QuestAreaIcon_C::Icon' has a wrong offset!");
static_assert(offsetof(ABP_QuestAreaIcon_C, IconSize) == 0x0002A8, "Member 'ABP_QuestAreaIcon_C::IconSize' has a wrong offset!");

}

