#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_QuestItemsSpawnZone

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_QuestItemsSpawnZone.BP_QuestItemsSpawnZone_C.ExecuteUbergraph_BP_QuestItemsSpawnZone
// 0x0140 (0x0140 - 0x0000)
struct BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0038(0x0010)(ReferenceParm)
	TArray<class UQuest*>                         CallFunc_Set_ToArray_Result;                       // 0x0048(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UQuest*                                 CallFunc_Array_Get_Item_1;                         // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALootPoint_C*                           K2Node_DynamicCast_AsLoot_Point;                   // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Map_Find_Value;                           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors_1; // 0x0098(0x0010)(ReferenceParm)
	TArray<class UQuest*>                         CallFunc_Set_ToArray_Result_1;                     // 0x00A8(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item_2;                         // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ZombieSpawner_C*                    K2Node_DynamicCast_AsBP_Zombie_Spawner;            // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D3[0x5];                                       // 0x00D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors_2; // 0x00D8(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item_3;                         // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CarWithZombie_C*                    K2Node_DynamicCast_AsBP_Car_with_Zombie;           // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_103[0x5];                                      // 0x0103(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UQuest*>                         CallFunc_Set_ToArray_Result_2;                     // 0x0108(0x0010)(ReferenceParm)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GS_TDB_C>         K2Node_DynamicCast_AsBPI_GS_TDB;                   // 0x0120(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone) == 0x000008, "Wrong alignment on BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone");
static_assert(sizeof(BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone) == 0x000140, "Wrong size on BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone");
static_assert(offsetof(BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone, EntryPoint) == 0x000000, "Member 'BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone, Temp_int_Array_Index_Variable_1) == 0x00000C, "Member 'BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone, Temp_int_Loop_Counter_Variable_1) == 0x000014, "Member 'BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone, CallFunc_Add_IntInt_ReturnValue_1) == 0x00001C, "Member 'BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone, Temp_int_Loop_Counter_Variable_2) == 0x000020, "Member 'BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone, CallFunc_Add_IntInt_ReturnValue_2) == 0x000024, "Member 'BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone, Temp_int_Array_Index_Variable_2) == 0x000028, "Member 'BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone, Temp_int_Loop_Counter_Variable_3) == 0x00002C, "Member 'BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone, CallFunc_Add_IntInt_ReturnValue_3) == 0x000030, "Member 'BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone, Temp_int_Array_Index_Variable_3) == 0x000034, "Member 'BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone, CallFunc_GetOverlappingActors_OverlappingActors) == 0x000038, "Member 'BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone, CallFunc_Set_ToArray_Result) == 0x000048, "Member 'BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone::CallFunc_Set_ToArray_Result' has a wrong offset!");
static_assert(offsetof(BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone, CallFunc_Array_Get_Item) == 0x000058, "Member 'BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone, CallFunc_Array_Get_Item_1) == 0x000060, "Member 'BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone, K2Node_DynamicCast_AsLoot_Point) == 0x000068, "Member 'BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone::K2Node_DynamicCast_AsLoot_Point' has a wrong offset!");
static_assert(offsetof(BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone, CallFunc_Array_Length_ReturnValue) == 0x000074, "Member 'BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone, CallFunc_Less_IntInt_ReturnValue) == 0x000079, "Member 'BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone, CallFunc_Array_Length_ReturnValue_1) == 0x00007C, "Member 'BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone, CallFunc_Less_IntInt_ReturnValue_1) == 0x000080, "Member 'BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone, CallFunc_Map_Find_Value) == 0x000088, "Member 'BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone, CallFunc_Map_Find_ReturnValue) == 0x000090, "Member 'BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone, CallFunc_GetOverlappingActors_OverlappingActors_1) == 0x000098, "Member 'BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone::CallFunc_GetOverlappingActors_OverlappingActors_1' has a wrong offset!");
static_assert(offsetof(BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone, CallFunc_Set_ToArray_Result_1) == 0x0000A8, "Member 'BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone::CallFunc_Set_ToArray_Result_1' has a wrong offset!");
static_assert(offsetof(BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone, CallFunc_Array_Get_Item_2) == 0x0000B8, "Member 'BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone, CallFunc_Array_Length_ReturnValue_2) == 0x0000C0, "Member 'BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone, K2Node_DynamicCast_AsBP_Zombie_Spawner) == 0x0000C8, "Member 'BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone::K2Node_DynamicCast_AsBP_Zombie_Spawner' has a wrong offset!");
static_assert(offsetof(BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone, K2Node_DynamicCast_bSuccess_1) == 0x0000D0, "Member 'BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000D1, "Member 'BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone, CallFunc_IsValid_ReturnValue_1) == 0x0000D2, "Member 'BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone, CallFunc_GetOverlappingActors_OverlappingActors_2) == 0x0000D8, "Member 'BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone::CallFunc_GetOverlappingActors_OverlappingActors_2' has a wrong offset!");
static_assert(offsetof(BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone, CallFunc_Array_Get_Item_3) == 0x0000E8, "Member 'BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone, CallFunc_Array_Length_ReturnValue_3) == 0x0000F0, "Member 'BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone, K2Node_DynamicCast_AsBP_Car_with_Zombie) == 0x0000F8, "Member 'BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone::K2Node_DynamicCast_AsBP_Car_with_Zombie' has a wrong offset!");
static_assert(offsetof(BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone, K2Node_DynamicCast_bSuccess_2) == 0x000100, "Member 'BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone, CallFunc_Less_IntInt_ReturnValue_3) == 0x000101, "Member 'BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone, CallFunc_IsValid_ReturnValue_2) == 0x000102, "Member 'BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone, CallFunc_Set_ToArray_Result_2) == 0x000108, "Member 'BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone::CallFunc_Set_ToArray_Result_2' has a wrong offset!");
static_assert(offsetof(BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone, CallFunc_GetGameState_ReturnValue) == 0x000118, "Member 'BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone, K2Node_DynamicCast_AsBPI_GS_TDB) == 0x000120, "Member 'BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone::K2Node_DynamicCast_AsBPI_GS_TDB' has a wrong offset!");
static_assert(offsetof(BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone, K2Node_DynamicCast_bSuccess_3) == 0x000130, "Member 'BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000138, "Member 'BP_QuestItemsSpawnZone_C_ExecuteUbergraph_BP_QuestItemsSpawnZone::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");

// Function BP_QuestItemsSpawnZone.BP_QuestItemsSpawnZone_C.GetMapIcon
// 0x0080 (0x0080 - 0x0000)
struct BP_QuestItemsSpawnZone_C_GetMapIcon final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Param_Icon;                                        // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Param_IconSize;                                    // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 WorldActor;                                        // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Rotation;                                          // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeLiteralDouble_ReturnValue;            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_QuestItemsSpawnZone_C_GetMapIcon) == 0x000008, "Wrong alignment on BP_QuestItemsSpawnZone_C_GetMapIcon");
static_assert(sizeof(BP_QuestItemsSpawnZone_C_GetMapIcon) == 0x000080, "Wrong size on BP_QuestItemsSpawnZone_C_GetMapIcon");
static_assert(offsetof(BP_QuestItemsSpawnZone_C_GetMapIcon, Location) == 0x000000, "Member 'BP_QuestItemsSpawnZone_C_GetMapIcon::Location' has a wrong offset!");
static_assert(offsetof(BP_QuestItemsSpawnZone_C_GetMapIcon, Param_Icon) == 0x000018, "Member 'BP_QuestItemsSpawnZone_C_GetMapIcon::Param_Icon' has a wrong offset!");
static_assert(offsetof(BP_QuestItemsSpawnZone_C_GetMapIcon, Param_IconSize) == 0x000020, "Member 'BP_QuestItemsSpawnZone_C_GetMapIcon::Param_IconSize' has a wrong offset!");
static_assert(offsetof(BP_QuestItemsSpawnZone_C_GetMapIcon, WorldActor) == 0x000030, "Member 'BP_QuestItemsSpawnZone_C_GetMapIcon::WorldActor' has a wrong offset!");
static_assert(offsetof(BP_QuestItemsSpawnZone_C_GetMapIcon, Rotation) == 0x000038, "Member 'BP_QuestItemsSpawnZone_C_GetMapIcon::Rotation' has a wrong offset!");
static_assert(offsetof(BP_QuestItemsSpawnZone_C_GetMapIcon, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000040, "Member 'BP_QuestItemsSpawnZone_C_GetMapIcon::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuestItemsSpawnZone_C_GetMapIcon, CallFunc_MakeLiteralDouble_ReturnValue) == 0x000048, "Member 'BP_QuestItemsSpawnZone_C_GetMapIcon::CallFunc_MakeLiteralDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuestItemsSpawnZone_C_GetMapIcon, CallFunc_MakeVector2D_ReturnValue) == 0x000050, "Member 'BP_QuestItemsSpawnZone_C_GetMapIcon::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuestItemsSpawnZone_C_GetMapIcon, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000060, "Member 'BP_QuestItemsSpawnZone_C_GetMapIcon::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuestItemsSpawnZone_C_GetMapIcon, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000078, "Member 'BP_QuestItemsSpawnZone_C_GetMapIcon::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");

}

