#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_QuestItemOld

#include "Basic.hpp"

#include "E_InteractType_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "E_ActorType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_QuestItemOld.BP_QuestItemOld_C
// 0x0018 (0x02A8 - 0x0290)
class ABP_QuestItemOld_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPickupComponent_C*                     PickupComponent;                                   // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void AddMark();
	void CreateItem(class FName Item_ID);
	void DestroyInteractable();
	void ExecuteUbergraph_BP_QuestItemOld(int32 EntryPoint);
	void GetActorType(E_ActorType* ActorType);
	void IsLocked_(bool* Result);
	void OnBeginInteract(class APawn* Player);
	void OnFocused(class APawn* Player, class AActor* HighlightActor, class UActorComponent* HighlightActorComponent, E_InteractType* InteractType, double* LateTime);
	void OnInteract(class APawn* Player);
	void OnInteract2(class APawn* Player);
	void OnInteract3(class APawn* Player);
	void OnInteractVehicle(class APawn* Player, int32 SitIndex, bool SkipAnimation);
	void OnLoaded_A2789CAD4B7C1935C54F7F855D187AD0(class UObject* Loaded);
	void OnLocalInteract(class APawn* Player);
	void OnLostFocus(class APawn* Player);
	void OnSeen(class APawn* Player);
	void OnSquadCheckComplete();
	void OnStopInteract(class APawn* Player);
	void ReceiveBeginPlay();
	void Run_Lockpicking();
	void Set3DWidgetVisibility(bool Visible);
	void SetItem();
	void SetTutorial3DWidgetVisibility(bool Visible);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_QuestItemOld_C">();
	}
	static class ABP_QuestItemOld_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_QuestItemOld_C>();
	}
};
static_assert(alignof(ABP_QuestItemOld_C) == 0x000008, "Wrong alignment on ABP_QuestItemOld_C");
static_assert(sizeof(ABP_QuestItemOld_C) == 0x0002A8, "Wrong size on ABP_QuestItemOld_C");
static_assert(offsetof(ABP_QuestItemOld_C, UberGraphFrame) == 0x000290, "Member 'ABP_QuestItemOld_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_QuestItemOld_C, StaticMesh) == 0x000298, "Member 'ABP_QuestItemOld_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_QuestItemOld_C, PickupComponent) == 0x0002A0, "Member 'ABP_QuestItemOld_C::PickupComponent' has a wrong offset!");

}

