#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_QuestZone_Towers

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "E_InteractType_structs.hpp"


namespace SDK::Params
{

// Function BP_QuestZone_Towers.BP_QuestZone_Towers_C.Active 3DPoint Widget
// 0x0001 (0x0001 - 0x0000)
struct BP_QuestZone_Towers_C_Active_3DPoint_Widget final
{
public:
	bool                                          Toggle;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_QuestZone_Towers_C_Active_3DPoint_Widget) == 0x000001, "Wrong alignment on BP_QuestZone_Towers_C_Active_3DPoint_Widget");
static_assert(sizeof(BP_QuestZone_Towers_C_Active_3DPoint_Widget) == 0x000001, "Wrong size on BP_QuestZone_Towers_C_Active_3DPoint_Widget");
static_assert(offsetof(BP_QuestZone_Towers_C_Active_3DPoint_Widget, Toggle) == 0x000000, "Member 'BP_QuestZone_Towers_C_Active_3DPoint_Widget::Toggle' has a wrong offset!");

// Function BP_QuestZone_Towers.BP_QuestZone_Towers_C.ExecuteUbergraph_BP_QuestZone_Towers
// 0x0098 (0x0098 - 0x0000)
struct BP_QuestZone_Towers_C_ExecuteUbergraph_BP_QuestZone_Towers final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_Position;                             // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_In_Out;                               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GS_TDB_C>         K2Node_DynamicCast_AsBPI_GS_TDB;                   // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_Player;                               // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvPC_C*                              K2Node_DynamicCast_AsSurv_PC;                      // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Visible;                              // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63[0x5];                                       // 0x0063(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UQuest*                                 CallFunc_Array_Get_Item;                           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UQuestCustomData*                 CallFunc_GetCustomData_ReturnValue;                // 0x0078(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UQuestData_C*                     K2Node_DynamicCast_AsQuest_Data;                   // 0x0088(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_QuestZone_Towers_C_ExecuteUbergraph_BP_QuestZone_Towers) == 0x000008, "Wrong alignment on BP_QuestZone_Towers_C_ExecuteUbergraph_BP_QuestZone_Towers");
static_assert(sizeof(BP_QuestZone_Towers_C_ExecuteUbergraph_BP_QuestZone_Towers) == 0x000098, "Wrong size on BP_QuestZone_Towers_C_ExecuteUbergraph_BP_QuestZone_Towers");
static_assert(offsetof(BP_QuestZone_Towers_C_ExecuteUbergraph_BP_QuestZone_Towers, EntryPoint) == 0x000000, "Member 'BP_QuestZone_Towers_C_ExecuteUbergraph_BP_QuestZone_Towers::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_QuestZone_Towers_C_ExecuteUbergraph_BP_QuestZone_Towers, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_QuestZone_Towers_C_ExecuteUbergraph_BP_QuestZone_Towers::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_QuestZone_Towers_C_ExecuteUbergraph_BP_QuestZone_Towers, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_QuestZone_Towers_C_ExecuteUbergraph_BP_QuestZone_Towers::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_QuestZone_Towers_C_ExecuteUbergraph_BP_QuestZone_Towers, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_QuestZone_Towers_C_ExecuteUbergraph_BP_QuestZone_Towers::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuestZone_Towers_C_ExecuteUbergraph_BP_QuestZone_Towers, K2Node_Event_Position) == 0x000010, "Member 'BP_QuestZone_Towers_C_ExecuteUbergraph_BP_QuestZone_Towers::K2Node_Event_Position' has a wrong offset!");
static_assert(offsetof(BP_QuestZone_Towers_C_ExecuteUbergraph_BP_QuestZone_Towers, K2Node_Event_In_Out) == 0x000020, "Member 'BP_QuestZone_Towers_C_ExecuteUbergraph_BP_QuestZone_Towers::K2Node_Event_In_Out' has a wrong offset!");
static_assert(offsetof(BP_QuestZone_Towers_C_ExecuteUbergraph_BP_QuestZone_Towers, CallFunc_GetGameState_ReturnValue) == 0x000028, "Member 'BP_QuestZone_Towers_C_ExecuteUbergraph_BP_QuestZone_Towers::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuestZone_Towers_C_ExecuteUbergraph_BP_QuestZone_Towers, K2Node_DynamicCast_AsBPI_GS_TDB) == 0x000030, "Member 'BP_QuestZone_Towers_C_ExecuteUbergraph_BP_QuestZone_Towers::K2Node_DynamicCast_AsBPI_GS_TDB' has a wrong offset!");
static_assert(offsetof(BP_QuestZone_Towers_C_ExecuteUbergraph_BP_QuestZone_Towers, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_QuestZone_Towers_C_ExecuteUbergraph_BP_QuestZone_Towers::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_QuestZone_Towers_C_ExecuteUbergraph_BP_QuestZone_Towers, K2Node_Event_Player) == 0x000048, "Member 'BP_QuestZone_Towers_C_ExecuteUbergraph_BP_QuestZone_Towers::K2Node_Event_Player' has a wrong offset!");
static_assert(offsetof(BP_QuestZone_Towers_C_ExecuteUbergraph_BP_QuestZone_Towers, CallFunc_GetController_ReturnValue) == 0x000050, "Member 'BP_QuestZone_Towers_C_ExecuteUbergraph_BP_QuestZone_Towers::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuestZone_Towers_C_ExecuteUbergraph_BP_QuestZone_Towers, K2Node_DynamicCast_AsSurv_PC) == 0x000058, "Member 'BP_QuestZone_Towers_C_ExecuteUbergraph_BP_QuestZone_Towers::K2Node_DynamicCast_AsSurv_PC' has a wrong offset!");
static_assert(offsetof(BP_QuestZone_Towers_C_ExecuteUbergraph_BP_QuestZone_Towers, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'BP_QuestZone_Towers_C_ExecuteUbergraph_BP_QuestZone_Towers::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_QuestZone_Towers_C_ExecuteUbergraph_BP_QuestZone_Towers, K2Node_Event_Visible) == 0x000061, "Member 'BP_QuestZone_Towers_C_ExecuteUbergraph_BP_QuestZone_Towers::K2Node_Event_Visible' has a wrong offset!");
static_assert(offsetof(BP_QuestZone_Towers_C_ExecuteUbergraph_BP_QuestZone_Towers, CallFunc_Array_RemoveItem_ReturnValue) == 0x000062, "Member 'BP_QuestZone_Towers_C_ExecuteUbergraph_BP_QuestZone_Towers::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuestZone_Towers_C_ExecuteUbergraph_BP_QuestZone_Towers, CallFunc_Array_Get_Item) == 0x000068, "Member 'BP_QuestZone_Towers_C_ExecuteUbergraph_BP_QuestZone_Towers::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_QuestZone_Towers_C_ExecuteUbergraph_BP_QuestZone_Towers, CallFunc_Array_Length_ReturnValue) == 0x000070, "Member 'BP_QuestZone_Towers_C_ExecuteUbergraph_BP_QuestZone_Towers::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuestZone_Towers_C_ExecuteUbergraph_BP_QuestZone_Towers, CallFunc_GetCustomData_ReturnValue) == 0x000078, "Member 'BP_QuestZone_Towers_C_ExecuteUbergraph_BP_QuestZone_Towers::CallFunc_GetCustomData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuestZone_Towers_C_ExecuteUbergraph_BP_QuestZone_Towers, CallFunc_Less_IntInt_ReturnValue) == 0x000080, "Member 'BP_QuestZone_Towers_C_ExecuteUbergraph_BP_QuestZone_Towers::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuestZone_Towers_C_ExecuteUbergraph_BP_QuestZone_Towers, K2Node_DynamicCast_AsQuest_Data) == 0x000088, "Member 'BP_QuestZone_Towers_C_ExecuteUbergraph_BP_QuestZone_Towers::K2Node_DynamicCast_AsQuest_Data' has a wrong offset!");
static_assert(offsetof(BP_QuestZone_Towers_C_ExecuteUbergraph_BP_QuestZone_Towers, K2Node_DynamicCast_bSuccess_2) == 0x000090, "Member 'BP_QuestZone_Towers_C_ExecuteUbergraph_BP_QuestZone_Towers::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function BP_QuestZone_Towers.BP_QuestZone_Towers_C.GetMapIconData
// 0x00A8 (0x00A8 - 0x0000)
struct BP_QuestZone_Towers_C_GetMapIconData final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Param_Icon;                                        // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              IconSize;                                          // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RotationYaw;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 WorldActor;                                        // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   Param_Name;                                        // 0x0040(0x0018)(Parm, OutParm)
	class FText                                   Description;                                       // 0x0058(0x0018)(Parm, OutParm)
	bool                                          Temp_bool_Variable;                                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable;                              // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Select_Default;                             // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeLiteralDouble_ReturnValue;            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_QuestZone_Towers_C_GetMapIconData) == 0x000008, "Wrong alignment on BP_QuestZone_Towers_C_GetMapIconData");
static_assert(sizeof(BP_QuestZone_Towers_C_GetMapIconData) == 0x0000A8, "Wrong size on BP_QuestZone_Towers_C_GetMapIconData");
static_assert(offsetof(BP_QuestZone_Towers_C_GetMapIconData, Location) == 0x000000, "Member 'BP_QuestZone_Towers_C_GetMapIconData::Location' has a wrong offset!");
static_assert(offsetof(BP_QuestZone_Towers_C_GetMapIconData, Param_Icon) == 0x000018, "Member 'BP_QuestZone_Towers_C_GetMapIconData::Param_Icon' has a wrong offset!");
static_assert(offsetof(BP_QuestZone_Towers_C_GetMapIconData, IconSize) == 0x000020, "Member 'BP_QuestZone_Towers_C_GetMapIconData::IconSize' has a wrong offset!");
static_assert(offsetof(BP_QuestZone_Towers_C_GetMapIconData, RotationYaw) == 0x000030, "Member 'BP_QuestZone_Towers_C_GetMapIconData::RotationYaw' has a wrong offset!");
static_assert(offsetof(BP_QuestZone_Towers_C_GetMapIconData, WorldActor) == 0x000038, "Member 'BP_QuestZone_Towers_C_GetMapIconData::WorldActor' has a wrong offset!");
static_assert(offsetof(BP_QuestZone_Towers_C_GetMapIconData, Param_Name) == 0x000040, "Member 'BP_QuestZone_Towers_C_GetMapIconData::Param_Name' has a wrong offset!");
static_assert(offsetof(BP_QuestZone_Towers_C_GetMapIconData, Description) == 0x000058, "Member 'BP_QuestZone_Towers_C_GetMapIconData::Description' has a wrong offset!");
static_assert(offsetof(BP_QuestZone_Towers_C_GetMapIconData, Temp_bool_Variable) == 0x000070, "Member 'BP_QuestZone_Towers_C_GetMapIconData::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_QuestZone_Towers_C_GetMapIconData, Temp_object_Variable) == 0x000078, "Member 'BP_QuestZone_Towers_C_GetMapIconData::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_QuestZone_Towers_C_GetMapIconData, K2Node_Select_Default) == 0x000080, "Member 'BP_QuestZone_Towers_C_GetMapIconData::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_QuestZone_Towers_C_GetMapIconData, CallFunc_MakeLiteralDouble_ReturnValue) == 0x000088, "Member 'BP_QuestZone_Towers_C_GetMapIconData::CallFunc_MakeLiteralDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuestZone_Towers_C_GetMapIconData, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000090, "Member 'BP_QuestZone_Towers_C_GetMapIconData::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");

// Function BP_QuestZone_Towers.BP_QuestZone_Towers_C.UpdateIconPosition
// 0x0010 (0x0010 - 0x0000)
struct BP_QuestZone_Towers_C_UpdateIconPosition final
{
public:
	struct FVector2D                              Position;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_QuestZone_Towers_C_UpdateIconPosition) == 0x000008, "Wrong alignment on BP_QuestZone_Towers_C_UpdateIconPosition");
static_assert(sizeof(BP_QuestZone_Towers_C_UpdateIconPosition) == 0x000010, "Wrong size on BP_QuestZone_Towers_C_UpdateIconPosition");
static_assert(offsetof(BP_QuestZone_Towers_C_UpdateIconPosition, Position) == 0x000000, "Member 'BP_QuestZone_Towers_C_UpdateIconPosition::Position' has a wrong offset!");

// Function BP_QuestZone_Towers.BP_QuestZone_Towers_C.Zoom
// 0x0001 (0x0001 - 0x0000)
struct BP_QuestZone_Towers_C_Zoom final
{
public:
	bool                                          Out;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_QuestZone_Towers_C_Zoom) == 0x000001, "Wrong alignment on BP_QuestZone_Towers_C_Zoom");
static_assert(sizeof(BP_QuestZone_Towers_C_Zoom) == 0x000001, "Wrong size on BP_QuestZone_Towers_C_Zoom");
static_assert(offsetof(BP_QuestZone_Towers_C_Zoom, Out) == 0x000000, "Member 'BP_QuestZone_Towers_C_Zoom::Out' has a wrong offset!");

// Function BP_QuestZone_Towers.BP_QuestZone_Towers_C.OnFocused
// 0x0090 (0x0090 - 0x0000)
struct BP_QuestZone_Towers_C_OnFocused final
{
public:
	class APawn*                                  Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 HighlightActor;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UActorComponent*                        HighlightActorComponent;                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	E_InteractType                                InteractType;                                      // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        LateTime;                                          // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UQuest*                                 CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvPC_C*                              K2Node_DynamicCast_AsSurv_PC;                      // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_2;             // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0048(0x0010)(ReferenceParm)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_3;             // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameHUD_C>        K2Node_DynamicCast_AsBPI_Game_HUD;                 // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_PlayerMain_C*                      CallFunc_GetGUI_GUI;                               // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_QuestZone_Towers_C_OnFocused) == 0x000008, "Wrong alignment on BP_QuestZone_Towers_C_OnFocused");
static_assert(sizeof(BP_QuestZone_Towers_C_OnFocused) == 0x000090, "Wrong size on BP_QuestZone_Towers_C_OnFocused");
static_assert(offsetof(BP_QuestZone_Towers_C_OnFocused, Player) == 0x000000, "Member 'BP_QuestZone_Towers_C_OnFocused::Player' has a wrong offset!");
static_assert(offsetof(BP_QuestZone_Towers_C_OnFocused, HighlightActor) == 0x000008, "Member 'BP_QuestZone_Towers_C_OnFocused::HighlightActor' has a wrong offset!");
static_assert(offsetof(BP_QuestZone_Towers_C_OnFocused, HighlightActorComponent) == 0x000010, "Member 'BP_QuestZone_Towers_C_OnFocused::HighlightActorComponent' has a wrong offset!");
static_assert(offsetof(BP_QuestZone_Towers_C_OnFocused, InteractType) == 0x000018, "Member 'BP_QuestZone_Towers_C_OnFocused::InteractType' has a wrong offset!");
static_assert(offsetof(BP_QuestZone_Towers_C_OnFocused, LateTime) == 0x000020, "Member 'BP_QuestZone_Towers_C_OnFocused::LateTime' has a wrong offset!");
static_assert(offsetof(BP_QuestZone_Towers_C_OnFocused, CallFunc_GetController_ReturnValue) == 0x000028, "Member 'BP_QuestZone_Towers_C_OnFocused::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuestZone_Towers_C_OnFocused, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_QuestZone_Towers_C_OnFocused::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_QuestZone_Towers_C_OnFocused, K2Node_DynamicCast_AsSurv_PC) == 0x000038, "Member 'BP_QuestZone_Towers_C_OnFocused::K2Node_DynamicCast_AsSurv_PC' has a wrong offset!");
static_assert(offsetof(BP_QuestZone_Towers_C_OnFocused, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_QuestZone_Towers_C_OnFocused::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_QuestZone_Towers_C_OnFocused, CallFunc_Array_Contains_ReturnValue) == 0x000041, "Member 'BP_QuestZone_Towers_C_OnFocused::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuestZone_Towers_C_OnFocused, CallFunc_Array_Contains_ReturnValue_1) == 0x000042, "Member 'BP_QuestZone_Towers_C_OnFocused::CallFunc_Array_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_QuestZone_Towers_C_OnFocused, CallFunc_Not_PreBool_ReturnValue) == 0x000043, "Member 'BP_QuestZone_Towers_C_OnFocused::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuestZone_Towers_C_OnFocused, CallFunc_Array_Contains_ReturnValue_2) == 0x000044, "Member 'BP_QuestZone_Towers_C_OnFocused::CallFunc_Array_Contains_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_QuestZone_Towers_C_OnFocused, CallFunc_GetOverlappingActors_OverlappingActors) == 0x000048, "Member 'BP_QuestZone_Towers_C_OnFocused::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(BP_QuestZone_Towers_C_OnFocused, CallFunc_BooleanAND_ReturnValue) == 0x000058, "Member 'BP_QuestZone_Towers_C_OnFocused::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuestZone_Towers_C_OnFocused, CallFunc_Array_Contains_ReturnValue_3) == 0x000059, "Member 'BP_QuestZone_Towers_C_OnFocused::CallFunc_Array_Contains_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_QuestZone_Towers_C_OnFocused, CallFunc_GetPlayerController_ReturnValue) == 0x000060, "Member 'BP_QuestZone_Towers_C_OnFocused::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuestZone_Towers_C_OnFocused, CallFunc_GetHUD_ReturnValue) == 0x000068, "Member 'BP_QuestZone_Towers_C_OnFocused::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuestZone_Towers_C_OnFocused, K2Node_DynamicCast_AsBPI_Game_HUD) == 0x000070, "Member 'BP_QuestZone_Towers_C_OnFocused::K2Node_DynamicCast_AsBPI_Game_HUD' has a wrong offset!");
static_assert(offsetof(BP_QuestZone_Towers_C_OnFocused, K2Node_DynamicCast_bSuccess_1) == 0x000080, "Member 'BP_QuestZone_Towers_C_OnFocused::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_QuestZone_Towers_C_OnFocused, CallFunc_GetGUI_GUI) == 0x000088, "Member 'BP_QuestZone_Towers_C_OnFocused::CallFunc_GetGUI_GUI' has a wrong offset!");

// Function BP_QuestZone_Towers.BP_QuestZone_Towers_C.OnLocalInteract
// 0x0008 (0x0008 - 0x0000)
struct BP_QuestZone_Towers_C_OnLocalInteract final
{
public:
	class APawn*                                  Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_QuestZone_Towers_C_OnLocalInteract) == 0x000008, "Wrong alignment on BP_QuestZone_Towers_C_OnLocalInteract");
static_assert(sizeof(BP_QuestZone_Towers_C_OnLocalInteract) == 0x000008, "Wrong size on BP_QuestZone_Towers_C_OnLocalInteract");
static_assert(offsetof(BP_QuestZone_Towers_C_OnLocalInteract, Player) == 0x000000, "Member 'BP_QuestZone_Towers_C_OnLocalInteract::Player' has a wrong offset!");

// Function BP_QuestZone_Towers.BP_QuestZone_Towers_C.Set3DWidgetVisibility
// 0x0001 (0x0001 - 0x0000)
struct BP_QuestZone_Towers_C_Set3DWidgetVisibility final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_QuestZone_Towers_C_Set3DWidgetVisibility) == 0x000001, "Wrong alignment on BP_QuestZone_Towers_C_Set3DWidgetVisibility");
static_assert(sizeof(BP_QuestZone_Towers_C_Set3DWidgetVisibility) == 0x000001, "Wrong size on BP_QuestZone_Towers_C_Set3DWidgetVisibility");
static_assert(offsetof(BP_QuestZone_Towers_C_Set3DWidgetVisibility, Visible) == 0x000000, "Member 'BP_QuestZone_Towers_C_Set3DWidgetVisibility::Visible' has a wrong offset!");

}

