#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_QuestAreaIcon

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_QuestAreaIcon.BP_QuestAreaIcon_C.ExecuteUbergraph_BP_QuestAreaIcon
// 0x0020 (0x0020 - 0x0000)
struct BP_QuestAreaIcon_C_ExecuteUbergraph_BP_QuestAreaIcon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Event_Position;                             // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_In_Out;                               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_QuestAreaIcon_C_ExecuteUbergraph_BP_QuestAreaIcon) == 0x000008, "Wrong alignment on BP_QuestAreaIcon_C_ExecuteUbergraph_BP_QuestAreaIcon");
static_assert(sizeof(BP_QuestAreaIcon_C_ExecuteUbergraph_BP_QuestAreaIcon) == 0x000020, "Wrong size on BP_QuestAreaIcon_C_ExecuteUbergraph_BP_QuestAreaIcon");
static_assert(offsetof(BP_QuestAreaIcon_C_ExecuteUbergraph_BP_QuestAreaIcon, EntryPoint) == 0x000000, "Member 'BP_QuestAreaIcon_C_ExecuteUbergraph_BP_QuestAreaIcon::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_QuestAreaIcon_C_ExecuteUbergraph_BP_QuestAreaIcon, K2Node_Event_Position) == 0x000008, "Member 'BP_QuestAreaIcon_C_ExecuteUbergraph_BP_QuestAreaIcon::K2Node_Event_Position' has a wrong offset!");
static_assert(offsetof(BP_QuestAreaIcon_C_ExecuteUbergraph_BP_QuestAreaIcon, K2Node_Event_In_Out) == 0x000018, "Member 'BP_QuestAreaIcon_C_ExecuteUbergraph_BP_QuestAreaIcon::K2Node_Event_In_Out' has a wrong offset!");

// Function BP_QuestAreaIcon.BP_QuestAreaIcon_C.GetMapIconData
// 0x0090 (0x0090 - 0x0000)
struct BP_QuestAreaIcon_C_GetMapIconData final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Param_Icon;                                        // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Param_IconSize;                                    // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RotationYaw;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 WorldActor;                                        // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   Param_Name;                                        // 0x0040(0x0018)(Parm, OutParm)
	class FText                                   Description;                                       // 0x0058(0x0018)(Parm, OutParm)
	double                                        CallFunc_MakeLiteralDouble_ReturnValue;            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_QuestAreaIcon_C_GetMapIconData) == 0x000008, "Wrong alignment on BP_QuestAreaIcon_C_GetMapIconData");
static_assert(sizeof(BP_QuestAreaIcon_C_GetMapIconData) == 0x000090, "Wrong size on BP_QuestAreaIcon_C_GetMapIconData");
static_assert(offsetof(BP_QuestAreaIcon_C_GetMapIconData, Location) == 0x000000, "Member 'BP_QuestAreaIcon_C_GetMapIconData::Location' has a wrong offset!");
static_assert(offsetof(BP_QuestAreaIcon_C_GetMapIconData, Param_Icon) == 0x000018, "Member 'BP_QuestAreaIcon_C_GetMapIconData::Param_Icon' has a wrong offset!");
static_assert(offsetof(BP_QuestAreaIcon_C_GetMapIconData, Param_IconSize) == 0x000020, "Member 'BP_QuestAreaIcon_C_GetMapIconData::Param_IconSize' has a wrong offset!");
static_assert(offsetof(BP_QuestAreaIcon_C_GetMapIconData, RotationYaw) == 0x000030, "Member 'BP_QuestAreaIcon_C_GetMapIconData::RotationYaw' has a wrong offset!");
static_assert(offsetof(BP_QuestAreaIcon_C_GetMapIconData, WorldActor) == 0x000038, "Member 'BP_QuestAreaIcon_C_GetMapIconData::WorldActor' has a wrong offset!");
static_assert(offsetof(BP_QuestAreaIcon_C_GetMapIconData, Param_Name) == 0x000040, "Member 'BP_QuestAreaIcon_C_GetMapIconData::Param_Name' has a wrong offset!");
static_assert(offsetof(BP_QuestAreaIcon_C_GetMapIconData, Description) == 0x000058, "Member 'BP_QuestAreaIcon_C_GetMapIconData::Description' has a wrong offset!");
static_assert(offsetof(BP_QuestAreaIcon_C_GetMapIconData, CallFunc_MakeLiteralDouble_ReturnValue) == 0x000070, "Member 'BP_QuestAreaIcon_C_GetMapIconData::CallFunc_MakeLiteralDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuestAreaIcon_C_GetMapIconData, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000078, "Member 'BP_QuestAreaIcon_C_GetMapIconData::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");

// Function BP_QuestAreaIcon.BP_QuestAreaIcon_C.UpdateIconPosition
// 0x0010 (0x0010 - 0x0000)
struct BP_QuestAreaIcon_C_UpdateIconPosition final
{
public:
	struct FVector2D                              Position;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_QuestAreaIcon_C_UpdateIconPosition) == 0x000008, "Wrong alignment on BP_QuestAreaIcon_C_UpdateIconPosition");
static_assert(sizeof(BP_QuestAreaIcon_C_UpdateIconPosition) == 0x000010, "Wrong size on BP_QuestAreaIcon_C_UpdateIconPosition");
static_assert(offsetof(BP_QuestAreaIcon_C_UpdateIconPosition, Position) == 0x000000, "Member 'BP_QuestAreaIcon_C_UpdateIconPosition::Position' has a wrong offset!");

// Function BP_QuestAreaIcon.BP_QuestAreaIcon_C.Zoom
// 0x0001 (0x0001 - 0x0000)
struct BP_QuestAreaIcon_C_Zoom final
{
public:
	bool                                          Out;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_QuestAreaIcon_C_Zoom) == 0x000001, "Wrong alignment on BP_QuestAreaIcon_C_Zoom");
static_assert(sizeof(BP_QuestAreaIcon_C_Zoom) == 0x000001, "Wrong size on BP_QuestAreaIcon_C_Zoom");
static_assert(offsetof(BP_QuestAreaIcon_C_Zoom, Out) == 0x000000, "Member 'BP_QuestAreaIcon_C_Zoom::Out' has a wrong offset!");

}

