#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RT_Box

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_RT_Box.BP_RT_Box_C.ExecuteUbergraph_BP_RT_Box
// 0x00A8 (0x00A8 - 0x0000)
struct BP_RT_Box_C_ExecuteUbergraph_BP_RT_Box final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor_1;                         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_V2_C*                   K2Node_DynamicCast_AsSurvival_Player_V2;           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_V2_C*                   K2Node_DynamicCast_AsSurvival_Player_V2_1;         // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetAttachedActors_OutActors;              // 0x0050(0x0010)(ReferenceParm)
	TArray<class AActor*>                         CallFunc_GetAttachedActors_OutActors_1;            // 0x0060(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_RT_Manager_SceneCapture_C*          K2Node_DynamicCast_AsBP_RT_Manager_Scene_Capture;  // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_RT_Manager_SceneCapture_C*          K2Node_DynamicCast_AsBP_RT_Manager_Scene_Capture_1; // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x00A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RT_Box_C_ExecuteUbergraph_BP_RT_Box) == 0x000008, "Wrong alignment on BP_RT_Box_C_ExecuteUbergraph_BP_RT_Box");
static_assert(sizeof(BP_RT_Box_C_ExecuteUbergraph_BP_RT_Box) == 0x0000A8, "Wrong size on BP_RT_Box_C_ExecuteUbergraph_BP_RT_Box");
static_assert(offsetof(BP_RT_Box_C_ExecuteUbergraph_BP_RT_Box, EntryPoint) == 0x000000, "Member 'BP_RT_Box_C_ExecuteUbergraph_BP_RT_Box::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_RT_Box_C_ExecuteUbergraph_BP_RT_Box, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_RT_Box_C_ExecuteUbergraph_BP_RT_Box::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_RT_Box_C_ExecuteUbergraph_BP_RT_Box, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_RT_Box_C_ExecuteUbergraph_BP_RT_Box::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_RT_Box_C_ExecuteUbergraph_BP_RT_Box, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_RT_Box_C_ExecuteUbergraph_BP_RT_Box::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RT_Box_C_ExecuteUbergraph_BP_RT_Box, Temp_int_Loop_Counter_Variable_1) == 0x000010, "Member 'BP_RT_Box_C_ExecuteUbergraph_BP_RT_Box::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_RT_Box_C_ExecuteUbergraph_BP_RT_Box, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'BP_RT_Box_C_ExecuteUbergraph_BP_RT_Box::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RT_Box_C_ExecuteUbergraph_BP_RT_Box, Temp_int_Array_Index_Variable_1) == 0x000018, "Member 'BP_RT_Box_C_ExecuteUbergraph_BP_RT_Box::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_RT_Box_C_ExecuteUbergraph_BP_RT_Box, K2Node_Event_OtherActor_1) == 0x000020, "Member 'BP_RT_Box_C_ExecuteUbergraph_BP_RT_Box::K2Node_Event_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_RT_Box_C_ExecuteUbergraph_BP_RT_Box, K2Node_Event_OtherActor) == 0x000028, "Member 'BP_RT_Box_C_ExecuteUbergraph_BP_RT_Box::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_RT_Box_C_ExecuteUbergraph_BP_RT_Box, K2Node_DynamicCast_AsSurvival_Player_V2) == 0x000030, "Member 'BP_RT_Box_C_ExecuteUbergraph_BP_RT_Box::K2Node_DynamicCast_AsSurvival_Player_V2' has a wrong offset!");
static_assert(offsetof(BP_RT_Box_C_ExecuteUbergraph_BP_RT_Box, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_RT_Box_C_ExecuteUbergraph_BP_RT_Box::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_RT_Box_C_ExecuteUbergraph_BP_RT_Box, K2Node_DynamicCast_AsSurvival_Player_V2_1) == 0x000040, "Member 'BP_RT_Box_C_ExecuteUbergraph_BP_RT_Box::K2Node_DynamicCast_AsSurvival_Player_V2_1' has a wrong offset!");
static_assert(offsetof(BP_RT_Box_C_ExecuteUbergraph_BP_RT_Box, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BP_RT_Box_C_ExecuteUbergraph_BP_RT_Box::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_RT_Box_C_ExecuteUbergraph_BP_RT_Box, CallFunc_GetAttachedActors_OutActors) == 0x000050, "Member 'BP_RT_Box_C_ExecuteUbergraph_BP_RT_Box::CallFunc_GetAttachedActors_OutActors' has a wrong offset!");
static_assert(offsetof(BP_RT_Box_C_ExecuteUbergraph_BP_RT_Box, CallFunc_GetAttachedActors_OutActors_1) == 0x000060, "Member 'BP_RT_Box_C_ExecuteUbergraph_BP_RT_Box::CallFunc_GetAttachedActors_OutActors_1' has a wrong offset!");
static_assert(offsetof(BP_RT_Box_C_ExecuteUbergraph_BP_RT_Box, CallFunc_Array_Get_Item) == 0x000070, "Member 'BP_RT_Box_C_ExecuteUbergraph_BP_RT_Box::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_RT_Box_C_ExecuteUbergraph_BP_RT_Box, CallFunc_Array_Get_Item_1) == 0x000078, "Member 'BP_RT_Box_C_ExecuteUbergraph_BP_RT_Box::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_RT_Box_C_ExecuteUbergraph_BP_RT_Box, K2Node_DynamicCast_AsBP_RT_Manager_Scene_Capture) == 0x000080, "Member 'BP_RT_Box_C_ExecuteUbergraph_BP_RT_Box::K2Node_DynamicCast_AsBP_RT_Manager_Scene_Capture' has a wrong offset!");
static_assert(offsetof(BP_RT_Box_C_ExecuteUbergraph_BP_RT_Box, K2Node_DynamicCast_bSuccess_2) == 0x000088, "Member 'BP_RT_Box_C_ExecuteUbergraph_BP_RT_Box::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_RT_Box_C_ExecuteUbergraph_BP_RT_Box, K2Node_DynamicCast_AsBP_RT_Manager_Scene_Capture_1) == 0x000090, "Member 'BP_RT_Box_C_ExecuteUbergraph_BP_RT_Box::K2Node_DynamicCast_AsBP_RT_Manager_Scene_Capture_1' has a wrong offset!");
static_assert(offsetof(BP_RT_Box_C_ExecuteUbergraph_BP_RT_Box, K2Node_DynamicCast_bSuccess_3) == 0x000098, "Member 'BP_RT_Box_C_ExecuteUbergraph_BP_RT_Box::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_RT_Box_C_ExecuteUbergraph_BP_RT_Box, CallFunc_Array_Length_ReturnValue) == 0x00009C, "Member 'BP_RT_Box_C_ExecuteUbergraph_BP_RT_Box::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RT_Box_C_ExecuteUbergraph_BP_RT_Box, CallFunc_Array_Length_ReturnValue_1) == 0x0000A0, "Member 'BP_RT_Box_C_ExecuteUbergraph_BP_RT_Box::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RT_Box_C_ExecuteUbergraph_BP_RT_Box, CallFunc_Less_IntInt_ReturnValue) == 0x0000A4, "Member 'BP_RT_Box_C_ExecuteUbergraph_BP_RT_Box::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RT_Box_C_ExecuteUbergraph_BP_RT_Box, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000A5, "Member 'BP_RT_Box_C_ExecuteUbergraph_BP_RT_Box::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RT_Box_C_ExecuteUbergraph_BP_RT_Box, CallFunc_IsServer_ReturnValue) == 0x0000A6, "Member 'BP_RT_Box_C_ExecuteUbergraph_BP_RT_Box::CallFunc_IsServer_ReturnValue' has a wrong offset!");

// Function BP_RT_Box.BP_RT_Box_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct BP_RT_Box_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RT_Box_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on BP_RT_Box_C_ReceiveActorBeginOverlap");
static_assert(sizeof(BP_RT_Box_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on BP_RT_Box_C_ReceiveActorBeginOverlap");
static_assert(offsetof(BP_RT_Box_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'BP_RT_Box_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

// Function BP_RT_Box.BP_RT_Box_C.ReceiveActorEndOverlap
// 0x0008 (0x0008 - 0x0000)
struct BP_RT_Box_C_ReceiveActorEndOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RT_Box_C_ReceiveActorEndOverlap) == 0x000008, "Wrong alignment on BP_RT_Box_C_ReceiveActorEndOverlap");
static_assert(sizeof(BP_RT_Box_C_ReceiveActorEndOverlap) == 0x000008, "Wrong size on BP_RT_Box_C_ReceiveActorEndOverlap");
static_assert(offsetof(BP_RT_Box_C_ReceiveActorEndOverlap, OtherActor) == 0x000000, "Member 'BP_RT_Box_C_ReceiveActorEndOverlap::OtherActor' has a wrong offset!");

}

