#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RB_Vehicle

#include "Basic.hpp"

#include "E_ActorType_structs.hpp"
#include "Engine_structs.hpp"
#include "E_InteractType_structs.hpp"
#include "E_SitsType_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FMODStudio_structs.hpp"
#include "CarHit_structs.hpp"
#include "S_VehicleSit_structs.hpp"
#include "InputCore_structs.hpp"
#include "S_VehicleState_structs.hpp"
#include "DropItemEntry_structs.hpp"


namespace SDK::Params
{

// Function BP_RB_Vehicle.BP_RB_Vehicle_C.AntiRoll
// 0x0100 (0x0100 - 0x0000)
struct BP_RB_Vehicle_C_AntiRoll final
{
public:
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0000(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetPhysicsAngularVelocityInDegrees_ReturnValue; // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_InverseTransformDirection_ReturnValue;    // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformDirection_ReturnValue;           // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RB_Vehicle_C_AntiRoll) == 0x000010, "Wrong alignment on BP_RB_Vehicle_C_AntiRoll");
static_assert(sizeof(BP_RB_Vehicle_C_AntiRoll) == 0x000100, "Wrong size on BP_RB_Vehicle_C_AntiRoll");
static_assert(offsetof(BP_RB_Vehicle_C_AntiRoll, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000000, "Member 'BP_RB_Vehicle_C_AntiRoll::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_AntiRoll, CallFunc_GetPhysicsAngularVelocityInDegrees_ReturnValue) == 0x000060, "Member 'BP_RB_Vehicle_C_AntiRoll::CallFunc_GetPhysicsAngularVelocityInDegrees_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_AntiRoll, CallFunc_BooleanAND_ReturnValue) == 0x000078, "Member 'BP_RB_Vehicle_C_AntiRoll::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_AntiRoll, CallFunc_InverseTransformDirection_ReturnValue) == 0x000080, "Member 'BP_RB_Vehicle_C_AntiRoll::CallFunc_InverseTransformDirection_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_AntiRoll, CallFunc_BooleanAND_ReturnValue_1) == 0x000098, "Member 'BP_RB_Vehicle_C_AntiRoll::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_AntiRoll, CallFunc_BreakVector_X) == 0x0000A0, "Member 'BP_RB_Vehicle_C_AntiRoll::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_AntiRoll, CallFunc_BreakVector_Y) == 0x0000A8, "Member 'BP_RB_Vehicle_C_AntiRoll::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_AntiRoll, CallFunc_BreakVector_Z) == 0x0000B0, "Member 'BP_RB_Vehicle_C_AntiRoll::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_AntiRoll, CallFunc_BooleanAND_ReturnValue_2) == 0x0000B8, "Member 'BP_RB_Vehicle_C_AntiRoll::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_AntiRoll, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000C0, "Member 'BP_RB_Vehicle_C_AntiRoll::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_AntiRoll, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0000C8, "Member 'BP_RB_Vehicle_C_AntiRoll::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_AntiRoll, CallFunc_MakeVector_ReturnValue) == 0x0000D0, "Member 'BP_RB_Vehicle_C_AntiRoll::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_AntiRoll, CallFunc_TransformDirection_ReturnValue) == 0x0000E8, "Member 'BP_RB_Vehicle_C_AntiRoll::CallFunc_TransformDirection_ReturnValue' has a wrong offset!");

// Function BP_RB_Vehicle.BP_RB_Vehicle_C.BlockWheel
// 0x0050 (0x0050 - 0x0000)
struct BP_RB_Vehicle_C_BlockWheel final
{
public:
	class UPhysicsConstraintComponent*            WheelConstraint;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Param_IsHandbraking;                               // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsBroken;                                          // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetAngularDriveParams_VelocityStrength_ImplicitCast; // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RB_Vehicle_C_BlockWheel) == 0x000008, "Wrong alignment on BP_RB_Vehicle_C_BlockWheel");
static_assert(sizeof(BP_RB_Vehicle_C_BlockWheel) == 0x000050, "Wrong size on BP_RB_Vehicle_C_BlockWheel");
static_assert(offsetof(BP_RB_Vehicle_C_BlockWheel, WheelConstraint) == 0x000000, "Member 'BP_RB_Vehicle_C_BlockWheel::WheelConstraint' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_BlockWheel, Param_IsHandbraking) == 0x000008, "Member 'BP_RB_Vehicle_C_BlockWheel::Param_IsHandbraking' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_BlockWheel, IsBroken) == 0x000009, "Member 'BP_RB_Vehicle_C_BlockWheel::IsBroken' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_BlockWheel, Temp_real_Variable) == 0x000010, "Member 'BP_RB_Vehicle_C_BlockWheel::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_BlockWheel, CallFunc_BooleanOR_ReturnValue) == 0x000018, "Member 'BP_RB_Vehicle_C_BlockWheel::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_BlockWheel, CallFunc_MakeVector_ReturnValue) == 0x000020, "Member 'BP_RB_Vehicle_C_BlockWheel::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_BlockWheel, Temp_bool_Variable) == 0x000038, "Member 'BP_RB_Vehicle_C_BlockWheel::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_BlockWheel, K2Node_Select_Default) == 0x000040, "Member 'BP_RB_Vehicle_C_BlockWheel::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_BlockWheel, CallFunc_SetAngularDriveParams_VelocityStrength_ImplicitCast) == 0x000048, "Member 'BP_RB_Vehicle_C_BlockWheel::CallFunc_SetAngularDriveParams_VelocityStrength_ImplicitCast' has a wrong offset!");

// Function BP_RB_Vehicle.BP_RB_Vehicle_C.BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct BP_RB_Vehicle_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_RB_Vehicle_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_RB_Vehicle_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_RB_Vehicle_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on BP_RB_Vehicle_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_RB_Vehicle_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_RB_Vehicle_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_RB_Vehicle_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_RB_Vehicle_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_RB_Vehicle_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_RB_Vehicle_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_RB_Vehicle_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_RB_Vehicle.BP_RB_Vehicle_C.BndEvt__ForntCollision_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct BP_RB_Vehicle_C_BndEvt__ForntCollision_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_RB_Vehicle_C_BndEvt__ForntCollision_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_RB_Vehicle_C_BndEvt__ForntCollision_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_RB_Vehicle_C_BndEvt__ForntCollision_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on BP_RB_Vehicle_C_BndEvt__ForntCollision_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_RB_Vehicle_C_BndEvt__ForntCollision_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_RB_Vehicle_C_BndEvt__ForntCollision_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_BndEvt__ForntCollision_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_RB_Vehicle_C_BndEvt__ForntCollision_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_BndEvt__ForntCollision_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_RB_Vehicle_C_BndEvt__ForntCollision_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_BndEvt__ForntCollision_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_RB_Vehicle_C_BndEvt__ForntCollision_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_BndEvt__ForntCollision_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_RB_Vehicle_C_BndEvt__ForntCollision_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_BndEvt__ForntCollision_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_RB_Vehicle_C_BndEvt__ForntCollision_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_RB_Vehicle.BP_RB_Vehicle_C.BndEvt__Mesh_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature
// 0x0118 (0x0118 - 0x0000)
struct BP_RB_Vehicle_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Param_Hit;                                         // 0x0030(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_RB_Vehicle_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_RB_Vehicle_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature");
static_assert(sizeof(BP_RB_Vehicle_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature) == 0x000118, "Wrong size on BP_RB_Vehicle_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature");
static_assert(offsetof(BP_RB_Vehicle_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature, HitComponent) == 0x000000, "Member 'BP_RB_Vehicle_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature::HitComponent' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_RB_Vehicle_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_RB_Vehicle_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature, NormalImpulse) == 0x000018, "Member 'BP_RB_Vehicle_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature::NormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature, Param_Hit) == 0x000030, "Member 'BP_RB_Vehicle_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature::Param_Hit' has a wrong offset!");

// Function BP_RB_Vehicle.BP_RB_Vehicle_C.BndEvt__Mesh_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct BP_RB_Vehicle_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_RB_Vehicle_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_RB_Vehicle_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_RB_Vehicle_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on BP_RB_Vehicle_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_RB_Vehicle_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_RB_Vehicle_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_RB_Vehicle_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_RB_Vehicle_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_RB_Vehicle_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_RB_Vehicle_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_RB_Vehicle_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_RB_Vehicle.BP_RB_Vehicle_C.BndEvt__WheelCol_LB_K2Node_ComponentBoundEvent_10_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct BP_RB_Vehicle_C_BndEvt__WheelCol_LB_K2Node_ComponentBoundEvent_10_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_RB_Vehicle_C_BndEvt__WheelCol_LB_K2Node_ComponentBoundEvent_10_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_RB_Vehicle_C_BndEvt__WheelCol_LB_K2Node_ComponentBoundEvent_10_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_RB_Vehicle_C_BndEvt__WheelCol_LB_K2Node_ComponentBoundEvent_10_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on BP_RB_Vehicle_C_BndEvt__WheelCol_LB_K2Node_ComponentBoundEvent_10_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_RB_Vehicle_C_BndEvt__WheelCol_LB_K2Node_ComponentBoundEvent_10_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_RB_Vehicle_C_BndEvt__WheelCol_LB_K2Node_ComponentBoundEvent_10_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_BndEvt__WheelCol_LB_K2Node_ComponentBoundEvent_10_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_RB_Vehicle_C_BndEvt__WheelCol_LB_K2Node_ComponentBoundEvent_10_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_BndEvt__WheelCol_LB_K2Node_ComponentBoundEvent_10_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_RB_Vehicle_C_BndEvt__WheelCol_LB_K2Node_ComponentBoundEvent_10_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_BndEvt__WheelCol_LB_K2Node_ComponentBoundEvent_10_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_RB_Vehicle_C_BndEvt__WheelCol_LB_K2Node_ComponentBoundEvent_10_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_BndEvt__WheelCol_LB_K2Node_ComponentBoundEvent_10_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_RB_Vehicle_C_BndEvt__WheelCol_LB_K2Node_ComponentBoundEvent_10_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_BndEvt__WheelCol_LB_K2Node_ComponentBoundEvent_10_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_RB_Vehicle_C_BndEvt__WheelCol_LB_K2Node_ComponentBoundEvent_10_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_RB_Vehicle.BP_RB_Vehicle_C.BndEvt__WheelCol_LF_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct BP_RB_Vehicle_C_BndEvt__WheelCol_LF_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_RB_Vehicle_C_BndEvt__WheelCol_LF_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_RB_Vehicle_C_BndEvt__WheelCol_LF_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_RB_Vehicle_C_BndEvt__WheelCol_LF_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on BP_RB_Vehicle_C_BndEvt__WheelCol_LF_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_RB_Vehicle_C_BndEvt__WheelCol_LF_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_RB_Vehicle_C_BndEvt__WheelCol_LF_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_BndEvt__WheelCol_LF_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_RB_Vehicle_C_BndEvt__WheelCol_LF_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_BndEvt__WheelCol_LF_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_RB_Vehicle_C_BndEvt__WheelCol_LF_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_BndEvt__WheelCol_LF_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_RB_Vehicle_C_BndEvt__WheelCol_LF_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_BndEvt__WheelCol_LF_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_RB_Vehicle_C_BndEvt__WheelCol_LF_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_BndEvt__WheelCol_LF_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_RB_Vehicle_C_BndEvt__WheelCol_LF_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_RB_Vehicle.BP_RB_Vehicle_C.BndEvt__WheelCol_RB_K2Node_ComponentBoundEvent_11_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct BP_RB_Vehicle_C_BndEvt__WheelCol_RB_K2Node_ComponentBoundEvent_11_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_RB_Vehicle_C_BndEvt__WheelCol_RB_K2Node_ComponentBoundEvent_11_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_RB_Vehicle_C_BndEvt__WheelCol_RB_K2Node_ComponentBoundEvent_11_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_RB_Vehicle_C_BndEvt__WheelCol_RB_K2Node_ComponentBoundEvent_11_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on BP_RB_Vehicle_C_BndEvt__WheelCol_RB_K2Node_ComponentBoundEvent_11_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_RB_Vehicle_C_BndEvt__WheelCol_RB_K2Node_ComponentBoundEvent_11_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_RB_Vehicle_C_BndEvt__WheelCol_RB_K2Node_ComponentBoundEvent_11_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_BndEvt__WheelCol_RB_K2Node_ComponentBoundEvent_11_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_RB_Vehicle_C_BndEvt__WheelCol_RB_K2Node_ComponentBoundEvent_11_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_BndEvt__WheelCol_RB_K2Node_ComponentBoundEvent_11_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_RB_Vehicle_C_BndEvt__WheelCol_RB_K2Node_ComponentBoundEvent_11_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_BndEvt__WheelCol_RB_K2Node_ComponentBoundEvent_11_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_RB_Vehicle_C_BndEvt__WheelCol_RB_K2Node_ComponentBoundEvent_11_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_BndEvt__WheelCol_RB_K2Node_ComponentBoundEvent_11_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_RB_Vehicle_C_BndEvt__WheelCol_RB_K2Node_ComponentBoundEvent_11_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_BndEvt__WheelCol_RB_K2Node_ComponentBoundEvent_11_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_RB_Vehicle_C_BndEvt__WheelCol_RB_K2Node_ComponentBoundEvent_11_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_RB_Vehicle.BP_RB_Vehicle_C.BndEvt__WheelCol_RF_K2Node_ComponentBoundEvent_5_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct BP_RB_Vehicle_C_BndEvt__WheelCol_RF_K2Node_ComponentBoundEvent_5_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_RB_Vehicle_C_BndEvt__WheelCol_RF_K2Node_ComponentBoundEvent_5_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_RB_Vehicle_C_BndEvt__WheelCol_RF_K2Node_ComponentBoundEvent_5_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_RB_Vehicle_C_BndEvt__WheelCol_RF_K2Node_ComponentBoundEvent_5_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on BP_RB_Vehicle_C_BndEvt__WheelCol_RF_K2Node_ComponentBoundEvent_5_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_RB_Vehicle_C_BndEvt__WheelCol_RF_K2Node_ComponentBoundEvent_5_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_RB_Vehicle_C_BndEvt__WheelCol_RF_K2Node_ComponentBoundEvent_5_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_BndEvt__WheelCol_RF_K2Node_ComponentBoundEvent_5_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_RB_Vehicle_C_BndEvt__WheelCol_RF_K2Node_ComponentBoundEvent_5_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_BndEvt__WheelCol_RF_K2Node_ComponentBoundEvent_5_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_RB_Vehicle_C_BndEvt__WheelCol_RF_K2Node_ComponentBoundEvent_5_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_BndEvt__WheelCol_RF_K2Node_ComponentBoundEvent_5_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_RB_Vehicle_C_BndEvt__WheelCol_RF_K2Node_ComponentBoundEvent_5_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_BndEvt__WheelCol_RF_K2Node_ComponentBoundEvent_5_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_RB_Vehicle_C_BndEvt__WheelCol_RF_K2Node_ComponentBoundEvent_5_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_BndEvt__WheelCol_RF_K2Node_ComponentBoundEvent_5_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_RB_Vehicle_C_BndEvt__WheelCol_RF_K2Node_ComponentBoundEvent_5_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_RB_Vehicle.BP_RB_Vehicle_C.CalculateRPM
// 0x0058 (0x0058 - 0x0000)
struct BP_RB_Vehicle_C_CalculateRPM final
{
public:
	double                                        SelectedInput;                                     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetInputAxisValue_ReturnValue;            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsIdleRPM_IdleReached;                    // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_IncreaseRPM_NewRPM;                       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_DecreaseRPM_NewRPM;                       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Option_1_ImplicitCast;               // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RB_Vehicle_C_CalculateRPM) == 0x000008, "Wrong alignment on BP_RB_Vehicle_C_CalculateRPM");
static_assert(sizeof(BP_RB_Vehicle_C_CalculateRPM) == 0x000058, "Wrong size on BP_RB_Vehicle_C_CalculateRPM");
static_assert(offsetof(BP_RB_Vehicle_C_CalculateRPM, SelectedInput) == 0x000000, "Member 'BP_RB_Vehicle_C_CalculateRPM::SelectedInput' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_CalculateRPM, Temp_bool_Variable) == 0x000008, "Member 'BP_RB_Vehicle_C_CalculateRPM::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_CalculateRPM, CallFunc_Abs_ReturnValue) == 0x000010, "Member 'BP_RB_Vehicle_C_CalculateRPM::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_CalculateRPM, Temp_real_Variable) == 0x000018, "Member 'BP_RB_Vehicle_C_CalculateRPM::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_CalculateRPM, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000020, "Member 'BP_RB_Vehicle_C_CalculateRPM::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_CalculateRPM, CallFunc_GetInputAxisValue_ReturnValue) == 0x000024, "Member 'BP_RB_Vehicle_C_CalculateRPM::CallFunc_GetInputAxisValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_CalculateRPM, CallFunc_Not_PreBool_ReturnValue) == 0x000028, "Member 'BP_RB_Vehicle_C_CalculateRPM::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_CalculateRPM, CallFunc_BooleanAND_ReturnValue) == 0x000029, "Member 'BP_RB_Vehicle_C_CalculateRPM::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_CalculateRPM, K2Node_Select_Default) == 0x000030, "Member 'BP_RB_Vehicle_C_CalculateRPM::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_CalculateRPM, CallFunc_Not_PreBool_ReturnValue_1) == 0x000038, "Member 'BP_RB_Vehicle_C_CalculateRPM::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_CalculateRPM, CallFunc_BooleanAND_ReturnValue_1) == 0x000039, "Member 'BP_RB_Vehicle_C_CalculateRPM::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_CalculateRPM, CallFunc_IsIdleRPM_IdleReached) == 0x00003A, "Member 'BP_RB_Vehicle_C_CalculateRPM::CallFunc_IsIdleRPM_IdleReached' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_CalculateRPM, CallFunc_IncreaseRPM_NewRPM) == 0x000040, "Member 'BP_RB_Vehicle_C_CalculateRPM::CallFunc_IncreaseRPM_NewRPM' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_CalculateRPM, CallFunc_DecreaseRPM_NewRPM) == 0x000048, "Member 'BP_RB_Vehicle_C_CalculateRPM::CallFunc_DecreaseRPM_NewRPM' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_CalculateRPM, K2Node_Select_Option_1_ImplicitCast) == 0x000050, "Member 'BP_RB_Vehicle_C_CalculateRPM::K2Node_Select_Option_1_ImplicitCast' has a wrong offset!");

// Function BP_RB_Vehicle.BP_RB_Vehicle_C.ChangeSit
// 0x0010 (0x0010 - 0x0000)
struct BP_RB_Vehicle_C_ChangeSit final
{
public:
	int32                                         SitIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      Player;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RB_Vehicle_C_ChangeSit) == 0x000008, "Wrong alignment on BP_RB_Vehicle_C_ChangeSit");
static_assert(sizeof(BP_RB_Vehicle_C_ChangeSit) == 0x000010, "Wrong size on BP_RB_Vehicle_C_ChangeSit");
static_assert(offsetof(BP_RB_Vehicle_C_ChangeSit, SitIndex) == 0x000000, "Member 'BP_RB_Vehicle_C_ChangeSit::SitIndex' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_ChangeSit, Player) == 0x000008, "Member 'BP_RB_Vehicle_C_ChangeSit::Player' has a wrong offset!");

// Function BP_RB_Vehicle.BP_RB_Vehicle_C.ChangeViewTargetWithDelay
// 0x0010 (0x0010 - 0x0000)
struct BP_RB_Vehicle_C_ChangeViewTargetWithDelay final
{
public:
	double                                        Delay;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  NewViewTarget;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RB_Vehicle_C_ChangeViewTargetWithDelay) == 0x000008, "Wrong alignment on BP_RB_Vehicle_C_ChangeViewTargetWithDelay");
static_assert(sizeof(BP_RB_Vehicle_C_ChangeViewTargetWithDelay) == 0x000010, "Wrong size on BP_RB_Vehicle_C_ChangeViewTargetWithDelay");
static_assert(offsetof(BP_RB_Vehicle_C_ChangeViewTargetWithDelay, Delay) == 0x000000, "Member 'BP_RB_Vehicle_C_ChangeViewTargetWithDelay::Delay' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_ChangeViewTargetWithDelay, NewViewTarget) == 0x000008, "Member 'BP_RB_Vehicle_C_ChangeViewTargetWithDelay::NewViewTarget' has a wrong offset!");

// Function BP_RB_Vehicle.BP_RB_Vehicle_C.CheckAndSetPlayRadio
// 0x0010 (0x0010 - 0x0000)
struct BP_RB_Vehicle_C_CheckAndSetPlayRadio final
{
public:
	bool                                          NewPlay;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      PassengerPlayerController;                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RB_Vehicle_C_CheckAndSetPlayRadio) == 0x000008, "Wrong alignment on BP_RB_Vehicle_C_CheckAndSetPlayRadio");
static_assert(sizeof(BP_RB_Vehicle_C_CheckAndSetPlayRadio) == 0x000010, "Wrong size on BP_RB_Vehicle_C_CheckAndSetPlayRadio");
static_assert(offsetof(BP_RB_Vehicle_C_CheckAndSetPlayRadio, NewPlay) == 0x000000, "Member 'BP_RB_Vehicle_C_CheckAndSetPlayRadio::NewPlay' has a wrong offset!");
static_assert(offsetof(BP_RB_Vehicle_C_CheckAndSetPlayRadio, PassengerPlayerController) == 0x000008, "Member 'BP_RB_Vehicle_C_CheckAndSetPlayRadio::PassengerPlayerController' has a wrong offset!");

// Function BP_RB_Vehicle.BP_RB_Vehicle_C.CheckPlayerSit
// 0x00D0 (0x00D0 - 0x0000)
struct BP_RB_Vehicle_C_CheckPlayerSit final
{
public:
	class ASurvivalPlayer_C*                      Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CanEnterVehicle;                                   // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SitIndex;                                          // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TempSitIndex;                                      // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0020(0x0010)(ConstParm, ReferenceParm)
	E_SitsType                                    Temp_byte_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43[0x1];                                       // 0x0043(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_4;                               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_1;                              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ConstParm, ReferenceParm)
	E_SitsType                                    Temp_byte_Variable_1;                              // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
