#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Shops

#include "Basic.hpp"

#include "E_InteractType_structs.hpp"
#include "F_DialogueNodeInfo_structs.hpp"
#include "E_BaseContainerType_structs.hpp"
#include "E_ActorType_structs.hpp"
#include "ContainerPickupsInfo_structs.hpp"
#include "NPC_Structure_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FItemInfo_structs.hpp"
#include "S_CategoryData_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "E_ReasonForCancelingTransaction_structs.hpp"
#include "ELootTypes_structs.hpp"
#include "S_ShopItemList_structs.hpp"
#include "E_Shops_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FMODStudio_structs.hpp"


namespace SDK::Params
{

// Function BP_Shops.BP_Shops_C.AddBuyback
// 0x0070 (0x0070 - 0x0000)
struct BP_Shops_C_AddBuyback final
{
public:
	struct FContainerPickupsInfo                  Param_PickupsBuybackItems;                         // 0x0000(0x0068)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Shops_C_AddBuyback) == 0x000008, "Wrong alignment on BP_Shops_C_AddBuyback");
static_assert(sizeof(BP_Shops_C_AddBuyback) == 0x000070, "Wrong size on BP_Shops_C_AddBuyback");
static_assert(offsetof(BP_Shops_C_AddBuyback, Param_PickupsBuybackItems) == 0x000000, "Member 'BP_Shops_C_AddBuyback::Param_PickupsBuybackItems' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_AddBuyback, CallFunc_Array_Add_ReturnValue) == 0x000068, "Member 'BP_Shops_C_AddBuyback::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_Shops.BP_Shops_C.AddBuybackItem
// 0x0228 (0x0228 - 0x0000)
struct BP_Shops_C_AddBuybackItem final
{
public:
	struct FFItemInfo                             Item;                                              // 0x0000(0x0220)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Shops_C_AddBuybackItem) == 0x000008, "Wrong alignment on BP_Shops_C_AddBuybackItem");
static_assert(sizeof(BP_Shops_C_AddBuybackItem) == 0x000228, "Wrong size on BP_Shops_C_AddBuybackItem");
static_assert(offsetof(BP_Shops_C_AddBuybackItem, Item) == 0x000000, "Member 'BP_Shops_C_AddBuybackItem::Item' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_AddBuybackItem, CallFunc_Array_Add_ReturnValue) == 0x000220, "Member 'BP_Shops_C_AddBuybackItem::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_Shops.BP_Shops_C.AddMoney
// 0x0008 (0x0008 - 0x0000)
struct BP_Shops_C_AddMoney final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Shops_C_AddMoney) == 0x000004, "Wrong alignment on BP_Shops_C_AddMoney");
static_assert(sizeof(BP_Shops_C_AddMoney) == 0x000008, "Wrong size on BP_Shops_C_AddMoney");
static_assert(offsetof(BP_Shops_C_AddMoney, Value) == 0x000000, "Member 'BP_Shops_C_AddMoney::Value' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_AddMoney, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'BP_Shops_C_AddMoney::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_Shops.BP_Shops_C.AddMoneyLikeItem
// 0x0298 (0x0298 - 0x0000)
struct BP_Shops_C_AddMoneyLikeItem final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             CallFunc_GetDataTableRowFromName_OutRow;           // 0x0008(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FContainerPickupsInfo                  K2Node_MakeStruct_ContainerPickupsInfo;            // 0x0230(0x0068)(ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(BP_Shops_C_AddMoneyLikeItem) == 0x000008, "Wrong alignment on BP_Shops_C_AddMoneyLikeItem");
static_assert(sizeof(BP_Shops_C_AddMoneyLikeItem) == 0x000298, "Wrong size on BP_Shops_C_AddMoneyLikeItem");
static_assert(offsetof(BP_Shops_C_AddMoneyLikeItem, Temp_int_Variable) == 0x000000, "Member 'BP_Shops_C_AddMoneyLikeItem::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_AddMoneyLikeItem, CallFunc_GetDataTableRowFromName_OutRow) == 0x000008, "Member 'BP_Shops_C_AddMoneyLikeItem::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_AddMoneyLikeItem, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000228, "Member 'BP_Shops_C_AddMoneyLikeItem::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_AddMoneyLikeItem, K2Node_MakeStruct_ContainerPickupsInfo) == 0x000230, "Member 'BP_Shops_C_AddMoneyLikeItem::K2Node_MakeStruct_ContainerPickupsInfo' has a wrong offset!");

// Function BP_Shops.BP_Shops_C.BndEvt__BP_DoorTeleport_TipBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct BP_Shops_C_BndEvt__BP_DoorTeleport_TipBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Shops_C_BndEvt__BP_DoorTeleport_TipBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Shops_C_BndEvt__BP_DoorTeleport_TipBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_Shops_C_BndEvt__BP_DoorTeleport_TipBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on BP_Shops_C_BndEvt__BP_DoorTeleport_TipBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_Shops_C_BndEvt__BP_DoorTeleport_TipBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_Shops_C_BndEvt__BP_DoorTeleport_TipBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_BndEvt__BP_DoorTeleport_TipBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_Shops_C_BndEvt__BP_DoorTeleport_TipBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_BndEvt__BP_DoorTeleport_TipBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_Shops_C_BndEvt__BP_DoorTeleport_TipBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_BndEvt__BP_DoorTeleport_TipBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_Shops_C_BndEvt__BP_DoorTeleport_TipBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_BndEvt__BP_DoorTeleport_TipBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_Shops_C_BndEvt__BP_DoorTeleport_TipBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_BndEvt__BP_DoorTeleport_TipBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_Shops_C_BndEvt__BP_DoorTeleport_TipBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_Shops.BP_Shops_C.BndEvt__BP_Shops_TipBox_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_Shops_C_BndEvt__BP_Shops_TipBox_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Shops_C_BndEvt__BP_Shops_TipBox_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Shops_C_BndEvt__BP_Shops_TipBox_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_Shops_C_BndEvt__BP_Shops_TipBox_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BP_Shops_C_BndEvt__BP_Shops_TipBox_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_Shops_C_BndEvt__BP_Shops_TipBox_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_Shops_C_BndEvt__BP_Shops_TipBox_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_BndEvt__BP_Shops_TipBox_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_Shops_C_BndEvt__BP_Shops_TipBox_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_BndEvt__BP_Shops_TipBox_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_Shops_C_BndEvt__BP_Shops_TipBox_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_BndEvt__BP_Shops_TipBox_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_Shops_C_BndEvt__BP_Shops_TipBox_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BP_Shops.BP_Shops_C.Cached Data for Shop
// 0x0150 (0x0150 - 0x0000)
struct BP_Shops_C_Cached_Data_for_Shop final
{
public:
	bool                                          All;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CategoryName;                                      // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalSlotIndex;                                    // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EquipmentSlotCol;                                  // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EquipmentSlotRow;                                  // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJSI_Slot_C*                            CurrentJSI_Slot;                                   // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_isRotated__ReturnValue;                   // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetItemCategory_CategoryName;             // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FContainerPickupsInfo                  K2Node_MakeStruct_ContainerPickupsInfo;            // 0x0058(0x0068)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FContainerPickupsInfo                  K2Node_SetFieldsInStruct_StructOut;                // 0x00C8(0x0068)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJSI_Slot_C*                            CallFunc_Array_Get_Item;                           // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Shops_C_Cached_Data_for_Shop) == 0x000008, "Wrong alignment on BP_Shops_C_Cached_Data_for_Shop");
static_assert(sizeof(BP_Shops_C_Cached_Data_for_Shop) == 0x000150, "Wrong size on BP_Shops_C_Cached_Data_for_Shop");
static_assert(offsetof(BP_Shops_C_Cached_Data_for_Shop, All) == 0x000000, "Member 'BP_Shops_C_Cached_Data_for_Shop::All' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_Cached_Data_for_Shop, CategoryName) == 0x000004, "Member 'BP_Shops_C_Cached_Data_for_Shop::CategoryName' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_Cached_Data_for_Shop, LocalSlotIndex) == 0x00000C, "Member 'BP_Shops_C_Cached_Data_for_Shop::LocalSlotIndex' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_Cached_Data_for_Shop, EquipmentSlotCol) == 0x000010, "Member 'BP_Shops_C_Cached_Data_for_Shop::EquipmentSlotCol' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_Cached_Data_for_Shop, EquipmentSlotRow) == 0x000014, "Member 'BP_Shops_C_Cached_Data_for_Shop::EquipmentSlotRow' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_Cached_Data_for_Shop, CurrentJSI_Slot) == 0x000018, "Member 'BP_Shops_C_Cached_Data_for_Shop::CurrentJSI_Slot' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_Cached_Data_for_Shop, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'BP_Shops_C_Cached_Data_for_Shop::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_Cached_Data_for_Shop, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'BP_Shops_C_Cached_Data_for_Shop::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_Cached_Data_for_Shop, Temp_int_Array_Index_Variable) == 0x000028, "Member 'BP_Shops_C_Cached_Data_for_Shop::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_Cached_Data_for_Shop, Temp_int_Variable) == 0x00002C, "Member 'BP_Shops_C_Cached_Data_for_Shop::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_Cached_Data_for_Shop, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000030, "Member 'BP_Shops_C_Cached_Data_for_Shop::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_Cached_Data_for_Shop, CallFunc_Add_IntInt_ReturnValue_1) == 0x000034, "Member 'BP_Shops_C_Cached_Data_for_Shop::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_Cached_Data_for_Shop, CallFunc_Conv_IntToString_ReturnValue) == 0x000038, "Member 'BP_Shops_C_Cached_Data_for_Shop::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_Cached_Data_for_Shop, CallFunc_isRotated__ReturnValue) == 0x000048, "Member 'BP_Shops_C_Cached_Data_for_Shop::CallFunc_isRotated__ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_Cached_Data_for_Shop, CallFunc_GetItemCategory_CategoryName) == 0x00004C, "Member 'BP_Shops_C_Cached_Data_for_Shop::CallFunc_GetItemCategory_CategoryName' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_Cached_Data_for_Shop, K2Node_MakeStruct_ContainerPickupsInfo) == 0x000058, "Member 'BP_Shops_C_Cached_Data_for_Shop::K2Node_MakeStruct_ContainerPickupsInfo' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_Cached_Data_for_Shop, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0000C0, "Member 'BP_Shops_C_Cached_Data_for_Shop::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_Cached_Data_for_Shop, K2Node_SetFieldsInStruct_StructOut) == 0x0000C8, "Member 'BP_Shops_C_Cached_Data_for_Shop::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_Cached_Data_for_Shop, CallFunc_IsValid_ReturnValue) == 0x000130, "Member 'BP_Shops_C_Cached_Data_for_Shop::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_Cached_Data_for_Shop, CallFunc_Add_IntInt_ReturnValue_2) == 0x000134, "Member 'BP_Shops_C_Cached_Data_for_Shop::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_Cached_Data_for_Shop, CallFunc_Array_Length_ReturnValue) == 0x000138, "Member 'BP_Shops_C_Cached_Data_for_Shop::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_Cached_Data_for_Shop, CallFunc_Array_Get_Item) == 0x000140, "Member 'BP_Shops_C_Cached_Data_for_Shop::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_Cached_Data_for_Shop, CallFunc_Less_IntInt_ReturnValue) == 0x000148, "Member 'BP_Shops_C_Cached_Data_for_Shop::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_Shops.BP_Shops_C.CalculatePlayerMoney
// 0x0050 (0x0050 - 0x0000)
struct BP_Shops_C_CalculatePlayerMoney final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC;                  // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      CallFunc_GetPlayerRef_SurvivalPlayer;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJSI_Slot_C*                            CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Shops_C_CalculatePlayerMoney) == 0x000008, "Wrong alignment on BP_Shops_C_CalculatePlayerMoney");
static_assert(sizeof(BP_Shops_C_CalculatePlayerMoney) == 0x000050, "Wrong size on BP_Shops_C_CalculatePlayerMoney");
static_assert(offsetof(BP_Shops_C_CalculatePlayerMoney, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_Shops_C_CalculatePlayerMoney::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_CalculatePlayerMoney, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_Shops_C_CalculatePlayerMoney::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_CalculatePlayerMoney, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_Shops_C_CalculatePlayerMoney::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_CalculatePlayerMoney, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'BP_Shops_C_CalculatePlayerMoney::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_CalculatePlayerMoney, K2Node_DynamicCast_AsBPI_Surv_PC) == 0x000018, "Member 'BP_Shops_C_CalculatePlayerMoney::K2Node_DynamicCast_AsBPI_Surv_PC' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_CalculatePlayerMoney, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_Shops_C_CalculatePlayerMoney::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_CalculatePlayerMoney, CallFunc_GetPlayerRef_SurvivalPlayer) == 0x000030, "Member 'BP_Shops_C_CalculatePlayerMoney::CallFunc_GetPlayerRef_SurvivalPlayer' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_CalculatePlayerMoney, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'BP_Shops_C_CalculatePlayerMoney::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_CalculatePlayerMoney, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_Shops_C_CalculatePlayerMoney::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_CalculatePlayerMoney, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'BP_Shops_C_CalculatePlayerMoney::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_CalculatePlayerMoney, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000049, "Member 'BP_Shops_C_CalculatePlayerMoney::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_CalculatePlayerMoney, CallFunc_Add_IntInt_ReturnValue_1) == 0x00004C, "Member 'BP_Shops_C_CalculatePlayerMoney::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_Shops.BP_Shops_C.ChangeKeyForData
// 0x0440 (0x0440 - 0x0000)
struct BP_Shops_C_ChangeKeyForData final
{
public:
	E_BaseContainerType                           ContainerType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         OldIndex;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewIndex;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, struct FContainerPickupsInfo>     NewLocalVar_0;                                     // 0x0010(0x0050)(Edit, BlueprintVisible, ContainsInstancedReference)
	class FString                                 ForDebug;                                          // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FContainerPickupsInfo                  CachedData;                                        // 0x0070(0x0068)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x00DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue_1;                 // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FContainerPickupsInfo                  CallFunc_Map_Find_Value;                           // 0x00E0(0x0068)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FContainerPickupsInfo                  K2Node_Copy_ReturnValue;                           // 0x0150(0x0068)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FContainerPickupsInfo                  K2Node_SetFieldsInStruct_StructOut;                // 0x01B8(0x0068)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FContainerPickupsInfo                  CallFunc_Map_Find_Value_1;                         // 0x0220(0x0068)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FContainerPickupsInfo                  K2Node_SetFieldsInStruct_StructOut_1;              // 0x0290(0x0068)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue_2;                 // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FContainerPickupsInfo                  CallFunc_Map_Find_Value_2;                         // 0x0300(0x0068)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_2;                   // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_369[0x7];                                      // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FContainerPickupsInfo                  K2Node_Copy_ReturnValue_1;                         // 0x0370(0x0068)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FContainerPickupsInfo                  K2Node_SetFieldsInStruct_StructOut_2;              // 0x03D8(0x0068)(ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(BP_Shops_C_ChangeKeyForData) == 0x000008, "Wrong alignment on BP_Shops_C_ChangeKeyForData");
static_assert(sizeof(BP_Shops_C_ChangeKeyForData) == 0x000440, "Wrong size on BP_Shops_C_ChangeKeyForData");
static_assert(offsetof(BP_Shops_C_ChangeKeyForData, ContainerType) == 0x000000, "Member 'BP_Shops_C_ChangeKeyForData::ContainerType' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_ChangeKeyForData, OldIndex) == 0x000004, "Member 'BP_Shops_C_ChangeKeyForData::OldIndex' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_ChangeKeyForData, NewIndex) == 0x000008, "Member 'BP_Shops_C_ChangeKeyForData::NewIndex' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_ChangeKeyForData, NewLocalVar_0) == 0x000010, "Member 'BP_Shops_C_ChangeKeyForData::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_ChangeKeyForData, ForDebug) == 0x000060, "Member 'BP_Shops_C_ChangeKeyForData::ForDebug' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_ChangeKeyForData, CachedData) == 0x000070, "Member 'BP_Shops_C_ChangeKeyForData::CachedData' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_ChangeKeyForData, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000D8, "Member 'BP_Shops_C_ChangeKeyForData::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_ChangeKeyForData, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0000D9, "Member 'BP_Shops_C_ChangeKeyForData::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_ChangeKeyForData, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x0000DA, "Member 'BP_Shops_C_ChangeKeyForData::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_ChangeKeyForData, CallFunc_Map_Remove_ReturnValue) == 0x0000DB, "Member 'BP_Shops_C_ChangeKeyForData::CallFunc_Map_Remove_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_ChangeKeyForData, CallFunc_Map_Remove_ReturnValue_1) == 0x0000DC, "Member 'BP_Shops_C_ChangeKeyForData::CallFunc_Map_Remove_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_ChangeKeyForData, CallFunc_Map_Find_Value) == 0x0000E0, "Member 'BP_Shops_C_ChangeKeyForData::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_ChangeKeyForData, CallFunc_Map_Find_ReturnValue) == 0x000148, "Member 'BP_Shops_C_ChangeKeyForData::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_ChangeKeyForData, K2Node_Copy_ReturnValue) == 0x000150, "Member 'BP_Shops_C_ChangeKeyForData::K2Node_Copy_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_ChangeKeyForData, K2Node_SetFieldsInStruct_StructOut) == 0x0001B8, "Member 'BP_Shops_C_ChangeKeyForData::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_ChangeKeyForData, CallFunc_Map_Find_Value_1) == 0x000220, "Member 'BP_Shops_C_ChangeKeyForData::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_ChangeKeyForData, CallFunc_Map_Find_ReturnValue_1) == 0x000288, "Member 'BP_Shops_C_ChangeKeyForData::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_ChangeKeyForData, K2Node_SetFieldsInStruct_StructOut_1) == 0x000290, "Member 'BP_Shops_C_ChangeKeyForData::K2Node_SetFieldsInStruct_StructOut_1' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_ChangeKeyForData, CallFunc_Map_Remove_ReturnValue_2) == 0x0002F8, "Member 'BP_Shops_C_ChangeKeyForData::CallFunc_Map_Remove_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_ChangeKeyForData, CallFunc_Map_Find_Value_2) == 0x000300, "Member 'BP_Shops_C_ChangeKeyForData::CallFunc_Map_Find_Value_2' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_ChangeKeyForData, CallFunc_Map_Find_ReturnValue_2) == 0x000368, "Member 'BP_Shops_C_ChangeKeyForData::CallFunc_Map_Find_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_ChangeKeyForData, K2Node_Copy_ReturnValue_1) == 0x000370, "Member 'BP_Shops_C_ChangeKeyForData::K2Node_Copy_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_ChangeKeyForData, K2Node_SetFieldsInStruct_StructOut_2) == 0x0003D8, "Member 'BP_Shops_C_ChangeKeyForData::K2Node_SetFieldsInStruct_StructOut_2' has a wrong offset!");

// Function BP_Shops.BP_Shops_C.CompleteQuest
// 0x0008 (0x0008 - 0x0000)
struct BP_Shops_C_CompleteQuest final
{
public:
	int32                                         QuestIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ObjectiveIndex;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Shops_C_CompleteQuest) == 0x000004, "Wrong alignment on BP_Shops_C_CompleteQuest");
static_assert(sizeof(BP_Shops_C_CompleteQuest) == 0x000008, "Wrong size on BP_Shops_C_CompleteQuest");
static_assert(offsetof(BP_Shops_C_CompleteQuest, QuestIndex) == 0x000000, "Member 'BP_Shops_C_CompleteQuest::QuestIndex' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_CompleteQuest, ObjectiveIndex) == 0x000004, "Member 'BP_Shops_C_CompleteQuest::ObjectiveIndex' has a wrong offset!");

// Function BP_Shops.BP_Shops_C.DefaultShop
// 0x00C0 (0x00C0 - 0x0000)
struct BP_Shops_C_DefaultShop final
{
public:
	class FName                                   CallFunc_GetParticipantName_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetParticipantName_ReturnValue_1;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetParticipantName_ReturnValue_2;         // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_2;        // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetParticipantName_ReturnValue_3;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_3;        // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue_2;                  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0048(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC;                  // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OpenTabsWindow_Succes;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC_1;                // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_TabsWindow_C*                        CallFunc_GetTabsWidget_Widget;                     // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameHUD_C>        K2Node_DynamicCast_AsBPI_Game_HUD;                 // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMPInGameInventory_C*                   CallFunc_GetInventoryWidget_Widget;                // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Shops_C_DefaultShop) == 0x000008, "Wrong alignment on BP_Shops_C_DefaultShop");
static_assert(sizeof(BP_Shops_C_DefaultShop) == 0x0000C0, "Wrong size on BP_Shops_C_DefaultShop");
static_assert(offsetof(BP_Shops_C_DefaultShop, CallFunc_GetParticipantName_ReturnValue) == 0x000000, "Member 'BP_Shops_C_DefaultShop::CallFunc_GetParticipantName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_DefaultShop, CallFunc_GetParticipantName_ReturnValue_1) == 0x000008, "Member 'BP_Shops_C_DefaultShop::CallFunc_GetParticipantName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_DefaultShop, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000010, "Member 'BP_Shops_C_DefaultShop::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_DefaultShop, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x000011, "Member 'BP_Shops_C_DefaultShop::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_DefaultShop, CallFunc_SelectInt_ReturnValue) == 0x000014, "Member 'BP_Shops_C_DefaultShop::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_DefaultShop, CallFunc_SelectInt_ReturnValue_1) == 0x000018, "Member 'BP_Shops_C_DefaultShop::CallFunc_SelectInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_DefaultShop, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'BP_Shops_C_DefaultShop::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_DefaultShop, CallFunc_GetParticipantName_ReturnValue_2) == 0x00002C, "Member 'BP_Shops_C_DefaultShop::CallFunc_GetParticipantName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_DefaultShop, CallFunc_EqualEqual_NameName_ReturnValue_2) == 0x000034, "Member 'BP_Shops_C_DefaultShop::CallFunc_EqualEqual_NameName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_DefaultShop, CallFunc_GetParticipantName_ReturnValue_3) == 0x000038, "Member 'BP_Shops_C_DefaultShop::CallFunc_GetParticipantName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_DefaultShop, CallFunc_EqualEqual_NameName_ReturnValue_3) == 0x000040, "Member 'BP_Shops_C_DefaultShop::CallFunc_EqualEqual_NameName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_DefaultShop, CallFunc_SelectInt_ReturnValue_2) == 0x000044, "Member 'BP_Shops_C_DefaultShop::CallFunc_SelectInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_DefaultShop, K2Node_CreateDelegate_OutputDelegate_1) == 0x000048, "Member 'BP_Shops_C_DefaultShop::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_DefaultShop, K2Node_DynamicCast_AsBPI_Surv_PC) == 0x000058, "Member 'BP_Shops_C_DefaultShop::K2Node_DynamicCast_AsBPI_Surv_PC' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_DefaultShop, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'BP_Shops_C_DefaultShop::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_DefaultShop, CallFunc_AddChild_ReturnValue) == 0x000070, "Member 'BP_Shops_C_DefaultShop::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_DefaultShop, CallFunc_OpenTabsWindow_Succes) == 0x000078, "Member 'BP_Shops_C_DefaultShop::CallFunc_OpenTabsWindow_Succes' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_DefaultShop, K2Node_DynamicCast_AsBPI_Surv_PC_1) == 0x000080, "Member 'BP_Shops_C_DefaultShop::K2Node_DynamicCast_AsBPI_Surv_PC_1' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_DefaultShop, K2Node_DynamicCast_bSuccess_1) == 0x000090, "Member 'BP_Shops_C_DefaultShop::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_DefaultShop, CallFunc_GetTabsWidget_Widget) == 0x000098, "Member 'BP_Shops_C_DefaultShop::CallFunc_GetTabsWidget_Widget' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_DefaultShop, K2Node_DynamicCast_AsBPI_Game_HUD) == 0x0000A0, "Member 'BP_Shops_C_DefaultShop::K2Node_DynamicCast_AsBPI_Game_HUD' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_DefaultShop, K2Node_DynamicCast_bSuccess_2) == 0x0000B0, "Member 'BP_Shops_C_DefaultShop::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_DefaultShop, CallFunc_GetInventoryWidget_Widget) == 0x0000B8, "Member 'BP_Shops_C_DefaultShop::CallFunc_GetInventoryWidget_Widget' has a wrong offset!");

// Function BP_Shops.BP_Shops_C.EndDialogue
// 0x0028 (0x0028 - 0x0000)
struct BP_Shops_C_EndDialogue final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_NPCLocalInteract_C> K2Node_DynamicCast_AsBPI_NPCLocal_Interact;        // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Shops_C_EndDialogue) == 0x000008, "Wrong alignment on BP_Shops_C_EndDialogue");
static_assert(sizeof(BP_Shops_C_EndDialogue) == 0x000028, "Wrong size on BP_Shops_C_EndDialogue");
static_assert(offsetof(BP_Shops_C_EndDialogue, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_Shops_C_EndDialogue::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_EndDialogue, CallFunc_GetAnimInstance_ReturnValue) == 0x000008, "Member 'BP_Shops_C_EndDialogue::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_EndDialogue, K2Node_DynamicCast_AsBPI_NPCLocal_Interact) == 0x000010, "Member 'BP_Shops_C_EndDialogue::K2Node_DynamicCast_AsBPI_NPCLocal_Interact' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_EndDialogue, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_Shops_C_EndDialogue::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_Shops.BP_Shops_C.Event Split Players Item Between Slots
// 0x01C8 (0x01C8 - 0x0000)
struct BP_Shops_C_Event_Split_Players_Item_Between_Slots final
{
public:
	E_BaseContainerType                           ContainerType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SenderSlotIndex;                                   // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RecipientSlotIndex;                                // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SplitCount;                                        // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FContainerPickupsInfo                  RecipientData;                                     // 0x0010(0x0068)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	struct FContainerPickupsInfo                  SenderData;                                        // 0x0078(0x0068)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FContainerPickupsInfo                  K2Node_Copy_ReturnValue;                           // 0x00E8(0x0068)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue_1;                 // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FContainerPickupsInfo                  CallFunc_Map_Find_Value;                           // 0x0158(0x0068)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Shops_C_Event_Split_Players_Item_Between_Slots) == 0x000008, "Wrong alignment on BP_Shops_C_Event_Split_Players_Item_Between_Slots");
static_assert(sizeof(BP_Shops_C_Event_Split_Players_Item_Between_Slots) == 0x0001C8, "Wrong size on BP_Shops_C_Event_Split_Players_Item_Between_Slots");
static_assert(offsetof(BP_Shops_C_Event_Split_Players_Item_Between_Slots, ContainerType) == 0x000000, "Member 'BP_Shops_C_Event_Split_Players_Item_Between_Slots::ContainerType' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_Event_Split_Players_Item_Between_Slots, SenderSlotIndex) == 0x000004, "Member 'BP_Shops_C_Event_Split_Players_Item_Between_Slots::SenderSlotIndex' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_Event_Split_Players_Item_Between_Slots, RecipientSlotIndex) == 0x000008, "Member 'BP_Shops_C_Event_Split_Players_Item_Between_Slots::RecipientSlotIndex' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_Event_Split_Players_Item_Between_Slots, SplitCount) == 0x00000C, "Member 'BP_Shops_C_Event_Split_Players_Item_Between_Slots::SplitCount' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_Event_Split_Players_Item_Between_Slots, RecipientData) == 0x000010, "Member 'BP_Shops_C_Event_Split_Players_Item_Between_Slots::RecipientData' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_Event_Split_Players_Item_Between_Slots, SenderData) == 0x000078, "Member 'BP_Shops_C_Event_Split_Players_Item_Between_Slots::SenderData' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_Event_Split_Players_Item_Between_Slots, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000E0, "Member 'BP_Shops_C_Event_Split_Players_Item_Between_Slots::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_Event_Split_Players_Item_Between_Slots, CallFunc_Map_Remove_ReturnValue) == 0x0000E1, "Member 'BP_Shops_C_Event_Split_Players_Item_Between_Slots::CallFunc_Map_Remove_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_Event_Split_Players_Item_Between_Slots, K2Node_Copy_ReturnValue) == 0x0000E8, "Member 'BP_Shops_C_Event_Split_Players_Item_Between_Slots::K2Node_Copy_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_Event_Split_Players_Item_Between_Slots, CallFunc_Map_Remove_ReturnValue_1) == 0x000150, "Member 'BP_Shops_C_Event_Split_Players_Item_Between_Slots::CallFunc_Map_Remove_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_Event_Split_Players_Item_Between_Slots, CallFunc_Subtract_IntInt_ReturnValue) == 0x000154, "Member 'BP_Shops_C_Event_Split_Players_Item_Between_Slots::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_Event_Split_Players_Item_Between_Slots, CallFunc_Map_Find_Value) == 0x000158, "Member 'BP_Shops_C_Event_Split_Players_Item_Between_Slots::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_Shops_C_Event_Split_Players_Item_Between_Slots, CallFunc_Map_Find_ReturnValue) == 0x0001C0, "Member 'BP_Shops_C_Event_Split_Players_Item_Between_Slots::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function BP_Shops.BP_Shops_C.EventDeletePlayersItem
// 0x0004 (0x0004 - 0x0000)
struct BP_Shops_C_EventDeletePlayersItem final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Shops_C_EventDeletePlayersItem) == 0x000004, "Wrong alignment on BP_Shops_C_EventDeletePlayersItem");
static_assert(sizeof(BP_Shops_C_EventDeletePlayersItem) == 0x000004, "Wrong size on BP_Shops_C_EventDeletePlayersItem");
static_assert(offsetof(BP_Shops_C_EventDeletePlayersItem, Param_Index) == 0x000000, "Member 'BP_Shops_C_EventDeletePlayersItem::Param_Index' has a wrong offset!");

// Function BP_Shops.BP_Shops_C.ExecuteUbergraph_BP_Shops
// 0x14E0 (0x14E0 - 0x0000)
struct BP_Shops_C_ExecuteUbergraph_BP_Shops final
{
public:
