#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SurvivalSpectator

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_SurvivalSpectator.BP_SurvivalSpectator_C.ExecuteUbergraph_BP_SurvivalSpectator
// 0x01C0 (0x01C0 - 0x0000)
struct BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key;                          // 0x0010(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_1;                        // 0x0028(0x0018)(HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvPC_C*                              K2Node_DynamicCast_AsSurv_PC;                      // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvPC_C*                              K2Node_DynamicCast_AsSurv_PC_1;                    // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetCameraRotation_ReturnValue;            // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_2;                        // 0x00A8(0x0018)(HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00C0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_3;                        // 0x0120(0x0018)(HasGetValueTypeHash)
	class UFloatingPawnMovement*                  K2Node_DynamicCast_AsFloating_Pawn_Movement;       // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15A[0x6];                                      // 0x015A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxSpeed_ReturnValue;                  // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key_4;                        // 0x0188(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_DefaultSpeed_ImplicitCast;      // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_MaxSpeed_ImplicitCast;          // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator) == 0x000010, "Wrong alignment on BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator");
static_assert(sizeof(BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator) == 0x0001C0, "Wrong size on BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator");
static_assert(offsetof(BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator, EntryPoint) == 0x000000, "Member 'BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator, Temp_bool_IsClosed_Variable) == 0x000004, "Member 'BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator, K2Node_InputKeyEvent_Key) == 0x000010, "Member 'BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator::K2Node_InputKeyEvent_Key' has a wrong offset!");
static_assert(offsetof(BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator, K2Node_InputKeyEvent_Key_1) == 0x000028, "Member 'BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator::K2Node_InputKeyEvent_Key_1' has a wrong offset!");
static_assert(offsetof(BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator, CallFunc_GetPlayerController_ReturnValue) == 0x000040, "Member 'BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator, CallFunc_GetPlayerController_ReturnValue_1) == 0x000048, "Member 'BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator, K2Node_DynamicCast_AsSurv_PC) == 0x000050, "Member 'BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator::K2Node_DynamicCast_AsSurv_PC' has a wrong offset!");
static_assert(offsetof(BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator, K2Node_DynamicCast_AsSurv_PC_1) == 0x000060, "Member 'BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator::K2Node_DynamicCast_AsSurv_PC_1' has a wrong offset!");
static_assert(offsetof(BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000070, "Member 'BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator, CallFunc_GetCameraRotation_ReturnValue) == 0x000078, "Member 'BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator::CallFunc_GetCameraRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator, CallFunc_GetCameraLocation_ReturnValue) == 0x000090, "Member 'BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator::CallFunc_GetCameraLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator, K2Node_InputKeyEvent_Key_2) == 0x0000A8, "Member 'BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator::K2Node_InputKeyEvent_Key_2' has a wrong offset!");
static_assert(offsetof(BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator, CallFunc_MakeTransform_ReturnValue) == 0x0000C0, "Member 'BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator, K2Node_InputKeyEvent_Key_3) == 0x000120, "Member 'BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator::K2Node_InputKeyEvent_Key_3' has a wrong offset!");
static_assert(offsetof(BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator, K2Node_DynamicCast_AsFloating_Pawn_Movement) == 0x000138, "Member 'BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator::K2Node_DynamicCast_AsFloating_Pawn_Movement' has a wrong offset!");
static_assert(offsetof(BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator, K2Node_DynamicCast_bSuccess_2) == 0x000140, "Member 'BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000148, "Member 'BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000150, "Member 'BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000158, "Member 'BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator, Temp_bool_Has_Been_Initd_Variable) == 0x000159, "Member 'BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator, CallFunc_Conv_DoubleToString_ReturnValue) == 0x000160, "Member 'BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator::CallFunc_Conv_DoubleToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator, CallFunc_Concat_StrStr_ReturnValue) == 0x000170, "Member 'BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator, CallFunc_GetMaxSpeed_ReturnValue) == 0x000180, "Member 'BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator::CallFunc_GetMaxSpeed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator, K2Node_InputKeyEvent_Key_4) == 0x000188, "Member 'BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator::K2Node_InputKeyEvent_Key_4' has a wrong offset!");
static_assert(offsetof(BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator, CallFunc_NotEqual_DoubleDouble_ReturnValue) == 0x0001A0, "Member 'BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator::CallFunc_NotEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0001A8, "Member 'BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator, K2Node_VariableSet_DefaultSpeed_ImplicitCast) == 0x0001B0, "Member 'BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator::K2Node_VariableSet_DefaultSpeed_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator, K2Node_VariableSet_MaxSpeed_ImplicitCast) == 0x0001B8, "Member 'BP_SurvivalSpectator_C_ExecuteUbergraph_BP_SurvivalSpectator::K2Node_VariableSet_MaxSpeed_ImplicitCast' has a wrong offset!");

// Function BP_SurvivalSpectator.BP_SurvivalSpectator_C.InpActEvt_BackSpace_K2Node_InputKeyEvent_3
// 0x0018 (0x0018 - 0x0000)
struct BP_SurvivalSpectator_C_InpActEvt_BackSpace_K2Node_InputKeyEvent_3 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_SurvivalSpectator_C_InpActEvt_BackSpace_K2Node_InputKeyEvent_3) == 0x000008, "Wrong alignment on BP_SurvivalSpectator_C_InpActEvt_BackSpace_K2Node_InputKeyEvent_3");
static_assert(sizeof(BP_SurvivalSpectator_C_InpActEvt_BackSpace_K2Node_InputKeyEvent_3) == 0x000018, "Wrong size on BP_SurvivalSpectator_C_InpActEvt_BackSpace_K2Node_InputKeyEvent_3");
static_assert(offsetof(BP_SurvivalSpectator_C_InpActEvt_BackSpace_K2Node_InputKeyEvent_3, Key) == 0x000000, "Member 'BP_SurvivalSpectator_C_InpActEvt_BackSpace_K2Node_InputKeyEvent_3::Key' has a wrong offset!");

// Function BP_SurvivalSpectator.BP_SurvivalSpectator_C.InpActEvt_E_K2Node_InputKeyEvent_4
// 0x0018 (0x0018 - 0x0000)
struct BP_SurvivalSpectator_C_InpActEvt_E_K2Node_InputKeyEvent_4 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_SurvivalSpectator_C_InpActEvt_E_K2Node_InputKeyEvent_4) == 0x000008, "Wrong alignment on BP_SurvivalSpectator_C_InpActEvt_E_K2Node_InputKeyEvent_4");
static_assert(sizeof(BP_SurvivalSpectator_C_InpActEvt_E_K2Node_InputKeyEvent_4) == 0x000018, "Wrong size on BP_SurvivalSpectator_C_InpActEvt_E_K2Node_InputKeyEvent_4");
static_assert(offsetof(BP_SurvivalSpectator_C_InpActEvt_E_K2Node_InputKeyEvent_4, Key) == 0x000000, "Member 'BP_SurvivalSpectator_C_InpActEvt_E_K2Node_InputKeyEvent_4::Key' has a wrong offset!");

// Function BP_SurvivalSpectator.BP_SurvivalSpectator_C.InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_0
// 0x0018 (0x0018 - 0x0000)
struct BP_SurvivalSpectator_C_InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_SurvivalSpectator_C_InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_0) == 0x000008, "Wrong alignment on BP_SurvivalSpectator_C_InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_0");
static_assert(sizeof(BP_SurvivalSpectator_C_InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_0) == 0x000018, "Wrong size on BP_SurvivalSpectator_C_InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_0");
static_assert(offsetof(BP_SurvivalSpectator_C_InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_0, Key) == 0x000000, "Member 'BP_SurvivalSpectator_C_InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_0::Key' has a wrong offset!");

// Function BP_SurvivalSpectator.BP_SurvivalSpectator_C.InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_1
// 0x0018 (0x0018 - 0x0000)
struct BP_SurvivalSpectator_C_InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_1 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_SurvivalSpectator_C_InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_1) == 0x000008, "Wrong alignment on BP_SurvivalSpectator_C_InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_1");
static_assert(sizeof(BP_SurvivalSpectator_C_InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_1) == 0x000018, "Wrong size on BP_SurvivalSpectator_C_InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_1");
static_assert(offsetof(BP_SurvivalSpectator_C_InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_1, Key) == 0x000000, "Member 'BP_SurvivalSpectator_C_InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_1::Key' has a wrong offset!");

// Function BP_SurvivalSpectator.BP_SurvivalSpectator_C.InpActEvt_Q_K2Node_InputKeyEvent_2
// 0x0018 (0x0018 - 0x0000)
struct BP_SurvivalSpectator_C_InpActEvt_Q_K2Node_InputKeyEvent_2 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_SurvivalSpectator_C_InpActEvt_Q_K2Node_InputKeyEvent_2) == 0x000008, "Wrong alignment on BP_SurvivalSpectator_C_InpActEvt_Q_K2Node_InputKeyEvent_2");
static_assert(sizeof(BP_SurvivalSpectator_C_InpActEvt_Q_K2Node_InputKeyEvent_2) == 0x000018, "Wrong size on BP_SurvivalSpectator_C_InpActEvt_Q_K2Node_InputKeyEvent_2");
static_assert(offsetof(BP_SurvivalSpectator_C_InpActEvt_Q_K2Node_InputKeyEvent_2, Key) == 0x000000, "Member 'BP_SurvivalSpectator_C_InpActEvt_Q_K2Node_InputKeyEvent_2::Key' has a wrong offset!");

// Function BP_SurvivalSpectator.BP_SurvivalSpectator_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_SurvivalSpectator_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SurvivalSpectator_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_SurvivalSpectator_C_ReceiveTick");
static_assert(sizeof(BP_SurvivalSpectator_C_ReceiveTick) == 0x000004, "Wrong size on BP_SurvivalSpectator_C_ReceiveTick");
static_assert(offsetof(BP_SurvivalSpectator_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_SurvivalSpectator_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

