#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SleepingBagStub

#include "Basic.hpp"

#include "E_InteractType_structs.hpp"
#include "Engine_structs.hpp"
#include "BP_SleepingBagBase_classes.hpp"
#include "E_ActorType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SleepingBagStub.BP_SleepingBagStub_C
// 0x0068 (0x0310 - 0x02A8)
class ABP_SleepingBagStub_C final : public ABP_SleepingBagBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_SleepingBagStub_C;               // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          InteractBox;                                       // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInstanceDynamic*>       BuildingMat;                                       // 0x02C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AActor*                                 LocalPlayer;                                       // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        InteractDuration;                                  // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPlacing;                                         // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsStopping;                                        // 0x02E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanPlace;                                          // 0x02E2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E3[0x5];                                      // 0x02E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UClass*>                         ExcludedClasses;                                   // 0x02E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          CanBePlaced;                                       // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UClass*>                         RequiredClasses;                                   // 0x0300(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void AddExcludedClasses(TArray<class UClass*>& Classes);
	void CanPlaced(bool* Res);
	void DestroyInteractable();
	void ExecuteUbergraph_BP_SleepingBagStub(int32 EntryPoint);
	void GetActorType(E_ActorType* ActorType);
	void IsLocked_(bool* Result);
	void OnBeginInteract(class APawn* Player);
	void OnFocused(class APawn* Player, class AActor* HighlightActor, class UActorComponent* HighlightActorComponent, E_InteractType* InteractType, double* LateTime);
	void OnInteract(class APawn* Player);
	void OnInteract2(class APawn* Player);
	void OnInteract3(class APawn* Player);
	void OnInteractVehicle(class APawn* Player, int32 SitIndex, bool SkipAnimation);
	void OnLocalInteract(class APawn* Player);
	void OnLostFocus(class APawn* Player);
	void OnSeen(class APawn* Player);
	void OnSquadCheckComplete();
	void OnStopInteract(class APawn* Player);
	void Place();
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void Run_Lockpicking();
	void Set3DWidgetVisibility(bool Visible);
	void SetTutorial3DWidgetVisibility(bool Visible);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SleepingBagStub_C">();
	}
	static class ABP_SleepingBagStub_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SleepingBagStub_C>();
	}
};
static_assert(alignof(ABP_SleepingBagStub_C) == 0x000008, "Wrong alignment on ABP_SleepingBagStub_C");
static_assert(sizeof(ABP_SleepingBagStub_C) == 0x000310, "Wrong size on ABP_SleepingBagStub_C");
static_assert(offsetof(ABP_SleepingBagStub_C, UberGraphFrame_BP_SleepingBagStub_C) == 0x0002A8, "Member 'ABP_SleepingBagStub_C::UberGraphFrame_BP_SleepingBagStub_C' has a wrong offset!");
static_assert(offsetof(ABP_SleepingBagStub_C, InteractBox) == 0x0002B0, "Member 'ABP_SleepingBagStub_C::InteractBox' has a wrong offset!");
static_assert(offsetof(ABP_SleepingBagStub_C, Box) == 0x0002B8, "Member 'ABP_SleepingBagStub_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_SleepingBagStub_C, BuildingMat) == 0x0002C0, "Member 'ABP_SleepingBagStub_C::BuildingMat' has a wrong offset!");
static_assert(offsetof(ABP_SleepingBagStub_C, LocalPlayer) == 0x0002D0, "Member 'ABP_SleepingBagStub_C::LocalPlayer' has a wrong offset!");
static_assert(offsetof(ABP_SleepingBagStub_C, InteractDuration) == 0x0002D8, "Member 'ABP_SleepingBagStub_C::InteractDuration' has a wrong offset!");
static_assert(offsetof(ABP_SleepingBagStub_C, IsPlacing) == 0x0002E0, "Member 'ABP_SleepingBagStub_C::IsPlacing' has a wrong offset!");
static_assert(offsetof(ABP_SleepingBagStub_C, IsStopping) == 0x0002E1, "Member 'ABP_SleepingBagStub_C::IsStopping' has a wrong offset!");
static_assert(offsetof(ABP_SleepingBagStub_C, CanPlace) == 0x0002E2, "Member 'ABP_SleepingBagStub_C::CanPlace' has a wrong offset!");
static_assert(offsetof(ABP_SleepingBagStub_C, ExcludedClasses) == 0x0002E8, "Member 'ABP_SleepingBagStub_C::ExcludedClasses' has a wrong offset!");
static_assert(offsetof(ABP_SleepingBagStub_C, CanBePlaced) == 0x0002F8, "Member 'ABP_SleepingBagStub_C::CanBePlaced' has a wrong offset!");
static_assert(offsetof(ABP_SleepingBagStub_C, RequiredClasses) == 0x000300, "Member 'ABP_SleepingBagStub_C::RequiredClasses' has a wrong offset!");

}

