#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Sauna_Mesh

#include "Basic.hpp"

#include "S_SaveStructure_structs.hpp"


namespace SDK::Params
{

// Function BP_Sauna_Mesh.BP_Sauna_Mesh_C.ExecuteUbergraph_BP_Sauna_Mesh
// 0x0090 (0x0090 - 0x0000)
struct BP_Sauna_Mesh_C_ExecuteUbergraph_BP_Sauna_Mesh final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimationAsset*                        Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimationAsset*                        Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      K2Node_CustomEvent_survRef;                        // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimationAsset*                        K2Node_Select_Default;                             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          CallFunc_GetSkeletalMeshAsset_ReturnValue;         // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          CallFunc_GetSkeletalMeshAsset_ReturnValue_1;       // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          CallFunc_GetSkeletalMeshAsset_ReturnValue_2;       // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          CallFunc_GetSkeletalMeshAsset_ReturnValue_3;       // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_Map_Keys_Keys;                            // 0x0050(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_Map_Values_Values;                        // 0x0068(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Sauna_Mesh_C_ExecuteUbergraph_BP_Sauna_Mesh) == 0x000008, "Wrong alignment on BP_Sauna_Mesh_C_ExecuteUbergraph_BP_Sauna_Mesh");
static_assert(sizeof(BP_Sauna_Mesh_C_ExecuteUbergraph_BP_Sauna_Mesh) == 0x000090, "Wrong size on BP_Sauna_Mesh_C_ExecuteUbergraph_BP_Sauna_Mesh");
static_assert(offsetof(BP_Sauna_Mesh_C_ExecuteUbergraph_BP_Sauna_Mesh, EntryPoint) == 0x000000, "Member 'BP_Sauna_Mesh_C_ExecuteUbergraph_BP_Sauna_Mesh::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_ExecuteUbergraph_BP_Sauna_Mesh, Temp_object_Variable) == 0x000008, "Member 'BP_Sauna_Mesh_C_ExecuteUbergraph_BP_Sauna_Mesh::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_ExecuteUbergraph_BP_Sauna_Mesh, Temp_object_Variable_1) == 0x000010, "Member 'BP_Sauna_Mesh_C_ExecuteUbergraph_BP_Sauna_Mesh::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_ExecuteUbergraph_BP_Sauna_Mesh, Temp_bool_Variable) == 0x000018, "Member 'BP_Sauna_Mesh_C_ExecuteUbergraph_BP_Sauna_Mesh::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_ExecuteUbergraph_BP_Sauna_Mesh, K2Node_CustomEvent_survRef) == 0x000020, "Member 'BP_Sauna_Mesh_C_ExecuteUbergraph_BP_Sauna_Mesh::K2Node_CustomEvent_survRef' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_ExecuteUbergraph_BP_Sauna_Mesh, K2Node_Select_Default) == 0x000028, "Member 'BP_Sauna_Mesh_C_ExecuteUbergraph_BP_Sauna_Mesh::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_ExecuteUbergraph_BP_Sauna_Mesh, CallFunc_GetSkeletalMeshAsset_ReturnValue) == 0x000030, "Member 'BP_Sauna_Mesh_C_ExecuteUbergraph_BP_Sauna_Mesh::CallFunc_GetSkeletalMeshAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_ExecuteUbergraph_BP_Sauna_Mesh, CallFunc_GetSkeletalMeshAsset_ReturnValue_1) == 0x000038, "Member 'BP_Sauna_Mesh_C_ExecuteUbergraph_BP_Sauna_Mesh::CallFunc_GetSkeletalMeshAsset_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_ExecuteUbergraph_BP_Sauna_Mesh, CallFunc_GetSkeletalMeshAsset_ReturnValue_2) == 0x000040, "Member 'BP_Sauna_Mesh_C_ExecuteUbergraph_BP_Sauna_Mesh::CallFunc_GetSkeletalMeshAsset_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_ExecuteUbergraph_BP_Sauna_Mesh, CallFunc_GetSkeletalMeshAsset_ReturnValue_3) == 0x000048, "Member 'BP_Sauna_Mesh_C_ExecuteUbergraph_BP_Sauna_Mesh::CallFunc_GetSkeletalMeshAsset_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_ExecuteUbergraph_BP_Sauna_Mesh, CallFunc_Map_Keys_Keys) == 0x000050, "Member 'BP_Sauna_Mesh_C_ExecuteUbergraph_BP_Sauna_Mesh::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_ExecuteUbergraph_BP_Sauna_Mesh, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'BP_Sauna_Mesh_C_ExecuteUbergraph_BP_Sauna_Mesh::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_ExecuteUbergraph_BP_Sauna_Mesh, CallFunc_Map_Values_Values) == 0x000068, "Member 'BP_Sauna_Mesh_C_ExecuteUbergraph_BP_Sauna_Mesh::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_ExecuteUbergraph_BP_Sauna_Mesh, CallFunc_Array_Find_ReturnValue) == 0x000078, "Member 'BP_Sauna_Mesh_C_ExecuteUbergraph_BP_Sauna_Mesh::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_ExecuteUbergraph_BP_Sauna_Mesh, CallFunc_Array_Get_Item) == 0x000080, "Member 'BP_Sauna_Mesh_C_ExecuteUbergraph_BP_Sauna_Mesh::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_ExecuteUbergraph_BP_Sauna_Mesh, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000088, "Member 'BP_Sauna_Mesh_C_ExecuteUbergraph_BP_Sauna_Mesh::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_ExecuteUbergraph_BP_Sauna_Mesh, CallFunc_Map_Remove_ReturnValue) == 0x000089, "Member 'BP_Sauna_Mesh_C_ExecuteUbergraph_BP_Sauna_Mesh::CallFunc_Map_Remove_ReturnValue' has a wrong offset!");

// Function BP_Sauna_Mesh.BP_Sauna_Mesh_C.Head Customization
// 0x0080 (0x0080 - 0x0000)
struct BP_Sauna_Mesh_C_Head_Customization final
{
public:
	class FName                                   Temp_name_Variable;                                // 0x0000(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x0008(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetMaterialSlotNames_ReturnValue;         // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue_1;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x002C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_2; // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_3; // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_4; // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_5; // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_6; // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_7; // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_8; // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_9; // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_10; // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_11; // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_12; // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_13; // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_14; // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Sauna_Mesh_C_Head_Customization) == 0x000008, "Wrong alignment on BP_Sauna_Mesh_C_Head_Customization");
static_assert(sizeof(BP_Sauna_Mesh_C_Head_Customization) == 0x000080, "Wrong size on BP_Sauna_Mesh_C_Head_Customization");
static_assert(offsetof(BP_Sauna_Mesh_C_Head_Customization, Temp_name_Variable) == 0x000000, "Member 'BP_Sauna_Mesh_C_Head_Customization::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_Head_Customization, Temp_name_Variable_1) == 0x000008, "Member 'BP_Sauna_Mesh_C_Head_Customization::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_Head_Customization, CallFunc_GetMaterialSlotNames_ReturnValue) == 0x000010, "Member 'BP_Sauna_Mesh_C_Head_Customization::CallFunc_GetMaterialSlotNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_Head_Customization, CallFunc_Array_Find_ReturnValue) == 0x000020, "Member 'BP_Sauna_Mesh_C_Head_Customization::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_Head_Customization, CallFunc_Array_Find_ReturnValue_1) == 0x000024, "Member 'BP_Sauna_Mesh_C_Head_Customization::CallFunc_Array_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_Head_Customization, Temp_bool_Variable) == 0x000028, "Member 'BP_Sauna_Mesh_C_Head_Customization::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_Head_Customization, K2Node_Select_Default) == 0x00002C, "Member 'BP_Sauna_Mesh_C_Head_Customization::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_Head_Customization, CallFunc_GetMaterial_ReturnValue) == 0x000030, "Member 'BP_Sauna_Mesh_C_Head_Customization::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_Head_Customization, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000038, "Member 'BP_Sauna_Mesh_C_Head_Customization::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_Head_Customization, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000040, "Member 'BP_Sauna_Mesh_C_Head_Customization::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_Head_Customization, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x000044, "Member 'BP_Sauna_Mesh_C_Head_Customization::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_Head_Customization, CallFunc_SetScalarParameterValue_Value_ImplicitCast_2) == 0x000048, "Member 'BP_Sauna_Mesh_C_Head_Customization::CallFunc_SetScalarParameterValue_Value_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_Head_Customization, CallFunc_SetScalarParameterValue_Value_ImplicitCast_3) == 0x00004C, "Member 'BP_Sauna_Mesh_C_Head_Customization::CallFunc_SetScalarParameterValue_Value_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_Head_Customization, CallFunc_SetScalarParameterValue_Value_ImplicitCast_4) == 0x000050, "Member 'BP_Sauna_Mesh_C_Head_Customization::CallFunc_SetScalarParameterValue_Value_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_Head_Customization, CallFunc_SetScalarParameterValue_Value_ImplicitCast_5) == 0x000054, "Member 'BP_Sauna_Mesh_C_Head_Customization::CallFunc_SetScalarParameterValue_Value_ImplicitCast_5' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_Head_Customization, CallFunc_SetScalarParameterValue_Value_ImplicitCast_6) == 0x000058, "Member 'BP_Sauna_Mesh_C_Head_Customization::CallFunc_SetScalarParameterValue_Value_ImplicitCast_6' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_Head_Customization, CallFunc_SetScalarParameterValue_Value_ImplicitCast_7) == 0x00005C, "Member 'BP_Sauna_Mesh_C_Head_Customization::CallFunc_SetScalarParameterValue_Value_ImplicitCast_7' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_Head_Customization, CallFunc_SetScalarParameterValue_Value_ImplicitCast_8) == 0x000060, "Member 'BP_Sauna_Mesh_C_Head_Customization::CallFunc_SetScalarParameterValue_Value_ImplicitCast_8' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_Head_Customization, CallFunc_SetScalarParameterValue_Value_ImplicitCast_9) == 0x000064, "Member 'BP_Sauna_Mesh_C_Head_Customization::CallFunc_SetScalarParameterValue_Value_ImplicitCast_9' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_Head_Customization, CallFunc_SetScalarParameterValue_Value_ImplicitCast_10) == 0x000068, "Member 'BP_Sauna_Mesh_C_Head_Customization::CallFunc_SetScalarParameterValue_Value_ImplicitCast_10' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_Head_Customization, CallFunc_SetScalarParameterValue_Value_ImplicitCast_11) == 0x00006C, "Member 'BP_Sauna_Mesh_C_Head_Customization::CallFunc_SetScalarParameterValue_Value_ImplicitCast_11' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_Head_Customization, CallFunc_SetScalarParameterValue_Value_ImplicitCast_12) == 0x000070, "Member 'BP_Sauna_Mesh_C_Head_Customization::CallFunc_SetScalarParameterValue_Value_ImplicitCast_12' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_Head_Customization, CallFunc_SetScalarParameterValue_Value_ImplicitCast_13) == 0x000074, "Member 'BP_Sauna_Mesh_C_Head_Customization::CallFunc_SetScalarParameterValue_Value_ImplicitCast_13' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_Head_Customization, CallFunc_SetScalarParameterValue_Value_ImplicitCast_14) == 0x000078, "Member 'BP_Sauna_Mesh_C_Head_Customization::CallFunc_SetScalarParameterValue_Value_ImplicitCast_14' has a wrong offset!");

// Function BP_Sauna_Mesh.BP_Sauna_Mesh_C.mesh Update
// 0x0008 (0x0008 - 0x0000)
struct BP_Sauna_Mesh_C_Mesh_Update final
{
public:
	class ASurvivalPlayer_C*                      SurvRef;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Sauna_Mesh_C_Mesh_Update) == 0x000008, "Wrong alignment on BP_Sauna_Mesh_C_Mesh_Update");
static_assert(sizeof(BP_Sauna_Mesh_C_Mesh_Update) == 0x000008, "Wrong size on BP_Sauna_Mesh_C_Mesh_Update");
static_assert(offsetof(BP_Sauna_Mesh_C_Mesh_Update, SurvRef) == 0x000000, "Member 'BP_Sauna_Mesh_C_Mesh_Update::SurvRef' has a wrong offset!");

// Function BP_Sauna_Mesh.BP_Sauna_Mesh_C.SetMaterial
// 0x0238 (0x0238 - 0x0000)
struct BP_Sauna_Mesh_C_SetMaterial final
{
public:
	struct FS_SaveStructure                       Save;                                              // 0x0000(0x01B0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Outwear;                                           // 0x01B0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Param_Pants;                                       // 0x01B8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetMaterialSlotNames_ReturnValue;         // 0x01C8(0x0010)(ReferenceParm)
	TArray<class FName>                           CallFunc_GetMaterialSlotNames_ReturnValue_1;       // 0x01D8(0x0010)(ReferenceParm)
	bool                                          Temp_bool_Variable_1;                              // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_Skin_Tone_ReturnValue;                    // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_1;            // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_2;            // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default;                             // 0x0210(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_3;            // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default_1;                           // 0x0224(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue_1;                 // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Skin_Tone_Value_ImplicitCast;             // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Sauna_Mesh_C_SetMaterial) == 0x000008, "Wrong alignment on BP_Sauna_Mesh_C_SetMaterial");
static_assert(sizeof(BP_Sauna_Mesh_C_SetMaterial) == 0x000238, "Wrong size on BP_Sauna_Mesh_C_SetMaterial");
static_assert(offsetof(BP_Sauna_Mesh_C_SetMaterial, Save) == 0x000000, "Member 'BP_Sauna_Mesh_C_SetMaterial::Save' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_SetMaterial, Outwear) == 0x0001B0, "Member 'BP_Sauna_Mesh_C_SetMaterial::Outwear' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_SetMaterial, Param_Pants) == 0x0001B8, "Member 'BP_Sauna_Mesh_C_SetMaterial::Param_Pants' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_SetMaterial, Temp_bool_Variable) == 0x0001C0, "Member 'BP_Sauna_Mesh_C_SetMaterial::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_SetMaterial, CallFunc_GetMaterialSlotNames_ReturnValue) == 0x0001C8, "Member 'BP_Sauna_Mesh_C_SetMaterial::CallFunc_GetMaterialSlotNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_SetMaterial, CallFunc_GetMaterialSlotNames_ReturnValue_1) == 0x0001D8, "Member 'BP_Sauna_Mesh_C_SetMaterial::CallFunc_GetMaterialSlotNames_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_SetMaterial, Temp_bool_Variable_1) == 0x0001E8, "Member 'BP_Sauna_Mesh_C_SetMaterial::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_SetMaterial, CallFunc_Skin_Tone_ReturnValue) == 0x0001F0, "Member 'BP_Sauna_Mesh_C_SetMaterial::CallFunc_Skin_Tone_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_SetMaterial, CallFunc_MakeLiteralName_ReturnValue) == 0x0001F8, "Member 'BP_Sauna_Mesh_C_SetMaterial::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_SetMaterial, CallFunc_MakeLiteralName_ReturnValue_1) == 0x000200, "Member 'BP_Sauna_Mesh_C_SetMaterial::CallFunc_MakeLiteralName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_SetMaterial, CallFunc_MakeLiteralName_ReturnValue_2) == 0x000208, "Member 'BP_Sauna_Mesh_C_SetMaterial::CallFunc_MakeLiteralName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_SetMaterial, K2Node_Select_Default) == 0x000210, "Member 'BP_Sauna_Mesh_C_SetMaterial::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_SetMaterial, CallFunc_MakeLiteralName_ReturnValue_3) == 0x000218, "Member 'BP_Sauna_Mesh_C_SetMaterial::CallFunc_MakeLiteralName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_SetMaterial, CallFunc_Array_Find_ReturnValue) == 0x000220, "Member 'BP_Sauna_Mesh_C_SetMaterial::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_SetMaterial, K2Node_Select_Default_1) == 0x000224, "Member 'BP_Sauna_Mesh_C_SetMaterial::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_SetMaterial, CallFunc_Array_Find_ReturnValue_1) == 0x00022C, "Member 'BP_Sauna_Mesh_C_SetMaterial::CallFunc_Array_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_SetMaterial, CallFunc_Skin_Tone_Value_ImplicitCast) == 0x000230, "Member 'BP_Sauna_Mesh_C_SetMaterial::CallFunc_Skin_Tone_Value_ImplicitCast' has a wrong offset!");

// Function BP_Sauna_Mesh.BP_Sauna_Mesh_C.SetMeshMaterial
// 0x0040 (0x0040 - 0x0000)
struct BP_Sauna_Mesh_C_SetMeshMaterial final
{
public:
	class UMeshComponent*                         GetMat;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    Target;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue;                 // 0x0010(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Sauna_Mesh_C_SetMeshMaterial) == 0x000008, "Wrong alignment on BP_Sauna_Mesh_C_SetMeshMaterial");
static_assert(sizeof(BP_Sauna_Mesh_C_SetMeshMaterial) == 0x000040, "Wrong size on BP_Sauna_Mesh_C_SetMeshMaterial");
static_assert(offsetof(BP_Sauna_Mesh_C_SetMeshMaterial, GetMat) == 0x000000, "Member 'BP_Sauna_Mesh_C_SetMeshMaterial::GetMat' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_SetMeshMaterial, Target) == 0x000008, "Member 'BP_Sauna_Mesh_C_SetMeshMaterial::Target' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_SetMeshMaterial, CallFunc_GetMaterials_ReturnValue) == 0x000010, "Member 'BP_Sauna_Mesh_C_SetMeshMaterial::CallFunc_GetMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_SetMeshMaterial, Temp_int_Array_Index_Variable) == 0x000020, "Member 'BP_Sauna_Mesh_C_SetMeshMaterial::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_SetMeshMaterial, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'BP_Sauna_Mesh_C_SetMeshMaterial::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_SetMeshMaterial, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_Sauna_Mesh_C_SetMeshMaterial::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_SetMeshMaterial, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'BP_Sauna_Mesh_C_SetMeshMaterial::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_SetMeshMaterial, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'BP_Sauna_Mesh_C_SetMeshMaterial::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_SetMeshMaterial, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'BP_Sauna_Mesh_C_SetMeshMaterial::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_Sauna_Mesh.BP_Sauna_Mesh_C.SetSkeletalCloth
// 0x0058 (0x0058 - 0x0000)
struct BP_Sauna_Mesh_C_SetSkeletalCloth final
{
public:
	class USkeletalMeshComponent*                 SMRef;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class USkeletalMesh>           SSMRef;                                            // 0x0008(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          K2Node_DynamicCast_AsSkeletal_Mesh;                // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Sauna_Mesh_C_SetSkeletalCloth) == 0x000008, "Wrong alignment on BP_Sauna_Mesh_C_SetSkeletalCloth");
static_assert(sizeof(BP_Sauna_Mesh_C_SetSkeletalCloth) == 0x000058, "Wrong size on BP_Sauna_Mesh_C_SetSkeletalCloth");
static_assert(offsetof(BP_Sauna_Mesh_C_SetSkeletalCloth, SMRef) == 0x000000, "Member 'BP_Sauna_Mesh_C_SetSkeletalCloth::SMRef' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_SetSkeletalCloth, SSMRef) == 0x000008, "Member 'BP_Sauna_Mesh_C_SetSkeletalCloth::SSMRef' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_SetSkeletalCloth, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000038, "Member 'BP_Sauna_Mesh_C_SetSkeletalCloth::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_SetSkeletalCloth, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000040, "Member 'BP_Sauna_Mesh_C_SetSkeletalCloth::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_SetSkeletalCloth, K2Node_DynamicCast_AsSkeletal_Mesh) == 0x000048, "Member 'BP_Sauna_Mesh_C_SetSkeletalCloth::K2Node_DynamicCast_AsSkeletal_Mesh' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_SetSkeletalCloth, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BP_Sauna_Mesh_C_SetSkeletalCloth::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_Sauna_Mesh.BP_Sauna_Mesh_C.Skin Tone
// 0x0068 (0x0068 - 0x0000)
struct BP_Sauna_Mesh_C_Skin_Tone final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 SelfComp;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SurvComp;                                          // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetMaterialSlotNames_ReturnValue;         // 0x0028(0x0010)(ReferenceParm)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_1;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default;                             // 0x0048(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Sauna_Mesh_C_Skin_Tone) == 0x000008, "Wrong alignment on BP_Sauna_Mesh_C_Skin_Tone");
static_assert(sizeof(BP_Sauna_Mesh_C_Skin_Tone) == 0x000068, "Wrong size on BP_Sauna_Mesh_C_Skin_Tone");
static_assert(offsetof(BP_Sauna_Mesh_C_Skin_Tone, Value) == 0x000000, "Member 'BP_Sauna_Mesh_C_Skin_Tone::Value' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_Skin_Tone, SelfComp) == 0x000008, "Member 'BP_Sauna_Mesh_C_Skin_Tone::SelfComp' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_Skin_Tone, SurvComp) == 0x000010, "Member 'BP_Sauna_Mesh_C_Skin_Tone::SurvComp' has a wrong offset!");
static_assert(offsetof(BP_Sauna_Mesh_C_Skin_Tone, ReturnValue) == 0x000018, "Member 'BP_Sauna_Mesh_C_Skin_Tone::ReturnValue' has a wrong offset!");
