#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SleepingBagBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SleepingBagBase.BP_SleepingBagBase_C
// 0x0018 (0x02A8 - 0x0290)
class ABP_SleepingBagBase_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 Sleeping_Bag;                                      // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_SleepingBagBase(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SleepingBagBase_C">();
	}
	static class ABP_SleepingBagBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SleepingBagBase_C>();
	}
};
static_assert(alignof(ABP_SleepingBagBase_C) == 0x000008, "Wrong alignment on ABP_SleepingBagBase_C");
static_assert(sizeof(ABP_SleepingBagBase_C) == 0x0002A8, "Wrong size on ABP_SleepingBagBase_C");
static_assert(offsetof(ABP_SleepingBagBase_C, UberGraphFrame) == 0x000290, "Member 'ABP_SleepingBagBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_SleepingBagBase_C, Sleeping_Bag) == 0x000298, "Member 'ABP_SleepingBagBase_C::Sleeping_Bag' has a wrong offset!");
static_assert(offsetof(ABP_SleepingBagBase_C, DefaultSceneRoot) == 0x0002A0, "Member 'ABP_SleepingBagBase_C::DefaultSceneRoot' has a wrong offset!");

}

