#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SequanceHolder

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SequanceHolder.BP_SequanceHolder_C
// 0x0018 (0x02A8 - 0x0290)
class ABP_SequanceHolder_C final : public AActor
{
public:
	class UBoxComponent*                          Box;                                               // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ALevelSequenceActor*                    Sequence;                                          // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SequanceHolder_C">();
	}
	static class ABP_SequanceHolder_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SequanceHolder_C>();
	}
};
static_assert(alignof(ABP_SequanceHolder_C) == 0x000008, "Wrong alignment on ABP_SequanceHolder_C");
static_assert(sizeof(ABP_SequanceHolder_C) == 0x0002A8, "Wrong size on ABP_SequanceHolder_C");
static_assert(offsetof(ABP_SequanceHolder_C, Box) == 0x000290, "Member 'ABP_SequanceHolder_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_SequanceHolder_C, DefaultSceneRoot) == 0x000298, "Member 'ABP_SequanceHolder_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_SequanceHolder_C, Sequence) == 0x0002A0, "Member 'ABP_SequanceHolder_C::Sequence' has a wrong offset!");

}

