#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Steam

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BPS_DamageInfo_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Steam.BP_Steam_C.CauseDamage
// 0x0008 (0x0008 - 0x0000)
struct BP_Steam_C_CauseDamage final
{
public:
	const class AActor*                           Actor;                                             // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Steam_C_CauseDamage) == 0x000008, "Wrong alignment on BP_Steam_C_CauseDamage");
static_assert(sizeof(BP_Steam_C_CauseDamage) == 0x000008, "Wrong size on BP_Steam_C_CauseDamage");
static_assert(offsetof(BP_Steam_C_CauseDamage, Actor) == 0x000000, "Member 'BP_Steam_C_CauseDamage::Actor' has a wrong offset!");

// Function BP_Steam.BP_Steam_C.ExecuteUbergraph_BP_Steam
// 0x0458 (0x0458 - 0x0000)
struct BP_Steam_C_ExecuteUbergraph_BP_Steam final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue;              // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0050(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	const class AActor*                           K2Node_Event_Actor;                                // 0x0138(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x0140(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0238(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0250(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_MakeHitResult_ReturnValue;                // 0x0268(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0350(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ApplyPointDamage_ReturnValue;             // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36C[0x4];                                      // 0x036C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0370(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_379[0x7];                                      // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBPS_DamageInfo                        K2Node_MakeStruct_BPS_DamageInfo;                  // 0x0380(0x0098)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_419[0x7];                                      // 0x0419(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBPS_DamageInfo>                K2Node_MakeArray_Array;                            // 0x0420(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x0431(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_432[0x6];                                      // 0x0432(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IElectricBoxListener_C> CallFunc_SetListener_Listener_CastInput;           // 0x0438(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x0450(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_1;            // 0x0454(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Steam_C_ExecuteUbergraph_BP_Steam) == 0x000008, "Wrong alignment on BP_Steam_C_ExecuteUbergraph_BP_Steam");
static_assert(sizeof(BP_Steam_C_ExecuteUbergraph_BP_Steam) == 0x000458, "Wrong size on BP_Steam_C_ExecuteUbergraph_BP_Steam");
static_assert(offsetof(BP_Steam_C_ExecuteUbergraph_BP_Steam, EntryPoint) == 0x000000, "Member 'BP_Steam_C_ExecuteUbergraph_BP_Steam::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Steam_C_ExecuteUbergraph_BP_Steam, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BP_Steam_C_ExecuteUbergraph_BP_Steam::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Steam_C_ExecuteUbergraph_BP_Steam, K2Node_Event_OtherActor) == 0x000008, "Member 'BP_Steam_C_ExecuteUbergraph_BP_Steam::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Steam_C_ExecuteUbergraph_BP_Steam, K2Node_Event_DeltaSeconds) == 0x000010, "Member 'BP_Steam_C_ExecuteUbergraph_BP_Steam::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Steam_C_ExecuteUbergraph_BP_Steam, K2Node_DynamicCast_AsPawn) == 0x000018, "Member 'BP_Steam_C_ExecuteUbergraph_BP_Steam::K2Node_DynamicCast_AsPawn' has a wrong offset!");
static_assert(offsetof(BP_Steam_C_ExecuteUbergraph_BP_Steam, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_Steam_C_ExecuteUbergraph_BP_Steam::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Steam_C_ExecuteUbergraph_BP_Steam, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000028, "Member 'BP_Steam_C_ExecuteUbergraph_BP_Steam::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Steam_C_ExecuteUbergraph_BP_Steam, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000030, "Member 'BP_Steam_C_ExecuteUbergraph_BP_Steam::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Steam_C_ExecuteUbergraph_BP_Steam, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000031, "Member 'BP_Steam_C_ExecuteUbergraph_BP_Steam::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Steam_C_ExecuteUbergraph_BP_Steam, CallFunc_GetActorScale3D_ReturnValue) == 0x000038, "Member 'BP_Steam_C_ExecuteUbergraph_BP_Steam::CallFunc_GetActorScale3D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Steam_C_ExecuteUbergraph_BP_Steam, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000050, "Member 'BP_Steam_C_ExecuteUbergraph_BP_Steam::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Steam_C_ExecuteUbergraph_BP_Steam, K2Node_Event_Actor) == 0x000138, "Member 'BP_Steam_C_ExecuteUbergraph_BP_Steam::K2Node_Event_Actor' has a wrong offset!");
static_assert(offsetof(BP_Steam_C_ExecuteUbergraph_BP_Steam, CallFunc_K2_SetRelativeLocation_SweepHitResult_1) == 0x000140, "Member 'BP_Steam_C_ExecuteUbergraph_BP_Steam::CallFunc_K2_SetRelativeLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_Steam_C_ExecuteUbergraph_BP_Steam, K2Node_DynamicCast_AsSurvival_Player) == 0x000228, "Member 'BP_Steam_C_ExecuteUbergraph_BP_Steam::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(BP_Steam_C_ExecuteUbergraph_BP_Steam, K2Node_DynamicCast_bSuccess_1) == 0x000230, "Member 'BP_Steam_C_ExecuteUbergraph_BP_Steam::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Steam_C_ExecuteUbergraph_BP_Steam, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000238, "Member 'BP_Steam_C_ExecuteUbergraph_BP_Steam::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Steam_C_ExecuteUbergraph_BP_Steam, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000250, "Member 'BP_Steam_C_ExecuteUbergraph_BP_Steam::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Steam_C_ExecuteUbergraph_BP_Steam, CallFunc_MakeHitResult_ReturnValue) == 0x000268, "Member 'BP_Steam_C_ExecuteUbergraph_BP_Steam::CallFunc_MakeHitResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Steam_C_ExecuteUbergraph_BP_Steam, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000350, "Member 'BP_Steam_C_ExecuteUbergraph_BP_Steam::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Steam_C_ExecuteUbergraph_BP_Steam, CallFunc_ApplyPointDamage_ReturnValue) == 0x000368, "Member 'BP_Steam_C_ExecuteUbergraph_BP_Steam::CallFunc_ApplyPointDamage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Steam_C_ExecuteUbergraph_BP_Steam, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000370, "Member 'BP_Steam_C_ExecuteUbergraph_BP_Steam::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Steam_C_ExecuteUbergraph_BP_Steam, CallFunc_HasAuthority_ReturnValue_1) == 0x000378, "Member 'BP_Steam_C_ExecuteUbergraph_BP_Steam::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Steam_C_ExecuteUbergraph_BP_Steam, K2Node_MakeStruct_BPS_DamageInfo) == 0x000380, "Member 'BP_Steam_C_ExecuteUbergraph_BP_Steam::K2Node_MakeStruct_BPS_DamageInfo' has a wrong offset!");
static_assert(offsetof(BP_Steam_C_ExecuteUbergraph_BP_Steam, CallFunc_IsValid_ReturnValue) == 0x000418, "Member 'BP_Steam_C_ExecuteUbergraph_BP_Steam::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Steam_C_ExecuteUbergraph_BP_Steam, K2Node_MakeArray_Array) == 0x000420, "Member 'BP_Steam_C_ExecuteUbergraph_BP_Steam::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_Steam_C_ExecuteUbergraph_BP_Steam, CallFunc_HasAuthority_ReturnValue_2) == 0x000430, "Member 'BP_Steam_C_ExecuteUbergraph_BP_Steam::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Steam_C_ExecuteUbergraph_BP_Steam, CallFunc_HasAuthority_ReturnValue_3) == 0x000431, "Member 'BP_Steam_C_ExecuteUbergraph_BP_Steam::CallFunc_HasAuthority_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Steam_C_ExecuteUbergraph_BP_Steam, CallFunc_SetListener_Listener_CastInput) == 0x000438, "Member 'BP_Steam_C_ExecuteUbergraph_BP_Steam::CallFunc_SetListener_Listener_CastInput' has a wrong offset!");
static_assert(offsetof(BP_Steam_C_ExecuteUbergraph_BP_Steam, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000448, "Member 'BP_Steam_C_ExecuteUbergraph_BP_Steam::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Steam_C_ExecuteUbergraph_BP_Steam, CallFunc_Delay_Duration_ImplicitCast) == 0x000450, "Member 'BP_Steam_C_ExecuteUbergraph_BP_Steam::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Steam_C_ExecuteUbergraph_BP_Steam, CallFunc_Delay_Duration_ImplicitCast_1) == 0x000454, "Member 'BP_Steam_C_ExecuteUbergraph_BP_Steam::CallFunc_Delay_Duration_ImplicitCast_1' has a wrong offset!");

// Function BP_Steam.BP_Steam_C.GetEmptyHitInfo
// 0x00E8 (0x00E8 - 0x0000)
struct BP_Steam_C_GetEmptyHitInfo final
{
public:
	struct FHitResult                             HitInfo;                                           // 0x0000(0x00E8)(Parm, OutParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Steam_C_GetEmptyHitInfo) == 0x000008, "Wrong alignment on BP_Steam_C_GetEmptyHitInfo");
static_assert(sizeof(BP_Steam_C_GetEmptyHitInfo) == 0x0000E8, "Wrong size on BP_Steam_C_GetEmptyHitInfo");
static_assert(offsetof(BP_Steam_C_GetEmptyHitInfo, HitInfo) == 0x000000, "Member 'BP_Steam_C_GetEmptyHitInfo::HitInfo' has a wrong offset!");

// Function BP_Steam.BP_Steam_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct BP_Steam_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Steam_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on BP_Steam_C_ReceiveActorBeginOverlap");
static_assert(sizeof(BP_Steam_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on BP_Steam_C_ReceiveActorBeginOverlap");
static_assert(offsetof(BP_Steam_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'BP_Steam_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

// Function BP_Steam.BP_Steam_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Steam_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Steam_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Steam_C_ReceiveTick");
static_assert(sizeof(BP_Steam_C_ReceiveTick) == 0x000004, "Wrong size on BP_Steam_C_ReceiveTick");
static_assert(offsetof(BP_Steam_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Steam_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

