#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Trap

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Trap.BP_Trap_C.ExecuteUbergraph_BP_Trap
// 0x03A8 (0x03A8 - 0x0000)
struct BP_Trap_C_ExecuteUbergraph_BP_Trap final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0008(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x00F0(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_NewParam_1;                           // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorInt_ReturnValue;             // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_NewParam;                             // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ApplyRadialDamage_ReturnValue;            // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable_1;                            // 0x0198(0x0010)(ConstParm, ReferenceParm)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_BoxTraceSingle_OutHit;                    // 0x01B0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BoxTraceSingle_ReturnValue;               // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29A[0x6];                                      // 0x029A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_1;              // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_CampClient_C*                       CallFunc_GetComponentByClass_ReturnValue;          // 0x02A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_1;  // 0x02B0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UCharacterMovementComponent*            CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0398(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ApplyRadialDamage_BaseDamage_ImplicitCast; // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Trap_C_ExecuteUbergraph_BP_Trap) == 0x000008, "Wrong alignment on BP_Trap_C_ExecuteUbergraph_BP_Trap");
static_assert(sizeof(BP_Trap_C_ExecuteUbergraph_BP_Trap) == 0x0003A8, "Wrong size on BP_Trap_C_ExecuteUbergraph_BP_Trap");
static_assert(offsetof(BP_Trap_C_ExecuteUbergraph_BP_Trap, EntryPoint) == 0x000000, "Member 'BP_Trap_C_ExecuteUbergraph_BP_Trap::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Trap_C_ExecuteUbergraph_BP_Trap, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000008, "Member 'BP_Trap_C_ExecuteUbergraph_BP_Trap::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Trap_C_ExecuteUbergraph_BP_Trap, Temp_object_Variable) == 0x0000F0, "Member 'BP_Trap_C_ExecuteUbergraph_BP_Trap::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_Trap_C_ExecuteUbergraph_BP_Trap, CallFunc_HasAuthority_ReturnValue) == 0x000100, "Member 'BP_Trap_C_ExecuteUbergraph_BP_Trap::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Trap_C_ExecuteUbergraph_BP_Trap, K2Node_Event_NewParam_1) == 0x000108, "Member 'BP_Trap_C_ExecuteUbergraph_BP_Trap::K2Node_Event_NewParam_1' has a wrong offset!");
static_assert(offsetof(BP_Trap_C_ExecuteUbergraph_BP_Trap, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000110, "Member 'BP_Trap_C_ExecuteUbergraph_BP_Trap::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Trap_C_ExecuteUbergraph_BP_Trap, CallFunc_Add_VectorVector_ReturnValue) == 0x000128, "Member 'BP_Trap_C_ExecuteUbergraph_BP_Trap::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Trap_C_ExecuteUbergraph_BP_Trap, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000140, "Member 'BP_Trap_C_ExecuteUbergraph_BP_Trap::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Trap_C_ExecuteUbergraph_BP_Trap, CallFunc_Divide_VectorInt_ReturnValue) == 0x000158, "Member 'BP_Trap_C_ExecuteUbergraph_BP_Trap::CallFunc_Divide_VectorInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Trap_C_ExecuteUbergraph_BP_Trap, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000170, "Member 'BP_Trap_C_ExecuteUbergraph_BP_Trap::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Trap_C_ExecuteUbergraph_BP_Trap, K2Node_Event_NewParam) == 0x000188, "Member 'BP_Trap_C_ExecuteUbergraph_BP_Trap::K2Node_Event_NewParam' has a wrong offset!");
static_assert(offsetof(BP_Trap_C_ExecuteUbergraph_BP_Trap, CallFunc_ApplyRadialDamage_ReturnValue) == 0x000190, "Member 'BP_Trap_C_ExecuteUbergraph_BP_Trap::CallFunc_ApplyRadialDamage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Trap_C_ExecuteUbergraph_BP_Trap, Temp_object_Variable_1) == 0x000198, "Member 'BP_Trap_C_ExecuteUbergraph_BP_Trap::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Trap_C_ExecuteUbergraph_BP_Trap, CallFunc_GetPlayerPawn_ReturnValue) == 0x0001A8, "Member 'BP_Trap_C_ExecuteUbergraph_BP_Trap::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Trap_C_ExecuteUbergraph_BP_Trap, CallFunc_BoxTraceSingle_OutHit) == 0x0001B0, "Member 'BP_Trap_C_ExecuteUbergraph_BP_Trap::CallFunc_BoxTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(BP_Trap_C_ExecuteUbergraph_BP_Trap, CallFunc_BoxTraceSingle_ReturnValue) == 0x000298, "Member 'BP_Trap_C_ExecuteUbergraph_BP_Trap::CallFunc_BoxTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Trap_C_ExecuteUbergraph_BP_Trap, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000299, "Member 'BP_Trap_C_ExecuteUbergraph_BP_Trap::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Trap_C_ExecuteUbergraph_BP_Trap, CallFunc_GetPlayerPawn_ReturnValue_1) == 0x0002A0, "Member 'BP_Trap_C_ExecuteUbergraph_BP_Trap::CallFunc_GetPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Trap_C_ExecuteUbergraph_BP_Trap, CallFunc_GetComponentByClass_ReturnValue) == 0x0002A8, "Member 'BP_Trap_C_ExecuteUbergraph_BP_Trap::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Trap_C_ExecuteUbergraph_BP_Trap, CallFunc_K2_SetRelativeRotation_SweepHitResult_1) == 0x0002B0, "Member 'BP_Trap_C_ExecuteUbergraph_BP_Trap::CallFunc_K2_SetRelativeRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_Trap_C_ExecuteUbergraph_BP_Trap, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000398, "Member 'BP_Trap_C_ExecuteUbergraph_BP_Trap::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Trap_C_ExecuteUbergraph_BP_Trap, CallFunc_ApplyRadialDamage_BaseDamage_ImplicitCast) == 0x0003A0, "Member 'BP_Trap_C_ExecuteUbergraph_BP_Trap::CallFunc_ApplyRadialDamage_BaseDamage_ImplicitCast' has a wrong offset!");

// Function BP_Trap.BP_Trap_C.OnCatch
// 0x0008 (0x0008 - 0x0000)
struct BP_Trap_C_OnCatch final
{
public:
	class APawn*                                  NewParam;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Trap_C_OnCatch) == 0x000008, "Wrong alignment on BP_Trap_C_OnCatch");
static_assert(sizeof(BP_Trap_C_OnCatch) == 0x000008, "Wrong size on BP_Trap_C_OnCatch");
static_assert(offsetof(BP_Trap_C_OnCatch, NewParam) == 0x000000, "Member 'BP_Trap_C_OnCatch::NewParam' has a wrong offset!");

// Function BP_Trap.BP_Trap_C.OnCatchMulti
// 0x0008 (0x0008 - 0x0000)
struct BP_Trap_C_OnCatchMulti final
{
public:
	class APawn*                                  NewParam;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Trap_C_OnCatchMulti) == 0x000008, "Wrong alignment on BP_Trap_C_OnCatchMulti");
static_assert(sizeof(BP_Trap_C_OnCatchMulti) == 0x000008, "Wrong size on BP_Trap_C_OnCatchMulti");
static_assert(offsetof(BP_Trap_C_OnCatchMulti, NewParam) == 0x000000, "Member 'BP_Trap_C_OnCatchMulti::NewParam' has a wrong offset!");

}

