#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TutorialBagSpawner

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_TutorialBagSpawner.BP_TutorialBagSpawner_C.CallTutorialBagSpawn_Serv
// 0x0008 (0x0008 - 0x0000)
struct BP_TutorialBagSpawner_C_CallTutorialBagSpawn_Serv final
{
public:
	class APlayerController*                      Controller;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TutorialBagSpawner_C_CallTutorialBagSpawn_Serv) == 0x000008, "Wrong alignment on BP_TutorialBagSpawner_C_CallTutorialBagSpawn_Serv");
static_assert(sizeof(BP_TutorialBagSpawner_C_CallTutorialBagSpawn_Serv) == 0x000008, "Wrong size on BP_TutorialBagSpawner_C_CallTutorialBagSpawn_Serv");
static_assert(offsetof(BP_TutorialBagSpawner_C_CallTutorialBagSpawn_Serv, Controller) == 0x000000, "Member 'BP_TutorialBagSpawner_C_CallTutorialBagSpawn_Serv::Controller' has a wrong offset!");

// Function BP_TutorialBagSpawner.BP_TutorialBagSpawner_C.ExecuteUbergraph_BP_TutorialBagSpawner
// 0x00A0 (0x00A0 - 0x0000)
struct BP_TutorialBagSpawner_C_ExecuteUbergraph_BP_TutorialBagSpawner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_CustomEvent_Controller;                     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvPC_C*                              K2Node_DynamicCast_AsSurv_PC;                      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0xF];                                       // 0x0021(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0030(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALP_TutorBag_C*                         CallFunc_FinishSpawningActor_ReturnValue;          // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TutorialBagSpawner_C_ExecuteUbergraph_BP_TutorialBagSpawner) == 0x000010, "Wrong alignment on BP_TutorialBagSpawner_C_ExecuteUbergraph_BP_TutorialBagSpawner");
static_assert(sizeof(BP_TutorialBagSpawner_C_ExecuteUbergraph_BP_TutorialBagSpawner) == 0x0000A0, "Wrong size on BP_TutorialBagSpawner_C_ExecuteUbergraph_BP_TutorialBagSpawner");
static_assert(offsetof(BP_TutorialBagSpawner_C_ExecuteUbergraph_BP_TutorialBagSpawner, EntryPoint) == 0x000000, "Member 'BP_TutorialBagSpawner_C_ExecuteUbergraph_BP_TutorialBagSpawner::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TutorialBagSpawner_C_ExecuteUbergraph_BP_TutorialBagSpawner, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BP_TutorialBagSpawner_C_ExecuteUbergraph_BP_TutorialBagSpawner::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TutorialBagSpawner_C_ExecuteUbergraph_BP_TutorialBagSpawner, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'BP_TutorialBagSpawner_C_ExecuteUbergraph_BP_TutorialBagSpawner::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TutorialBagSpawner_C_ExecuteUbergraph_BP_TutorialBagSpawner, K2Node_CustomEvent_Controller) == 0x000010, "Member 'BP_TutorialBagSpawner_C_ExecuteUbergraph_BP_TutorialBagSpawner::K2Node_CustomEvent_Controller' has a wrong offset!");
static_assert(offsetof(BP_TutorialBagSpawner_C_ExecuteUbergraph_BP_TutorialBagSpawner, K2Node_DynamicCast_AsSurv_PC) == 0x000018, "Member 'BP_TutorialBagSpawner_C_ExecuteUbergraph_BP_TutorialBagSpawner::K2Node_DynamicCast_AsSurv_PC' has a wrong offset!");
static_assert(offsetof(BP_TutorialBagSpawner_C_ExecuteUbergraph_BP_TutorialBagSpawner, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_TutorialBagSpawner_C_ExecuteUbergraph_BP_TutorialBagSpawner::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_TutorialBagSpawner_C_ExecuteUbergraph_BP_TutorialBagSpawner, CallFunc_GetTransform_ReturnValue) == 0x000030, "Member 'BP_TutorialBagSpawner_C_ExecuteUbergraph_BP_TutorialBagSpawner::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TutorialBagSpawner_C_ExecuteUbergraph_BP_TutorialBagSpawner, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000090, "Member 'BP_TutorialBagSpawner_C_ExecuteUbergraph_BP_TutorialBagSpawner::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TutorialBagSpawner_C_ExecuteUbergraph_BP_TutorialBagSpawner, CallFunc_FinishSpawningActor_ReturnValue) == 0x000098, "Member 'BP_TutorialBagSpawner_C_ExecuteUbergraph_BP_TutorialBagSpawner::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

}

