#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TrajectorySpline

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_TrajectorySpline.BP_TrajectorySpline_C.ExecuteUbergraph_BP_TrajectorySpline
// 0x0210 (0x0210 - 0x0000)
struct BP_TrajectorySpline_C_ExecuteUbergraph_BP_TrajectorySpline final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0028(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0128(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_TrajectorySpline_C_ExecuteUbergraph_BP_TrajectorySpline) == 0x000008, "Wrong alignment on BP_TrajectorySpline_C_ExecuteUbergraph_BP_TrajectorySpline");
static_assert(sizeof(BP_TrajectorySpline_C_ExecuteUbergraph_BP_TrajectorySpline) == 0x000210, "Wrong size on BP_TrajectorySpline_C_ExecuteUbergraph_BP_TrajectorySpline");
static_assert(offsetof(BP_TrajectorySpline_C_ExecuteUbergraph_BP_TrajectorySpline, EntryPoint) == 0x000000, "Member 'BP_TrajectorySpline_C_ExecuteUbergraph_BP_TrajectorySpline::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TrajectorySpline_C_ExecuteUbergraph_BP_TrajectorySpline, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_TrajectorySpline_C_ExecuteUbergraph_BP_TrajectorySpline::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_TrajectorySpline_C_ExecuteUbergraph_BP_TrajectorySpline, CallFunc_Array_LastIndex_ReturnValue) == 0x000008, "Member 'BP_TrajectorySpline_C_ExecuteUbergraph_BP_TrajectorySpline::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrajectorySpline_C_ExecuteUbergraph_BP_TrajectorySpline, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_TrajectorySpline_C_ExecuteUbergraph_BP_TrajectorySpline::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_TrajectorySpline_C_ExecuteUbergraph_BP_TrajectorySpline, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000028, "Member 'BP_TrajectorySpline_C_ExecuteUbergraph_BP_TrajectorySpline::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_TrajectorySpline_C_ExecuteUbergraph_BP_TrajectorySpline, CallFunc_MakeRotFromX_ReturnValue) == 0x000110, "Member 'BP_TrajectorySpline_C_ExecuteUbergraph_BP_TrajectorySpline::CallFunc_MakeRotFromX_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrajectorySpline_C_ExecuteUbergraph_BP_TrajectorySpline, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000128, "Member 'BP_TrajectorySpline_C_ExecuteUbergraph_BP_TrajectorySpline::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");

// Function BP_TrajectorySpline.BP_TrajectorySpline_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_TrajectorySpline_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TrajectorySpline_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_TrajectorySpline_C_ReceiveTick");
static_assert(sizeof(BP_TrajectorySpline_C_ReceiveTick) == 0x000004, "Wrong size on BP_TrajectorySpline_C_ReceiveTick");
static_assert(offsetof(BP_TrajectorySpline_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_TrajectorySpline_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

