#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TrainingApp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_InteractType_structs.hpp"
#include "E_ActorType_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_TrainingApp.BP_TrainingApp_C.CollisionSwitcher
// 0x0001 (0x0001 - 0x0000)
struct BP_TrainingApp_C_CollisionSwitcher final
{
public:
	bool                                          Off_;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TrainingApp_C_CollisionSwitcher) == 0x000001, "Wrong alignment on BP_TrainingApp_C_CollisionSwitcher");
static_assert(sizeof(BP_TrainingApp_C_CollisionSwitcher) == 0x000001, "Wrong size on BP_TrainingApp_C_CollisionSwitcher");
static_assert(offsetof(BP_TrainingApp_C_CollisionSwitcher, Off_) == 0x000000, "Member 'BP_TrainingApp_C_CollisionSwitcher::Off_' has a wrong offset!");

// Function BP_TrainingApp.BP_TrainingApp_C.ExecuteUbergraph_BP_TrainingApp
// 0x0840 (0x0840 - 0x0000)
struct BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_14;                  // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_13;                  // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_12;                  // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_11;                  // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x005C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_10;                  // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x0074(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x0084(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             Temp_byte_Variable;                                // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             Temp_byte_Variable_1;                              // 0x008E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8F[0x1];                                       // 0x008F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_9;                   // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x0098(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_8;                   // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_6;            // 0x00B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_7;                   // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_7;            // 0x00C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_6;                   // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_8;            // 0x00E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_5;                   // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_9;            // 0x00F8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_10;           // 0x0110(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x0124(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x012C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_11;           // 0x0134(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x0144(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_12;           // 0x014C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x015C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_13;           // 0x0164(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0174(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_14;           // 0x017C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_3;                              // 0x018C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x0195(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0196(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0197(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_Player_8;                             // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_Player_7;                             // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_Player_6;                             // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_Player_5;                             // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SitIndex;                             // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_SkipAnimation;                        // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BD[0x3];                                      // 0x01BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_Player_4;                             // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_Player_3;                             // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Visible_1;                            // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Visible;                              // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D2[0x6];                                      // 0x01D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      K2Node_CustomEvent_Player_4;                       // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_OnTrain;                        // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E2[0x6];                                      // 0x01E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_V2_C*                   K2Node_DynamicCast_AsSurvival_Player_V2;           // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x3];                                      // 0x01F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_18;                  // 0x01F4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_CustomEvent_Player_3;                       // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Sit_1;                          // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_212[0x6];                                      // 0x0212(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      K2Node_CustomEvent_Player_2;                       // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Sit;                            // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0230(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   K2Node_CustomEvent_Name;                           // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 K2Node_CustomEvent_Mesh;                           // 0x0250(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_CustomEvent_Player_1;                       // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult; // 0x0260(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0348(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_Player_2;                             // 0x0350(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0358(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_GameHUD_C*                          K2Node_DynamicCast_AsBP_Game_HUD;                  // 0x0360(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_369[0x3];                                      // 0x0369(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_15;           // 0x036C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37C[0x4];                                      // 0x037C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_Player_1;                             // 0x0380(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_15;                  // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_19;                  // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0398(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_16;           // 0x03A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue_1;                     // 0x03B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_GameHUD_C*                          K2Node_DynamicCast_AsBP_Game_HUD_1;                // 0x03B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C1[0x3];                                      // 0x03C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_16;                  // 0x03C4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Start__1;                       // 0x03CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CD[0x3];                                      // 0x03CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      K2Node_CustomEvent_Player;                         // 0x03D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_17;           // 0x03D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayerCutsceneComponent_C*             CallFunc_GetComponentByClass_ReturnValue;          // 0x03E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Start_;                         // 0x03F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Off_;                           // 0x03F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x03F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             K2Node_Select_Default;                             // 0x03F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x03F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F6[0x2];                                      // 0x03F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x03F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0400(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival;                  // 0x0408(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_411[0x7];                                      // 0x0411(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival_1;                // 0x0418(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x0421(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_1;        // 0x0422(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_2;        // 0x0423(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_424[0x4];                                      // 0x0424(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x0428(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetDefaultCameraTag_CameraModeTag;        // 0x0430(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_438[0x8];                                      // 0x0438(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0440(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x04A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x04B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x04D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocationAndRotation_SweepHitResult; // 0x04E8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocationAndRotation_ReturnValue; // 0x05D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D1[0x3];                                      // 0x05D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_18;           // 0x05D4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_3;        // 0x05E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E5[0x3];                                      // 0x05E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x05E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_1;     // 0x05F0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x0650(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x0668(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x0680(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0698(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_699[0x7];                                      // 0x0699(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_Player;                               // 0x06A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_4;        // 0x06A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A9[0x3];                                      // 0x06A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_17;                  // 0x06AC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x06B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x06B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B9[0x7];                                      // 0x06B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue_1;    // 0x06C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue_1;        // 0x06D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x06D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DA[0x2];                                      // 0x06DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_19;           // 0x06DC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_20;           // 0x06EC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_5;        // 0x06FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6FD[0x3];                                      // 0x06FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0700(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0708(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0709(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_70A[0x6];                                      // 0x070A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_2;            // 0x0710(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult_1; // 0x0718(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UAnimMontage*                           K2Node_Select_Default_1;                           // 0x0800(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_Select_Default_2;                           // 0x0808(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1; // 0x0810(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_2; // 0x0818(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0820(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0821(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_822[0x6];                                      // 0x0822(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_Select_Default_3;                           // 0x0828(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_3; // 0x0830(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_6;        // 0x0838(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0839(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_7;        // 0x083A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp) == 0x000010, "Wrong alignment on BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp");
static_assert(sizeof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp) == 0x000840, "Wrong size on BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, EntryPoint) == 0x000000, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, Temp_name_Variable) == 0x000004, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_CustomEvent_NotifyName_14) == 0x00000C, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_CustomEvent_NotifyName_14' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_CustomEvent_NotifyName_13) == 0x000024, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_CustomEvent_NotifyName_13' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_CreateDelegate_OutputDelegate_1) == 0x00002C, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_CustomEvent_NotifyName_12) == 0x00003C, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_CustomEvent_NotifyName_12' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_CreateDelegate_OutputDelegate_2) == 0x000044, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_CustomEvent_NotifyName_11) == 0x000054, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_CustomEvent_NotifyName_11' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_CreateDelegate_OutputDelegate_3) == 0x00005C, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_CustomEvent_NotifyName_10) == 0x00006C, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_CustomEvent_NotifyName_10' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_CreateDelegate_OutputDelegate_4) == 0x000074, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, Temp_name_Variable_1) == 0x000084, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, Temp_bool_Variable) == 0x00008C, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, Temp_byte_Variable) == 0x00008D, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, Temp_byte_Variable_1) == 0x00008E, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_CustomEvent_NotifyName_9) == 0x000090, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_CustomEvent_NotifyName_9' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_CreateDelegate_OutputDelegate_5) == 0x000098, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_CustomEvent_NotifyName_8) == 0x0000A8, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_CustomEvent_NotifyName_8' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_CreateDelegate_OutputDelegate_6) == 0x0000B0, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_CustomEvent_NotifyName_7) == 0x0000C0, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_CustomEvent_NotifyName_7' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_CreateDelegate_OutputDelegate_7) == 0x0000C8, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_CustomEvent_NotifyName_6) == 0x0000D8, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_CustomEvent_NotifyName_6' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_CreateDelegate_OutputDelegate_8) == 0x0000E0, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_CustomEvent_NotifyName_5) == 0x0000F0, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_CustomEvent_NotifyName_5' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_CreateDelegate_OutputDelegate_9) == 0x0000F8, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, Temp_name_Variable_2) == 0x000108, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_CreateDelegate_OutputDelegate_10) == 0x000110, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000120, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_CustomEvent_NotifyName_4) == 0x000124, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_CustomEvent_NotifyName_3) == 0x00012C, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_CreateDelegate_OutputDelegate_11) == 0x000134, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_CustomEvent_NotifyName_2) == 0x000144, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_CreateDelegate_OutputDelegate_12) == 0x00014C, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_CustomEvent_NotifyName_1) == 0x00015C, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_CreateDelegate_OutputDelegate_13) == 0x000164, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_CreateDelegate_OutputDelegate_13' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_CustomEvent_NotifyName) == 0x000174, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_CreateDelegate_OutputDelegate_14) == 0x00017C, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_CreateDelegate_OutputDelegate_14' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, Temp_name_Variable_3) == 0x00018C, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, Temp_bool_Variable_1) == 0x000194, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x000195, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, Temp_bool_Variable_2) == 0x000196, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, Temp_bool_Variable_3) == 0x000197, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_Event_Player_8) == 0x000198, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_Event_Player_8' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_Event_Player_7) == 0x0001A0, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_Event_Player_7' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_Event_Player_6) == 0x0001A8, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_Event_Player_6' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_Event_Player_5) == 0x0001B0, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_Event_Player_5' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_Event_SitIndex) == 0x0001B8, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_Event_SitIndex' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_Event_SkipAnimation) == 0x0001BC, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_Event_SkipAnimation' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_Event_Player_4) == 0x0001C0, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_Event_Player_4' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_Event_Player_3) == 0x0001C8, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_Event_Player_3' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_Event_Visible_1) == 0x0001D0, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_Event_Visible_1' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_Event_Visible) == 0x0001D1, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_Event_Visible' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_CustomEvent_Player_4) == 0x0001D8, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_CustomEvent_Player_4' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_CustomEvent_OnTrain) == 0x0001E0, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_CustomEvent_OnTrain' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, CallFunc_Not_PreBool_ReturnValue) == 0x0001E1, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_DynamicCast_AsSurvival_Player_V2) == 0x0001E8, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_DynamicCast_AsSurvival_Player_V2' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_DynamicCast_bSuccess) == 0x0001F0, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_CustomEvent_NotifyName_18) == 0x0001F4, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_CustomEvent_NotifyName_18' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x000200, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_CustomEvent_Player_3) == 0x000208, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_CustomEvent_Player_3' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_CustomEvent_Sit_1) == 0x000210, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_CustomEvent_Sit_1' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, CallFunc_IsValid_ReturnValue) == 0x000211, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_CustomEvent_Player_2) == 0x000218, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_CustomEvent_Player_2' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_CustomEvent_Sit) == 0x000220, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_CustomEvent_Sit' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, CallFunc_GetAnimInstance_ReturnValue) == 0x000228, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000230, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_CustomEvent_Name) == 0x000248, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_CustomEvent_Name' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_CustomEvent_Mesh) == 0x000250, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_CustomEvent_Mesh' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_CustomEvent_Player_1) == 0x000258, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_CustomEvent_Player_1' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult) == 0x000260, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, CallFunc_GetPlayerController_ReturnValue) == 0x000348, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_Event_Player_2) == 0x000350, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_Event_Player_2' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, CallFunc_GetHUD_ReturnValue) == 0x000358, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_DynamicCast_AsBP_Game_HUD) == 0x000360, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_DynamicCast_AsBP_Game_HUD' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_DynamicCast_bSuccess_1) == 0x000368, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_CreateDelegate_OutputDelegate_15) == 0x00036C, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_CreateDelegate_OutputDelegate_15' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_Event_Player_1) == 0x000380, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_Event_Player_1' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_CustomEvent_NotifyName_15) == 0x000388, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_CustomEvent_NotifyName_15' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_CustomEvent_NotifyName_19) == 0x000390, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_CustomEvent_NotifyName_19' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, CallFunc_GetPlayerController_ReturnValue_1) == 0x000398, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_CreateDelegate_OutputDelegate_16) == 0x0003A0, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_CreateDelegate_OutputDelegate_16' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, CallFunc_GetHUD_ReturnValue_1) == 0x0003B0, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::CallFunc_GetHUD_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_DynamicCast_AsBP_Game_HUD_1) == 0x0003B8, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_DynamicCast_AsBP_Game_HUD_1' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_DynamicCast_bSuccess_2) == 0x0003C0, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_CustomEvent_NotifyName_16) == 0x0003C4, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_CustomEvent_NotifyName_16' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_CustomEvent_Start__1) == 0x0003CC, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_CustomEvent_Start__1' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_CustomEvent_Player) == 0x0003D0, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_CustomEvent_Player' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_CreateDelegate_OutputDelegate_17) == 0x0003D8, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_CreateDelegate_OutputDelegate_17' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, CallFunc_GetComponentByClass_ReturnValue) == 0x0003E8, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, CallFunc_IsValid_ReturnValue_1) == 0x0003F0, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_CustomEvent_Start_) == 0x0003F1, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_CustomEvent_Start_' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_CustomEvent_Off_) == 0x0003F2, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_CustomEvent_Off_' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, CallFunc_Not_PreBool_ReturnValue_1) == 0x0003F3, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_Select_Default) == 0x0003F4, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, CallFunc_IsLocallyControlled_ReturnValue) == 0x0003F5, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, CallFunc_GetGameInstance_ReturnValue) == 0x0003F8, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, CallFunc_GetGameInstance_ReturnValue_1) == 0x000400, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_DynamicCast_AsGI_Survival) == 0x000408, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_DynamicCast_AsGI_Survival' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_DynamicCast_bSuccess_3) == 0x000410, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_DynamicCast_AsGI_Survival_1) == 0x000418, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_DynamicCast_AsGI_Survival_1' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_DynamicCast_bSuccess_4) == 0x000420, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, CallFunc_K2_SetActorRotation_ReturnValue) == 0x000421, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, CallFunc_IsLocallyControlled_ReturnValue_1) == 0x000422, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::CallFunc_IsLocallyControlled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, CallFunc_IsLocallyControlled_ReturnValue_2) == 0x000423, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::CallFunc_IsLocallyControlled_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, CallFunc_GetAnimInstance_ReturnValue_1) == 0x000428, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, CallFunc_GetDefaultCameraTag_CameraModeTag) == 0x000430, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::CallFunc_GetDefaultCameraTag_CameraModeTag' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000440, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, CallFunc_BreakTransform_Location) == 0x0004A0, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, CallFunc_BreakTransform_Rotation) == 0x0004B8, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, CallFunc_BreakTransform_Scale) == 0x0004D0, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, CallFunc_K2_SetActorLocationAndRotation_SweepHitResult) == 0x0004E8, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::CallFunc_K2_SetActorLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, CallFunc_K2_SetActorLocationAndRotation_ReturnValue) == 0x0005D0, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::CallFunc_K2_SetActorLocationAndRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, K2Node_CreateDelegate_OutputDelegate_18) == 0x0005D4, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::K2Node_CreateDelegate_OutputDelegate_18' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, CallFunc_IsLocallyControlled_ReturnValue_3) == 0x0005E4, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::CallFunc_IsLocallyControlled_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, CallFunc_GetPlayerController_ReturnValue_2) == 0x0005E8, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, CallFunc_K2_GetComponentToWorld_ReturnValue_1) == 0x0005F0, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::CallFunc_K2_GetComponentToWorld_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp, CallFunc_BreakTransform_Location_1) == 0x000650, "Member 'BP_TrainingApp_C_ExecuteUbergraph_BP_TrainingApp::CallFunc_BreakTransform_Location_1' has a wrong offset!");
