#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TutorialBagSpawner

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TutorialBagSpawner.BP_TutorialBagSpawner_C
// 0x0018 (0x02A8 - 0x0290)
class ABP_TutorialBagSpawner_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Mesh;                                              // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void CallTutorialBagSpawn_Serv(class APlayerController* Controller);
	void ExecuteUbergraph_BP_TutorialBagSpawner(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TutorialBagSpawner_C">();
	}
	static class ABP_TutorialBagSpawner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_TutorialBagSpawner_C>();
	}
};
static_assert(alignof(ABP_TutorialBagSpawner_C) == 0x000008, "Wrong alignment on ABP_TutorialBagSpawner_C");
static_assert(sizeof(ABP_TutorialBagSpawner_C) == 0x0002A8, "Wrong size on ABP_TutorialBagSpawner_C");
static_assert(offsetof(ABP_TutorialBagSpawner_C, UberGraphFrame) == 0x000290, "Member 'ABP_TutorialBagSpawner_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_TutorialBagSpawner_C, Mesh) == 0x000298, "Member 'ABP_TutorialBagSpawner_C::Mesh' has a wrong offset!");
static_assert(offsetof(ABP_TutorialBagSpawner_C, DefaultSceneRoot) == 0x0002A0, "Member 'ABP_TutorialBagSpawner_C::DefaultSceneRoot' has a wrong offset!");

}

