#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TrailComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TrailComponent.BP_TrailComponent_C
// 0x00A0 (0x0340 - 0x02A0)
class UBP_TrailComponent_C final : public USceneComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABP_TrailsManager_C*                    TrailManagerInstance;                              // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, NoDestructor, HasGetValueTypeHash)
	double                                        Hardness;                                          // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ReceivingActorsTag;                                // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CalculatedRadius;                                  // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OnlyRadiusV3;                                      // 0x02C8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CurLocation;                                       // 0x02E0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ParticleDelay;                                     // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Velocity;                                          // 0x0300(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SpawnEmitters;                                     // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	bool                                          SpawnTick;                                         // 0x0319(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsWorking;                                         // 0x031A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	bool                                          UpdateAnyway;                                      // 0x031B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31C[0x4];                                      // 0x031C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        FarDelayValue;                                     // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDebug;                                           // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FootInWater;                                       // 0x0329(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TickEnabled;                                       // 0x032A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SkipStartDelay;                                    // 0x032B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RadiusCalcValue;                                   // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_TrailComponent(int32 EntryPoint);
	void ParticleCalculation(int32 ParticleType, bool* Continue);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TrailComponent_C">();
	}
	static class UBP_TrailComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_TrailComponent_C>();
	}
};
static_assert(alignof(UBP_TrailComponent_C) == 0x000010, "Wrong alignment on UBP_TrailComponent_C");
static_assert(sizeof(UBP_TrailComponent_C) == 0x000340, "Wrong size on UBP_TrailComponent_C");
static_assert(offsetof(UBP_TrailComponent_C, UberGraphFrame) == 0x0002A0, "Member 'UBP_TrailComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_TrailComponent_C, TrailManagerInstance) == 0x0002A8, "Member 'UBP_TrailComponent_C::TrailManagerInstance' has a wrong offset!");
static_assert(offsetof(UBP_TrailComponent_C, Hardness) == 0x0002B0, "Member 'UBP_TrailComponent_C::Hardness' has a wrong offset!");
static_assert(offsetof(UBP_TrailComponent_C, ReceivingActorsTag) == 0x0002B8, "Member 'UBP_TrailComponent_C::ReceivingActorsTag' has a wrong offset!");
static_assert(offsetof(UBP_TrailComponent_C, CalculatedRadius) == 0x0002C0, "Member 'UBP_TrailComponent_C::CalculatedRadius' has a wrong offset!");
static_assert(offsetof(UBP_TrailComponent_C, OnlyRadiusV3) == 0x0002C8, "Member 'UBP_TrailComponent_C::OnlyRadiusV3' has a wrong offset!");
static_assert(offsetof(UBP_TrailComponent_C, CurLocation) == 0x0002E0, "Member 'UBP_TrailComponent_C::CurLocation' has a wrong offset!");
static_assert(offsetof(UBP_TrailComponent_C, ParticleDelay) == 0x0002F8, "Member 'UBP_TrailComponent_C::ParticleDelay' has a wrong offset!");
static_assert(offsetof(UBP_TrailComponent_C, Velocity) == 0x000300, "Member 'UBP_TrailComponent_C::Velocity' has a wrong offset!");
static_assert(offsetof(UBP_TrailComponent_C, SpawnEmitters) == 0x000318, "Member 'UBP_TrailComponent_C::SpawnEmitters' has a wrong offset!");
static_assert(offsetof(UBP_TrailComponent_C, SpawnTick) == 0x000319, "Member 'UBP_TrailComponent_C::SpawnTick' has a wrong offset!");
static_assert(offsetof(UBP_TrailComponent_C, IsWorking) == 0x00031A, "Member 'UBP_TrailComponent_C::IsWorking' has a wrong offset!");
static_assert(offsetof(UBP_TrailComponent_C, UpdateAnyway) == 0x00031B, "Member 'UBP_TrailComponent_C::UpdateAnyway' has a wrong offset!");
static_assert(offsetof(UBP_TrailComponent_C, FarDelayValue) == 0x000320, "Member 'UBP_TrailComponent_C::FarDelayValue' has a wrong offset!");
static_assert(offsetof(UBP_TrailComponent_C, IsDebug) == 0x000328, "Member 'UBP_TrailComponent_C::IsDebug' has a wrong offset!");
static_assert(offsetof(UBP_TrailComponent_C, FootInWater) == 0x000329, "Member 'UBP_TrailComponent_C::FootInWater' has a wrong offset!");
static_assert(offsetof(UBP_TrailComponent_C, TickEnabled) == 0x00032A, "Member 'UBP_TrailComponent_C::TickEnabled' has a wrong offset!");
static_assert(offsetof(UBP_TrailComponent_C, SkipStartDelay) == 0x00032B, "Member 'UBP_TrailComponent_C::SkipStartDelay' has a wrong offset!");
static_assert(offsetof(UBP_TrailComponent_C, RadiusCalcValue) == 0x000330, "Member 'UBP_TrailComponent_C::RadiusCalcValue' has a wrong offset!");

}

