#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TeleportToRegion

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "DayCycleState_structs.hpp"


namespace SDK::Params
{

// Function BP_TeleportToRegion.BP_TeleportToRegion_C.ExecuteUbergraph_BP_TeleportToRegion
// 0x0168 (0x0168 - 0x0000)
struct BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ActorHasTag_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_OtherActor_1;                         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAVS_VehicleMaster_C*                   K2Node_DynamicCast_AsAVS_Vehicle_Master;           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAVS_VehicleMaster_C*                   K2Node_DynamicCast_AsAVS_Vehicle_Master_1;         // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_V2_C*                   K2Node_DynamicCast_AsSurvival_Player_V2;           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EventInstanceIsValid_ReturnValue;         // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_GameHUD_C*                          K2Node_DynamicCast_AsBP_Game_HUD;                  // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_V2_C*                   K2Node_DynamicCast_AsSurvival_Player_V2_1;         // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_V2_C*                   K2Node_DynamicCast_AsSurvival_Player_V2_2;         // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_In_Out;                               // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Event_Position;                             // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue_1;                     // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_GameHUD_C*                          K2Node_DynamicCast_AsBP_Game_HUD_1;                // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC;                  // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CloseTabsWindow_Success;                  // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F3[0x1];                                       // 0x00F3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      CallFunc_Array_Get_Item;                           // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      CallFunc_Array_Get_Item_1;                         // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_V2_C*                   K2Node_DynamicCast_AsSurvival_Player_V2_3;         // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_V2_C*                   K2Node_DynamicCast_AsSurvival_Player_V2_4;         // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_132[0x2];                                      // 0x0132(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TPWithTag_Result;                         // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TPWithTag_bIsWithoutBackpack;             // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TPWithTag_nightWarning;                   // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TPWithTag_dayWarning;                     // 0x013B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ActorHasTag_ReturnValue_1;                // 0x013D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x013E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x013F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ActorHasTag_ReturnValue_2;                // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_155[0x3];                                      // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ActorHasTag_ReturnValue_3;                // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ActorHasTag_ReturnValue_4;                // 0x015D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x015E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x015F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Teleporting_Timer_ImplicitCast;           // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion) == 0x000008, "Wrong alignment on BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion");
static_assert(sizeof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion) == 0x000168, "Wrong size on BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, EntryPoint) == 0x000000, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, CallFunc_ActorHasTag_ReturnValue) == 0x000004, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::CallFunc_ActorHasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, K2Node_Event_OtherActor_1) == 0x000018, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::K2Node_Event_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, K2Node_Event_OtherActor) == 0x000020, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, K2Node_DynamicCast_AsAVS_Vehicle_Master) == 0x000028, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::K2Node_DynamicCast_AsAVS_Vehicle_Master' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, K2Node_DynamicCast_AsAVS_Vehicle_Master_1) == 0x000038, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::K2Node_DynamicCast_AsAVS_Vehicle_Master_1' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, CallFunc_Array_Length_ReturnValue) == 0x000044, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, CallFunc_Array_Length_ReturnValue_1) == 0x000048, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, K2Node_DynamicCast_AsSurvival_Player_V2) == 0x000050, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::K2Node_DynamicCast_AsSurvival_Player_V2' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, K2Node_DynamicCast_bSuccess_2) == 0x000058, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, CallFunc_Less_IntInt_ReturnValue) == 0x000059, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, CallFunc_GetHUD_ReturnValue) == 0x000060, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, CallFunc_EventInstanceIsValid_ReturnValue) == 0x000068, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::CallFunc_EventInstanceIsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, K2Node_DynamicCast_AsBP_Game_HUD) == 0x000070, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::K2Node_DynamicCast_AsBP_Game_HUD' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, K2Node_DynamicCast_bSuccess_3) == 0x000078, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, CallFunc_IsLocallyControlled_ReturnValue) == 0x000079, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, K2Node_DynamicCast_AsSurvival_Player_V2_1) == 0x000080, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::K2Node_DynamicCast_AsSurvival_Player_V2_1' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, K2Node_DynamicCast_bSuccess_4) == 0x000088, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, K2Node_DynamicCast_AsSurvival_Player_V2_2) == 0x000090, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::K2Node_DynamicCast_AsSurvival_Player_V2_2' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, K2Node_DynamicCast_bSuccess_5) == 0x000098, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, K2Node_Event_In_Out) == 0x000099, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::K2Node_Event_In_Out' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, K2Node_Event_Position) == 0x0000A0, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::K2Node_Event_Position' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, CallFunc_GetHUD_ReturnValue_1) == 0x0000B0, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::CallFunc_GetHUD_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, K2Node_DynamicCast_AsBP_Game_HUD_1) == 0x0000B8, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::K2Node_DynamicCast_AsBP_Game_HUD_1' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, K2Node_DynamicCast_bSuccess_6) == 0x0000C0, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, CallFunc_K2_GetPawn_ReturnValue) == 0x0000C8, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, CallFunc_HasAuthority_ReturnValue) == 0x0000D0, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, CallFunc_HasAuthority_ReturnValue_1) == 0x0000D1, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, K2Node_DynamicCast_AsBPI_Surv_PC) == 0x0000D8, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::K2Node_DynamicCast_AsBPI_Surv_PC' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, K2Node_DynamicCast_bSuccess_7) == 0x0000E8, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, CallFunc_Array_Length_ReturnValue_2) == 0x0000EC, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, CallFunc_CloseTabsWindow_Success) == 0x0000F0, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::CallFunc_CloseTabsWindow_Success' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, CallFunc_HasAuthority_ReturnValue_2) == 0x0000F1, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, CallFunc_IsValid_ReturnValue) == 0x0000F2, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, Temp_int_Array_Index_Variable) == 0x0000F4, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, Temp_int_Array_Index_Variable_1) == 0x0000F8, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, CallFunc_Array_Get_Item) == 0x000100, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, CallFunc_Array_Get_Item_1) == 0x000108, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, K2Node_DynamicCast_AsSurvival_Player_V2_3) == 0x000110, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::K2Node_DynamicCast_AsSurvival_Player_V2_3' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, K2Node_DynamicCast_bSuccess_8) == 0x000118, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, CallFunc_Array_Find_ReturnValue) == 0x00011C, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000120, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, K2Node_DynamicCast_AsSurvival_Player_V2_4) == 0x000128, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::K2Node_DynamicCast_AsSurvival_Player_V2_4' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, K2Node_DynamicCast_bSuccess_9) == 0x000130, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, CallFunc_BooleanOR_ReturnValue) == 0x000131, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, CallFunc_Array_Length_ReturnValue_3) == 0x000134, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, CallFunc_TPWithTag_Result) == 0x000138, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::CallFunc_TPWithTag_Result' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, CallFunc_TPWithTag_bIsWithoutBackpack) == 0x000139, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::CallFunc_TPWithTag_bIsWithoutBackpack' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, CallFunc_TPWithTag_nightWarning) == 0x00013A, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::CallFunc_TPWithTag_nightWarning' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, CallFunc_TPWithTag_dayWarning) == 0x00013B, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::CallFunc_TPWithTag_dayWarning' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00013C, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, CallFunc_ActorHasTag_ReturnValue_1) == 0x00013D, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::CallFunc_ActorHasTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00013E, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, CallFunc_IsValid_ReturnValue_1) == 0x00013F, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, CallFunc_ActorHasTag_ReturnValue_2) == 0x000140, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::CallFunc_ActorHasTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, Temp_int_Loop_Counter_Variable) == 0x000144, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, CallFunc_Less_IntInt_ReturnValue_1) == 0x000148, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, CallFunc_Add_IntInt_ReturnValue) == 0x00014C, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, Temp_int_Loop_Counter_Variable_1) == 0x000150, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, CallFunc_Less_IntInt_ReturnValue_2) == 0x000154, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, CallFunc_Add_IntInt_ReturnValue_1) == 0x000158, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, CallFunc_ActorHasTag_ReturnValue_3) == 0x00015C, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::CallFunc_ActorHasTag_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, CallFunc_ActorHasTag_ReturnValue_4) == 0x00015D, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::CallFunc_ActorHasTag_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, CallFunc_BooleanOR_ReturnValue_1) == 0x00015E, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, CallFunc_BooleanOR_ReturnValue_2) == 0x00015F, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion, CallFunc_Teleporting_Timer_ImplicitCast) == 0x000160, "Member 'BP_TeleportToRegion_C_ExecuteUbergraph_BP_TeleportToRegion::CallFunc_Teleporting_Timer_ImplicitCast' has a wrong offset!");

// Function BP_TeleportToRegion.BP_TeleportToRegion_C.GetMapIconData
// 0x0090 (0x0090 - 0x0000)
struct BP_TeleportToRegion_C_GetMapIconData final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Icon;                                              // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              IconSize;                                          // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RotationYaw;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 WorldActor;                                        // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   Param_Name;                                        // 0x0040(0x0018)(Parm, OutParm)
	class FText                                   Description;                                       // 0x0058(0x0018)(Parm, OutParm)
	double                                        CallFunc_MakeLiteralDouble_ReturnValue;            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TeleportToRegion_C_GetMapIconData) == 0x000008, "Wrong alignment on BP_TeleportToRegion_C_GetMapIconData");
static_assert(sizeof(BP_TeleportToRegion_C_GetMapIconData) == 0x000090, "Wrong size on BP_TeleportToRegion_C_GetMapIconData");
static_assert(offsetof(BP_TeleportToRegion_C_GetMapIconData, Location) == 0x000000, "Member 'BP_TeleportToRegion_C_GetMapIconData::Location' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_GetMapIconData, Icon) == 0x000018, "Member 'BP_TeleportToRegion_C_GetMapIconData::Icon' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_GetMapIconData, IconSize) == 0x000020, "Member 'BP_TeleportToRegion_C_GetMapIconData::IconSize' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_GetMapIconData, RotationYaw) == 0x000030, "Member 'BP_TeleportToRegion_C_GetMapIconData::RotationYaw' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_GetMapIconData, WorldActor) == 0x000038, "Member 'BP_TeleportToRegion_C_GetMapIconData::WorldActor' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_GetMapIconData, Param_Name) == 0x000040, "Member 'BP_TeleportToRegion_C_GetMapIconData::Param_Name' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_GetMapIconData, Description) == 0x000058, "Member 'BP_TeleportToRegion_C_GetMapIconData::Description' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_GetMapIconData, CallFunc_MakeLiteralDouble_ReturnValue) == 0x000070, "Member 'BP_TeleportToRegion_C_GetMapIconData::CallFunc_MakeLiteralDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_GetMapIconData, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000078, "Member 'BP_TeleportToRegion_C_GetMapIconData::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");

// Function BP_TeleportToRegion.BP_TeleportToRegion_C.GetRandomRegion
// 0x0018 (0x0018 - 0x0000)
struct BP_TeleportToRegion_C_GetRandomRegion final
{
public:
	class ABP_PlayerSpawnPoint_C*                 SpawnPoint;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomInteger_ReturnValue;                // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerSpawnPoint_C*                 CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TeleportToRegion_C_GetRandomRegion) == 0x000008, "Wrong alignment on BP_TeleportToRegion_C_GetRandomRegion");
static_assert(sizeof(BP_TeleportToRegion_C_GetRandomRegion) == 0x000018, "Wrong size on BP_TeleportToRegion_C_GetRandomRegion");
static_assert(offsetof(BP_TeleportToRegion_C_GetRandomRegion, SpawnPoint) == 0x000000, "Member 'BP_TeleportToRegion_C_GetRandomRegion::SpawnPoint' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_GetRandomRegion, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'BP_TeleportToRegion_C_GetRandomRegion::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_GetRandomRegion, CallFunc_RandomInteger_ReturnValue) == 0x00000C, "Member 'BP_TeleportToRegion_C_GetRandomRegion::CallFunc_RandomInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_GetRandomRegion, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_TeleportToRegion_C_GetRandomRegion::CallFunc_Array_Get_Item' has a wrong offset!");

// Function BP_TeleportToRegion.BP_TeleportToRegion_C.OnBlackScreenOpened
// 0x0078 (0x0078 - 0x0000)
struct BP_TeleportToRegion_C_OnBlackScreenOpened final
{
public:
	TArray<class ABP_PlayerSpawnPoint_C*>         RandomRegions;                                     // 0x0000(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class ABP_PlayerSpawnPoint_C*                 RandomRegion;                                      // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_GameHUD_C*                          K2Node_DynamicCast_AsBP_Game_HUD;                  // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerSpawnPoint_C*                 CallFunc_Array_Random_OutItem;                     // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerSpawnPoint_C*                 CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B[0x1];                                       // 0x006B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TeleportToRegion_C_OnBlackScreenOpened) == 0x000008, "Wrong alignment on BP_TeleportToRegion_C_OnBlackScreenOpened");
static_assert(sizeof(BP_TeleportToRegion_C_OnBlackScreenOpened) == 0x000078, "Wrong size on BP_TeleportToRegion_C_OnBlackScreenOpened");
static_assert(offsetof(BP_TeleportToRegion_C_OnBlackScreenOpened, RandomRegions) == 0x000000, "Member 'BP_TeleportToRegion_C_OnBlackScreenOpened::RandomRegions' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_OnBlackScreenOpened, RandomRegion) == 0x000010, "Member 'BP_TeleportToRegion_C_OnBlackScreenOpened::RandomRegion' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_OnBlackScreenOpened, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_TeleportToRegion_C_OnBlackScreenOpened::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_OnBlackScreenOpened, CallFunc_GetHUD_ReturnValue) == 0x000020, "Member 'BP_TeleportToRegion_C_OnBlackScreenOpened::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_OnBlackScreenOpened, K2Node_DynamicCast_AsBP_Game_HUD) == 0x000028, "Member 'BP_TeleportToRegion_C_OnBlackScreenOpened::K2Node_DynamicCast_AsBP_Game_HUD' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_OnBlackScreenOpened, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_TeleportToRegion_C_OnBlackScreenOpened::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_OnBlackScreenOpened, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'BP_TeleportToRegion_C_OnBlackScreenOpened::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_OnBlackScreenOpened, CallFunc_Greater_IntInt_ReturnValue) == 0x000038, "Member 'BP_TeleportToRegion_C_OnBlackScreenOpened::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_OnBlackScreenOpened, CallFunc_Array_Random_OutItem) == 0x000040, "Member 'BP_TeleportToRegion_C_OnBlackScreenOpened::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_OnBlackScreenOpened, CallFunc_Array_Random_OutIndex) == 0x000048, "Member 'BP_TeleportToRegion_C_OnBlackScreenOpened::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_OnBlackScreenOpened, CallFunc_Array_Length_ReturnValue_1) == 0x00004C, "Member 'BP_TeleportToRegion_C_OnBlackScreenOpened::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_OnBlackScreenOpened, CallFunc_Subtract_IntInt_ReturnValue) == 0x000050, "Member 'BP_TeleportToRegion_C_OnBlackScreenOpened::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_OnBlackScreenOpened, CallFunc_Max_ReturnValue) == 0x000054, "Member 'BP_TeleportToRegion_C_OnBlackScreenOpened::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_OnBlackScreenOpened, Temp_int_Array_Index_Variable) == 0x000058, "Member 'BP_TeleportToRegion_C_OnBlackScreenOpened::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_OnBlackScreenOpened, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x00005C, "Member 'BP_TeleportToRegion_C_OnBlackScreenOpened::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_OnBlackScreenOpened, CallFunc_Array_Get_Item) == 0x000060, "Member 'BP_TeleportToRegion_C_OnBlackScreenOpened::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_OnBlackScreenOpened, CallFunc_Not_PreBool_ReturnValue) == 0x000068, "Member 'BP_TeleportToRegion_C_OnBlackScreenOpened::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_OnBlackScreenOpened, CallFunc_IsValid_ReturnValue_1) == 0x000069, "Member 'BP_TeleportToRegion_C_OnBlackScreenOpened::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_OnBlackScreenOpened, CallFunc_IsValid_ReturnValue_2) == 0x00006A, "Member 'BP_TeleportToRegion_C_OnBlackScreenOpened::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_OnBlackScreenOpened, Temp_int_Loop_Counter_Variable) == 0x00006C, "Member 'BP_TeleportToRegion_C_OnBlackScreenOpened::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_OnBlackScreenOpened, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000070, "Member 'BP_TeleportToRegion_C_OnBlackScreenOpened::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_OnBlackScreenOpened, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000074, "Member 'BP_TeleportToRegion_C_OnBlackScreenOpened::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_TeleportToRegion.BP_TeleportToRegion_C.OnDayStateChange
// 0x0001 (0x0001 - 0x0000)
struct BP_TeleportToRegion_C_OnDayStateChange final
{
public:
	EDayCycleState                                NewDayState;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TeleportToRegion_C_OnDayStateChange) == 0x000001, "Wrong alignment on BP_TeleportToRegion_C_OnDayStateChange");
static_assert(sizeof(BP_TeleportToRegion_C_OnDayStateChange) == 0x000001, "Wrong size on BP_TeleportToRegion_C_OnDayStateChange");
static_assert(offsetof(BP_TeleportToRegion_C_OnDayStateChange, NewDayState) == 0x000000, "Member 'BP_TeleportToRegion_C_OnDayStateChange::NewDayState' has a wrong offset!");

// Function BP_TeleportToRegion.BP_TeleportToRegion_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct BP_TeleportToRegion_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TeleportToRegion_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on BP_TeleportToRegion_C_ReceiveActorBeginOverlap");
static_assert(sizeof(BP_TeleportToRegion_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on BP_TeleportToRegion_C_ReceiveActorBeginOverlap");
static_assert(offsetof(BP_TeleportToRegion_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'BP_TeleportToRegion_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

// Function BP_TeleportToRegion.BP_TeleportToRegion_C.ReceiveActorEndOverlap
// 0x0008 (0x0008 - 0x0000)
struct BP_TeleportToRegion_C_ReceiveActorEndOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TeleportToRegion_C_ReceiveActorEndOverlap) == 0x000008, "Wrong alignment on BP_TeleportToRegion_C_ReceiveActorEndOverlap");
static_assert(sizeof(BP_TeleportToRegion_C_ReceiveActorEndOverlap) == 0x000008, "Wrong size on BP_TeleportToRegion_C_ReceiveActorEndOverlap");
static_assert(offsetof(BP_TeleportToRegion_C_ReceiveActorEndOverlap, OtherActor) == 0x000000, "Member 'BP_TeleportToRegion_C_ReceiveActorEndOverlap::OtherActor' has a wrong offset!");

// Function BP_TeleportToRegion.BP_TeleportToRegion_C.TPWithTag
// 0x0040 (0x0040 - 0x0000)
struct BP_TeleportToRegion_C_TPWithTag final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsWithoutBackpack;                                // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NightWarning;                                      // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DayWarning;                                        // 0x0003(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ActorHasTag_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ActorHasTag_ReturnValue_1;                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGS_TDB_C*                              K2Node_DynamicCast_AsGS_TDB;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ActorHasTag_ReturnValue_2;                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_1;               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ActorHasTag_ReturnValue_3;                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGS_TDB_C*                              K2Node_DynamicCast_AsGS_TDB_1;                     // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ActorHasTag_ReturnValue_4;                // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_2;        // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TeleportToRegion_C_TPWithTag) == 0x000008, "Wrong alignment on BP_TeleportToRegion_C_TPWithTag");
static_assert(sizeof(BP_TeleportToRegion_C_TPWithTag) == 0x000040, "Wrong size on BP_TeleportToRegion_C_TPWithTag");
static_assert(offsetof(BP_TeleportToRegion_C_TPWithTag, Result) == 0x000000, "Member 'BP_TeleportToRegion_C_TPWithTag::Result' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_TPWithTag, bIsWithoutBackpack) == 0x000001, "Member 'BP_TeleportToRegion_C_TPWithTag::bIsWithoutBackpack' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_TPWithTag, NightWarning) == 0x000002, "Member 'BP_TeleportToRegion_C_TPWithTag::NightWarning' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_TPWithTag, DayWarning) == 0x000003, "Member 'BP_TeleportToRegion_C_TPWithTag::DayWarning' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_TPWithTag, CallFunc_ActorHasTag_ReturnValue) == 0x000004, "Member 'BP_TeleportToRegion_C_TPWithTag::CallFunc_ActorHasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_TPWithTag, CallFunc_ActorHasTag_ReturnValue_1) == 0x000005, "Member 'BP_TeleportToRegion_C_TPWithTag::CallFunc_ActorHasTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_TPWithTag, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000006, "Member 'BP_TeleportToRegion_C_TPWithTag::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_TPWithTag, CallFunc_GetGameState_ReturnValue) == 0x000008, "Member 'BP_TeleportToRegion_C_TPWithTag::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_TPWithTag, K2Node_DynamicCast_AsGS_TDB) == 0x000010, "Member 'BP_TeleportToRegion_C_TPWithTag::K2Node_DynamicCast_AsGS_TDB' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_TPWithTag, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_TeleportToRegion_C_TPWithTag::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_TPWithTag, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x000019, "Member 'BP_TeleportToRegion_C_TPWithTag::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TeleportToRegion_C_TPWithTag, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00001A, "Member 'BP_TeleportToRegion_C_TPWithTag::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
