#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TeleporterDoorMaster

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TeleporterDoorMaster.BP_TeleporterDoorMaster_C
// 0x0028 (0x02B8 - 0x0290)
class ABP_TeleporterDoorMaster_C : public AActor
{
public:
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             TpFromTranzit;                                     // 0x0298(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class ABP_PlayerSpawnPoint_C*>         Regions;                                           // 0x02A8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)

public:
	void TpFromTranzit__DelegateSignature(class FName HomeRef);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TeleporterDoorMaster_C">();
	}
	static class ABP_TeleporterDoorMaster_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_TeleporterDoorMaster_C>();
	}
};
static_assert(alignof(ABP_TeleporterDoorMaster_C) == 0x000008, "Wrong alignment on ABP_TeleporterDoorMaster_C");
static_assert(sizeof(ABP_TeleporterDoorMaster_C) == 0x0002B8, "Wrong size on ABP_TeleporterDoorMaster_C");
static_assert(offsetof(ABP_TeleporterDoorMaster_C, DefaultSceneRoot) == 0x000290, "Member 'ABP_TeleporterDoorMaster_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_TeleporterDoorMaster_C, TpFromTranzit) == 0x000298, "Member 'ABP_TeleporterDoorMaster_C::TpFromTranzit' has a wrong offset!");
static_assert(offsetof(ABP_TeleporterDoorMaster_C, Regions) == 0x0002A8, "Member 'ABP_TeleporterDoorMaster_C::Regions' has a wrong offset!");

}

