#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TeleportCar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_InteractType_structs.hpp"
#include "E_ActorType_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_TeleportCar.BP_TeleportCar_C.AreSquadMembersReady
// 0x0060 (0x0060 - 0x0000)
struct BP_TeleportCar_C_AreSquadMembersReady final
{
public:
	bool                                          Bool;                                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSquadMember;                                     // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Break;                                             // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APS_TDB_C*>                      Squad;                                             // 0x0008(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APS_TDB_C*                              K2Node_DynamicCast_AsPS_TDB;                       // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APS_TDB_C*                              CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOverlappingActor_ReturnValue;           // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TeleportCar_C_AreSquadMembersReady) == 0x000008, "Wrong alignment on BP_TeleportCar_C_AreSquadMembersReady");
static_assert(sizeof(BP_TeleportCar_C_AreSquadMembersReady) == 0x000060, "Wrong size on BP_TeleportCar_C_AreSquadMembersReady");
static_assert(offsetof(BP_TeleportCar_C_AreSquadMembersReady, Bool) == 0x000000, "Member 'BP_TeleportCar_C_AreSquadMembersReady::Bool' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_AreSquadMembersReady, IsSquadMember) == 0x000001, "Member 'BP_TeleportCar_C_AreSquadMembersReady::IsSquadMember' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_AreSquadMembersReady, Break) == 0x000002, "Member 'BP_TeleportCar_C_AreSquadMembersReady::Break' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_AreSquadMembersReady, Squad) == 0x000008, "Member 'BP_TeleportCar_C_AreSquadMembersReady::Squad' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_AreSquadMembersReady, Temp_bool_True_if_break_was_hit_Variable) == 0x000018, "Member 'BP_TeleportCar_C_AreSquadMembersReady::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_AreSquadMembersReady, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'BP_TeleportCar_C_AreSquadMembersReady::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_AreSquadMembersReady, CallFunc_Not_PreBool_ReturnValue) == 0x000020, "Member 'BP_TeleportCar_C_AreSquadMembersReady::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_AreSquadMembersReady, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'BP_TeleportCar_C_AreSquadMembersReady::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_AreSquadMembersReady, CallFunc_GetPlayerController_ReturnValue) == 0x000028, "Member 'BP_TeleportCar_C_AreSquadMembersReady::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_AreSquadMembersReady, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'BP_TeleportCar_C_AreSquadMembersReady::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_AreSquadMembersReady, K2Node_DynamicCast_AsPS_TDB) == 0x000038, "Member 'BP_TeleportCar_C_AreSquadMembersReady::K2Node_DynamicCast_AsPS_TDB' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_AreSquadMembersReady, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_TeleportCar_C_AreSquadMembersReady::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_AreSquadMembersReady, CallFunc_Array_Get_Item) == 0x000048, "Member 'BP_TeleportCar_C_AreSquadMembersReady::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_AreSquadMembersReady, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'BP_TeleportCar_C_AreSquadMembersReady::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_AreSquadMembersReady, CallFunc_Greater_IntInt_ReturnValue) == 0x000054, "Member 'BP_TeleportCar_C_AreSquadMembersReady::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_AreSquadMembersReady, CallFunc_IsOverlappingActor_ReturnValue) == 0x000055, "Member 'BP_TeleportCar_C_AreSquadMembersReady::CallFunc_IsOverlappingActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_AreSquadMembersReady, CallFunc_Array_Length_ReturnValue_1) == 0x000058, "Member 'BP_TeleportCar_C_AreSquadMembersReady::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_AreSquadMembersReady, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'BP_TeleportCar_C_AreSquadMembersReady::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_AreSquadMembersReady, CallFunc_BooleanAND_ReturnValue) == 0x00005D, "Member 'BP_TeleportCar_C_AreSquadMembersReady::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_TeleportCar.BP_TeleportCar_C.ExecuteUbergraph_BP_TeleportCar
// 0x0318 (0x0318 - 0x0000)
struct BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_Player_3;                             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_Player_2;                             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_Player_1;                             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameHUD_C>        K2Node_DynamicCast_AsBPI_Game_HUD;                 // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_PlayerMain_C*                      CallFunc_GetGUI_GUI;                               // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0088(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_PlayerMain_C*                      K2Node_CustomEvent_FocusOver;                      // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_Player_4;                             // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue_1;              // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller_1;          // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUD*                                   CallFunc_GetHUD_ReturnValue_1;                     // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameHUD_C>        K2Node_DynamicCast_AsBPI_Game_HUD_1;               // 0x0110(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUD*                                   CallFunc_GetHUD_ReturnValue_2;                     // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUIW_PlayerMain_C*                      CallFunc_GetGUI_GUI_1;                             // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_GameHUD_C*                          K2Node_DynamicCast_AsBP_Game_HUD;                  // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_142[0x6];                                      // 0x0142(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_1;                 // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_V2_C*                   K2Node_DynamicCast_AsSurvival_Player_V2;           // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ExitFromGarage_C*                   CallFunc_GetActorOfClass_ReturnValue;              // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0198(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUD*                                   CallFunc_GetHUD_ReturnValue_3;                     // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_2;                 // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_GameHUD_C*                          K2Node_DynamicCast_AsBP_Game_HUD_1;                // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player_1;            // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayerCutsceneComponent_C*             CallFunc_GetComponentByClass_ReturnValue;          // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSomethingOnA_Way_ReturnValue;           // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x01EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUD*                                   CallFunc_GetHUD_ReturnValue_4;                     // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_GameHUD_C*                          K2Node_DynamicCast_AsBP_Game_HUD_2;                // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211[0x3];                                      // 0x0211(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0214(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_225[0x3];                                      // 0x0225(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0228(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPartyMember_ReturnValue;                // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Visible;                              // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Visible_1;                            // 0x0232(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_233[0x5];                                      // 0x0233(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_1;         // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player_2;            // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUD*                                   CallFunc_GetHUD_ReturnValue_5;                     // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_GameHUD_C*                          K2Node_DynamicCast_AsBP_Game_HUD_3;                // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Showed;                         // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26A[0x2];                                      // 0x026A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool Showed)>                  K2Node_CreateDelegate_OutputDelegate_4;            // 0x026C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_Player_5;                             // 0x0280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SitIndex;                             // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_SkipAnimation;                        // 0x028C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28D[0x3];                                      // 0x028D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_Player_6;                             // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_Player_7;                             // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_Player_8;                             // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_3;                 // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool Showed)>                  K2Node_CreateDelegate_OutputDelegate_5;            // 0x02B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player_3;            // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayerCutsceneComponent_C*             CallFunc_GetComponentByClass_ReturnValue_1;        // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_Player;                               // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player_4;            // 0x02E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_13;                    // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APS_TDB_C*                              K2Node_DynamicCast_AsPS_TDB;                       // 0x02F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_14;                    // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_1;        // 0x0301(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_302[0x6];                                      // 0x0302(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APS_TDB_C*                              K2Node_DynamicCast_AsPS_TDB_1;                     // 0x0308(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_15;                    // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar) == 0x000008, "Wrong alignment on BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar");
static_assert(sizeof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar) == 0x000318, "Wrong size on BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, EntryPoint) == 0x000000, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000008, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, K2Node_Event_Player_3) == 0x000010, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::K2Node_Event_Player_3' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, K2Node_Event_Player_2) == 0x000018, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::K2Node_Event_Player_2' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, K2Node_Event_Player_1) == 0x000020, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::K2Node_Event_Player_1' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, CallFunc_GetController_ReturnValue) == 0x000028, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, K2Node_DynamicCast_AsPlayer_Controller) == 0x000038, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::K2Node_DynamicCast_AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, CallFunc_GetHUD_ReturnValue) == 0x000048, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000050, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, K2Node_DynamicCast_AsBPI_Game_HUD) == 0x000068, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::K2Node_DynamicCast_AsBPI_Game_HUD' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, K2Node_DynamicCast_bSuccess_1) == 0x000078, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, CallFunc_GetGUI_GUI) == 0x000080, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::CallFunc_GetGUI_GUI' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, K2Node_CreateDelegate_OutputDelegate) == 0x000088, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, CallFunc_IsValid_ReturnValue_1) == 0x000098, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, K2Node_CustomEvent_FocusOver) == 0x0000A0, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::K2Node_CustomEvent_FocusOver' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000A8, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, CallFunc_Vector_Distance_ReturnValue) == 0x0000C0, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000C8, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, K2Node_Event_Player_4) == 0x0000D8, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::K2Node_Event_Player_4' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, CallFunc_GetController_ReturnValue_1) == 0x0000E0, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::CallFunc_GetController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, CallFunc_IsValid_ReturnValue_2) == 0x0000E8, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, K2Node_DynamicCast_AsPlayer_Controller_1) == 0x0000F0, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::K2Node_DynamicCast_AsPlayer_Controller_1' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, K2Node_DynamicCast_bSuccess_2) == 0x0000F8, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, CallFunc_GetHUD_ReturnValue_1) == 0x000100, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::CallFunc_GetHUD_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, CallFunc_GetPlayerController_ReturnValue) == 0x000108, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, K2Node_DynamicCast_AsBPI_Game_HUD_1) == 0x000110, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::K2Node_DynamicCast_AsBPI_Game_HUD_1' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, K2Node_DynamicCast_bSuccess_3) == 0x000120, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, CallFunc_GetHUD_ReturnValue_2) == 0x000128, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::CallFunc_GetHUD_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, CallFunc_GetGUI_GUI_1) == 0x000130, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::CallFunc_GetGUI_GUI_1' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, K2Node_DynamicCast_AsBP_Game_HUD) == 0x000138, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::K2Node_DynamicCast_AsBP_Game_HUD' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, K2Node_DynamicCast_bSuccess_4) == 0x000140, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, CallFunc_IsValid_ReturnValue_3) == 0x000141, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, CallFunc_GetPlayerController_ReturnValue_1) == 0x000148, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, CallFunc_GetPlayerController_ReturnValue_2) == 0x000150, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, CallFunc_K2_GetPawn_ReturnValue) == 0x000158, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, CallFunc_K2_GetPawn_ReturnValue_1) == 0x000160, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::CallFunc_K2_GetPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, K2Node_DynamicCast_AsSurvival_Player) == 0x000168, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, K2Node_DynamicCast_bSuccess_5) == 0x000170, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000178, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, K2Node_DynamicCast_AsSurvival_Player_V2) == 0x000180, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::K2Node_DynamicCast_AsSurvival_Player_V2' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, K2Node_DynamicCast_bSuccess_6) == 0x000188, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, CallFunc_GetActorOfClass_ReturnValue) == 0x000190, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, K2Node_CreateDelegate_OutputDelegate_2) == 0x000198, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, CallFunc_IsValid_ReturnValue_4) == 0x0001A8, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, CallFunc_GetHUD_ReturnValue_3) == 0x0001B0, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::CallFunc_GetHUD_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, CallFunc_K2_GetPawn_ReturnValue_2) == 0x0001B8, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::CallFunc_K2_GetPawn_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, K2Node_DynamicCast_AsBP_Game_HUD_1) == 0x0001C0, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::K2Node_DynamicCast_AsBP_Game_HUD_1' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, K2Node_DynamicCast_bSuccess_7) == 0x0001C8, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, K2Node_DynamicCast_AsSurvival_Player_1) == 0x0001D0, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::K2Node_DynamicCast_AsSurvival_Player_1' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, K2Node_DynamicCast_bSuccess_8) == 0x0001D8, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, CallFunc_GetComponentByClass_ReturnValue) == 0x0001E0, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, CallFunc_IsValid_ReturnValue_5) == 0x0001E8, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, CallFunc_IsSomethingOnA_Way_ReturnValue) == 0x0001E9, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::CallFunc_IsSomethingOnA_Way_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, CallFunc_IsInViewport_ReturnValue) == 0x0001EA, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::CallFunc_IsInViewport_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, CallFunc_Not_PreBool_ReturnValue) == 0x0001EB, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, CallFunc_GetPlayerController_ReturnValue_3) == 0x0001F0, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, CallFunc_BooleanAND_ReturnValue) == 0x0001F8, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, CallFunc_GetHUD_ReturnValue_4) == 0x000200, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::CallFunc_GetHUD_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, K2Node_DynamicCast_AsBP_Game_HUD_2) == 0x000208, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::K2Node_DynamicCast_AsBP_Game_HUD_2' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, K2Node_DynamicCast_bSuccess_9) == 0x000210, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, K2Node_CreateDelegate_OutputDelegate_3) == 0x000214, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, CallFunc_IsValid_ReturnValue_6) == 0x000224, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000228, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, CallFunc_IsPartyMember_ReturnValue) == 0x000230, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::CallFunc_IsPartyMember_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, K2Node_Event_Visible) == 0x000231, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::K2Node_Event_Visible' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, K2Node_Event_Visible_1) == 0x000232, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::K2Node_Event_Visible_1' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, CallFunc_GetPlayerCharacter_ReturnValue_1) == 0x000238, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::CallFunc_GetPlayerCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, K2Node_DynamicCast_AsSurvival_Player_2) == 0x000240, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::K2Node_DynamicCast_AsSurvival_Player_2' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, K2Node_DynamicCast_bSuccess_10) == 0x000248, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::K2Node_DynamicCast_bSuccess_10' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, CallFunc_GetHUD_ReturnValue_5) == 0x000250, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::CallFunc_GetHUD_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, CallFunc_IsLocallyControlled_ReturnValue) == 0x000258, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, K2Node_DynamicCast_AsBP_Game_HUD_3) == 0x000260, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::K2Node_DynamicCast_AsBP_Game_HUD_3' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, K2Node_DynamicCast_bSuccess_11) == 0x000268, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::K2Node_DynamicCast_bSuccess_11' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, K2Node_CustomEvent_Showed) == 0x000269, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::K2Node_CustomEvent_Showed' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, K2Node_CreateDelegate_OutputDelegate_4) == 0x00026C, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, K2Node_Event_Player_5) == 0x000280, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::K2Node_Event_Player_5' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, K2Node_Event_SitIndex) == 0x000288, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::K2Node_Event_SitIndex' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, K2Node_Event_SkipAnimation) == 0x00028C, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::K2Node_Event_SkipAnimation' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, K2Node_Event_Player_6) == 0x000290, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::K2Node_Event_Player_6' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, K2Node_Event_Player_7) == 0x000298, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::K2Node_Event_Player_7' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, K2Node_Event_Player_8) == 0x0002A0, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::K2Node_Event_Player_8' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, CallFunc_K2_GetPawn_ReturnValue_3) == 0x0002A8, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::CallFunc_K2_GetPawn_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, K2Node_CreateDelegate_OutputDelegate_5) == 0x0002B0, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, K2Node_DynamicCast_AsSurvival_Player_3) == 0x0002C0, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::K2Node_DynamicCast_AsSurvival_Player_3' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, K2Node_DynamicCast_bSuccess_12) == 0x0002C8, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::K2Node_DynamicCast_bSuccess_12' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, CallFunc_GetComponentByClass_ReturnValue_1) == 0x0002D0, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, CallFunc_IsValid_ReturnValue_7) == 0x0002D8, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, K2Node_Event_Player) == 0x0002E0, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::K2Node_Event_Player' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, K2Node_DynamicCast_AsSurvival_Player_4) == 0x0002E8, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::K2Node_DynamicCast_AsSurvival_Player_4' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, K2Node_DynamicCast_bSuccess_13) == 0x0002F0, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::K2Node_DynamicCast_bSuccess_13' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, K2Node_DynamicCast_AsPS_TDB) == 0x0002F8, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::K2Node_DynamicCast_AsPS_TDB' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, K2Node_DynamicCast_bSuccess_14) == 0x000300, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::K2Node_DynamicCast_bSuccess_14' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, CallFunc_IsLocallyControlled_ReturnValue_1) == 0x000301, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::CallFunc_IsLocallyControlled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, K2Node_DynamicCast_AsPS_TDB_1) == 0x000308, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::K2Node_DynamicCast_AsPS_TDB_1' has a wrong offset!");
static_assert(offsetof(BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar, K2Node_DynamicCast_bSuccess_15) == 0x000310, "Member 'BP_TeleportCar_C_ExecuteUbergraph_BP_TeleportCar::K2Node_DynamicCast_bSuccess_15' has a wrong offset!");

// Function BP_TeleportCar.BP_TeleportCar_C.FocusOver
// 0x0008 (0x0008 - 0x0000)
struct BP_TeleportCar_C_FocusOver final
{
public:
	class UUIW_PlayerMain_C*                      Param_FocusOver;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TeleportCar_C_FocusOver) == 0x000008, "Wrong alignment on BP_TeleportCar_C_FocusOver");
static_assert(sizeof(BP_TeleportCar_C_FocusOver) == 0x000008, "Wrong size on BP_TeleportCar_C_FocusOver");
static_assert(offsetof(BP_TeleportCar_C_FocusOver, Param_FocusOver) == 0x000000, "Member 'BP_TeleportCar_C_FocusOver::Param_FocusOver' has a wrong offset!");

// Function BP_TeleportCar.BP_TeleportCar_C.GetActorType
// 0x0001 (0x0001 - 0x0000)
struct BP_TeleportCar_C_GetActorType final
{
public:
	E_ActorType                                   ActorType;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TeleportCar_C_GetActorType) == 0x000001, "Wrong alignment on BP_TeleportCar_C_GetActorType");
static_assert(sizeof(BP_TeleportCar_C_GetActorType) == 0x000001, "Wrong size on BP_TeleportCar_C_GetActorType");
static_assert(offsetof(BP_TeleportCar_C_GetActorType, ActorType) == 0x000000, "Member 'BP_TeleportCar_C_GetActorType::ActorType' has a wrong offset!");

// Function BP_TeleportCar.BP_TeleportCar_C.IsInViewport
// 0x0078 (0x0078 - 0x0000)
struct BP_TeleportCar_C_IsInViewport final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetViewportSize_ReturnValue;              // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_ProjectWorldLocationToWidgetPosition_ScreenPosition; // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ProjectWorldLocationToWidgetPosition_ReturnValue; // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_2;       // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_3;       // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TeleportCar_C_IsInViewport) == 0x000008, "Wrong alignment on BP_TeleportCar_C_IsInViewport");
static_assert(sizeof(BP_TeleportCar_C_IsInViewport) == 0x000078, "Wrong size on BP_TeleportCar_C_IsInViewport");
static_assert(offsetof(BP_TeleportCar_C_IsInViewport, ReturnValue) == 0x000000, "Member 'BP_TeleportCar_C_IsInViewport::ReturnValue' has a wrong offset!");
