#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Trap

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_BaseTrap_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Trap.BP_Trap_C
// 0x0038 (0x02E8 - 0x02B0)
class ABP_Trap_C final : public ABP_BaseTrap_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Trap_C;                          // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Beartrap3;                                         // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Beartrap2;                                         // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_TrailComponent_C*                   BP_TrailComponent;                                 // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Beartrap;                                          // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        Damage;                                            // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsUsed_0;                                          // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Trap(int32 EntryPoint);
	void OnCatch(class APawn* NewParam);
	void OnCatchMulti(class APawn* NewParam);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Trap_C">();
	}
	static class ABP_Trap_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Trap_C>();
	}
};
static_assert(alignof(ABP_Trap_C) == 0x000008, "Wrong alignment on ABP_Trap_C");
static_assert(sizeof(ABP_Trap_C) == 0x0002E8, "Wrong size on ABP_Trap_C");
static_assert(offsetof(ABP_Trap_C, UberGraphFrame_BP_Trap_C) == 0x0002B0, "Member 'ABP_Trap_C::UberGraphFrame_BP_Trap_C' has a wrong offset!");
static_assert(offsetof(ABP_Trap_C, Beartrap3) == 0x0002B8, "Member 'ABP_Trap_C::Beartrap3' has a wrong offset!");
static_assert(offsetof(ABP_Trap_C, Beartrap2) == 0x0002C0, "Member 'ABP_Trap_C::Beartrap2' has a wrong offset!");
static_assert(offsetof(ABP_Trap_C, BP_TrailComponent) == 0x0002C8, "Member 'ABP_Trap_C::BP_TrailComponent' has a wrong offset!");
static_assert(offsetof(ABP_Trap_C, Beartrap) == 0x0002D0, "Member 'ABP_Trap_C::Beartrap' has a wrong offset!");
static_assert(offsetof(ABP_Trap_C, Damage) == 0x0002D8, "Member 'ABP_Trap_C::Damage' has a wrong offset!");
static_assert(offsetof(ABP_Trap_C, IsUsed_0) == 0x0002E0, "Member 'ABP_Trap_C::IsUsed_0' has a wrong offset!");

}

