#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WorkbenchRepairActor

#include "Basic.hpp"

#include "FItemInfo_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "EquipmentData_structs.hpp"
#include "AttachmentInfo_structs.hpp"
#include "Engine_structs.hpp"
#include "BPS_WeaponData_structs.hpp"
#include "S_Attachment_structs.hpp"


namespace SDK::Params
{

// Function BP_WorkbenchRepairActor.BP_WorkbenchRepairActor_C.AddDeltaRotation
// 0x0260 (0x0260 - 0x0000)
struct BP_WorkbenchRepairActor_C_AddDeltaRotation final
{
public:
	struct FRotator                               Param_AddDeltaRotation;                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        Delay__Reset_;                                     // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetActiveChildActor_Result;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UChildActorComponent*                   CallFunc_GetActiveChildActor_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_CalculaterLocationByBoundOrigin_Location; // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0050(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_NormalizedDeltaRotator_ReturnValue;       // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0178(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_WorkbenchRepairActor_C_AddDeltaRotation) == 0x000008, "Wrong alignment on BP_WorkbenchRepairActor_C_AddDeltaRotation");
static_assert(sizeof(BP_WorkbenchRepairActor_C_AddDeltaRotation) == 0x000260, "Wrong size on BP_WorkbenchRepairActor_C_AddDeltaRotation");
static_assert(offsetof(BP_WorkbenchRepairActor_C_AddDeltaRotation, Param_AddDeltaRotation) == 0x000000, "Member 'BP_WorkbenchRepairActor_C_AddDeltaRotation::Param_AddDeltaRotation' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_AddDeltaRotation, Delay__Reset_) == 0x000018, "Member 'BP_WorkbenchRepairActor_C_AddDeltaRotation::Delay__Reset_' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_AddDeltaRotation, CallFunc_GetActiveChildActor_Result) == 0x000020, "Member 'BP_WorkbenchRepairActor_C_AddDeltaRotation::CallFunc_GetActiveChildActor_Result' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_AddDeltaRotation, CallFunc_GetActiveChildActor_ReturnValue) == 0x000028, "Member 'BP_WorkbenchRepairActor_C_AddDeltaRotation::CallFunc_GetActiveChildActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_AddDeltaRotation, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000030, "Member 'BP_WorkbenchRepairActor_C_AddDeltaRotation::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_AddDeltaRotation, CallFunc_CalculaterLocationByBoundOrigin_Location) == 0x000038, "Member 'BP_WorkbenchRepairActor_C_AddDeltaRotation::CallFunc_CalculaterLocationByBoundOrigin_Location' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_AddDeltaRotation, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000050, "Member 'BP_WorkbenchRepairActor_C_AddDeltaRotation::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_AddDeltaRotation, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000138, "Member 'BP_WorkbenchRepairActor_C_AddDeltaRotation::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_AddDeltaRotation, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000140, "Member 'BP_WorkbenchRepairActor_C_AddDeltaRotation::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_AddDeltaRotation, CallFunc_BooleanAND_ReturnValue) == 0x000158, "Member 'BP_WorkbenchRepairActor_C_AddDeltaRotation::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_AddDeltaRotation, CallFunc_NormalizedDeltaRotator_ReturnValue) == 0x000160, "Member 'BP_WorkbenchRepairActor_C_AddDeltaRotation::CallFunc_NormalizedDeltaRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_AddDeltaRotation, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000178, "Member 'BP_WorkbenchRepairActor_C_AddDeltaRotation::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");

// Function BP_WorkbenchRepairActor.BP_WorkbenchRepairActor_C.CalculaterLocationByBoundOrigin
// 0x00B8 (0x00B8 - 0x0000)
struct BP_WorkbenchRepairActor_C_CalculaterLocationByBoundOrigin final
{
public:
	const class USceneComponent*                  Component;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WorkbenchRepairActor_C_CalculaterLocationByBoundOrigin) == 0x000008, "Wrong alignment on BP_WorkbenchRepairActor_C_CalculaterLocationByBoundOrigin");
static_assert(sizeof(BP_WorkbenchRepairActor_C_CalculaterLocationByBoundOrigin) == 0x0000B8, "Wrong size on BP_WorkbenchRepairActor_C_CalculaterLocationByBoundOrigin");
static_assert(offsetof(BP_WorkbenchRepairActor_C_CalculaterLocationByBoundOrigin, Component) == 0x000000, "Member 'BP_WorkbenchRepairActor_C_CalculaterLocationByBoundOrigin::Component' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_CalculaterLocationByBoundOrigin, Location) == 0x000008, "Member 'BP_WorkbenchRepairActor_C_CalculaterLocationByBoundOrigin::Location' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_CalculaterLocationByBoundOrigin, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000020, "Member 'BP_WorkbenchRepairActor_C_CalculaterLocationByBoundOrigin::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_CalculaterLocationByBoundOrigin, CallFunc_GetComponentBounds_Origin) == 0x000038, "Member 'BP_WorkbenchRepairActor_C_CalculaterLocationByBoundOrigin::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_CalculaterLocationByBoundOrigin, CallFunc_GetComponentBounds_BoxExtent) == 0x000050, "Member 'BP_WorkbenchRepairActor_C_CalculaterLocationByBoundOrigin::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_CalculaterLocationByBoundOrigin, CallFunc_GetComponentBounds_SphereRadius) == 0x000068, "Member 'BP_WorkbenchRepairActor_C_CalculaterLocationByBoundOrigin::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_CalculaterLocationByBoundOrigin, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000070, "Member 'BP_WorkbenchRepairActor_C_CalculaterLocationByBoundOrigin::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_CalculaterLocationByBoundOrigin, CallFunc_Add_VectorVector_ReturnValue) == 0x000088, "Member 'BP_WorkbenchRepairActor_C_CalculaterLocationByBoundOrigin::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_CalculaterLocationByBoundOrigin, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x0000A0, "Member 'BP_WorkbenchRepairActor_C_CalculaterLocationByBoundOrigin::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");

// Function BP_WorkbenchRepairActor.BP_WorkbenchRepairActor_C.ExecuteUbergraph_BP_WorkbenchRepairActor
// 0x0258 (0x0258 - 0x0000)
struct BP_WorkbenchRepairActor_C_ExecuteUbergraph_BP_WorkbenchRepairActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetActiveChildActor_Result;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UChildActorComponent*                   CallFunc_GetActiveChildActor_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AWeaponPlaceholder_C*                   K2Node_DynamicCast_AsWeapon_Placeholder;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_CalculaterLocationByBoundOrigin_Location; // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_1;        // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0048(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ASkeletalMeshActor*                     K2Node_DynamicCast_AsSkeletal_Mesh_Actor;          // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_RLerp_ReturnValue;                        // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0170(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_WorkbenchRepairActor_C_ExecuteUbergraph_BP_WorkbenchRepairActor) == 0x000008, "Wrong alignment on BP_WorkbenchRepairActor_C_ExecuteUbergraph_BP_WorkbenchRepairActor");
static_assert(sizeof(BP_WorkbenchRepairActor_C_ExecuteUbergraph_BP_WorkbenchRepairActor) == 0x000258, "Wrong size on BP_WorkbenchRepairActor_C_ExecuteUbergraph_BP_WorkbenchRepairActor");
static_assert(offsetof(BP_WorkbenchRepairActor_C_ExecuteUbergraph_BP_WorkbenchRepairActor, EntryPoint) == 0x000000, "Member 'BP_WorkbenchRepairActor_C_ExecuteUbergraph_BP_WorkbenchRepairActor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_ExecuteUbergraph_BP_WorkbenchRepairActor, CallFunc_GetActiveChildActor_Result) == 0x000004, "Member 'BP_WorkbenchRepairActor_C_ExecuteUbergraph_BP_WorkbenchRepairActor::CallFunc_GetActiveChildActor_Result' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_ExecuteUbergraph_BP_WorkbenchRepairActor, CallFunc_GetActiveChildActor_ReturnValue) == 0x000008, "Member 'BP_WorkbenchRepairActor_C_ExecuteUbergraph_BP_WorkbenchRepairActor::CallFunc_GetActiveChildActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_ExecuteUbergraph_BP_WorkbenchRepairActor, K2Node_DynamicCast_AsWeapon_Placeholder) == 0x000010, "Member 'BP_WorkbenchRepairActor_C_ExecuteUbergraph_BP_WorkbenchRepairActor::K2Node_DynamicCast_AsWeapon_Placeholder' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_ExecuteUbergraph_BP_WorkbenchRepairActor, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_WorkbenchRepairActor_C_ExecuteUbergraph_BP_WorkbenchRepairActor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_ExecuteUbergraph_BP_WorkbenchRepairActor, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000020, "Member 'BP_WorkbenchRepairActor_C_ExecuteUbergraph_BP_WorkbenchRepairActor::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_ExecuteUbergraph_BP_WorkbenchRepairActor, CallFunc_CalculaterLocationByBoundOrigin_Location) == 0x000028, "Member 'BP_WorkbenchRepairActor_C_ExecuteUbergraph_BP_WorkbenchRepairActor::CallFunc_CalculaterLocationByBoundOrigin_Location' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_ExecuteUbergraph_BP_WorkbenchRepairActor, CallFunc_K2_GetRootComponent_ReturnValue_1) == 0x000040, "Member 'BP_WorkbenchRepairActor_C_ExecuteUbergraph_BP_WorkbenchRepairActor::CallFunc_K2_GetRootComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_ExecuteUbergraph_BP_WorkbenchRepairActor, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000048, "Member 'BP_WorkbenchRepairActor_C_ExecuteUbergraph_BP_WorkbenchRepairActor::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_ExecuteUbergraph_BP_WorkbenchRepairActor, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000130, "Member 'BP_WorkbenchRepairActor_C_ExecuteUbergraph_BP_WorkbenchRepairActor::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_ExecuteUbergraph_BP_WorkbenchRepairActor, K2Node_DynamicCast_AsSkeletal_Mesh_Actor) == 0x000148, "Member 'BP_WorkbenchRepairActor_C_ExecuteUbergraph_BP_WorkbenchRepairActor::K2Node_DynamicCast_AsSkeletal_Mesh_Actor' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_ExecuteUbergraph_BP_WorkbenchRepairActor, K2Node_DynamicCast_bSuccess_1) == 0x000150, "Member 'BP_WorkbenchRepairActor_C_ExecuteUbergraph_BP_WorkbenchRepairActor::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_ExecuteUbergraph_BP_WorkbenchRepairActor, CallFunc_RLerp_ReturnValue) == 0x000158, "Member 'BP_WorkbenchRepairActor_C_ExecuteUbergraph_BP_WorkbenchRepairActor::CallFunc_RLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_ExecuteUbergraph_BP_WorkbenchRepairActor, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000170, "Member 'BP_WorkbenchRepairActor_C_ExecuteUbergraph_BP_WorkbenchRepairActor::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");

// Function BP_WorkbenchRepairActor.BP_WorkbenchRepairActor_C.GetActiveChildActor
// 0x0040 (0x0040 - 0x0000)
struct BP_WorkbenchRepairActor_C_GetActiveChildActor final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UChildActorComponent*                   ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UChildActorComponent*                   Temp_object_Variable;                              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UChildActorComponent*                   K2Node_Select_Default;                             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   K2Node_Select_Default_1;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WorkbenchRepairActor_C_GetActiveChildActor) == 0x000008, "Wrong alignment on BP_WorkbenchRepairActor_C_GetActiveChildActor");
static_assert(sizeof(BP_WorkbenchRepairActor_C_GetActiveChildActor) == 0x000040, "Wrong size on BP_WorkbenchRepairActor_C_GetActiveChildActor");
static_assert(offsetof(BP_WorkbenchRepairActor_C_GetActiveChildActor, Result) == 0x000000, "Member 'BP_WorkbenchRepairActor_C_GetActiveChildActor::Result' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_GetActiveChildActor, ReturnValue) == 0x000008, "Member 'BP_WorkbenchRepairActor_C_GetActiveChildActor::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_GetActiveChildActor, Temp_bool_Variable) == 0x000010, "Member 'BP_WorkbenchRepairActor_C_GetActiveChildActor::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_GetActiveChildActor, Temp_object_Variable) == 0x000018, "Member 'BP_WorkbenchRepairActor_C_GetActiveChildActor::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_GetActiveChildActor, Temp_bool_Variable_1) == 0x000020, "Member 'BP_WorkbenchRepairActor_C_GetActiveChildActor::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_GetActiveChildActor, K2Node_Select_Default) == 0x000028, "Member 'BP_WorkbenchRepairActor_C_GetActiveChildActor::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_GetActiveChildActor, K2Node_Select_Default_1) == 0x000030, "Member 'BP_WorkbenchRepairActor_C_GetActiveChildActor::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_GetActiveChildActor, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'BP_WorkbenchRepairActor_C_GetActiveChildActor::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_WorkbenchRepairActor.BP_WorkbenchRepairActor_C.Remove Model
// 0x0508 (0x0508 - 0x0000)
struct BP_WorkbenchRepairActor_C_Remove_Model final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumMaterials_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BaseAttachment_C*                   CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBPS_WeaponData                        CallFunc_GetDataTableRowFromName_OutRow;           // 0x0020(0x04C0)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E1[0x3];                                      // 0x04E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x04E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x04E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E9[0x3];                                      // 0x04E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x04EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x04F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          K2Node_DynamicCast_AsSkeletal_Mesh;                // 0x04F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0500(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WorkbenchRepairActor_C_Remove_Model) == 0x000008, "Wrong alignment on BP_WorkbenchRepairActor_C_Remove_Model");
static_assert(sizeof(BP_WorkbenchRepairActor_C_Remove_Model) == 0x000508, "Wrong size on BP_WorkbenchRepairActor_C_Remove_Model");
static_assert(offsetof(BP_WorkbenchRepairActor_C_Remove_Model, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'BP_WorkbenchRepairActor_C_Remove_Model::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_Remove_Model, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'BP_WorkbenchRepairActor_C_Remove_Model::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_Remove_Model, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_WorkbenchRepairActor_C_Remove_Model::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_Remove_Model, CallFunc_GetNumMaterials_ReturnValue) == 0x00000C, "Member 'BP_WorkbenchRepairActor_C_Remove_Model::CallFunc_GetNumMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_Remove_Model, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_WorkbenchRepairActor_C_Remove_Model::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_Remove_Model, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BP_WorkbenchRepairActor_C_Remove_Model::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_Remove_Model, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'BP_WorkbenchRepairActor_C_Remove_Model::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_Remove_Model, CallFunc_GetDataTableRowFromName_OutRow) == 0x000020, "Member 'BP_WorkbenchRepairActor_C_Remove_Model::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_Remove_Model, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0004E0, "Member 'BP_WorkbenchRepairActor_C_Remove_Model::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_Remove_Model, Temp_int_Variable) == 0x0004E4, "Member 'BP_WorkbenchRepairActor_C_Remove_Model::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_Remove_Model, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0004E8, "Member 'BP_WorkbenchRepairActor_C_Remove_Model::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_Remove_Model, CallFunc_Add_IntInt_ReturnValue_1) == 0x0004EC, "Member 'BP_WorkbenchRepairActor_C_Remove_Model::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_Remove_Model, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x0004F0, "Member 'BP_WorkbenchRepairActor_C_Remove_Model::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_Remove_Model, K2Node_DynamicCast_AsSkeletal_Mesh) == 0x0004F8, "Member 'BP_WorkbenchRepairActor_C_Remove_Model::K2Node_DynamicCast_AsSkeletal_Mesh' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_Remove_Model, K2Node_DynamicCast_bSuccess) == 0x000500, "Member 'BP_WorkbenchRepairActor_C_Remove_Model::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_WorkbenchRepairActor.BP_WorkbenchRepairActor_C.ResetRoationTimerHandler
// 0x0120 (0x0120 - 0x0000)
struct BP_WorkbenchRepairActor_C_ResetRoationTimerHandler final
{
public:
	bool                                          CallFunc_GetActiveChildActor_Result;               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UChildActorComponent*                   CallFunc_GetActiveChildActor_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RInterpTo_ReturnValue;                    // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_RotatorRotator_ReturnValue;    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0030(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WorkbenchRepairActor_C_ResetRoationTimerHandler) == 0x000008, "Wrong alignment on BP_WorkbenchRepairActor_C_ResetRoationTimerHandler");
static_assert(sizeof(BP_WorkbenchRepairActor_C_ResetRoationTimerHandler) == 0x000120, "Wrong size on BP_WorkbenchRepairActor_C_ResetRoationTimerHandler");
static_assert(offsetof(BP_WorkbenchRepairActor_C_ResetRoationTimerHandler, CallFunc_GetActiveChildActor_Result) == 0x000000, "Member 'BP_WorkbenchRepairActor_C_ResetRoationTimerHandler::CallFunc_GetActiveChildActor_Result' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_ResetRoationTimerHandler, CallFunc_GetActiveChildActor_ReturnValue) == 0x000008, "Member 'BP_WorkbenchRepairActor_C_ResetRoationTimerHandler::CallFunc_GetActiveChildActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_ResetRoationTimerHandler, CallFunc_RInterpTo_ReturnValue) == 0x000010, "Member 'BP_WorkbenchRepairActor_C_ResetRoationTimerHandler::CallFunc_RInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_ResetRoationTimerHandler, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000028, "Member 'BP_WorkbenchRepairActor_C_ResetRoationTimerHandler::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_ResetRoationTimerHandler, CallFunc_EqualEqual_RotatorRotator_ReturnValue) == 0x000029, "Member 'BP_WorkbenchRepairActor_C_ResetRoationTimerHandler::CallFunc_EqualEqual_RotatorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_ResetRoationTimerHandler, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000030, "Member 'BP_WorkbenchRepairActor_C_ResetRoationTimerHandler::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_ResetRoationTimerHandler, CallFunc_Not_PreBool_ReturnValue) == 0x000118, "Member 'BP_WorkbenchRepairActor_C_ResetRoationTimerHandler::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_ResetRoationTimerHandler, CallFunc_BooleanOR_ReturnValue) == 0x000119, "Member 'BP_WorkbenchRepairActor_C_ResetRoationTimerHandler::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BP_WorkbenchRepairActor.BP_WorkbenchRepairActor_C.ResetRotation
// 0x0210 (0x0210 - 0x0000)
struct BP_WorkbenchRepairActor_C_ResetRotation final
{
public:
	bool                                          Hard;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Delay;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_TimerExistsHandle_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetActiveChildActor_Result;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UChildActorComponent*                   CallFunc_GetActiveChildActor_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0038(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0120(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_K2_SetTimer_Time_ImplicitCast;            // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WorkbenchRepairActor_C_ResetRotation) == 0x000008, "Wrong alignment on BP_WorkbenchRepairActor_C_ResetRotation");
static_assert(sizeof(BP_WorkbenchRepairActor_C_ResetRotation) == 0x000210, "Wrong size on BP_WorkbenchRepairActor_C_ResetRotation");
static_assert(offsetof(BP_WorkbenchRepairActor_C_ResetRotation, Hard) == 0x000000, "Member 'BP_WorkbenchRepairActor_C_ResetRotation::Hard' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_ResetRotation, Delay) == 0x000008, "Member 'BP_WorkbenchRepairActor_C_ResetRotation::Delay' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_ResetRotation, CallFunc_K2_TimerExistsHandle_ReturnValue) == 0x000010, "Member 'BP_WorkbenchRepairActor_C_ResetRotation::CallFunc_K2_TimerExistsHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_ResetRotation, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000011, "Member 'BP_WorkbenchRepairActor_C_ResetRotation::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_ResetRotation, CallFunc_K2_SetTimer_ReturnValue) == 0x000018, "Member 'BP_WorkbenchRepairActor_C_ResetRotation::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_ResetRotation, CallFunc_GetActiveChildActor_Result) == 0x000020, "Member 'BP_WorkbenchRepairActor_C_ResetRotation::CallFunc_GetActiveChildActor_Result' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_ResetRotation, CallFunc_GetActiveChildActor_ReturnValue) == 0x000028, "Member 'BP_WorkbenchRepairActor_C_ResetRotation::CallFunc_GetActiveChildActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_ResetRotation, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000030, "Member 'BP_WorkbenchRepairActor_C_ResetRotation::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_ResetRotation, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000038, "Member 'BP_WorkbenchRepairActor_C_ResetRotation::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_ResetRotation, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000120, "Member 'BP_WorkbenchRepairActor_C_ResetRotation::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_ResetRotation, CallFunc_K2_SetTimer_Time_ImplicitCast) == 0x000208, "Member 'BP_WorkbenchRepairActor_C_ResetRotation::CallFunc_K2_SetTimer_Time_ImplicitCast' has a wrong offset!");

// Function BP_WorkbenchRepairActor.BP_WorkbenchRepairActor_C.SetNewModelByWeaponInfo
// 0x0EA0 (0x0EA0 - 0x0000)
struct BP_WorkbenchRepairActor_C_SetNewModelByWeaponInfo final
{
public:
	struct FFItemInfo                             WeaponInfo;                                        // 0x0000(0x0220)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class AActor*>                         AddsAttachments;                                   // 0x0220(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	struct FS_Attachment                          CurrentMode;                                       // 0x0230(0x0080)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D1[0x3];                                      // 0x02D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x02E0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0340(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0348(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0360(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x0378(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_394[0x4];                                      // 0x0394(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0398(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x03B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x03B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FEquipmentData                         CallFunc_GetDataTableRowFromName_OutRow;           // 0x03C0(0x0180)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0540(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_541[0x3];                                      // 0x0541(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0544(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0548(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0630(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_634[0x4];                                      // 0x0634(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0638(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          K2Node_DynamicCast_AsSkeletal_Mesh;                // 0x0640(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0648(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_649[0x7];                                      // 0x0649(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0650(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0658(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0660(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_661[0x7];                                      // 0x0661(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_Attachment                          CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0668(0x0080)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x06E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x06E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x06EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6EB[0x5];                                      // 0x06EB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_LoadClassAsset_Blocking_ReturnValue;      // 0x06F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x06F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F9[0x7];                                      // 0x06F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsBP_Base_Attachment;      // 0x0700(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0708(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0709(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_70A[0x2];                                      // 0x070A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x070C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0710(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_711[0x3];                                      // 0x0711(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAttachmentInfo                        CallFunc_Array_Get_Item_1;                         // 0x0714(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0724(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0728(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_729[0x7];                                      // 0x0729(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_Attachment                          CallFunc_GetDataTableRowFromName_OutRow_2;         // 0x0730(0x0080)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_2;    // 0x07B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B1[0x7];                                      // 0x07B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBPS_WeaponData                        CallFunc_GetDataTableRowFromName_OutRow_3;         // 0x07B8(0x04C0)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_3;    // 0x0C78(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0C79(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0C7A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0C7B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C7C[0x4];                                      // 0x0C7C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x0C80(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_1;         // 0x0D68(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          K2Node_DynamicCast_AsSkeletal_Mesh_1;              // 0x0D70(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0D78(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D79[0x7];                                      // 0x0D79(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0D80(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0D88(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D8C[0x4];                                      // 0x0D8C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BaseAttachment_C*                   CallFunc_FinishSpawningActor_ReturnValue;          // 0x0D90(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0D98(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D99[0x3];                                      // 0x0D99(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x0D9C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_4;                  // 0x0DA0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA4[0xC];                                      // 0x0DA4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0DB0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_LoadClassAsset_Blocking_ReturnValue_1;    // 0x0E10(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsBP_Base_Attachment_1;    // 0x0E18(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess_1;                // 0x0E20(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E21[0x7];                                      // 0x0E21(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0E28(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_BaseAttachment_C*                   CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0E30(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_1;       // 0x0E38(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E39[0x3];                                      // 0x0E39(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_5;                  // 0x0E3C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_6;                  // 0x0E40(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E44[0x4];                                      // 0x0E44(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0E48(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UStaticMeshComponent*>           CallFunc_K2_GetComponentsByClass_ReturnValue_1;    // 0x0E58(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item_2;                         // 0x0E68(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_3;                         // 0x0E70(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0E78(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0E80(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0E84(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0E88(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0E89(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E8A[0x2];                                      // 0x0E8A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_VariableSet_TargetArmLength_ImplicitCast;   // 0x0E8C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_TargetArmLength_ImplicitCast_1; // 0x0E90(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WorkbenchRepairActor_C_SetNewModelByWeaponInfo) == 0x000010, "Wrong alignment on BP_WorkbenchRepairActor_C_SetNewModelByWeaponInfo");
static_assert(sizeof(BP_WorkbenchRepairActor_C_SetNewModelByWeaponInfo) == 0x000EA0, "Wrong size on BP_WorkbenchRepairActor_C_SetNewModelByWeaponInfo");
static_assert(offsetof(BP_WorkbenchRepairActor_C_SetNewModelByWeaponInfo, WeaponInfo) == 0x000000, "Member 'BP_WorkbenchRepairActor_C_SetNewModelByWeaponInfo::WeaponInfo' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_SetNewModelByWeaponInfo, AddsAttachments) == 0x000220, "Member 'BP_WorkbenchRepairActor_C_SetNewModelByWeaponInfo::AddsAttachments' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchRepairActor_C_SetNewModelByWeaponInfo, CurrentMode) == 0x000230, "Member 'BP_WorkbenchRepairActor_C_SetNewModelByWeaponInfo::CurrentMode' has a wrong offset!");
