#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WorkbenchActor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "FItemInfo_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_WorkbenchActor.BP_WorkbenchActor_C
// 0x02B8 (0x0548 - 0x0290)
class ABP_WorkbenchActor_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPointLightComponent*                   PointLight;                                        // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight2;                                        // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight1;                                        // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight;                                         // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   ChildActorArmor;                                   // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SightView;                                         // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        ButtView;                                          // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        MagView;                                           // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultView;                                       // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        MuzzleView;                                        // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneCaptureComponent2D*               SceneCaptureComponent2D;                           // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   ChildActorWeapon;                                  // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AWeaponPlaceholder_C*                   WeaponPhRef;                                       // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class ASurvPC_C*                              Controller_Ref;                                    // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      Interacted_Player_Ref;                             // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FFItemInfo                             Weapon_Info;                                       // 0x0318(0x0220)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	class ASkeletalMeshActor*                     ArmorRef;                                          // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      As_Survival_Player;                                // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_WorkbenchActor(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Remove_Model();
	void SetNewModelByWeaponInfo(const struct FFItemInfo& WeaponInfo);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_WorkbenchActor_C">();
	}
	static class ABP_WorkbenchActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_WorkbenchActor_C>();
	}
};
static_assert(alignof(ABP_WorkbenchActor_C) == 0x000008, "Wrong alignment on ABP_WorkbenchActor_C");
static_assert(sizeof(ABP_WorkbenchActor_C) == 0x000548, "Wrong size on ABP_WorkbenchActor_C");
static_assert(offsetof(ABP_WorkbenchActor_C, UberGraphFrame) == 0x000290, "Member 'ABP_WorkbenchActor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_WorkbenchActor_C, PointLight) == 0x000298, "Member 'ABP_WorkbenchActor_C::PointLight' has a wrong offset!");
static_assert(offsetof(ABP_WorkbenchActor_C, RectLight2) == 0x0002A0, "Member 'ABP_WorkbenchActor_C::RectLight2' has a wrong offset!");
static_assert(offsetof(ABP_WorkbenchActor_C, RectLight1) == 0x0002A8, "Member 'ABP_WorkbenchActor_C::RectLight1' has a wrong offset!");
static_assert(offsetof(ABP_WorkbenchActor_C, RectLight) == 0x0002B0, "Member 'ABP_WorkbenchActor_C::RectLight' has a wrong offset!");
static_assert(offsetof(ABP_WorkbenchActor_C, ChildActorArmor) == 0x0002B8, "Member 'ABP_WorkbenchActor_C::ChildActorArmor' has a wrong offset!");
static_assert(offsetof(ABP_WorkbenchActor_C, SightView) == 0x0002C0, "Member 'ABP_WorkbenchActor_C::SightView' has a wrong offset!");
static_assert(offsetof(ABP_WorkbenchActor_C, ButtView) == 0x0002C8, "Member 'ABP_WorkbenchActor_C::ButtView' has a wrong offset!");
static_assert(offsetof(ABP_WorkbenchActor_C, MagView) == 0x0002D0, "Member 'ABP_WorkbenchActor_C::MagView' has a wrong offset!");
static_assert(offsetof(ABP_WorkbenchActor_C, DefaultView) == 0x0002D8, "Member 'ABP_WorkbenchActor_C::DefaultView' has a wrong offset!");
static_assert(offsetof(ABP_WorkbenchActor_C, MuzzleView) == 0x0002E0, "Member 'ABP_WorkbenchActor_C::MuzzleView' has a wrong offset!");
static_assert(offsetof(ABP_WorkbenchActor_C, SceneCaptureComponent2D) == 0x0002E8, "Member 'ABP_WorkbenchActor_C::SceneCaptureComponent2D' has a wrong offset!");
static_assert(offsetof(ABP_WorkbenchActor_C, ChildActorWeapon) == 0x0002F0, "Member 'ABP_WorkbenchActor_C::ChildActorWeapon' has a wrong offset!");
static_assert(offsetof(ABP_WorkbenchActor_C, Scene) == 0x0002F8, "Member 'ABP_WorkbenchActor_C::Scene' has a wrong offset!");
static_assert(offsetof(ABP_WorkbenchActor_C, WeaponPhRef) == 0x000300, "Member 'ABP_WorkbenchActor_C::WeaponPhRef' has a wrong offset!");
static_assert(offsetof(ABP_WorkbenchActor_C, Controller_Ref) == 0x000308, "Member 'ABP_WorkbenchActor_C::Controller_Ref' has a wrong offset!");
static_assert(offsetof(ABP_WorkbenchActor_C, Interacted_Player_Ref) == 0x000310, "Member 'ABP_WorkbenchActor_C::Interacted_Player_Ref' has a wrong offset!");
static_assert(offsetof(ABP_WorkbenchActor_C, Weapon_Info) == 0x000318, "Member 'ABP_WorkbenchActor_C::Weapon_Info' has a wrong offset!");
static_assert(offsetof(ABP_WorkbenchActor_C, ArmorRef) == 0x000538, "Member 'ABP_WorkbenchActor_C::ArmorRef' has a wrong offset!");
static_assert(offsetof(ABP_WorkbenchActor_C, As_Survival_Player) == 0x000540, "Member 'ABP_WorkbenchActor_C::As_Survival_Player' has a wrong offset!");

}

