#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Weapon

#include "Basic.hpp"

#include "ContainerPickupsInfo_structs.hpp"
#include "BPE_Weapon_Type_structs.hpp"
#include "FItemInfo_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_TypesOfModes_structs.hpp"
#include "BPE_AmmoType_structs.hpp"
#include "BPS_WeaponData_structs.hpp"
#include "BPE_AmmoClass_structs.hpp"
#include "StanceState_structs.hpp"
#include "FMODStudio_structs.hpp"
#include "Engine_structs.hpp"
#include "S_Float_structs.hpp"
#include "S_WeaponShakeInfo_structs.hpp"
#include "PlayerSlots_structs.hpp"
#include "S_SimplifiedHitInfo_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "BPS_HitDecals_structs.hpp"
#include "BPS_DamageInfo_structs.hpp"
#include "BPS_HitParticles_structs.hpp"
#include "S_HitInfo_structs.hpp"
#include "S_PlayerWeaponAnim_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_Weapon.BP_Weapon_C.AddAmmoToInventory
// 0x0B28 (0x0B28 - 0x0000)
struct BP_Weapon_C_AddAmmoToInventory final
{
public:
	bool                                          bIsForCurrentWeapon;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NewAmmoCount;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AmmoNameForOtherWeapon;                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AmmoCountForOtherWeapon;                           // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AmmoDif;                                           // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFItemInfo                             F_AddedAmmo;                                       // 0x0018(0x0220)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             CallFunc_GetDataTableRowFromName_OutRow;           // 0x0240(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_461[0x7];                                      // 0x0461(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             K2Node_SetFieldsInStruct_StructOut;                // 0x0468(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFItemInfo>                     K2Node_MakeArray_Array;                            // 0x0688(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0698(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69C[0x4];                                      // 0x069C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x06A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x06B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanAddItems_Can;                          // 0x06B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B9[0x3];                                      // 0x06B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_CanAddItems_ItemsLeft;                    // 0x06BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFItemInfo                             CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x06C0(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x08E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E1[0x7];                                      // 0x08E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             K2Node_SetFieldsInStruct_StructOut_1;              // 0x08E8(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0B08(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B09[0x7];                                      // 0x0B09(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FContainerPickupsInfo>          K2Node_MakeArray_Array_1;                          // 0x0B10(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_JSAddItem_Ad;                             // 0x0B20(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Weapon_C_AddAmmoToInventory) == 0x000008, "Wrong alignment on BP_Weapon_C_AddAmmoToInventory");
static_assert(sizeof(BP_Weapon_C_AddAmmoToInventory) == 0x000B28, "Wrong size on BP_Weapon_C_AddAmmoToInventory");
static_assert(offsetof(BP_Weapon_C_AddAmmoToInventory, bIsForCurrentWeapon) == 0x000000, "Member 'BP_Weapon_C_AddAmmoToInventory::bIsForCurrentWeapon' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_AddAmmoToInventory, NewAmmoCount) == 0x000004, "Member 'BP_Weapon_C_AddAmmoToInventory::NewAmmoCount' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_AddAmmoToInventory, AmmoNameForOtherWeapon) == 0x000008, "Member 'BP_Weapon_C_AddAmmoToInventory::AmmoNameForOtherWeapon' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_AddAmmoToInventory, AmmoCountForOtherWeapon) == 0x000010, "Member 'BP_Weapon_C_AddAmmoToInventory::AmmoCountForOtherWeapon' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_AddAmmoToInventory, AmmoDif) == 0x000014, "Member 'BP_Weapon_C_AddAmmoToInventory::AmmoDif' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_AddAmmoToInventory, F_AddedAmmo) == 0x000018, "Member 'BP_Weapon_C_AddAmmoToInventory::F_AddedAmmo' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_AddAmmoToInventory, CallFunc_Subtract_IntInt_ReturnValue) == 0x000238, "Member 'BP_Weapon_C_AddAmmoToInventory::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_AddAmmoToInventory, CallFunc_GetDataTableRowFromName_OutRow) == 0x000240, "Member 'BP_Weapon_C_AddAmmoToInventory::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_AddAmmoToInventory, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000460, "Member 'BP_Weapon_C_AddAmmoToInventory::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_AddAmmoToInventory, K2Node_SetFieldsInStruct_StructOut) == 0x000468, "Member 'BP_Weapon_C_AddAmmoToInventory::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_AddAmmoToInventory, K2Node_MakeArray_Array) == 0x000688, "Member 'BP_Weapon_C_AddAmmoToInventory::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_AddAmmoToInventory, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000698, "Member 'BP_Weapon_C_AddAmmoToInventory::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_AddAmmoToInventory, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x0006A0, "Member 'BP_Weapon_C_AddAmmoToInventory::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_AddAmmoToInventory, CallFunc_Conv_StringToName_ReturnValue) == 0x0006B0, "Member 'BP_Weapon_C_AddAmmoToInventory::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_AddAmmoToInventory, CallFunc_CanAddItems_Can) == 0x0006B8, "Member 'BP_Weapon_C_AddAmmoToInventory::CallFunc_CanAddItems_Can' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_AddAmmoToInventory, CallFunc_CanAddItems_ItemsLeft) == 0x0006BC, "Member 'BP_Weapon_C_AddAmmoToInventory::CallFunc_CanAddItems_ItemsLeft' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_AddAmmoToInventory, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x0006C0, "Member 'BP_Weapon_C_AddAmmoToInventory::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_AddAmmoToInventory, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x0008E0, "Member 'BP_Weapon_C_AddAmmoToInventory::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_AddAmmoToInventory, K2Node_SetFieldsInStruct_StructOut_1) == 0x0008E8, "Member 'BP_Weapon_C_AddAmmoToInventory::K2Node_SetFieldsInStruct_StructOut_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_AddAmmoToInventory, CallFunc_Greater_IntInt_ReturnValue) == 0x000B08, "Member 'BP_Weapon_C_AddAmmoToInventory::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_AddAmmoToInventory, K2Node_MakeArray_Array_1) == 0x000B10, "Member 'BP_Weapon_C_AddAmmoToInventory::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_AddAmmoToInventory, CallFunc_JSAddItem_Ad) == 0x000B20, "Member 'BP_Weapon_C_AddAmmoToInventory::CallFunc_JSAddItem_Ad' has a wrong offset!");

// Function BP_Weapon.BP_Weapon_C.AimEvent
// 0x0001 (0x0001 - 0x0000)
struct BP_Weapon_C_AimEvent final
{
public:
	bool                                          Aim;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Weapon_C_AimEvent) == 0x000001, "Wrong alignment on BP_Weapon_C_AimEvent");
static_assert(sizeof(BP_Weapon_C_AimEvent) == 0x000001, "Wrong size on BP_Weapon_C_AimEvent");
static_assert(offsetof(BP_Weapon_C_AimEvent, Aim) == 0x000000, "Member 'BP_Weapon_C_AimEvent::Aim' has a wrong offset!");

// Function BP_Weapon.BP_Weapon_C.AutoFireSound
// 0x0001 (0x0001 - 0x0000)
struct BP_Weapon_C_AutoFireSound final
{
public:
	bool                                          Start;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Weapon_C_AutoFireSound) == 0x000001, "Wrong alignment on BP_Weapon_C_AutoFireSound");
static_assert(sizeof(BP_Weapon_C_AutoFireSound) == 0x000001, "Wrong size on BP_Weapon_C_AutoFireSound");
static_assert(offsetof(BP_Weapon_C_AutoFireSound, Start) == 0x000000, "Member 'BP_Weapon_C_AutoFireSound::Start' has a wrong offset!");

// Function BP_Weapon.BP_Weapon_C.BoltActionResume
// 0x00B8 (0x00B8 - 0x0000)
struct BP_Weapon_C_BoltActionResume final
{
public:
	class UAnimMontage*                           CallFunc_GetWeaponShotMontage_NewParam;            // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_GetWeaponShotMontage_NewParam_1;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBI_FPFunctions_C>     K2Node_DynamicCast_AsBI_FPFunctions;               // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_GetFireMontage_Montage;                   // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_2;            // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ISurvInterface_C>      K2Node_DynamicCast_AsSurv_Interface;               // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UAnimMontage>            K2Node_Select_Default;                             // 0x0070(0x0030)(UObjectWrapper, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_LoadAnimMontage_AnimMontage;              // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_3;            // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Montage_IsPlaying_ReturnValue;            // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_1;        // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00B7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Weapon_C_BoltActionResume) == 0x000008, "Wrong alignment on BP_Weapon_C_BoltActionResume");
static_assert(sizeof(BP_Weapon_C_BoltActionResume) == 0x0000B8, "Wrong size on BP_Weapon_C_BoltActionResume");
static_assert(offsetof(BP_Weapon_C_BoltActionResume, CallFunc_GetWeaponShotMontage_NewParam) == 0x000000, "Member 'BP_Weapon_C_BoltActionResume::CallFunc_GetWeaponShotMontage_NewParam' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BoltActionResume, CallFunc_GetWeaponShotMontage_NewParam_1) == 0x000008, "Member 'BP_Weapon_C_BoltActionResume::CallFunc_GetWeaponShotMontage_NewParam_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BoltActionResume, Temp_bool_Variable) == 0x000010, "Member 'BP_Weapon_C_BoltActionResume::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BoltActionResume, CallFunc_GetAnimInstance_ReturnValue) == 0x000018, "Member 'BP_Weapon_C_BoltActionResume::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BoltActionResume, K2Node_DynamicCast_AsBI_FPFunctions) == 0x000020, "Member 'BP_Weapon_C_BoltActionResume::K2Node_DynamicCast_AsBI_FPFunctions' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BoltActionResume, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_Weapon_C_BoltActionResume::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BoltActionResume, CallFunc_GetAnimInstance_ReturnValue_1) == 0x000038, "Member 'BP_Weapon_C_BoltActionResume::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BoltActionResume, CallFunc_GetFireMontage_Montage) == 0x000040, "Member 'BP_Weapon_C_BoltActionResume::CallFunc_GetFireMontage_Montage' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BoltActionResume, CallFunc_GetAnimInstance_ReturnValue_2) == 0x000048, "Member 'BP_Weapon_C_BoltActionResume::CallFunc_GetAnimInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BoltActionResume, CallFunc_Not_PreBool_ReturnValue) == 0x000050, "Member 'BP_Weapon_C_BoltActionResume::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BoltActionResume, K2Node_DynamicCast_AsSurv_Interface) == 0x000058, "Member 'BP_Weapon_C_BoltActionResume::K2Node_DynamicCast_AsSurv_Interface' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BoltActionResume, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'BP_Weapon_C_BoltActionResume::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BoltActionResume, CallFunc_IsValid_ReturnValue) == 0x000069, "Member 'BP_Weapon_C_BoltActionResume::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BoltActionResume, K2Node_Select_Default) == 0x000070, "Member 'BP_Weapon_C_BoltActionResume::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BoltActionResume, CallFunc_LoadAnimMontage_AnimMontage) == 0x0000A0, "Member 'BP_Weapon_C_BoltActionResume::CallFunc_LoadAnimMontage_AnimMontage' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BoltActionResume, CallFunc_GetAnimInstance_ReturnValue_3) == 0x0000A8, "Member 'BP_Weapon_C_BoltActionResume::CallFunc_GetAnimInstance_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BoltActionResume, CallFunc_Montage_IsPlaying_ReturnValue) == 0x0000B0, "Member 'BP_Weapon_C_BoltActionResume::CallFunc_Montage_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BoltActionResume, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000B1, "Member 'BP_Weapon_C_BoltActionResume::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BoltActionResume, CallFunc_IsLocallyControlled_ReturnValue) == 0x0000B2, "Member 'BP_Weapon_C_BoltActionResume::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BoltActionResume, CallFunc_IsLocallyControlled_ReturnValue_1) == 0x0000B3, "Member 'BP_Weapon_C_BoltActionResume::CallFunc_IsLocallyControlled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BoltActionResume, CallFunc_Not_PreBool_ReturnValue_2) == 0x0000B4, "Member 'BP_Weapon_C_BoltActionResume::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BoltActionResume, CallFunc_BooleanAND_ReturnValue) == 0x0000B5, "Member 'BP_Weapon_C_BoltActionResume::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BoltActionResume, CallFunc_BooleanOR_ReturnValue) == 0x0000B6, "Member 'BP_Weapon_C_BoltActionResume::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BoltActionResume, CallFunc_BooleanAND_ReturnValue_1) == 0x0000B7, "Member 'BP_Weapon_C_BoltActionResume::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function BP_Weapon.BP_Weapon_C.BoltActionStop
// 0x0098 (0x0098 - 0x0000)
struct BP_Weapon_C_BoltActionStop final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBI_FPFunctions_C>     K2Node_DynamicCast_AsBI_FPFunctions;               // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetFireMontage_Montage;                   // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_1;        // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UAnimMontage>            K2Node_Select_Default;                             // 0x0040(0x0030)(UObjectWrapper, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_LoadAnimMontage_AnimMontage;              // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage;                 // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_2;            // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Weapon_C_BoltActionStop) == 0x000008, "Wrong alignment on BP_Weapon_C_BoltActionStop");
static_assert(sizeof(BP_Weapon_C_BoltActionStop) == 0x000098, "Wrong size on BP_Weapon_C_BoltActionStop");
static_assert(offsetof(BP_Weapon_C_BoltActionStop, Temp_bool_Variable) == 0x000000, "Member 'BP_Weapon_C_BoltActionStop::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BoltActionStop, CallFunc_GetAnimInstance_ReturnValue) == 0x000008, "Member 'BP_Weapon_C_BoltActionStop::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BoltActionStop, CallFunc_GetAnimInstance_ReturnValue_1) == 0x000010, "Member 'BP_Weapon_C_BoltActionStop::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BoltActionStop, K2Node_DynamicCast_AsBI_FPFunctions) == 0x000018, "Member 'BP_Weapon_C_BoltActionStop::K2Node_DynamicCast_AsBI_FPFunctions' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BoltActionStop, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_Weapon_C_BoltActionStop::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BoltActionStop, CallFunc_GetFireMontage_Montage) == 0x000030, "Member 'BP_Weapon_C_BoltActionStop::CallFunc_GetFireMontage_Montage' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BoltActionStop, CallFunc_IsLocallyControlled_ReturnValue) == 0x000038, "Member 'BP_Weapon_C_BoltActionStop::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BoltActionStop, CallFunc_IsLocallyControlled_ReturnValue_1) == 0x000039, "Member 'BP_Weapon_C_BoltActionStop::CallFunc_IsLocallyControlled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BoltActionStop, CallFunc_Not_PreBool_ReturnValue) == 0x00003A, "Member 'BP_Weapon_C_BoltActionStop::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BoltActionStop, CallFunc_BooleanAND_ReturnValue) == 0x00003B, "Member 'BP_Weapon_C_BoltActionStop::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BoltActionStop, CallFunc_BooleanOR_ReturnValue) == 0x00003C, "Member 'BP_Weapon_C_BoltActionStop::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BoltActionStop, K2Node_Select_Default) == 0x000040, "Member 'BP_Weapon_C_BoltActionStop::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BoltActionStop, CallFunc_LoadAnimMontage_AnimMontage) == 0x000070, "Member 'BP_Weapon_C_BoltActionStop::CallFunc_LoadAnimMontage_AnimMontage' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BoltActionStop, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000078, "Member 'BP_Weapon_C_BoltActionStop::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BoltActionStop, K2Node_DynamicCast_AsAnim_Montage) == 0x000080, "Member 'BP_Weapon_C_BoltActionStop::K2Node_DynamicCast_AsAnim_Montage' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BoltActionStop, K2Node_DynamicCast_bSuccess_1) == 0x000088, "Member 'BP_Weapon_C_BoltActionStop::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BoltActionStop, CallFunc_GetAnimInstance_ReturnValue_2) == 0x000090, "Member 'BP_Weapon_C_BoltActionStop::CallFunc_GetAnimInstance_ReturnValue_2' has a wrong offset!");

// Function BP_Weapon.BP_Weapon_C.BulletTrace
// 0x0970 (0x0970 - 0x0000)
struct BP_Weapon_C_BulletTrace final
{
public:
	TArray<struct FBPS_DamageInfo>                OutHit;                                            // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
	bool                                          GetHit;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LocalEndHitLocation;                               // 0x0018(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         LocalActorsToIgnore;                               // 0x0030(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         FitstSurvHitIndex;                                 // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   HitBoneName;                                       // 0x0044(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 HitActor;                                          // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CurrentHit;                                        // 0x0058(0x00E8)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          BlockingHit;                                       // 0x0140(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SkipNextHits;                                      // 0x0141(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_142[0x6];                                      // 0x0142(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBPS_DamageInfo>                DamageInfos;                                       // 0x0148(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         LastHitIndex;                                      // 0x0158(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHitResult>                     Hits;                                              // 0x0160(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0198(0x0010)(ReferenceParm)
	class ABP_RB_Vehicle_C*                       K2Node_DynamicCast_AsBP_RB_Vehicle;                // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C2[0x6];                                      // 0x01C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_CalculateDamage_ResultDamage;             // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D2[0x2];                                      // 0x01D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DC[0x4];                                      // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0210(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0228(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0250(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0278(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0290(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_SimplifiedHitInfo                   CallFunc_HitSimplify_S_SimplifiedHitInfo;          // 0x02B0(0x0080)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0331(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x0332(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x0333(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33C[0x4];                                      // 0x033C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x0340(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x0358(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x0370(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x0388(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x03A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x03A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x03B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName_1;                // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x03CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x03D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D4[0x4];                                      // 0x03D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x03D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x03F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_409[0x7];                                      // 0x0409(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_SimplifiedHitInfo                   CallFunc_HitSimplify_S_SimplifiedHitInfo_1;        // 0x0410(0x0080)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0490(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0494(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0499(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x049A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CHeckDamageDuplicate_CanAdd;              // 0x049B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x049C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49D[0x3];                                      // 0x049D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_Array_Get_Item;                           // 0x04A0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FBPS_DamageInfo                        K2Node_MakeStruct_BPS_DamageInfo;                  // 0x0588(0x0098)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0620(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0624(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0628(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_629[0x7];                                      // 0x0629(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBPS_DamageInfo                        K2Node_MakeStruct_BPS_DamageInfo_1;                // 0x0630(0x0098)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x06C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C9[0x3];                                      // 0x06C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x06CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x06D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x06D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D9[0x7];                                      // 0x06D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x06E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ShootDirection_BeginPoint;                // 0x06E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ShootDirection_EndPoint;                  // 0x0700(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ShootDirection_CamForwardVector;          // 0x0718(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomUnitVectorInConeInDegrees_ReturnValue; // 0x0730(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0748(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0830(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_831[0x7];                                      // 0x0831(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0838(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_2;            // 0x0850(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_2;         // 0x0851(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_852[0x2];                                      // 0x0852(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_2;                    // 0x0854(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_2;                // 0x0858(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85C[0x4];                                      // 0x085C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location_2;                // 0x0860(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_2;             // 0x0878(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_2;                  // 0x0890(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_2;            // 0x08A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_2;                 // 0x08C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_2;                // 0x08C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_2;            // 0x08D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_2;             // 0x08D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName_2;                // 0x08E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_2;                 // 0x08E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_2;            // 0x08EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_2;               // 0x08F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8F4[0x4];                                      // 0x08F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart_2;              // 0x08F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_2;                // 0x0910(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0928(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0940(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FHitResult>                     CallFunc_LineTraceMulti_OutHits;                   // 0x0958(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceMulti_ReturnValue;               // 0x0968(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Weapon_C_BulletTrace) == 0x000008, "Wrong alignment on BP_Weapon_C_BulletTrace");
static_assert(sizeof(BP_Weapon_C_BulletTrace) == 0x000970, "Wrong size on BP_Weapon_C_BulletTrace");
static_assert(offsetof(BP_Weapon_C_BulletTrace, OutHit) == 0x000000, "Member 'BP_Weapon_C_BulletTrace::OutHit' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BulletTrace, GetHit) == 0x000010, "Member 'BP_Weapon_C_BulletTrace::GetHit' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BulletTrace, LocalEndHitLocation) == 0x000018, "Member 'BP_Weapon_C_BulletTrace::LocalEndHitLocation' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BulletTrace, LocalActorsToIgnore) == 0x000030, "Member 'BP_Weapon_C_BulletTrace::LocalActorsToIgnore' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BulletTrace, FitstSurvHitIndex) == 0x000040, "Member 'BP_Weapon_C_BulletTrace::FitstSurvHitIndex' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BulletTrace, HitBoneName) == 0x000044, "Member 'BP_Weapon_C_BulletTrace::HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BulletTrace, HitActor) == 0x000050, "Member 'BP_Weapon_C_BulletTrace::HitActor' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BulletTrace, CurrentHit) == 0x000058, "Member 'BP_Weapon_C_BulletTrace::CurrentHit' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BulletTrace, BlockingHit) == 0x000140, "Member 'BP_Weapon_C_BulletTrace::BlockingHit' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BulletTrace, SkipNextHits) == 0x000141, "Member 'BP_Weapon_C_BulletTrace::SkipNextHits' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BulletTrace, DamageInfos) == 0x000148, "Member 'BP_Weapon_C_BulletTrace::DamageInfos' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BulletTrace, LastHitIndex) == 0x000158, "Member 'BP_Weapon_C_BulletTrace::LastHitIndex' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BulletTrace, Hits) == 0x000160, "Member 'BP_Weapon_C_BulletTrace::Hits' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BulletTrace, Temp_int_Array_Index_Variable) == 0x000170, "Member 'BP_Weapon_C_BulletTrace::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BulletTrace, CallFunc_GetPlayerPawn_ReturnValue) == 0x000178, "Member 'BP_Weapon_C_BulletTrace::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BulletTrace, CallFunc_GetSocketLocation_ReturnValue) == 0x000180, "Member 'BP_Weapon_C_BulletTrace::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BulletTrace, K2Node_MakeArray_Array) == 0x000198, "Member 'BP_Weapon_C_BulletTrace::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BulletTrace, K2Node_DynamicCast_AsBP_RB_Vehicle) == 0x0001A8, "Member 'BP_Weapon_C_BulletTrace::K2Node_DynamicCast_AsBP_RB_Vehicle' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BulletTrace, K2Node_DynamicCast_bSuccess) == 0x0001B0, "Member 'BP_Weapon_C_BulletTrace::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BulletTrace, K2Node_DynamicCast_AsPawn) == 0x0001B8, "Member 'BP_Weapon_C_BulletTrace::K2Node_DynamicCast_AsPawn' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BulletTrace, K2Node_DynamicCast_bSuccess_1) == 0x0001C0, "Member 'BP_Weapon_C_BulletTrace::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BulletTrace, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0001C1, "Member 'BP_Weapon_C_BulletTrace::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BulletTrace, CallFunc_CalculateDamage_ResultDamage) == 0x0001C8, "Member 'BP_Weapon_C_BulletTrace::CallFunc_CalculateDamage_ResultDamage' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BulletTrace, CallFunc_BreakHitResult_bBlockingHit) == 0x0001D0, "Member 'BP_Weapon_C_BulletTrace::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BulletTrace, CallFunc_BreakHitResult_bInitialOverlap) == 0x0001D1, "Member 'BP_Weapon_C_BulletTrace::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BulletTrace, CallFunc_BreakHitResult_Time) == 0x0001D4, "Member 'BP_Weapon_C_BulletTrace::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BulletTrace, CallFunc_BreakHitResult_Distance) == 0x0001D8, "Member 'BP_Weapon_C_BulletTrace::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BulletTrace, CallFunc_BreakHitResult_Location) == 0x0001E0, "Member 'BP_Weapon_C_BulletTrace::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BulletTrace, CallFunc_BreakHitResult_ImpactPoint) == 0x0001F8, "Member 'BP_Weapon_C_BulletTrace::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BulletTrace, CallFunc_BreakHitResult_Normal) == 0x000210, "Member 'BP_Weapon_C_BulletTrace::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BulletTrace, CallFunc_BreakHitResult_ImpactNormal) == 0x000228, "Member 'BP_Weapon_C_BulletTrace::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BulletTrace, CallFunc_BreakHitResult_PhysMat) == 0x000240, "Member 'BP_Weapon_C_BulletTrace::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BulletTrace, CallFunc_BreakHitResult_HitActor) == 0x000248, "Member 'BP_Weapon_C_BulletTrace::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BulletTrace, CallFunc_BreakHitResult_HitComponent) == 0x000250, "Member 'BP_Weapon_C_BulletTrace::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_Weapon_C_BulletTrace, CallFunc_BreakHitResult_HitBoneName) == 0x000258, "Member 'BP_Weapon_C_BulletTrace::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
