#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WorkbenchActor

#include "Basic.hpp"

#include "BPS_WeaponData_structs.hpp"
#include "ContainerPickupsInfo_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FItemInfo_structs.hpp"
#include "Engine_structs.hpp"
#include "EquipmentData_structs.hpp"
#include "AttachmentInfo_structs.hpp"
#include "S_Attachment_structs.hpp"


namespace SDK::Params
{

// Function BP_WorkbenchActor.BP_WorkbenchActor_C.ExecuteUbergraph_BP_WorkbenchActor
// 0x0180 (0x0180 - 0x0000)
struct BP_WorkbenchActor_C_ExecuteUbergraph_BP_WorkbenchActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWeaponPlaceholder_C*                   K2Node_DynamicCast_AsWeapon_Placeholder;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetRelativeTransform_ReturnValue;         // 0x0020(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult;   // 0x0080(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class ASkeletalMeshActor*                     K2Node_DynamicCast_AsSkeletal_Mesh_Actor;          // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WorkbenchActor_C_ExecuteUbergraph_BP_WorkbenchActor) == 0x000010, "Wrong alignment on BP_WorkbenchActor_C_ExecuteUbergraph_BP_WorkbenchActor");
static_assert(sizeof(BP_WorkbenchActor_C_ExecuteUbergraph_BP_WorkbenchActor) == 0x000180, "Wrong size on BP_WorkbenchActor_C_ExecuteUbergraph_BP_WorkbenchActor");
static_assert(offsetof(BP_WorkbenchActor_C_ExecuteUbergraph_BP_WorkbenchActor, EntryPoint) == 0x000000, "Member 'BP_WorkbenchActor_C_ExecuteUbergraph_BP_WorkbenchActor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchActor_C_ExecuteUbergraph_BP_WorkbenchActor, CallFunc_Array_Add_ReturnValue) == 0x000004, "Member 'BP_WorkbenchActor_C_ExecuteUbergraph_BP_WorkbenchActor::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchActor_C_ExecuteUbergraph_BP_WorkbenchActor, K2Node_DynamicCast_AsWeapon_Placeholder) == 0x000008, "Member 'BP_WorkbenchActor_C_ExecuteUbergraph_BP_WorkbenchActor::K2Node_DynamicCast_AsWeapon_Placeholder' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchActor_C_ExecuteUbergraph_BP_WorkbenchActor, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_WorkbenchActor_C_ExecuteUbergraph_BP_WorkbenchActor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchActor_C_ExecuteUbergraph_BP_WorkbenchActor, CallFunc_Array_Add_ReturnValue_1) == 0x000014, "Member 'BP_WorkbenchActor_C_ExecuteUbergraph_BP_WorkbenchActor::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchActor_C_ExecuteUbergraph_BP_WorkbenchActor, CallFunc_GetRelativeTransform_ReturnValue) == 0x000020, "Member 'BP_WorkbenchActor_C_ExecuteUbergraph_BP_WorkbenchActor::CallFunc_GetRelativeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchActor_C_ExecuteUbergraph_BP_WorkbenchActor, CallFunc_K2_SetRelativeTransform_SweepHitResult) == 0x000080, "Member 'BP_WorkbenchActor_C_ExecuteUbergraph_BP_WorkbenchActor::CallFunc_K2_SetRelativeTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchActor_C_ExecuteUbergraph_BP_WorkbenchActor, K2Node_DynamicCast_AsSkeletal_Mesh_Actor) == 0x000168, "Member 'BP_WorkbenchActor_C_ExecuteUbergraph_BP_WorkbenchActor::K2Node_DynamicCast_AsSkeletal_Mesh_Actor' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchActor_C_ExecuteUbergraph_BP_WorkbenchActor, K2Node_DynamicCast_bSuccess_1) == 0x000170, "Member 'BP_WorkbenchActor_C_ExecuteUbergraph_BP_WorkbenchActor::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function BP_WorkbenchActor.BP_WorkbenchActor_C.Remove Model
// 0x0508 (0x0508 - 0x0000)
struct BP_WorkbenchActor_C_Remove_Model final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBPS_WeaponData                        CallFunc_GetDataTableRowFromName_OutRow;           // 0x0010(0x04C0)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D1[0x3];                                      // 0x04D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumMaterials_ReturnValue;              // 0x04D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x04D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          K2Node_DynamicCast_AsSkeletal_Mesh;                // 0x04E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x04E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E9[0x3];                                      // 0x04E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x04EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x04F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F1[0x3];                                      // 0x04F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x04F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BaseAttachment_C*                   CallFunc_Array_Get_Item;                           // 0x04F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0500(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0504(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WorkbenchActor_C_Remove_Model) == 0x000008, "Wrong alignment on BP_WorkbenchActor_C_Remove_Model");
static_assert(sizeof(BP_WorkbenchActor_C_Remove_Model) == 0x000508, "Wrong size on BP_WorkbenchActor_C_Remove_Model");
static_assert(offsetof(BP_WorkbenchActor_C_Remove_Model, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'BP_WorkbenchActor_C_Remove_Model::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchActor_C_Remove_Model, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'BP_WorkbenchActor_C_Remove_Model::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchActor_C_Remove_Model, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_WorkbenchActor_C_Remove_Model::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchActor_C_Remove_Model, CallFunc_GetDataTableRowFromName_OutRow) == 0x000010, "Member 'BP_WorkbenchActor_C_Remove_Model::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchActor_C_Remove_Model, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0004D0, "Member 'BP_WorkbenchActor_C_Remove_Model::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchActor_C_Remove_Model, CallFunc_GetNumMaterials_ReturnValue) == 0x0004D4, "Member 'BP_WorkbenchActor_C_Remove_Model::CallFunc_GetNumMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchActor_C_Remove_Model, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x0004D8, "Member 'BP_WorkbenchActor_C_Remove_Model::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchActor_C_Remove_Model, K2Node_DynamicCast_AsSkeletal_Mesh) == 0x0004E0, "Member 'BP_WorkbenchActor_C_Remove_Model::K2Node_DynamicCast_AsSkeletal_Mesh' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchActor_C_Remove_Model, K2Node_DynamicCast_bSuccess) == 0x0004E8, "Member 'BP_WorkbenchActor_C_Remove_Model::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchActor_C_Remove_Model, Temp_int_Variable) == 0x0004EC, "Member 'BP_WorkbenchActor_C_Remove_Model::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchActor_C_Remove_Model, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0004F0, "Member 'BP_WorkbenchActor_C_Remove_Model::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchActor_C_Remove_Model, CallFunc_Add_IntInt_ReturnValue_1) == 0x0004F4, "Member 'BP_WorkbenchActor_C_Remove_Model::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchActor_C_Remove_Model, CallFunc_Array_Get_Item) == 0x0004F8, "Member 'BP_WorkbenchActor_C_Remove_Model::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchActor_C_Remove_Model, CallFunc_Array_Length_ReturnValue) == 0x000500, "Member 'BP_WorkbenchActor_C_Remove_Model::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchActor_C_Remove_Model, CallFunc_Less_IntInt_ReturnValue) == 0x000504, "Member 'BP_WorkbenchActor_C_Remove_Model::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_WorkbenchActor.BP_WorkbenchActor_C.SetNewModelByWeaponInfo
// 0x10E0 (0x10E0 - 0x0000)
struct BP_WorkbenchActor_C_SetNewModelByWeaponInfo final
{
public:
	struct FFItemInfo                             WeaponInfo;                                        // 0x0000(0x0220)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
	struct FS_Attachment                          CurrentMode;                                       // 0x0220(0x0080)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEquipmentData                         CallFunc_GetDataTableRowFromName_OutRow;           // 0x02A8(0x0180)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_429[0x3];                                      // 0x0429(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x042C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0430(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          K2Node_DynamicCast_AsSkeletal_Mesh;                // 0x0438(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_441[0x3];                                      // 0x0441(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0444(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0448(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x044C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0450(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0454(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0459(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45A[0x6];                                      // 0x045A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0460(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0468(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46C[0x4];                                      // 0x046C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0470(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_479[0x3];                                      // 0x0479(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x047C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BaseAttachment_C*                   CallFunc_Array_Get_Item;                           // 0x0480(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0488(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x048C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48D[0x3];                                      // 0x048D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0490(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FContainerPickupsInfo>          CallFunc_getItemsInventory_ContainerItems;         // 0x04F0(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<struct FContainerPickupsInfo>          CallFunc_getItemsInventory_ContainersData;         // 0x0500(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FContainerPickupsInfo                  CallFunc_Array_Get_Item_1;                         // 0x0510(0x0068)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0578(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57C[0x4];                                      // 0x057C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0580(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x07A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x07A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x07A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A3[0x5];                                      // 0x07A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             K2Node_SetFieldsInStruct_StructOut;                // 0x07A8(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x09C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x09D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D9[0x7];                                      // 0x09D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x09E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x09F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_LoadClassAsset_Blocking_ReturnValue;      // 0x0A00(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsBP_Base_Attachment;      // 0x0A08(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0A10(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A11[0x7];                                      // 0x0A11(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0A18(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_BaseAttachment_C*                   CallFunc_FinishSpawningActor_ReturnValue;          // 0x0A20(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0A28(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2C[0x4];                                      // 0x0A2C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0A30(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0A90(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0A91(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0A92(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A93[0x5];                                      // 0x0A93(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_1;         // 0x0A98(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          K2Node_DynamicCast_AsSkeletal_Mesh_1;              // 0x0AA0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0AA8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0AA9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AAA[0x2];                                      // 0x0AAA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0AAC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_Attachment                          CallFunc_GetDataTableRowFromName_OutRow_2;         // 0x0AB0(0x0080)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_2;    // 0x0B30(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B31[0x3];                                      // 0x0B31(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAttachmentInfo                        CallFunc_Array_Get_Item_2;                         // 0x0B34(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0B44(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0B48(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B49[0x7];                                      // 0x0B49(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_Attachment                          CallFunc_GetDataTableRowFromName_OutRow_3;         // 0x0B50(0x0080)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_3;    // 0x0BD0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0BD1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD2[0x6];                                      // 0x0BD2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_LoadClassAsset_Blocking_ReturnValue_1;    // 0x0BD8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsBP_Base_Attachment_1;    // 0x0BE0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess_1;                // 0x0BE8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0BE9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BEA[0x6];                                      // 0x0BEA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0BF0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_BaseAttachment_C*                   CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0BF8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0C00(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_1;       // 0x0C01(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C02[0x2];                                      // 0x0C02(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0C04(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x0C08(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x0C0C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0C0D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C0E[0x2];                                      // 0x0C0E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBPS_WeaponData                        CallFunc_GetDataTableRowFromName_OutRow_4;         // 0x0C10(0x04C0)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_4;    // 0x10D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WorkbenchActor_C_SetNewModelByWeaponInfo) == 0x000010, "Wrong alignment on BP_WorkbenchActor_C_SetNewModelByWeaponInfo");
static_assert(sizeof(BP_WorkbenchActor_C_SetNewModelByWeaponInfo) == 0x0010E0, "Wrong size on BP_WorkbenchActor_C_SetNewModelByWeaponInfo");
static_assert(offsetof(BP_WorkbenchActor_C_SetNewModelByWeaponInfo, WeaponInfo) == 0x000000, "Member 'BP_WorkbenchActor_C_SetNewModelByWeaponInfo::WeaponInfo' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchActor_C_SetNewModelByWeaponInfo, CurrentMode) == 0x000220, "Member 'BP_WorkbenchActor_C_SetNewModelByWeaponInfo::CurrentMode' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchActor_C_SetNewModelByWeaponInfo, Temp_int_Loop_Counter_Variable) == 0x0002A0, "Member 'BP_WorkbenchActor_C_SetNewModelByWeaponInfo::Temp_int_Loop_Counter_Variable' has a wrong offset!");
