#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WorkbenchItemPlaceholder

#include "Basic.hpp"

#include "FItemInfo_structs.hpp"
#include "E_WorkbenchTabTypes_structs.hpp"


namespace SDK::Params
{

// Function BP_WorkbenchItemPlaceholder.BP_WorkbenchItemPlaceholder_C.ExecuteUbergraph_BP_WorkbenchItemPlaceholder
// 0x0490 (0x0490 - 0x0000)
struct BP_WorkbenchItemPlaceholder_C_ExecuteUbergraph_BP_WorkbenchItemPlaceholder final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             K2Node_MakeStruct_FItemInfo;                       // 0x0008(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFItemInfo                             K2Node_CustomEvent_NewItemInfo;                    // 0x0238(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	E_WorkbenchTabTypes                           K2Node_CustomEvent_ForTab;                         // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsScetch;                      // 0x0459(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45A[0x6];                                      // 0x045A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            K2Node_DynamicCast_AsStatic_Mesh;                  // 0x0460(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0469(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46A[0x6];                                      // 0x046A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0470(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0479(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_1;              // 0x047A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x047B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x047C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WorkbenchItemPlaceholder_C_ExecuteUbergraph_BP_WorkbenchItemPlaceholder) == 0x000008, "Wrong alignment on BP_WorkbenchItemPlaceholder_C_ExecuteUbergraph_BP_WorkbenchItemPlaceholder");
static_assert(sizeof(BP_WorkbenchItemPlaceholder_C_ExecuteUbergraph_BP_WorkbenchItemPlaceholder) == 0x000490, "Wrong size on BP_WorkbenchItemPlaceholder_C_ExecuteUbergraph_BP_WorkbenchItemPlaceholder");
static_assert(offsetof(BP_WorkbenchItemPlaceholder_C_ExecuteUbergraph_BP_WorkbenchItemPlaceholder, EntryPoint) == 0x000000, "Member 'BP_WorkbenchItemPlaceholder_C_ExecuteUbergraph_BP_WorkbenchItemPlaceholder::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchItemPlaceholder_C_ExecuteUbergraph_BP_WorkbenchItemPlaceholder, K2Node_MakeStruct_FItemInfo) == 0x000008, "Member 'BP_WorkbenchItemPlaceholder_C_ExecuteUbergraph_BP_WorkbenchItemPlaceholder::K2Node_MakeStruct_FItemInfo' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchItemPlaceholder_C_ExecuteUbergraph_BP_WorkbenchItemPlaceholder, K2Node_SwitchEnum_CmpSuccess) == 0x000228, "Member 'BP_WorkbenchItemPlaceholder_C_ExecuteUbergraph_BP_WorkbenchItemPlaceholder::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchItemPlaceholder_C_ExecuteUbergraph_BP_WorkbenchItemPlaceholder, Temp_object_Variable) == 0x000230, "Member 'BP_WorkbenchItemPlaceholder_C_ExecuteUbergraph_BP_WorkbenchItemPlaceholder::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchItemPlaceholder_C_ExecuteUbergraph_BP_WorkbenchItemPlaceholder, K2Node_CustomEvent_NewItemInfo) == 0x000238, "Member 'BP_WorkbenchItemPlaceholder_C_ExecuteUbergraph_BP_WorkbenchItemPlaceholder::K2Node_CustomEvent_NewItemInfo' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchItemPlaceholder_C_ExecuteUbergraph_BP_WorkbenchItemPlaceholder, K2Node_CustomEvent_ForTab) == 0x000458, "Member 'BP_WorkbenchItemPlaceholder_C_ExecuteUbergraph_BP_WorkbenchItemPlaceholder::K2Node_CustomEvent_ForTab' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchItemPlaceholder_C_ExecuteUbergraph_BP_WorkbenchItemPlaceholder, K2Node_CustomEvent_bIsScetch) == 0x000459, "Member 'BP_WorkbenchItemPlaceholder_C_ExecuteUbergraph_BP_WorkbenchItemPlaceholder::K2Node_CustomEvent_bIsScetch' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchItemPlaceholder_C_ExecuteUbergraph_BP_WorkbenchItemPlaceholder, K2Node_DynamicCast_AsStatic_Mesh) == 0x000460, "Member 'BP_WorkbenchItemPlaceholder_C_ExecuteUbergraph_BP_WorkbenchItemPlaceholder::K2Node_DynamicCast_AsStatic_Mesh' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchItemPlaceholder_C_ExecuteUbergraph_BP_WorkbenchItemPlaceholder, K2Node_DynamicCast_bSuccess) == 0x000468, "Member 'BP_WorkbenchItemPlaceholder_C_ExecuteUbergraph_BP_WorkbenchItemPlaceholder::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchItemPlaceholder_C_ExecuteUbergraph_BP_WorkbenchItemPlaceholder, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000469, "Member 'BP_WorkbenchItemPlaceholder_C_ExecuteUbergraph_BP_WorkbenchItemPlaceholder::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchItemPlaceholder_C_ExecuteUbergraph_BP_WorkbenchItemPlaceholder, K2Node_CustomEvent_Loaded) == 0x000470, "Member 'BP_WorkbenchItemPlaceholder_C_ExecuteUbergraph_BP_WorkbenchItemPlaceholder::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchItemPlaceholder_C_ExecuteUbergraph_BP_WorkbenchItemPlaceholder, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000478, "Member 'BP_WorkbenchItemPlaceholder_C_ExecuteUbergraph_BP_WorkbenchItemPlaceholder::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchItemPlaceholder_C_ExecuteUbergraph_BP_WorkbenchItemPlaceholder, CallFunc_SetStaticMesh_ReturnValue) == 0x000479, "Member 'BP_WorkbenchItemPlaceholder_C_ExecuteUbergraph_BP_WorkbenchItemPlaceholder::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchItemPlaceholder_C_ExecuteUbergraph_BP_WorkbenchItemPlaceholder, CallFunc_SetStaticMesh_ReturnValue_1) == 0x00047A, "Member 'BP_WorkbenchItemPlaceholder_C_ExecuteUbergraph_BP_WorkbenchItemPlaceholder::CallFunc_SetStaticMesh_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchItemPlaceholder_C_ExecuteUbergraph_BP_WorkbenchItemPlaceholder, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x00047B, "Member 'BP_WorkbenchItemPlaceholder_C_ExecuteUbergraph_BP_WorkbenchItemPlaceholder::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchItemPlaceholder_C_ExecuteUbergraph_BP_WorkbenchItemPlaceholder, K2Node_CreateDelegate_OutputDelegate) == 0x00047C, "Member 'BP_WorkbenchItemPlaceholder_C_ExecuteUbergraph_BP_WorkbenchItemPlaceholder::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function BP_WorkbenchItemPlaceholder.BP_WorkbenchItemPlaceholder_C.OnLoaded_C93A95CC45F4AE4C85612682A9D71841
// 0x0008 (0x0008 - 0x0000)
struct BP_WorkbenchItemPlaceholder_C_OnLoaded_C93A95CC45F4AE4C85612682A9D71841 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WorkbenchItemPlaceholder_C_OnLoaded_C93A95CC45F4AE4C85612682A9D71841) == 0x000008, "Wrong alignment on BP_WorkbenchItemPlaceholder_C_OnLoaded_C93A95CC45F4AE4C85612682A9D71841");
static_assert(sizeof(BP_WorkbenchItemPlaceholder_C_OnLoaded_C93A95CC45F4AE4C85612682A9D71841) == 0x000008, "Wrong size on BP_WorkbenchItemPlaceholder_C_OnLoaded_C93A95CC45F4AE4C85612682A9D71841");
static_assert(offsetof(BP_WorkbenchItemPlaceholder_C_OnLoaded_C93A95CC45F4AE4C85612682A9D71841, Loaded) == 0x000000, "Member 'BP_WorkbenchItemPlaceholder_C_OnLoaded_C93A95CC45F4AE4C85612682A9D71841::Loaded' has a wrong offset!");

// Function BP_WorkbenchItemPlaceholder.BP_WorkbenchItemPlaceholder_C.SpawnWorkbenchItem
// 0x0228 (0x0228 - 0x0000)
struct BP_WorkbenchItemPlaceholder_C_SpawnWorkbenchItem final
{
public:
	struct FFItemInfo                             NewItemInfo;                                       // 0x0000(0x0220)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
	E_WorkbenchTabTypes                           ForTab;                                            // 0x0220(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsScetch;                                         // 0x0221(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WorkbenchItemPlaceholder_C_SpawnWorkbenchItem) == 0x000008, "Wrong alignment on BP_WorkbenchItemPlaceholder_C_SpawnWorkbenchItem");
static_assert(sizeof(BP_WorkbenchItemPlaceholder_C_SpawnWorkbenchItem) == 0x000228, "Wrong size on BP_WorkbenchItemPlaceholder_C_SpawnWorkbenchItem");
static_assert(offsetof(BP_WorkbenchItemPlaceholder_C_SpawnWorkbenchItem, NewItemInfo) == 0x000000, "Member 'BP_WorkbenchItemPlaceholder_C_SpawnWorkbenchItem::NewItemInfo' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchItemPlaceholder_C_SpawnWorkbenchItem, ForTab) == 0x000220, "Member 'BP_WorkbenchItemPlaceholder_C_SpawnWorkbenchItem::ForTab' has a wrong offset!");
static_assert(offsetof(BP_WorkbenchItemPlaceholder_C_SpawnWorkbenchItem, bIsScetch) == 0x000221, "Member 'BP_WorkbenchItemPlaceholder_C_SpawnWorkbenchItem::bIsScetch' has a wrong offset!");

}

