#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ZombieSpawner

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Survival_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "DayCycleState_structs.hpp"
#include "AreaPropertiesUpdated_structs.hpp"


namespace SDK::Params
{

// Function BP_ZombieSpawner.BP_ZombieSpawner_C.AddArea
// 0x0320 (0x0320 - 0x0000)
struct BP_ZombieSpawner_C_AddArea final
{
public:
	struct FAreaPropertiesUpdated                 AreaProperties;                                    // 0x0000(0x00C8)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RelativeTransform;                                 // 0x00D0(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               RelativeRotation;                                  // 0x0130(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                RelativeLocation;                                  // 0x0148(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Extent;                                            // 0x0160(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowCurrentWorkingArea;                            // 0x0178(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBoxComponent*                          BoxArea;                                           // 0x0180(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_188[0x8];                                      // 0x0188(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0190(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        CallFunc_AddComponent_ReturnValue;                 // 0x0220(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          CallFunc_AddComponent_ReturnValue_1;               // 0x0228(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0230(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0250(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_268[0x8];                                      // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0270(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x02E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x02F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_R_ImplicitCast;                  // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_G_ImplicitCast;                  // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_B_ImplicitCast;                  // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ZombieSpawner_C_AddArea) == 0x000010, "Wrong alignment on BP_ZombieSpawner_C_AddArea");
static_assert(sizeof(BP_ZombieSpawner_C_AddArea) == 0x000320, "Wrong size on BP_ZombieSpawner_C_AddArea");
static_assert(offsetof(BP_ZombieSpawner_C_AddArea, AreaProperties) == 0x000000, "Member 'BP_ZombieSpawner_C_AddArea::AreaProperties' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_AddArea, RelativeTransform) == 0x0000D0, "Member 'BP_ZombieSpawner_C_AddArea::RelativeTransform' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_AddArea, RelativeRotation) == 0x000130, "Member 'BP_ZombieSpawner_C_AddArea::RelativeRotation' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_AddArea, RelativeLocation) == 0x000148, "Member 'BP_ZombieSpawner_C_AddArea::RelativeLocation' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_AddArea, Extent) == 0x000160, "Member 'BP_ZombieSpawner_C_AddArea::Extent' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_AddArea, ShowCurrentWorkingArea) == 0x000178, "Member 'BP_ZombieSpawner_C_AddArea::ShowCurrentWorkingArea' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_AddArea, BoxArea) == 0x000180, "Member 'BP_ZombieSpawner_C_AddArea::BoxArea' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_AddArea, Temp_struct_Variable) == 0x000190, "Member 'BP_ZombieSpawner_C_AddArea::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_AddArea, CallFunc_BreakVector_X) == 0x0001F0, "Member 'BP_ZombieSpawner_C_AddArea::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_AddArea, CallFunc_BreakVector_Y) == 0x0001F8, "Member 'BP_ZombieSpawner_C_AddArea::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_AddArea, CallFunc_BreakVector_Z) == 0x000200, "Member 'BP_ZombieSpawner_C_AddArea::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_AddArea, CallFunc_MakeVector_ReturnValue) == 0x000208, "Member 'BP_ZombieSpawner_C_AddArea::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_AddArea, CallFunc_AddComponent_ReturnValue) == 0x000220, "Member 'BP_ZombieSpawner_C_AddArea::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_AddArea, CallFunc_AddComponent_ReturnValue_1) == 0x000228, "Member 'BP_ZombieSpawner_C_AddArea::CallFunc_AddComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_AddArea, CallFunc_Add_VectorVector_ReturnValue) == 0x000230, "Member 'BP_ZombieSpawner_C_AddArea::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_AddArea, CallFunc_BooleanOR_ReturnValue) == 0x000248, "Member 'BP_ZombieSpawner_C_AddArea::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_AddArea, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000250, "Member 'BP_ZombieSpawner_C_AddArea::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_AddArea, CallFunc_MakeTransform_ReturnValue) == 0x000270, "Member 'BP_ZombieSpawner_C_AddArea::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_AddArea, CallFunc_K2_AttachToComponent_ReturnValue) == 0x0002D0, "Member 'BP_ZombieSpawner_C_AddArea::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_AddArea, CallFunc_RandomFloatInRange_ReturnValue) == 0x0002D8, "Member 'BP_ZombieSpawner_C_AddArea::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_AddArea, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0002E0, "Member 'BP_ZombieSpawner_C_AddArea::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_AddArea, K2Node_MakeStruct_LinearColor) == 0x0002F8, "Member 'BP_ZombieSpawner_C_AddArea::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_AddArea, K2Node_MakeStruct_R_ImplicitCast) == 0x000308, "Member 'BP_ZombieSpawner_C_AddArea::K2Node_MakeStruct_R_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_AddArea, K2Node_MakeStruct_G_ImplicitCast) == 0x00030C, "Member 'BP_ZombieSpawner_C_AddArea::K2Node_MakeStruct_G_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_AddArea, K2Node_MakeStruct_B_ImplicitCast) == 0x000310, "Member 'BP_ZombieSpawner_C_AddArea::K2Node_MakeStruct_B_ImplicitCast' has a wrong offset!");

// Function BP_ZombieSpawner.BP_ZombieSpawner_C.AddPlayerCheckArea
// 0x0350 (0x0350 - 0x0000)
struct BP_ZombieSpawner_C_AddPlayerCheckArea final
{
public:
	struct FAreaPropertiesUpdated                 Area;                                              // 0x0000(0x00C8)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ConnectedAreaRelativeTransform;                    // 0x00D0(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          CheckBoxArea;                                      // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0198(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x01B0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex)> K2Node_CreateDelegate_OutputDelegate;              // 0x029C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x02AC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x02BC(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C4[0x4];                                      // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x02C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x02E0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          CallFunc_AddComponent_ReturnValue;                 // 0x0340(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ZombieSpawner_C_AddPlayerCheckArea) == 0x000010, "Wrong alignment on BP_ZombieSpawner_C_AddPlayerCheckArea");
static_assert(sizeof(BP_ZombieSpawner_C_AddPlayerCheckArea) == 0x000350, "Wrong size on BP_ZombieSpawner_C_AddPlayerCheckArea");
static_assert(offsetof(BP_ZombieSpawner_C_AddPlayerCheckArea, Area) == 0x000000, "Member 'BP_ZombieSpawner_C_AddPlayerCheckArea::Area' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_AddPlayerCheckArea, ConnectedAreaRelativeTransform) == 0x0000D0, "Member 'BP_ZombieSpawner_C_AddPlayerCheckArea::ConnectedAreaRelativeTransform' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_AddPlayerCheckArea, CheckBoxArea) == 0x000130, "Member 'BP_ZombieSpawner_C_AddPlayerCheckArea::CheckBoxArea' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_AddPlayerCheckArea, CallFunc_BreakTransform_Location) == 0x000138, "Member 'BP_ZombieSpawner_C_AddPlayerCheckArea::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_AddPlayerCheckArea, CallFunc_BreakTransform_Rotation) == 0x000150, "Member 'BP_ZombieSpawner_C_AddPlayerCheckArea::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_AddPlayerCheckArea, CallFunc_BreakTransform_Scale) == 0x000168, "Member 'BP_ZombieSpawner_C_AddPlayerCheckArea::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_AddPlayerCheckArea, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000180, "Member 'BP_ZombieSpawner_C_AddPlayerCheckArea::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_AddPlayerCheckArea, CallFunc_Add_VectorVector_ReturnValue) == 0x000198, "Member 'BP_ZombieSpawner_C_AddPlayerCheckArea::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_AddPlayerCheckArea, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x0001B0, "Member 'BP_ZombieSpawner_C_AddPlayerCheckArea::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_AddPlayerCheckArea, CallFunc_Array_Add_ReturnValue) == 0x000298, "Member 'BP_ZombieSpawner_C_AddPlayerCheckArea::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_AddPlayerCheckArea, K2Node_CreateDelegate_OutputDelegate) == 0x00029C, "Member 'BP_ZombieSpawner_C_AddPlayerCheckArea::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_AddPlayerCheckArea, K2Node_CreateDelegate_OutputDelegate_1) == 0x0002AC, "Member 'BP_ZombieSpawner_C_AddPlayerCheckArea::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_AddPlayerCheckArea, Temp_int_Variable) == 0x0002BC, "Member 'BP_ZombieSpawner_C_AddPlayerCheckArea::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_AddPlayerCheckArea, CallFunc_Array_Add_ReturnValue_1) == 0x0002C0, "Member 'BP_ZombieSpawner_C_AddPlayerCheckArea::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_AddPlayerCheckArea, CallFunc_ComposeRotators_ReturnValue) == 0x0002C8, "Member 'BP_ZombieSpawner_C_AddPlayerCheckArea::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_AddPlayerCheckArea, CallFunc_MakeTransform_ReturnValue) == 0x0002E0, "Member 'BP_ZombieSpawner_C_AddPlayerCheckArea::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_AddPlayerCheckArea, CallFunc_AddComponent_ReturnValue) == 0x000340, "Member 'BP_ZombieSpawner_C_AddPlayerCheckArea::CallFunc_AddComponent_ReturnValue' has a wrong offset!");

// Function BP_ZombieSpawner.BP_ZombieSpawner_C.All Areas Occupied
// 0x0010 (0x0010 - 0x0000)
struct BP_ZombieSpawner_C_All_Areas_Occupied final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ZombieSpawner_C_All_Areas_Occupied) == 0x000004, "Wrong alignment on BP_ZombieSpawner_C_All_Areas_Occupied");
static_assert(sizeof(BP_ZombieSpawner_C_All_Areas_Occupied) == 0x000010, "Wrong size on BP_ZombieSpawner_C_All_Areas_Occupied");
static_assert(offsetof(BP_ZombieSpawner_C_All_Areas_Occupied, ReturnValue) == 0x000000, "Member 'BP_ZombieSpawner_C_All_Areas_Occupied::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_All_Areas_Occupied, Temp_int_Variable) == 0x000004, "Member 'BP_ZombieSpawner_C_All_Areas_Occupied::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_All_Areas_Occupied, CallFunc_Array_Find_ReturnValue) == 0x000008, "Member 'BP_ZombieSpawner_C_All_Areas_Occupied::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_All_Areas_Occupied, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00000C, "Member 'BP_ZombieSpawner_C_All_Areas_Occupied::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_ZombieSpawner.BP_ZombieSpawner_C.AnotherZombieInSpawnPoint
// 0x0178 (0x0178 - 0x0000)
struct BP_ZombieSpawner_C_AnotherZombieInSpawnPoint final
{
public:
	struct FVector                                SpawnLocation;                                     // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HalfHeight;                                        // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Radius;                                            // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0028(0x0010)(ConstParm, ReferenceParm)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0038(0x0010)(ConstParm, ReferenceParm)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_CapsuleTraceSingleForObjects_OutHit;      // 0x0080(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_CapsuleTraceSingleForObjects_ReturnValue; // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ZombieSpawner_C_AnotherZombieInSpawnPoint) == 0x000008, "Wrong alignment on BP_ZombieSpawner_C_AnotherZombieInSpawnPoint");
static_assert(sizeof(BP_ZombieSpawner_C_AnotherZombieInSpawnPoint) == 0x000178, "Wrong size on BP_ZombieSpawner_C_AnotherZombieInSpawnPoint");
static_assert(offsetof(BP_ZombieSpawner_C_AnotherZombieInSpawnPoint, SpawnLocation) == 0x000000, "Member 'BP_ZombieSpawner_C_AnotherZombieInSpawnPoint::SpawnLocation' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_AnotherZombieInSpawnPoint, ReturnValue) == 0x000018, "Member 'BP_ZombieSpawner_C_AnotherZombieInSpawnPoint::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_AnotherZombieInSpawnPoint, HalfHeight) == 0x00001C, "Member 'BP_ZombieSpawner_C_AnotherZombieInSpawnPoint::HalfHeight' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_AnotherZombieInSpawnPoint, Radius) == 0x000020, "Member 'BP_ZombieSpawner_C_AnotherZombieInSpawnPoint::Radius' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_AnotherZombieInSpawnPoint, Temp_object_Variable) == 0x000028, "Member 'BP_ZombieSpawner_C_AnotherZombieInSpawnPoint::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_AnotherZombieInSpawnPoint, K2Node_MakeArray_Array) == 0x000038, "Member 'BP_ZombieSpawner_C_AnotherZombieInSpawnPoint::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_AnotherZombieInSpawnPoint, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000048, "Member 'BP_ZombieSpawner_C_AnotherZombieInSpawnPoint::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_AnotherZombieInSpawnPoint, CallFunc_MakeVector_ReturnValue) == 0x000050, "Member 'BP_ZombieSpawner_C_AnotherZombieInSpawnPoint::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_AnotherZombieInSpawnPoint, CallFunc_Add_VectorVector_ReturnValue) == 0x000068, "Member 'BP_ZombieSpawner_C_AnotherZombieInSpawnPoint::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_AnotherZombieInSpawnPoint, CallFunc_CapsuleTraceSingleForObjects_OutHit) == 0x000080, "Member 'BP_ZombieSpawner_C_AnotherZombieInSpawnPoint::CallFunc_CapsuleTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_AnotherZombieInSpawnPoint, CallFunc_CapsuleTraceSingleForObjects_ReturnValue) == 0x000168, "Member 'BP_ZombieSpawner_C_AnotherZombieInSpawnPoint::CallFunc_CapsuleTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_AnotherZombieInSpawnPoint, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000170, "Member 'BP_ZombieSpawner_C_AnotherZombieInSpawnPoint::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_ZombieSpawner.BP_ZombieSpawner_C.AreaIsEmptyFromPlayers
// 0x0008 (0x0008 - 0x0000)
struct BP_ZombieSpawner_C_AreaIsEmptyFromPlayers final
{
public:
	int32                                         AreaIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ZombieSpawner_C_AreaIsEmptyFromPlayers) == 0x000004, "Wrong alignment on BP_ZombieSpawner_C_AreaIsEmptyFromPlayers");
static_assert(sizeof(BP_ZombieSpawner_C_AreaIsEmptyFromPlayers) == 0x000008, "Wrong size on BP_ZombieSpawner_C_AreaIsEmptyFromPlayers");
static_assert(offsetof(BP_ZombieSpawner_C_AreaIsEmptyFromPlayers, AreaIndex) == 0x000000, "Member 'BP_ZombieSpawner_C_AreaIsEmptyFromPlayers::AreaIndex' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_AreaIsEmptyFromPlayers, ReturnValue) == 0x000004, "Member 'BP_ZombieSpawner_C_AreaIsEmptyFromPlayers::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_AreaIsEmptyFromPlayers, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000005, "Member 'BP_ZombieSpawner_C_AreaIsEmptyFromPlayers::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_ZombieSpawner.BP_ZombieSpawner_C.BndEvt__BP_ZombieSpawner_BoxTriggerZone_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_ZombieSpawner_C_BndEvt__BP_ZombieSpawner_BoxTriggerZone_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ZombieSpawner_C_BndEvt__BP_ZombieSpawner_BoxTriggerZone_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_ZombieSpawner_C_BndEvt__BP_ZombieSpawner_BoxTriggerZone_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_ZombieSpawner_C_BndEvt__BP_ZombieSpawner_BoxTriggerZone_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BP_ZombieSpawner_C_BndEvt__BP_ZombieSpawner_BoxTriggerZone_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_ZombieSpawner_C_BndEvt__BP_ZombieSpawner_BoxTriggerZone_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_ZombieSpawner_C_BndEvt__BP_ZombieSpawner_BoxTriggerZone_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_BndEvt__BP_ZombieSpawner_BoxTriggerZone_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_ZombieSpawner_C_BndEvt__BP_ZombieSpawner_BoxTriggerZone_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_BndEvt__BP_ZombieSpawner_BoxTriggerZone_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_ZombieSpawner_C_BndEvt__BP_ZombieSpawner_BoxTriggerZone_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_BndEvt__BP_ZombieSpawner_BoxTriggerZone_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_ZombieSpawner_C_BndEvt__BP_ZombieSpawner_BoxTriggerZone_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BP_ZombieSpawner.BP_ZombieSpawner_C.BndEvt__BP_ZombieSpawner_BoxTriggerZone_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct BP_ZombieSpawner_C_BndEvt__BP_ZombieSpawner_BoxTriggerZone_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_ZombieSpawner_C_BndEvt__BP_ZombieSpawner_BoxTriggerZone_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_ZombieSpawner_C_BndEvt__BP_ZombieSpawner_BoxTriggerZone_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_ZombieSpawner_C_BndEvt__BP_ZombieSpawner_BoxTriggerZone_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on BP_ZombieSpawner_C_BndEvt__BP_ZombieSpawner_BoxTriggerZone_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_ZombieSpawner_C_BndEvt__BP_ZombieSpawner_BoxTriggerZone_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_ZombieSpawner_C_BndEvt__BP_ZombieSpawner_BoxTriggerZone_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_BndEvt__BP_ZombieSpawner_BoxTriggerZone_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_ZombieSpawner_C_BndEvt__BP_ZombieSpawner_BoxTriggerZone_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_BndEvt__BP_ZombieSpawner_BoxTriggerZone_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_ZombieSpawner_C_BndEvt__BP_ZombieSpawner_BoxTriggerZone_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_BndEvt__BP_ZombieSpawner_BoxTriggerZone_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_ZombieSpawner_C_BndEvt__BP_ZombieSpawner_BoxTriggerZone_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_BndEvt__BP_ZombieSpawner_BoxTriggerZone_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_ZombieSpawner_C_BndEvt__BP_ZombieSpawner_BoxTriggerZone_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_BndEvt__BP_ZombieSpawner_BoxTriggerZone_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_ZombieSpawner_C_BndEvt__BP_ZombieSpawner_BoxTriggerZone_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_ZombieSpawner.BP_ZombieSpawner_C.CheckShouldSpawnAntiCamp
// 0x0010 (0x0010 - 0x0000)
struct BP_ZombieSpawner_C_CheckShouldSpawnAntiCamp final
{
public:
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0000(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ZombieSpawner_C_CheckShouldSpawnAntiCamp) == 0x000008, "Wrong alignment on BP_ZombieSpawner_C_CheckShouldSpawnAntiCamp");
static_assert(sizeof(BP_ZombieSpawner_C_CheckShouldSpawnAntiCamp) == 0x000010, "Wrong size on BP_ZombieSpawner_C_CheckShouldSpawnAntiCamp");
static_assert(offsetof(BP_ZombieSpawner_C_CheckShouldSpawnAntiCamp, CallFunc_K2_SetTimer_ReturnValue) == 0x000000, "Member 'BP_ZombieSpawner_C_CheckShouldSpawnAntiCamp::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_CheckShouldSpawnAntiCamp, CallFunc_Greater_IntInt_ReturnValue) == 0x000008, "Member 'BP_ZombieSpawner_C_CheckShouldSpawnAntiCamp::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function BP_ZombieSpawner.BP_ZombieSpawner_C.ConfigureAnimType
// 0x00D0 (0x00D0 - 0x0000)
struct BP_ZombieSpawner_C_ConfigureAnimType final
{
public:
	struct FAreaPropertiesUpdated                 Area;                                              // 0x0000(0x00C8)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	EZombieAnimType                               ReturnValue;                                       // 0x00C8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EZombieAnimType                               Temp_byte_Variable;                                // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EZombieAnimType                               Temp_byte_Variable_1;                              // 0x00CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EZombieAnimType                               CallFunc_DetermineZombieAnimType_ReturnValue;      // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBool_ReturnValue;                   // 0x00CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EZombieAnimType                               K2Node_Select_Default;                             // 0x00CF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ZombieSpawner_C_ConfigureAnimType) == 0x000008, "Wrong alignment on BP_ZombieSpawner_C_ConfigureAnimType");
static_assert(sizeof(BP_ZombieSpawner_C_ConfigureAnimType) == 0x0000D0, "Wrong size on BP_ZombieSpawner_C_ConfigureAnimType");
static_assert(offsetof(BP_ZombieSpawner_C_ConfigureAnimType, Area) == 0x000000, "Member 'BP_ZombieSpawner_C_ConfigureAnimType::Area' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_ConfigureAnimType, ReturnValue) == 0x0000C8, "Member 'BP_ZombieSpawner_C_ConfigureAnimType::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_ConfigureAnimType, Temp_bool_Variable) == 0x0000C9, "Member 'BP_ZombieSpawner_C_ConfigureAnimType::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_ConfigureAnimType, Temp_byte_Variable) == 0x0000CA, "Member 'BP_ZombieSpawner_C_ConfigureAnimType::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_ConfigureAnimType, Temp_byte_Variable_1) == 0x0000CB, "Member 'BP_ZombieSpawner_C_ConfigureAnimType::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_ConfigureAnimType, CallFunc_DetermineZombieAnimType_ReturnValue) == 0x0000CC, "Member 'BP_ZombieSpawner_C_ConfigureAnimType::CallFunc_DetermineZombieAnimType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_ConfigureAnimType, CallFunc_IsValid_ReturnValue) == 0x0000CD, "Member 'BP_ZombieSpawner_C_ConfigureAnimType::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_ConfigureAnimType, CallFunc_RandomBool_ReturnValue) == 0x0000CE, "Member 'BP_ZombieSpawner_C_ConfigureAnimType::CallFunc_RandomBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_ConfigureAnimType, K2Node_Select_Default) == 0x0000CF, "Member 'BP_ZombieSpawner_C_ConfigureAnimType::K2Node_Select_Default' has a wrong offset!");

// Function BP_ZombieSpawner.BP_ZombieSpawner_C.ConfigureRotation
// 0x0160 (0x0160 - 0x0000)
struct BP_ZombieSpawner_C_ConfigureRotation final
{
public:
	struct FAreaPropertiesUpdated                 Area;                                              // 0x0000(0x00C8)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	struct FRotator                               ReturnValue;                                       // 0x00C8(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ClampAxis_ReturnValue;                    // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ZombieSpawner_C_ConfigureRotation) == 0x000008, "Wrong alignment on BP_ZombieSpawner_C_ConfigureRotation");
static_assert(sizeof(BP_ZombieSpawner_C_ConfigureRotation) == 0x000160, "Wrong size on BP_ZombieSpawner_C_ConfigureRotation");
static_assert(offsetof(BP_ZombieSpawner_C_ConfigureRotation, Area) == 0x000000, "Member 'BP_ZombieSpawner_C_ConfigureRotation::Area' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_ConfigureRotation, ReturnValue) == 0x0000C8, "Member 'BP_ZombieSpawner_C_ConfigureRotation::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_ConfigureRotation, CallFunc_K2_GetActorRotation_ReturnValue) == 0x0000E0, "Member 'BP_ZombieSpawner_C_ConfigureRotation::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_ConfigureRotation, CallFunc_RandomFloatInRange_ReturnValue) == 0x0000F8, "Member 'BP_ZombieSpawner_C_ConfigureRotation::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_ConfigureRotation, CallFunc_ComposeRotators_ReturnValue) == 0x000100, "Member 'BP_ZombieSpawner_C_ConfigureRotation::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_ConfigureRotation, CallFunc_MakeRotator_ReturnValue) == 0x000118, "Member 'BP_ZombieSpawner_C_ConfigureRotation::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_ConfigureRotation, CallFunc_BreakRotator_Roll) == 0x000130, "Member 'BP_ZombieSpawner_C_ConfigureRotation::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_ConfigureRotation, CallFunc_BreakRotator_Pitch) == 0x000134, "Member 'BP_ZombieSpawner_C_ConfigureRotation::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_ConfigureRotation, CallFunc_BreakRotator_Yaw) == 0x000138, "Member 'BP_ZombieSpawner_C_ConfigureRotation::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_ConfigureRotation, CallFunc_ClampAxis_ReturnValue) == 0x00013C, "Member 'BP_ZombieSpawner_C_ConfigureRotation::CallFunc_ClampAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_ConfigureRotation, CallFunc_MakeRotator_ReturnValue_1) == 0x000140, "Member 'BP_ZombieSpawner_C_ConfigureRotation::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_ConfigureRotation, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x000158, "Member 'BP_ZombieSpawner_C_ConfigureRotation::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");

// Function BP_ZombieSpawner.BP_ZombieSpawner_C.ConfigureZombieAndMeshType
// 0x0108 (0x0108 - 0x0000)
struct BP_ZombieSpawner_C_ConfigureZombieAndMeshType final
{
public:
	struct FAreaPropertiesUpdated                 Area;                                              // 0x0000(0x00C8)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	EZombieType                                   ZombieType;                                        // 0x00C8(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MeshType;                                          // 0x00CC(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EZombieType                                   ResultZombieType;                                  // 0x00D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EZombieType                                   Temp_byte_Variable;                                // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2[0x2];                                       // 0x00D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GenerateSoldierMeshType_MeshType;         // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EZombieType                                   CallFunc_SpawnNightZombie_ReturnValue;             // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetChanceIsLowerThan_ReturnValue;         // 0x00ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetChanceIsLowerThan_ReturnValue_1;       // 0x00EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EF[0x1];                                       // 0x00EF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GenerateNightMeshType_MeshType;           // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GenerateDayMeshType_MeshType;             // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GenerateNightMeshType_MeshType_1;         // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GenerateDayMeshType_MeshType_1;           // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ValidNightConditions_ReturnValue;         // 0x0105(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ValidNightConditions_ReturnValue_1;       // 0x0106(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0107(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ZombieSpawner_C_ConfigureZombieAndMeshType) == 0x000008, "Wrong alignment on BP_ZombieSpawner_C_ConfigureZombieAndMeshType");
static_assert(sizeof(BP_ZombieSpawner_C_ConfigureZombieAndMeshType) == 0x000108, "Wrong size on BP_ZombieSpawner_C_ConfigureZombieAndMeshType");
static_assert(offsetof(BP_ZombieSpawner_C_ConfigureZombieAndMeshType, Area) == 0x000000, "Member 'BP_ZombieSpawner_C_ConfigureZombieAndMeshType::Area' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_ConfigureZombieAndMeshType, ZombieType) == 0x0000C8, "Member 'BP_ZombieSpawner_C_ConfigureZombieAndMeshType::ZombieType' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_ConfigureZombieAndMeshType, MeshType) == 0x0000CC, "Member 'BP_ZombieSpawner_C_ConfigureZombieAndMeshType::MeshType' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_ConfigureZombieAndMeshType, ResultZombieType) == 0x0000D0, "Member 'BP_ZombieSpawner_C_ConfigureZombieAndMeshType::ResultZombieType' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_ConfigureZombieAndMeshType, Temp_byte_Variable) == 0x0000D1, "Member 'BP_ZombieSpawner_C_ConfigureZombieAndMeshType::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_ConfigureZombieAndMeshType, Temp_int_Variable) == 0x0000D4, "Member 'BP_ZombieSpawner_C_ConfigureZombieAndMeshType::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_ConfigureZombieAndMeshType, Temp_int_Variable_1) == 0x0000D8, "Member 'BP_ZombieSpawner_C_ConfigureZombieAndMeshType::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_ConfigureZombieAndMeshType, Temp_int_Variable_2) == 0x0000DC, "Member 'BP_ZombieSpawner_C_ConfigureZombieAndMeshType::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_ConfigureZombieAndMeshType, Temp_int_Variable_3) == 0x0000E0, "Member 'BP_ZombieSpawner_C_ConfigureZombieAndMeshType::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_ConfigureZombieAndMeshType, Temp_int_Variable_4) == 0x0000E4, "Member 'BP_ZombieSpawner_C_ConfigureZombieAndMeshType::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_ConfigureZombieAndMeshType, CallFunc_GenerateSoldierMeshType_MeshType) == 0x0000E8, "Member 'BP_ZombieSpawner_C_ConfigureZombieAndMeshType::CallFunc_GenerateSoldierMeshType_MeshType' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_ConfigureZombieAndMeshType, CallFunc_SpawnNightZombie_ReturnValue) == 0x0000EC, "Member 'BP_ZombieSpawner_C_ConfigureZombieAndMeshType::CallFunc_SpawnNightZombie_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_ConfigureZombieAndMeshType, CallFunc_GetChanceIsLowerThan_ReturnValue) == 0x0000ED, "Member 'BP_ZombieSpawner_C_ConfigureZombieAndMeshType::CallFunc_GetChanceIsLowerThan_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_ConfigureZombieAndMeshType, CallFunc_GetChanceIsLowerThan_ReturnValue_1) == 0x0000EE, "Member 'BP_ZombieSpawner_C_ConfigureZombieAndMeshType::CallFunc_GetChanceIsLowerThan_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_ConfigureZombieAndMeshType, CallFunc_GenerateNightMeshType_MeshType) == 0x0000F0, "Member 'BP_ZombieSpawner_C_ConfigureZombieAndMeshType::CallFunc_GenerateNightMeshType_MeshType' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_ConfigureZombieAndMeshType, CallFunc_GenerateDayMeshType_MeshType) == 0x0000F4, "Member 'BP_ZombieSpawner_C_ConfigureZombieAndMeshType::CallFunc_GenerateDayMeshType_MeshType' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_ConfigureZombieAndMeshType, CallFunc_GenerateNightMeshType_MeshType_1) == 0x0000F8, "Member 'BP_ZombieSpawner_C_ConfigureZombieAndMeshType::CallFunc_GenerateNightMeshType_MeshType_1' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_ConfigureZombieAndMeshType, CallFunc_GenerateDayMeshType_MeshType_1) == 0x0000FC, "Member 'BP_ZombieSpawner_C_ConfigureZombieAndMeshType::CallFunc_GenerateDayMeshType_MeshType_1' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_ConfigureZombieAndMeshType, K2Node_Select_Default) == 0x000100, "Member 'BP_ZombieSpawner_C_ConfigureZombieAndMeshType::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_ConfigureZombieAndMeshType, CallFunc_BooleanOR_ReturnValue) == 0x000104, "Member 'BP_ZombieSpawner_C_ConfigureZombieAndMeshType::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_ConfigureZombieAndMeshType, CallFunc_ValidNightConditions_ReturnValue) == 0x000105, "Member 'BP_ZombieSpawner_C_ConfigureZombieAndMeshType::CallFunc_ValidNightConditions_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_ConfigureZombieAndMeshType, CallFunc_ValidNightConditions_ReturnValue_1) == 0x000106, "Member 'BP_ZombieSpawner_C_ConfigureZombieAndMeshType::CallFunc_ValidNightConditions_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_ConfigureZombieAndMeshType, K2Node_SwitchEnum_CmpSuccess) == 0x000107, "Member 'BP_ZombieSpawner_C_ConfigureZombieAndMeshType::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_ZombieSpawner.BP_ZombieSpawner_C.CREATEDELEGATE_PROXYFUNCTION_0
// 0x0108 (0x0108 - 0x0000)
struct BP_ZombieSpawner_C_CREATEDELEGATE_PROXYFUNCTION_0 final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_ZombieSpawner_C_CREATEDELEGATE_PROXYFUNCTION_0) == 0x000008, "Wrong alignment on BP_ZombieSpawner_C_CREATEDELEGATE_PROXYFUNCTION_0");
static_assert(sizeof(BP_ZombieSpawner_C_CREATEDELEGATE_PROXYFUNCTION_0) == 0x000108, "Wrong size on BP_ZombieSpawner_C_CREATEDELEGATE_PROXYFUNCTION_0");
static_assert(offsetof(BP_ZombieSpawner_C_CREATEDELEGATE_PROXYFUNCTION_0, OverlappedComponent) == 0x000000, "Member 'BP_ZombieSpawner_C_CREATEDELEGATE_PROXYFUNCTION_0::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_CREATEDELEGATE_PROXYFUNCTION_0, OtherActor) == 0x000008, "Member 'BP_ZombieSpawner_C_CREATEDELEGATE_PROXYFUNCTION_0::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_CREATEDELEGATE_PROXYFUNCTION_0, OtherComp) == 0x000010, "Member 'BP_ZombieSpawner_C_CREATEDELEGATE_PROXYFUNCTION_0::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_CREATEDELEGATE_PROXYFUNCTION_0, OtherBodyIndex) == 0x000018, "Member 'BP_ZombieSpawner_C_CREATEDELEGATE_PROXYFUNCTION_0::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_ZombieSpawner_C_CREATEDELEGATE_PROXYFUNCTION_0, bFromSweep) == 0x00001C, "Member 'BP_ZombieSpawner_C_CREATEDELEGATE_PROXYFUNCTION_0::bFromSweep' has a wrong offset!");
