#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPA_SleepingBag

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct BPA_SleepingBag.BPA_SleepingBag_C.AnimBlueprintGeneratedConstantData
// 0x012F (0x0130 - 0x0001)
struct BPA_SleepingBag::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_54;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_55;                                 // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_56;                                  // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_57;                                 // 0x0018(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_58;                                 // 0x001C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_59;                                  // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_60;                                // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_61;                               // 0x002C(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_62;                                // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_63;                                 // 0x005C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_64;                                 // 0x005D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_65;                                 // 0x005E(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F[0x1];                                       // 0x005F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_66;                                 // 0x0060(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_67;                                 // 0x0068(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_68;                                  // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_69;                               // 0x0078(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0098(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0118(0x0018)()
};
static_assert(alignof(BPA_SleepingBag::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on BPA_SleepingBag::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(BPA_SleepingBag::FAnimBlueprintGeneratedConstantData) == 0x000130, "Wrong size on BPA_SleepingBag::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(BPA_SleepingBag::FAnimBlueprintGeneratedConstantData, __NameProperty_54) == 0x000004, "Member 'BPA_SleepingBag::FAnimBlueprintGeneratedConstantData::__NameProperty_54' has a wrong offset!");
static_assert(offsetof(BPA_SleepingBag::FAnimBlueprintGeneratedConstantData, __NameProperty_55) == 0x00000C, "Member 'BPA_SleepingBag::FAnimBlueprintGeneratedConstantData::__NameProperty_55' has a wrong offset!");
static_assert(offsetof(BPA_SleepingBag::FAnimBlueprintGeneratedConstantData, __IntProperty_56) == 0x000014, "Member 'BPA_SleepingBag::FAnimBlueprintGeneratedConstantData::__IntProperty_56' has a wrong offset!");
static_assert(offsetof(BPA_SleepingBag::FAnimBlueprintGeneratedConstantData, __BoolProperty_57) == 0x000018, "Member 'BPA_SleepingBag::FAnimBlueprintGeneratedConstantData::__BoolProperty_57' has a wrong offset!");
static_assert(offsetof(BPA_SleepingBag::FAnimBlueprintGeneratedConstantData, __NameProperty_58) == 0x00001C, "Member 'BPA_SleepingBag::FAnimBlueprintGeneratedConstantData::__NameProperty_58' has a wrong offset!");
static_assert(offsetof(BPA_SleepingBag::FAnimBlueprintGeneratedConstantData, __IntProperty_59) == 0x000024, "Member 'BPA_SleepingBag::FAnimBlueprintGeneratedConstantData::__IntProperty_59' has a wrong offset!");
static_assert(offsetof(BPA_SleepingBag::FAnimBlueprintGeneratedConstantData, __FloatProperty_60) == 0x000028, "Member 'BPA_SleepingBag::FAnimBlueprintGeneratedConstantData::__FloatProperty_60' has a wrong offset!");
static_assert(offsetof(BPA_SleepingBag::FAnimBlueprintGeneratedConstantData, __StructProperty_61) == 0x00002C, "Member 'BPA_SleepingBag::FAnimBlueprintGeneratedConstantData::__StructProperty_61' has a wrong offset!");
static_assert(offsetof(BPA_SleepingBag::FAnimBlueprintGeneratedConstantData, __FloatProperty_62) == 0x000058, "Member 'BPA_SleepingBag::FAnimBlueprintGeneratedConstantData::__FloatProperty_62' has a wrong offset!");
static_assert(offsetof(BPA_SleepingBag::FAnimBlueprintGeneratedConstantData, __BoolProperty_63) == 0x00005C, "Member 'BPA_SleepingBag::FAnimBlueprintGeneratedConstantData::__BoolProperty_63' has a wrong offset!");
static_assert(offsetof(BPA_SleepingBag::FAnimBlueprintGeneratedConstantData, __EnumProperty_64) == 0x00005D, "Member 'BPA_SleepingBag::FAnimBlueprintGeneratedConstantData::__EnumProperty_64' has a wrong offset!");
static_assert(offsetof(BPA_SleepingBag::FAnimBlueprintGeneratedConstantData, __ByteProperty_65) == 0x00005E, "Member 'BPA_SleepingBag::FAnimBlueprintGeneratedConstantData::__ByteProperty_65' has a wrong offset!");
static_assert(offsetof(BPA_SleepingBag::FAnimBlueprintGeneratedConstantData, __NameProperty_66) == 0x000060, "Member 'BPA_SleepingBag::FAnimBlueprintGeneratedConstantData::__NameProperty_66' has a wrong offset!");
static_assert(offsetof(BPA_SleepingBag::FAnimBlueprintGeneratedConstantData, __NameProperty_67) == 0x000068, "Member 'BPA_SleepingBag::FAnimBlueprintGeneratedConstantData::__NameProperty_67' has a wrong offset!");
static_assert(offsetof(BPA_SleepingBag::FAnimBlueprintGeneratedConstantData, __IntProperty_68) == 0x000070, "Member 'BPA_SleepingBag::FAnimBlueprintGeneratedConstantData::__IntProperty_68' has a wrong offset!");
static_assert(offsetof(BPA_SleepingBag::FAnimBlueprintGeneratedConstantData, __StructProperty_69) == 0x000078, "Member 'BPA_SleepingBag::FAnimBlueprintGeneratedConstantData::__StructProperty_69' has a wrong offset!");
static_assert(offsetof(BPA_SleepingBag::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000098, "Member 'BPA_SleepingBag::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(BPA_SleepingBag::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000118, "Member 'BPA_SleepingBag::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

