#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_PlayerStatsComponent

#include "Basic.hpp"

#include "E_TrainStatType_structs.hpp"
#include "Engine_structs.hpp"
#include "E_HouseType_structs.hpp"
#include "StatType_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "PerkStatEnum_structs.hpp"
#include "Survival_structs.hpp"
#include "EffectMainContructor_structs.hpp"
#include "S_StatInfo_structs.hpp"


namespace SDK::Params
{

// Function BPC_PlayerStatsComponent.BPC_PlayerStatsComponent_C.AdrenalinHealthChange
// 0x0020 (0x0020 - 0x0000)
struct BPC_PlayerStatsComponent_C_AdrenalinHealthChange final
{
public:
	double                                        CallFunc_GetStat_Value;                            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetStat_ReturnValue;                      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PlayerStatsComponent_C_AdrenalinHealthChange) == 0x000008, "Wrong alignment on BPC_PlayerStatsComponent_C_AdrenalinHealthChange");
static_assert(sizeof(BPC_PlayerStatsComponent_C_AdrenalinHealthChange) == 0x000020, "Wrong size on BPC_PlayerStatsComponent_C_AdrenalinHealthChange");
static_assert(offsetof(BPC_PlayerStatsComponent_C_AdrenalinHealthChange, CallFunc_GetStat_Value) == 0x000000, "Member 'BPC_PlayerStatsComponent_C_AdrenalinHealthChange::CallFunc_GetStat_Value' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_AdrenalinHealthChange, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000008, "Member 'BPC_PlayerStatsComponent_C_AdrenalinHealthChange::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_AdrenalinHealthChange, CallFunc_FClamp_ReturnValue) == 0x000010, "Member 'BPC_PlayerStatsComponent_C_AdrenalinHealthChange::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_AdrenalinHealthChange, CallFunc_SetStat_ReturnValue) == 0x000018, "Member 'BPC_PlayerStatsComponent_C_AdrenalinHealthChange::CallFunc_SetStat_ReturnValue' has a wrong offset!");

// Function BPC_PlayerStatsComponent.BPC_PlayerStatsComponent_C.Calculate Health
// 0x01B0 (0x01B0 - 0x0000)
struct BPC_PlayerStatsComponent_C_Calculate_Health final
{
public:
	double                                        CallFunc_GetStat_Value;                            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SetStat_ReturnValue;                      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetStat_ReturnValue_1;                    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetStat_Value_1;                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetStat_Value_2;                          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetStat_Value_3;                          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_2;                              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetStat_Value_4;                          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_1;     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default;                             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4;                              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetStat_Value_5;                          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetStat_Value_6;                          // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_2;     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_3;     // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CB[0x5];                                       // 0x00CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_5;                              // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default_1;                           // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetStat_Value_7;                          // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_4;     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_6;                              // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetStat_Value_8;                          // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_5;     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default_2;                           // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_5;      // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default_3;                           // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default_4;                           // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetStat_Value_9;                          // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_6;      // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_6;     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_2;           // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default_5;                           // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue;                         // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_7;     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default_6;                           // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_8;     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PlayerStatsComponent_C_Calculate_Health) == 0x000008, "Wrong alignment on BPC_PlayerStatsComponent_C_Calculate_Health");
static_assert(sizeof(BPC_PlayerStatsComponent_C_Calculate_Health) == 0x0001B0, "Wrong size on BPC_PlayerStatsComponent_C_Calculate_Health");
static_assert(offsetof(BPC_PlayerStatsComponent_C_Calculate_Health, CallFunc_GetStat_Value) == 0x000000, "Member 'BPC_PlayerStatsComponent_C_Calculate_Health::CallFunc_GetStat_Value' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_Calculate_Health, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000008, "Member 'BPC_PlayerStatsComponent_C_Calculate_Health::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_Calculate_Health, CallFunc_SetStat_ReturnValue) == 0x000010, "Member 'BPC_PlayerStatsComponent_C_Calculate_Health::CallFunc_SetStat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_Calculate_Health, CallFunc_SetStat_ReturnValue_1) == 0x000018, "Member 'BPC_PlayerStatsComponent_C_Calculate_Health::CallFunc_SetStat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_Calculate_Health, Temp_real_Variable) == 0x000020, "Member 'BPC_PlayerStatsComponent_C_Calculate_Health::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_Calculate_Health, Temp_bool_Variable) == 0x000028, "Member 'BPC_PlayerStatsComponent_C_Calculate_Health::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_Calculate_Health, CallFunc_GetStat_Value_1) == 0x000030, "Member 'BPC_PlayerStatsComponent_C_Calculate_Health::CallFunc_GetStat_Value_1' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_Calculate_Health, CallFunc_GetStat_Value_2) == 0x000038, "Member 'BPC_PlayerStatsComponent_C_Calculate_Health::CallFunc_GetStat_Value_2' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_Calculate_Health, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000040, "Member 'BPC_PlayerStatsComponent_C_Calculate_Health::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_Calculate_Health, Temp_real_Variable_1) == 0x000048, "Member 'BPC_PlayerStatsComponent_C_Calculate_Health::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_Calculate_Health, Temp_bool_Variable_1) == 0x000050, "Member 'BPC_PlayerStatsComponent_C_Calculate_Health::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_Calculate_Health, CallFunc_GetStat_Value_3) == 0x000058, "Member 'BPC_PlayerStatsComponent_C_Calculate_Health::CallFunc_GetStat_Value_3' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_Calculate_Health, Temp_bool_Variable_2) == 0x000060, "Member 'BPC_PlayerStatsComponent_C_Calculate_Health::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_Calculate_Health, Temp_real_Variable_2) == 0x000068, "Member 'BPC_PlayerStatsComponent_C_Calculate_Health::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_Calculate_Health, CallFunc_GetStat_Value_4) == 0x000070, "Member 'BPC_PlayerStatsComponent_C_Calculate_Health::CallFunc_GetStat_Value_4' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_Calculate_Health, CallFunc_LessEqual_DoubleDouble_ReturnValue_1) == 0x000078, "Member 'BPC_PlayerStatsComponent_C_Calculate_Health::CallFunc_LessEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_Calculate_Health, Temp_bool_Variable_3) == 0x000079, "Member 'BPC_PlayerStatsComponent_C_Calculate_Health::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_Calculate_Health, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000080, "Member 'BPC_PlayerStatsComponent_C_Calculate_Health::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_Calculate_Health, K2Node_Select_Default) == 0x000088, "Member 'BPC_PlayerStatsComponent_C_Calculate_Health::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_Calculate_Health, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000090, "Member 'BPC_PlayerStatsComponent_C_Calculate_Health::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_Calculate_Health, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000098, "Member 'BPC_PlayerStatsComponent_C_Calculate_Health::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_Calculate_Health, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x0000A0, "Member 'BPC_PlayerStatsComponent_C_Calculate_Health::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_Calculate_Health, Temp_real_Variable_3) == 0x0000A8, "Member 'BPC_PlayerStatsComponent_C_Calculate_Health::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_Calculate_Health, Temp_real_Variable_4) == 0x0000B0, "Member 'BPC_PlayerStatsComponent_C_Calculate_Health::Temp_real_Variable_4' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_Calculate_Health, CallFunc_GetStat_Value_5) == 0x0000B8, "Member 'BPC_PlayerStatsComponent_C_Calculate_Health::CallFunc_GetStat_Value_5' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_Calculate_Health, CallFunc_GetStat_Value_6) == 0x0000C0, "Member 'BPC_PlayerStatsComponent_C_Calculate_Health::CallFunc_GetStat_Value_6' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_Calculate_Health, CallFunc_LessEqual_DoubleDouble_ReturnValue_2) == 0x0000C8, "Member 'BPC_PlayerStatsComponent_C_Calculate_Health::CallFunc_LessEqual_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_Calculate_Health, CallFunc_LessEqual_DoubleDouble_ReturnValue_3) == 0x0000C9, "Member 'BPC_PlayerStatsComponent_C_Calculate_Health::CallFunc_LessEqual_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_Calculate_Health, Temp_bool_Variable_4) == 0x0000CA, "Member 'BPC_PlayerStatsComponent_C_Calculate_Health::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_Calculate_Health, Temp_real_Variable_5) == 0x0000D0, "Member 'BPC_PlayerStatsComponent_C_Calculate_Health::Temp_real_Variable_5' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_Calculate_Health, K2Node_Select_Default_1) == 0x0000D8, "Member 'BPC_PlayerStatsComponent_C_Calculate_Health::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_Calculate_Health, CallFunc_GetStat_Value_7) == 0x0000E0, "Member 'BPC_PlayerStatsComponent_C_Calculate_Health::CallFunc_GetStat_Value_7' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_Calculate_Health, CallFunc_Multiply_DoubleDouble_ReturnValue_4) == 0x0000E8, "Member 'BPC_PlayerStatsComponent_C_Calculate_Health::CallFunc_Multiply_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_Calculate_Health, CallFunc_LessEqual_DoubleDouble_ReturnValue_4) == 0x0000F0, "Member 'BPC_PlayerStatsComponent_C_Calculate_Health::CallFunc_LessEqual_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_Calculate_Health, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0000F8, "Member 'BPC_PlayerStatsComponent_C_Calculate_Health::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_Calculate_Health, Temp_real_Variable_6) == 0x000100, "Member 'BPC_PlayerStatsComponent_C_Calculate_Health::Temp_real_Variable_6' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_Calculate_Health, Temp_bool_Variable_5) == 0x000108, "Member 'BPC_PlayerStatsComponent_C_Calculate_Health::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_Calculate_Health, CallFunc_GetStat_Value_8) == 0x000110, "Member 'BPC_PlayerStatsComponent_C_Calculate_Health::CallFunc_GetStat_Value_8' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_Calculate_Health, CallFunc_LessEqual_DoubleDouble_ReturnValue_5) == 0x000118, "Member 'BPC_PlayerStatsComponent_C_Calculate_Health::CallFunc_LessEqual_DoubleDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_Calculate_Health, K2Node_Select_Default_2) == 0x000120, "Member 'BPC_PlayerStatsComponent_C_Calculate_Health::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_Calculate_Health, CallFunc_BooleanOR_ReturnValue) == 0x000128, "Member 'BPC_PlayerStatsComponent_C_Calculate_Health::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_Calculate_Health, CallFunc_Multiply_DoubleDouble_ReturnValue_5) == 0x000130, "Member 'BPC_PlayerStatsComponent_C_Calculate_Health::CallFunc_Multiply_DoubleDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_Calculate_Health, CallFunc_BooleanOR_ReturnValue_1) == 0x000138, "Member 'BPC_PlayerStatsComponent_C_Calculate_Health::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_Calculate_Health, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000140, "Member 'BPC_PlayerStatsComponent_C_Calculate_Health::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_Calculate_Health, K2Node_Select_Default_3) == 0x000148, "Member 'BPC_PlayerStatsComponent_C_Calculate_Health::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_Calculate_Health, K2Node_Select_Default_4) == 0x000150, "Member 'BPC_PlayerStatsComponent_C_Calculate_Health::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_Calculate_Health, CallFunc_GetStat_Value_9) == 0x000158, "Member 'BPC_PlayerStatsComponent_C_Calculate_Health::CallFunc_GetStat_Value_9' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_Calculate_Health, CallFunc_Multiply_DoubleDouble_ReturnValue_6) == 0x000160, "Member 'BPC_PlayerStatsComponent_C_Calculate_Health::CallFunc_Multiply_DoubleDouble_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_Calculate_Health, CallFunc_LessEqual_DoubleDouble_ReturnValue_6) == 0x000168, "Member 'BPC_PlayerStatsComponent_C_Calculate_Health::CallFunc_LessEqual_DoubleDouble_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_Calculate_Health, CallFunc_Add_DoubleDouble_ReturnValue_2) == 0x000170, "Member 'BPC_PlayerStatsComponent_C_Calculate_Health::CallFunc_Add_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_Calculate_Health, Temp_bool_Variable_6) == 0x000178, "Member 'BPC_PlayerStatsComponent_C_Calculate_Health::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_Calculate_Health, K2Node_Select_Default_5) == 0x000180, "Member 'BPC_PlayerStatsComponent_C_Calculate_Health::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_Calculate_Health, CallFunc_FMin_ReturnValue) == 0x000188, "Member 'BPC_PlayerStatsComponent_C_Calculate_Health::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_Calculate_Health, CallFunc_FMax_ReturnValue) == 0x000190, "Member 'BPC_PlayerStatsComponent_C_Calculate_Health::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_Calculate_Health, CallFunc_LessEqual_DoubleDouble_ReturnValue_7) == 0x000198, "Member 'BPC_PlayerStatsComponent_C_Calculate_Health::CallFunc_LessEqual_DoubleDouble_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_Calculate_Health, K2Node_Select_Default_6) == 0x0001A0, "Member 'BPC_PlayerStatsComponent_C_Calculate_Health::K2Node_Select_Default_6' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_Calculate_Health, CallFunc_LessEqual_DoubleDouble_ReturnValue_8) == 0x0001A8, "Member 'BPC_PlayerStatsComponent_C_Calculate_Health::CallFunc_LessEqual_DoubleDouble_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_Calculate_Health, CallFunc_BooleanAND_ReturnValue) == 0x0001A9, "Member 'BPC_PlayerStatsComponent_C_Calculate_Health::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BPC_PlayerStatsComponent.BPC_PlayerStatsComponent_C.Calculate Stamina Decrease
// 0x0008 (0x0008 - 0x0000)
struct BPC_PlayerStatsComponent_C_Calculate_Stamina_Decrease final
{
public:
	double                                        Param_ConsumptionStaminaWeight;                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PlayerStatsComponent_C_Calculate_Stamina_Decrease) == 0x000008, "Wrong alignment on BPC_PlayerStatsComponent_C_Calculate_Stamina_Decrease");
static_assert(sizeof(BPC_PlayerStatsComponent_C_Calculate_Stamina_Decrease) == 0x000008, "Wrong size on BPC_PlayerStatsComponent_C_Calculate_Stamina_Decrease");
static_assert(offsetof(BPC_PlayerStatsComponent_C_Calculate_Stamina_Decrease, Param_ConsumptionStaminaWeight) == 0x000000, "Member 'BPC_PlayerStatsComponent_C_Calculate_Stamina_Decrease::Param_ConsumptionStaminaWeight' has a wrong offset!");

// Function BPC_PlayerStatsComponent.BPC_PlayerStatsComponent_C.CalculateCold
// 0x0008 (0x0008 - 0x0000)
struct BPC_PlayerStatsComponent_C_CalculateCold final
{
public:
	double                                        ColdSpeed;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PlayerStatsComponent_C_CalculateCold) == 0x000008, "Wrong alignment on BPC_PlayerStatsComponent_C_CalculateCold");
static_assert(sizeof(BPC_PlayerStatsComponent_C_CalculateCold) == 0x000008, "Wrong size on BPC_PlayerStatsComponent_C_CalculateCold");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateCold, ColdSpeed) == 0x000000, "Member 'BPC_PlayerStatsComponent_C_CalculateCold::ColdSpeed' has a wrong offset!");

// Function BPC_PlayerStatsComponent.BPC_PlayerStatsComponent_C.CalculateFakeHealth
// 0x0080 (0x0080 - 0x0000)
struct BPC_PlayerStatsComponent_C_CalculateFakeHealth final
{
public:
	double                                        Temp_real_Variable;                                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetStat_Value;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetStat_Value_1;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetStat_Value_2;                          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue;                         // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetStat_ReturnValue;                      // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PlayerStatsComponent_C_CalculateFakeHealth) == 0x000008, "Wrong alignment on BPC_PlayerStatsComponent_C_CalculateFakeHealth");
static_assert(sizeof(BPC_PlayerStatsComponent_C_CalculateFakeHealth) == 0x000080, "Wrong size on BPC_PlayerStatsComponent_C_CalculateFakeHealth");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateFakeHealth, Temp_real_Variable) == 0x000000, "Member 'BPC_PlayerStatsComponent_C_CalculateFakeHealth::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateFakeHealth, Temp_bool_Variable) == 0x000008, "Member 'BPC_PlayerStatsComponent_C_CalculateFakeHealth::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateFakeHealth, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000010, "Member 'BPC_PlayerStatsComponent_C_CalculateFakeHealth::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateFakeHealth, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000018, "Member 'BPC_PlayerStatsComponent_C_CalculateFakeHealth::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateFakeHealth, CallFunc_GetStat_Value) == 0x000020, "Member 'BPC_PlayerStatsComponent_C_CalculateFakeHealth::CallFunc_GetStat_Value' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateFakeHealth, CallFunc_GetStat_Value_1) == 0x000028, "Member 'BPC_PlayerStatsComponent_C_CalculateFakeHealth::CallFunc_GetStat_Value_1' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateFakeHealth, K2Node_Select_Default) == 0x000030, "Member 'BPC_PlayerStatsComponent_C_CalculateFakeHealth::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateFakeHealth, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000038, "Member 'BPC_PlayerStatsComponent_C_CalculateFakeHealth::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateFakeHealth, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000040, "Member 'BPC_PlayerStatsComponent_C_CalculateFakeHealth::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateFakeHealth, CallFunc_GetStat_Value_2) == 0x000048, "Member 'BPC_PlayerStatsComponent_C_CalculateFakeHealth::CallFunc_GetStat_Value_2' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateFakeHealth, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000050, "Member 'BPC_PlayerStatsComponent_C_CalculateFakeHealth::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateFakeHealth, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000058, "Member 'BPC_PlayerStatsComponent_C_CalculateFakeHealth::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateFakeHealth, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000060, "Member 'BPC_PlayerStatsComponent_C_CalculateFakeHealth::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateFakeHealth, CallFunc_FMax_ReturnValue) == 0x000068, "Member 'BPC_PlayerStatsComponent_C_CalculateFakeHealth::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateFakeHealth, CallFunc_FMin_ReturnValue) == 0x000070, "Member 'BPC_PlayerStatsComponent_C_CalculateFakeHealth::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateFakeHealth, CallFunc_SetStat_ReturnValue) == 0x000078, "Member 'BPC_PlayerStatsComponent_C_CalculateFakeHealth::CallFunc_SetStat_ReturnValue' has a wrong offset!");

// Function BPC_PlayerStatsComponent.BPC_PlayerStatsComponent_C.CalculateHealthMax
// 0x0020 (0x0020 - 0x0000)
struct BPC_PlayerStatsComponent_C_CalculateHealthMax final
{
public:
	bool                                          HungerZero;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default;                             // 0x0010(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetStat_ReturnValue;                      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PlayerStatsComponent_C_CalculateHealthMax) == 0x000008, "Wrong alignment on BPC_PlayerStatsComponent_C_CalculateHealthMax");
static_assert(sizeof(BPC_PlayerStatsComponent_C_CalculateHealthMax) == 0x000020, "Wrong size on BPC_PlayerStatsComponent_C_CalculateHealthMax");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateHealthMax, HungerZero) == 0x000000, "Member 'BPC_PlayerStatsComponent_C_CalculateHealthMax::HungerZero' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateHealthMax, Temp_bool_Variable) == 0x000001, "Member 'BPC_PlayerStatsComponent_C_CalculateHealthMax::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateHealthMax, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000008, "Member 'BPC_PlayerStatsComponent_C_CalculateHealthMax::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateHealthMax, K2Node_Select_Default) == 0x000010, "Member 'BPC_PlayerStatsComponent_C_CalculateHealthMax::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateHealthMax, CallFunc_SetStat_ReturnValue) == 0x000018, "Member 'BPC_PlayerStatsComponent_C_CalculateHealthMax::CallFunc_SetStat_ReturnValue' has a wrong offset!");

// Function BPC_PlayerStatsComponent.BPC_PlayerStatsComponent_C.CalculateHunger
// 0x0070 (0x0070 - 0x0000)
struct BPC_PlayerStatsComponent_C_CalculateHunger final
{
public:
	double                                        CallFunc_GetStat_Value;                            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetStat_Value_1;                          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetStat_Value_2;                          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FCeil_ReturnValue;                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_1;     // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetStat_Value_3;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetStat_Value_4;                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_2;     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetStat_Value_5;                          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetStat_ReturnValue;                      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PlayerStatsComponent_C_CalculateHunger) == 0x000008, "Wrong alignment on BPC_PlayerStatsComponent_C_CalculateHunger");
static_assert(sizeof(BPC_PlayerStatsComponent_C_CalculateHunger) == 0x000070, "Wrong size on BPC_PlayerStatsComponent_C_CalculateHunger");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateHunger, CallFunc_GetStat_Value) == 0x000000, "Member 'BPC_PlayerStatsComponent_C_CalculateHunger::CallFunc_GetStat_Value' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateHunger, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000008, "Member 'BPC_PlayerStatsComponent_C_CalculateHunger::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateHunger, CallFunc_GetStat_Value_1) == 0x000010, "Member 'BPC_PlayerStatsComponent_C_CalculateHunger::CallFunc_GetStat_Value_1' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateHunger, CallFunc_GetStat_Value_2) == 0x000018, "Member 'BPC_PlayerStatsComponent_C_CalculateHunger::CallFunc_GetStat_Value_2' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateHunger, CallFunc_FCeil_ReturnValue) == 0x000020, "Member 'BPC_PlayerStatsComponent_C_CalculateHunger::CallFunc_FCeil_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateHunger, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000024, "Member 'BPC_PlayerStatsComponent_C_CalculateHunger::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateHunger, CallFunc_LessEqual_DoubleDouble_ReturnValue_1) == 0x000025, "Member 'BPC_PlayerStatsComponent_C_CalculateHunger::CallFunc_LessEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateHunger, CallFunc_GetStat_Value_3) == 0x000028, "Member 'BPC_PlayerStatsComponent_C_CalculateHunger::CallFunc_GetStat_Value_3' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateHunger, CallFunc_GetStat_Value_4) == 0x000030, "Member 'BPC_PlayerStatsComponent_C_CalculateHunger::CallFunc_GetStat_Value_4' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateHunger, CallFunc_LessEqual_DoubleDouble_ReturnValue_2) == 0x000038, "Member 'BPC_PlayerStatsComponent_C_CalculateHunger::CallFunc_LessEqual_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateHunger, CallFunc_GetStat_Value_5) == 0x000040, "Member 'BPC_PlayerStatsComponent_C_CalculateHunger::CallFunc_GetStat_Value_5' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateHunger, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000048, "Member 'BPC_PlayerStatsComponent_C_CalculateHunger::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateHunger, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000050, "Member 'BPC_PlayerStatsComponent_C_CalculateHunger::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateHunger, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000058, "Member 'BPC_PlayerStatsComponent_C_CalculateHunger::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateHunger, CallFunc_FClamp_ReturnValue) == 0x000060, "Member 'BPC_PlayerStatsComponent_C_CalculateHunger::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateHunger, CallFunc_SetStat_ReturnValue) == 0x000068, "Member 'BPC_PlayerStatsComponent_C_CalculateHunger::CallFunc_SetStat_ReturnValue' has a wrong offset!");

// Function BPC_PlayerStatsComponent.BPC_PlayerStatsComponent_C.CalculateMaxStamina
// 0x0098 (0x0098 - 0x0000)
struct BPC_PlayerStatsComponent_C_CalculateMaxStamina final
{
public:
	double                                        Effect;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EStatType                                     Key;                                               // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_2;          // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1;  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_2;  // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetStat_Value;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetStat_Value_1;                          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetStat_Value_2;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetStat_Value_3;                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue;                         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetStat_ReturnValue;                      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue_1;                       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetStat_ReturnValue_1;                    // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue_2;                       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetStat_ReturnValue_2;                    // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue_3;                       // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetStat_ReturnValue_3;                    // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PlayerStatsComponent_C_CalculateMaxStamina) == 0x000008, "Wrong alignment on BPC_PlayerStatsComponent_C_CalculateMaxStamina");
static_assert(sizeof(BPC_PlayerStatsComponent_C_CalculateMaxStamina) == 0x000098, "Wrong size on BPC_PlayerStatsComponent_C_CalculateMaxStamina");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateMaxStamina, Effect) == 0x000000, "Member 'BPC_PlayerStatsComponent_C_CalculateMaxStamina::Effect' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateMaxStamina, Key) == 0x000008, "Member 'BPC_PlayerStatsComponent_C_CalculateMaxStamina::Key' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateMaxStamina, K2Node_SwitchEnum_CmpSuccess) == 0x000009, "Member 'BPC_PlayerStatsComponent_C_CalculateMaxStamina::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateMaxStamina, CallFunc_Less_DoubleDouble_ReturnValue) == 0x00000A, "Member 'BPC_PlayerStatsComponent_C_CalculateMaxStamina::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateMaxStamina, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x00000B, "Member 'BPC_PlayerStatsComponent_C_CalculateMaxStamina::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateMaxStamina, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x00000C, "Member 'BPC_PlayerStatsComponent_C_CalculateMaxStamina::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateMaxStamina, CallFunc_BooleanAND_ReturnValue) == 0x00000D, "Member 'BPC_PlayerStatsComponent_C_CalculateMaxStamina::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateMaxStamina, CallFunc_Less_DoubleDouble_ReturnValue_2) == 0x00000E, "Member 'BPC_PlayerStatsComponent_C_CalculateMaxStamina::CallFunc_Less_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateMaxStamina, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x00000F, "Member 'BPC_PlayerStatsComponent_C_CalculateMaxStamina::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateMaxStamina, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1) == 0x000010, "Member 'BPC_PlayerStatsComponent_C_CalculateMaxStamina::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateMaxStamina, CallFunc_BooleanAND_ReturnValue_1) == 0x000011, "Member 'BPC_PlayerStatsComponent_C_CalculateMaxStamina::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateMaxStamina, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_2) == 0x000012, "Member 'BPC_PlayerStatsComponent_C_CalculateMaxStamina::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateMaxStamina, CallFunc_BooleanAND_ReturnValue_2) == 0x000013, "Member 'BPC_PlayerStatsComponent_C_CalculateMaxStamina::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateMaxStamina, CallFunc_GetStat_Value) == 0x000018, "Member 'BPC_PlayerStatsComponent_C_CalculateMaxStamina::CallFunc_GetStat_Value' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateMaxStamina, CallFunc_GetStat_Value_1) == 0x000020, "Member 'BPC_PlayerStatsComponent_C_CalculateMaxStamina::CallFunc_GetStat_Value_1' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateMaxStamina, CallFunc_GetStat_Value_2) == 0x000028, "Member 'BPC_PlayerStatsComponent_C_CalculateMaxStamina::CallFunc_GetStat_Value_2' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateMaxStamina, CallFunc_GetStat_Value_3) == 0x000030, "Member 'BPC_PlayerStatsComponent_C_CalculateMaxStamina::CallFunc_GetStat_Value_3' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateMaxStamina, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000038, "Member 'BPC_PlayerStatsComponent_C_CalculateMaxStamina::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateMaxStamina, CallFunc_FMin_ReturnValue) == 0x000040, "Member 'BPC_PlayerStatsComponent_C_CalculateMaxStamina::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateMaxStamina, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000048, "Member 'BPC_PlayerStatsComponent_C_CalculateMaxStamina::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateMaxStamina, CallFunc_SetStat_ReturnValue) == 0x000050, "Member 'BPC_PlayerStatsComponent_C_CalculateMaxStamina::CallFunc_SetStat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateMaxStamina, CallFunc_FMin_ReturnValue_1) == 0x000058, "Member 'BPC_PlayerStatsComponent_C_CalculateMaxStamina::CallFunc_FMin_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_PlayerStatsComponent_C_CalculateMaxStamina, CallFunc_SetStat_ReturnValue_1) == 0x000060, "Member 'BPC_PlayerStatsComponent_C_CalculateMaxStamina::CallFunc_SetStat_ReturnValue_1' has a wrong offset!");
