#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_BarPlayerComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_BarPlayerComponent.BPC_BarPlayerComponent_C
// 0x0020 (0x00C0 - 0x00A0)
class UBPC_BarPlayerComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ASurvivalPlayer_C*                      Owner;                                             // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Sit;                                               // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABarParent_C*                           Sofa;                                              // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void CollisionSwitcher(bool On_);
	void CutsceneEnding();
	void ExecuteUbergraph_BPC_BarPlayerComponent(int32 EntryPoint);
	void MultiSofa(bool On_, class ABarParent_C* Param_Sofa, int32 Param_Index);
	void OnBlendOut_2151BB334E81EB7F3A46A98C59275EBA(class FName NotifyName);
	void OnCompleted_2151BB334E81EB7F3A46A98C59275EBA(class FName NotifyName);
	void OnCutsceneExit();
	void OnCutsceneStart();
	void OnInterrupted_2151BB334E81EB7F3A46A98C59275EBA(class FName NotifyName);
	void OnNotifyBegin_2151BB334E81EB7F3A46A98C59275EBA(class FName NotifyName);
	void OnNotifyEnd_2151BB334E81EB7F3A46A98C59275EBA(class FName NotifyName);
	void ReceiveBeginPlay();
	void ReplicateSwitcher(bool Off_);
	void ServerChair(bool Sit_, class AChairParent_C* Chair);
	void ServerSofa(bool On_, class ABarParent_C* Param_Sofa);
	void SitEventLogic(bool Param_Sit);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPC_BarPlayerComponent_C">();
	}
	static class UBPC_BarPlayerComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_BarPlayerComponent_C>();
	}
};
static_assert(alignof(UBPC_BarPlayerComponent_C) == 0x000008, "Wrong alignment on UBPC_BarPlayerComponent_C");
static_assert(sizeof(UBPC_BarPlayerComponent_C) == 0x0000C0, "Wrong size on UBPC_BarPlayerComponent_C");
static_assert(offsetof(UBPC_BarPlayerComponent_C, UberGraphFrame) == 0x0000A0, "Member 'UBPC_BarPlayerComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPC_BarPlayerComponent_C, Owner) == 0x0000A8, "Member 'UBPC_BarPlayerComponent_C::Owner' has a wrong offset!");
static_assert(offsetof(UBPC_BarPlayerComponent_C, Sit) == 0x0000B0, "Member 'UBPC_BarPlayerComponent_C::Sit' has a wrong offset!");
static_assert(offsetof(UBPC_BarPlayerComponent_C, Sofa) == 0x0000B8, "Member 'UBPC_BarPlayerComponent_C::Sofa' has a wrong offset!");

}

