#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_Binoculars

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function BPC_Binoculars.BPC_Binoculars_C.ExecuteUbergraph_BPC_Binoculars
// 0x03D0 (0x03D0 - 0x0000)
struct BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_9;                   // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_8;                   // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_7;                   // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_6;                   // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x005C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_5;                   // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x0074(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0084(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x0090(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x00B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_6;            // 0x00C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_7;            // 0x00E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_8;            // 0x00F8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded_2;                       // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage_1;               // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_1;                            // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage_2;               // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_2;                            // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage_3;               // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UATPCCameraFOVObject*                   CallFunc_GetCameraFOVObject_ReturnValue;           // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UATPCCameraComponent*                   CallFunc_GetOwningCamera_ReturnValue;              // 0x0180(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UATPCCameraModeDataAsset*               CallFunc_GetCurrentCameraMode_ReturnValue;         // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_9;            // 0x0190(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A2[0x6];                                      // 0x01A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key;                       // 0x01B8(0x0018)(HasGetValueTypeHash)
	class UATPCCameraFOVObject*                   CallFunc_GetCameraFOVObject_ReturnValue_1;         // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_1;                     // 0x01D8(0x0018)(HasGetValueTypeHash)
	class UATPCCameraComponent*                   CallFunc_GetOwningCamera_ReturnValue_1;            // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_10;                  // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UATPCCameraModeDataAsset*               CallFunc_GetCurrentCameraMode_ReturnValue_1;       // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_212[0x2];                                      // 0x0212(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_10;           // 0x0214(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_225[0x3];                                      // 0x0225(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_11;                  // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1; // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x3];                                      // 0x0241(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_11;           // 0x0244(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0254(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0255(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_256[0x2];                                      // 0x0256(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_12;           // 0x0258(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UATPCCameraFOVObject*                   CallFunc_GetCameraFOVObject_ReturnValue_2;         // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UATPCCameraComponent*                   CallFunc_GetOwningCamera_ReturnValue_2;            // 0x0270(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UATPCCameraModeDataAsset*               CallFunc_GetCurrentCameraMode_ReturnValue_2;       // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0292(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_293[0x1];                                      // 0x0293(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_12;                  // 0x0294(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_2; // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x02A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AA[0x6];                                      // 0x02AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UATPCCameraFOVObject*                   CallFunc_GetCameraFOVObject_ReturnValue_3;         // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UATPCCameraComponent*                   CallFunc_GetOwningCamera_ReturnValue_3;            // 0x02B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UATPCCameraModeDataAsset*               CallFunc_GetCurrentCameraMode_ReturnValue_3;       // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_13;           // 0x02C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x02D8(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_14;           // 0x02E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x02F0(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_15;           // 0x02F8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_2;        // 0x0308(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_311[0x3];                                      // 0x0311(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_16;           // 0x0314(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_13;                  // 0x0324(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_17;           // 0x032C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_14;                  // 0x033C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_18;           // 0x0344(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Show;                           // 0x0354(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_355[0x3];                                      // 0x0355(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UATPCCameraFOVObject*                   CallFunc_GetCameraFOVObject_ReturnValue_4;         // 0x0358(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0360(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UATPCCameraComponent*                   CallFunc_GetOwningCamera_ReturnValue_4;            // 0x0368(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0370(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UATPCCameraModeDataAsset*               CallFunc_GetCurrentCameraMode_ReturnValue_4;       // 0x0378(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameHUD_C>        K2Node_DynamicCast_AsBPI_Game_HUD;                 // 0x0380(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_391[0x3];                                      // 0x0391(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_19;           // 0x0394(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A4[0x4];                                      // 0x03A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x03A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_20;           // 0x03B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_SetFieldsInStruct_CameraFOV_ImplicitCast;   // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_SetFieldsInStruct_CameraFOV_ImplicitCast_1; // 0x03C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_SetFieldsInStruct_CameraFOV_ImplicitCast_2; // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars) == 0x000008, "Wrong alignment on BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars");
static_assert(sizeof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars) == 0x0003D0, "Wrong size on BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, EntryPoint) == 0x000000, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000008, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, K2Node_DynamicCast_AsAnim_Montage) == 0x000010, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::K2Node_DynamicCast_AsAnim_Montage' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, K2Node_CustomEvent_NotifyName_9) == 0x00001C, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::K2Node_CustomEvent_NotifyName_9' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, K2Node_CustomEvent_NotifyName_8) == 0x000024, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::K2Node_CustomEvent_NotifyName_8' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, K2Node_CreateDelegate_OutputDelegate) == 0x00002C, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, K2Node_CustomEvent_NotifyName_7) == 0x00003C, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::K2Node_CustomEvent_NotifyName_7' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, K2Node_CreateDelegate_OutputDelegate_1) == 0x000044, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, K2Node_CustomEvent_NotifyName_6) == 0x000054, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::K2Node_CustomEvent_NotifyName_6' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, K2Node_CreateDelegate_OutputDelegate_2) == 0x00005C, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, K2Node_CustomEvent_NotifyName_5) == 0x00006C, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::K2Node_CustomEvent_NotifyName_5' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, K2Node_CreateDelegate_OutputDelegate_3) == 0x000074, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, Temp_name_Variable) == 0x000084, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, CallFunc_IsValid_ReturnValue) == 0x00008C, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, K2Node_CreateDelegate_OutputDelegate_4) == 0x000090, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, K2Node_CustomEvent_NotifyName_4) == 0x0000A0, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, K2Node_CustomEvent_NotifyName_3) == 0x0000A8, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, K2Node_CreateDelegate_OutputDelegate_5) == 0x0000B0, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, K2Node_CustomEvent_NotifyName_2) == 0x0000C0, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, K2Node_CreateDelegate_OutputDelegate_6) == 0x0000C8, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, K2Node_CustomEvent_NotifyName_1) == 0x0000D8, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, K2Node_CreateDelegate_OutputDelegate_7) == 0x0000E0, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, K2Node_CustomEvent_NotifyName) == 0x0000F0, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, K2Node_CreateDelegate_OutputDelegate_8) == 0x0000F8, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, Temp_name_Variable_1) == 0x000108, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, K2Node_CustomEvent_Loaded_2) == 0x000110, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::K2Node_CustomEvent_Loaded_2' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, Temp_object_Variable) == 0x000118, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, K2Node_DynamicCast_AsAnim_Montage_1) == 0x000120, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::K2Node_DynamicCast_AsAnim_Montage_1' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, K2Node_DynamicCast_bSuccess_1) == 0x000128, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, K2Node_CustomEvent_Loaded_1) == 0x000130, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, Temp_object_Variable_1) == 0x000138, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, K2Node_DynamicCast_AsAnim_Montage_2) == 0x000140, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::K2Node_DynamicCast_AsAnim_Montage_2' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, K2Node_DynamicCast_bSuccess_2) == 0x000148, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, K2Node_CustomEvent_Loaded) == 0x000150, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, Temp_object_Variable_2) == 0x000158, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, K2Node_DynamicCast_AsAnim_Montage_3) == 0x000160, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::K2Node_DynamicCast_AsAnim_Montage_3' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, K2Node_DynamicCast_bSuccess_3) == 0x000168, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000170, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, CallFunc_GetCameraFOVObject_ReturnValue) == 0x000178, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::CallFunc_GetCameraFOVObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, CallFunc_GetOwningCamera_ReturnValue) == 0x000180, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::CallFunc_GetOwningCamera_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, CallFunc_GetCurrentCameraMode_ReturnValue) == 0x000188, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::CallFunc_GetCurrentCameraMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, K2Node_CreateDelegate_OutputDelegate_9) == 0x000190, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0001A0, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, CallFunc_Less_DoubleDouble_ReturnValue) == 0x0001A1, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0001A8, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, Temp_name_Variable_2) == 0x0001B0, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, K2Node_InputActionEvent_Key) == 0x0001B8, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::K2Node_InputActionEvent_Key' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, CallFunc_GetCameraFOVObject_ReturnValue_1) == 0x0001D0, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::CallFunc_GetCameraFOVObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, K2Node_InputActionEvent_Key_1) == 0x0001D8, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::K2Node_InputActionEvent_Key_1' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, CallFunc_GetOwningCamera_ReturnValue_1) == 0x0001F0, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::CallFunc_GetOwningCamera_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, K2Node_CustomEvent_NotifyName_10) == 0x0001F8, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::K2Node_CustomEvent_NotifyName_10' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, CallFunc_GetCurrentCameraMode_ReturnValue_1) == 0x000200, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::CallFunc_GetCurrentCameraMode_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x000208, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, CallFunc_Not_PreBool_ReturnValue) == 0x000210, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, CallFunc_IsValid_ReturnValue_1) == 0x000211, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, K2Node_CreateDelegate_OutputDelegate_10) == 0x000214, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, CallFunc_Not_PreBool_ReturnValue_1) == 0x000224, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, K2Node_CustomEvent_NotifyName_11) == 0x000228, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::K2Node_CustomEvent_NotifyName_11' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1) == 0x000230, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, CallFunc_GetAnimInstance_ReturnValue) == 0x000238, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, CallFunc_IsValid_ReturnValue_2) == 0x000240, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, K2Node_CreateDelegate_OutputDelegate_11) == 0x000244, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, CallFunc_IsServer_ReturnValue) == 0x000254, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, CallFunc_Not_PreBool_ReturnValue_2) == 0x000255, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, K2Node_CreateDelegate_OutputDelegate_12) == 0x000258, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, CallFunc_GetCameraFOVObject_ReturnValue_2) == 0x000268, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::CallFunc_GetCameraFOVObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, CallFunc_GetOwningCamera_ReturnValue_2) == 0x000270, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::CallFunc_GetOwningCamera_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, CallFunc_GetCurrentCameraMode_ReturnValue_2) == 0x000278, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::CallFunc_GetCurrentCameraMode_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, CallFunc_GetOwner_ReturnValue) == 0x000280, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, K2Node_DynamicCast_AsSurvival_Player) == 0x000288, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, K2Node_DynamicCast_bSuccess_4) == 0x000290, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, CallFunc_IsServer_ReturnValue_1) == 0x000291, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::CallFunc_IsServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, CallFunc_Not_PreBool_ReturnValue_3) == 0x000292, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, K2Node_CustomEvent_NotifyName_12) == 0x000294, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::K2Node_CustomEvent_NotifyName_12' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_2) == 0x0002A0, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, CallFunc_IsValid_ReturnValue_3) == 0x0002A8, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, CallFunc_IsLocallyControlled_ReturnValue) == 0x0002A9, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, CallFunc_GetCameraFOVObject_ReturnValue_3) == 0x0002B0, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::CallFunc_GetCameraFOVObject_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, CallFunc_GetOwningCamera_ReturnValue_3) == 0x0002B8, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::CallFunc_GetOwningCamera_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, CallFunc_GetCurrentCameraMode_ReturnValue_3) == 0x0002C0, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::CallFunc_GetCurrentCameraMode_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, K2Node_CreateDelegate_OutputDelegate_13) == 0x0002C8, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::K2Node_CreateDelegate_OutputDelegate_13' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0002D8, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, K2Node_CreateDelegate_OutputDelegate_14) == 0x0002E0, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::K2Node_CreateDelegate_OutputDelegate_14' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x0002F0, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, K2Node_CreateDelegate_OutputDelegate_15) == 0x0002F8, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::K2Node_CreateDelegate_OutputDelegate_15' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, CallFunc_K2_SetTimerDelegate_ReturnValue_2) == 0x000308, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::CallFunc_K2_SetTimerDelegate_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000310, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, K2Node_CreateDelegate_OutputDelegate_16) == 0x000314, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::K2Node_CreateDelegate_OutputDelegate_16' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, K2Node_CustomEvent_NotifyName_13) == 0x000324, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::K2Node_CustomEvent_NotifyName_13' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, K2Node_CreateDelegate_OutputDelegate_17) == 0x00032C, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::K2Node_CreateDelegate_OutputDelegate_17' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, K2Node_CustomEvent_NotifyName_14) == 0x00033C, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::K2Node_CustomEvent_NotifyName_14' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, K2Node_CreateDelegate_OutputDelegate_18) == 0x000344, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::K2Node_CreateDelegate_OutputDelegate_18' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, K2Node_CustomEvent_Show) == 0x000354, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::K2Node_CustomEvent_Show' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, CallFunc_GetCameraFOVObject_ReturnValue_4) == 0x000358, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::CallFunc_GetCameraFOVObject_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, CallFunc_GetPlayerController_ReturnValue) == 0x000360, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, CallFunc_GetOwningCamera_ReturnValue_4) == 0x000368, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::CallFunc_GetOwningCamera_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, CallFunc_GetHUD_ReturnValue) == 0x000370, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, CallFunc_GetCurrentCameraMode_ReturnValue_4) == 0x000378, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::CallFunc_GetCurrentCameraMode_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, K2Node_DynamicCast_AsBPI_Game_HUD) == 0x000380, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::K2Node_DynamicCast_AsBPI_Game_HUD' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, K2Node_DynamicCast_bSuccess_5) == 0x000390, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, K2Node_CreateDelegate_OutputDelegate_19) == 0x000394, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::K2Node_CreateDelegate_OutputDelegate_19' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, CallFunc_K2_GetRootComponent_ReturnValue) == 0x0003A8, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, K2Node_CreateDelegate_OutputDelegate_20) == 0x0003B0, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::K2Node_CreateDelegate_OutputDelegate_20' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, K2Node_SetFieldsInStruct_CameraFOV_ImplicitCast) == 0x0003C0, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::K2Node_SetFieldsInStruct_CameraFOV_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, K2Node_SetFieldsInStruct_CameraFOV_ImplicitCast_1) == 0x0003C4, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::K2Node_SetFieldsInStruct_CameraFOV_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars, K2Node_SetFieldsInStruct_CameraFOV_ImplicitCast_2) == 0x0003C8, "Member 'BPC_Binoculars_C_ExecuteUbergraph_BPC_Binoculars::K2Node_SetFieldsInStruct_CameraFOV_ImplicitCast_2' has a wrong offset!");

// Function BPC_Binoculars.BPC_Binoculars_C.HideBinocularInGame
// 0x0003 (0x0003 - 0x0000)
struct BPC_Binoculars_C_HideBinocularInGame final
{
public:
	bool                                          bIsHidden;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_Binoculars_C_HideBinocularInGame) == 0x000001, "Wrong alignment on BPC_Binoculars_C_HideBinocularInGame");
static_assert(sizeof(BPC_Binoculars_C_HideBinocularInGame) == 0x000003, "Wrong size on BPC_Binoculars_C_HideBinocularInGame");
static_assert(offsetof(BPC_Binoculars_C_HideBinocularInGame, bIsHidden) == 0x000000, "Member 'BPC_Binoculars_C_HideBinocularInGame::bIsHidden' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_HideBinocularInGame, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'BPC_Binoculars_C_HideBinocularInGame::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Binoculars_C_HideBinocularInGame, CallFunc_IsValid_ReturnValue) == 0x000002, "Member 'BPC_Binoculars_C_HideBinocularInGame::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BPC_Binoculars.BPC_Binoculars_C.InpActEvt_ZoomIn_K2Node_InputActionEvent_1
// 0x0018 (0x0018 - 0x0000)
struct BPC_Binoculars_C_InpActEvt_ZoomIn_K2Node_InputActionEvent_1 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BPC_Binoculars_C_InpActEvt_ZoomIn_K2Node_InputActionEvent_1) == 0x000008, "Wrong alignment on BPC_Binoculars_C_InpActEvt_ZoomIn_K2Node_InputActionEvent_1");
static_assert(sizeof(BPC_Binoculars_C_InpActEvt_ZoomIn_K2Node_InputActionEvent_1) == 0x000018, "Wrong size on BPC_Binoculars_C_InpActEvt_ZoomIn_K2Node_InputActionEvent_1");
static_assert(offsetof(BPC_Binoculars_C_InpActEvt_ZoomIn_K2Node_InputActionEvent_1, Key) == 0x000000, "Member 'BPC_Binoculars_C_InpActEvt_ZoomIn_K2Node_InputActionEvent_1::Key' has a wrong offset!");

// Function BPC_Binoculars.BPC_Binoculars_C.InpActEvt_ZoomOut_K2Node_InputActionEvent_0
// 0x0018 (0x0018 - 0x0000)
struct BPC_Binoculars_C_InpActEvt_ZoomOut_K2Node_InputActionEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BPC_Binoculars_C_InpActEvt_ZoomOut_K2Node_InputActionEvent_0) == 0x000008, "Wrong alignment on BPC_Binoculars_C_InpActEvt_ZoomOut_K2Node_InputActionEvent_0");
static_assert(sizeof(BPC_Binoculars_C_InpActEvt_ZoomOut_K2Node_InputActionEvent_0) == 0x000018, "Wrong size on BPC_Binoculars_C_InpActEvt_ZoomOut_K2Node_InputActionEvent_0");
static_assert(offsetof(BPC_Binoculars_C_InpActEvt_ZoomOut_K2Node_InputActionEvent_0, Key) == 0x000000, "Member 'BPC_Binoculars_C_InpActEvt_ZoomOut_K2Node_InputActionEvent_0::Key' has a wrong offset!");

// Function BPC_Binoculars.BPC_Binoculars_C.OnBlendOut_2CFB31634500C45E62F961970FE3B055
// 0x0008 (0x0008 - 0x0000)
struct BPC_Binoculars_C_OnBlendOut_2CFB31634500C45E62F961970FE3B055 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_Binoculars_C_OnBlendOut_2CFB31634500C45E62F961970FE3B055) == 0x000004, "Wrong alignment on BPC_Binoculars_C_OnBlendOut_2CFB31634500C45E62F961970FE3B055");
static_assert(sizeof(BPC_Binoculars_C_OnBlendOut_2CFB31634500C45E62F961970FE3B055) == 0x000008, "Wrong size on BPC_Binoculars_C_OnBlendOut_2CFB31634500C45E62F961970FE3B055");
static_assert(offsetof(BPC_Binoculars_C_OnBlendOut_2CFB31634500C45E62F961970FE3B055, NotifyName) == 0x000000, "Member 'BPC_Binoculars_C_OnBlendOut_2CFB31634500C45E62F961970FE3B055::NotifyName' has a wrong offset!");

// Function BPC_Binoculars.BPC_Binoculars_C.OnBlendOut_848C5EAA4C1F4E4B87C1F1AA7EEF4709
// 0x0008 (0x0008 - 0x0000)
struct BPC_Binoculars_C_OnBlendOut_848C5EAA4C1F4E4B87C1F1AA7EEF4709 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_Binoculars_C_OnBlendOut_848C5EAA4C1F4E4B87C1F1AA7EEF4709) == 0x000004, "Wrong alignment on BPC_Binoculars_C_OnBlendOut_848C5EAA4C1F4E4B87C1F1AA7EEF4709");
static_assert(sizeof(BPC_Binoculars_C_OnBlendOut_848C5EAA4C1F4E4B87C1F1AA7EEF4709) == 0x000008, "Wrong size on BPC_Binoculars_C_OnBlendOut_848C5EAA4C1F4E4B87C1F1AA7EEF4709");
static_assert(offsetof(BPC_Binoculars_C_OnBlendOut_848C5EAA4C1F4E4B87C1F1AA7EEF4709, NotifyName) == 0x000000, "Member 'BPC_Binoculars_C_OnBlendOut_848C5EAA4C1F4E4B87C1F1AA7EEF4709::NotifyName' has a wrong offset!");

// Function BPC_Binoculars.BPC_Binoculars_C.OnBlendOut_AE5C42014C2633295DD80685A1D16528
// 0x0008 (0x0008 - 0x0000)
struct BPC_Binoculars_C_OnBlendOut_AE5C42014C2633295DD80685A1D16528 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_Binoculars_C_OnBlendOut_AE5C42014C2633295DD80685A1D16528) == 0x000004, "Wrong alignment on BPC_Binoculars_C_OnBlendOut_AE5C42014C2633295DD80685A1D16528");
static_assert(sizeof(BPC_Binoculars_C_OnBlendOut_AE5C42014C2633295DD80685A1D16528) == 0x000008, "Wrong size on BPC_Binoculars_C_OnBlendOut_AE5C42014C2633295DD80685A1D16528");
static_assert(offsetof(BPC_Binoculars_C_OnBlendOut_AE5C42014C2633295DD80685A1D16528, NotifyName) == 0x000000, "Member 'BPC_Binoculars_C_OnBlendOut_AE5C42014C2633295DD80685A1D16528::NotifyName' has a wrong offset!");

// Function BPC_Binoculars.BPC_Binoculars_C.OnCompleted_2CFB31634500C45E62F961970FE3B055
// 0x0008 (0x0008 - 0x0000)
struct BPC_Binoculars_C_OnCompleted_2CFB31634500C45E62F961970FE3B055 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_Binoculars_C_OnCompleted_2CFB31634500C45E62F961970FE3B055) == 0x000004, "Wrong alignment on BPC_Binoculars_C_OnCompleted_2CFB31634500C45E62F961970FE3B055");
static_assert(sizeof(BPC_Binoculars_C_OnCompleted_2CFB31634500C45E62F961970FE3B055) == 0x000008, "Wrong size on BPC_Binoculars_C_OnCompleted_2CFB31634500C45E62F961970FE3B055");
static_assert(offsetof(BPC_Binoculars_C_OnCompleted_2CFB31634500C45E62F961970FE3B055, NotifyName) == 0x000000, "Member 'BPC_Binoculars_C_OnCompleted_2CFB31634500C45E62F961970FE3B055::NotifyName' has a wrong offset!");

// Function BPC_Binoculars.BPC_Binoculars_C.OnCompleted_848C5EAA4C1F4E4B87C1F1AA7EEF4709
// 0x0008 (0x0008 - 0x0000)
struct BPC_Binoculars_C_OnCompleted_848C5EAA4C1F4E4B87C1F1AA7EEF4709 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_Binoculars_C_OnCompleted_848C5EAA4C1F4E4B87C1F1AA7EEF4709) == 0x000004, "Wrong alignment on BPC_Binoculars_C_OnCompleted_848C5EAA4C1F4E4B87C1F1AA7EEF4709");
static_assert(sizeof(BPC_Binoculars_C_OnCompleted_848C5EAA4C1F4E4B87C1F1AA7EEF4709) == 0x000008, "Wrong size on BPC_Binoculars_C_OnCompleted_848C5EAA4C1F4E4B87C1F1AA7EEF4709");
static_assert(offsetof(BPC_Binoculars_C_OnCompleted_848C5EAA4C1F4E4B87C1F1AA7EEF4709, NotifyName) == 0x000000, "Member 'BPC_Binoculars_C_OnCompleted_848C5EAA4C1F4E4B87C1F1AA7EEF4709::NotifyName' has a wrong offset!");

// Function BPC_Binoculars.BPC_Binoculars_C.OnCompleted_AE5C42014C2633295DD80685A1D16528
// 0x0008 (0x0008 - 0x0000)
struct BPC_Binoculars_C_OnCompleted_AE5C42014C2633295DD80685A1D16528 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_Binoculars_C_OnCompleted_AE5C42014C2633295DD80685A1D16528) == 0x000004, "Wrong alignment on BPC_Binoculars_C_OnCompleted_AE5C42014C2633295DD80685A1D16528");
static_assert(sizeof(BPC_Binoculars_C_OnCompleted_AE5C42014C2633295DD80685A1D16528) == 0x000008, "Wrong size on BPC_Binoculars_C_OnCompleted_AE5C42014C2633295DD80685A1D16528");
static_assert(offsetof(BPC_Binoculars_C_OnCompleted_AE5C42014C2633295DD80685A1D16528, NotifyName) == 0x000000, "Member 'BPC_Binoculars_C_OnCompleted_AE5C42014C2633295DD80685A1D16528::NotifyName' has a wrong offset!");

// Function BPC_Binoculars.BPC_Binoculars_C.OnInterrupted_2CFB31634500C45E62F961970FE3B055
// 0x0008 (0x0008 - 0x0000)
struct BPC_Binoculars_C_OnInterrupted_2CFB31634500C45E62F961970FE3B055 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_Binoculars_C_OnInterrupted_2CFB31634500C45E62F961970FE3B055) == 0x000004, "Wrong alignment on BPC_Binoculars_C_OnInterrupted_2CFB31634500C45E62F961970FE3B055");
static_assert(sizeof(BPC_Binoculars_C_OnInterrupted_2CFB31634500C45E62F961970FE3B055) == 0x000008, "Wrong size on BPC_Binoculars_C_OnInterrupted_2CFB31634500C45E62F961970FE3B055");
static_assert(offsetof(BPC_Binoculars_C_OnInterrupted_2CFB31634500C45E62F961970FE3B055, NotifyName) == 0x000000, "Member 'BPC_Binoculars_C_OnInterrupted_2CFB31634500C45E62F961970FE3B055::NotifyName' has a wrong offset!");

// Function BPC_Binoculars.BPC_Binoculars_C.OnInterrupted_848C5EAA4C1F4E4B87C1F1AA7EEF4709
// 0x0008 (0x0008 - 0x0000)
struct BPC_Binoculars_C_OnInterrupted_848C5EAA4C1F4E4B87C1F1AA7EEF4709 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_Binoculars_C_OnInterrupted_848C5EAA4C1F4E4B87C1F1AA7EEF4709) == 0x000004, "Wrong alignment on BPC_Binoculars_C_OnInterrupted_848C5EAA4C1F4E4B87C1F1AA7EEF4709");
static_assert(sizeof(BPC_Binoculars_C_OnInterrupted_848C5EAA4C1F4E4B87C1F1AA7EEF4709) == 0x000008, "Wrong size on BPC_Binoculars_C_OnInterrupted_848C5EAA4C1F4E4B87C1F1AA7EEF4709");
static_assert(offsetof(BPC_Binoculars_C_OnInterrupted_848C5EAA4C1F4E4B87C1F1AA7EEF4709, NotifyName) == 0x000000, "Member 'BPC_Binoculars_C_OnInterrupted_848C5EAA4C1F4E4B87C1F1AA7EEF4709::NotifyName' has a wrong offset!");

// Function BPC_Binoculars.BPC_Binoculars_C.OnInterrupted_AE5C42014C2633295DD80685A1D16528
