#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_PerkSystem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "S_PerkData_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_PerkSystem.BPC_PerkSystem_C
// 0x00E0 (0x0180 - 0x00A0)
class UBPC_PerkSystem_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TSoftObjectPtr<class UDataTable>              PerksDataTable;                                    // 0x00A8(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class UPerkBaseObject_C*>              ActivePerks;                                       // 0x00D8(0x0010)(Edit, BlueprintVisible)
	TArray<struct FS_PerkData>                    AvailablePerks;                                    // 0x00E8(0x0010)(Edit, BlueprintVisible)
	TArray<struct FS_PerkData>                    UnavailablePerks;                                  // 0x00F8(0x0010)(Edit, BlueprintVisible)
	TMap<class FString, double>                   AchievedActions;                                   // 0x0108(0x0050)(Edit, BlueprintVisible)
	TArray<class FString>                         TimeActiveActions;                                 // 0x0158(0x0010)(Edit, BlueprintVisible)
	TArray<class FName>                           Selected_Traits;                                   // 0x0168(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ASurvivalPlayer_V2_C*                   As_Survival_Player_V2;                             // 0x0178(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPC_PerkSystem(int32 EntryPoint);
	void Init();
	void LoadPerk(const struct FWS_CharaterPerks& Info);
	void LoadPerks(class UObject* Object);
	void OnLoaded_1096EADF44D2066402B441BD4B5A2D44(TSubclassOf<class UObject> Loaded);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPC_PerkSystem_C">();
	}
	static class UBPC_PerkSystem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_PerkSystem_C>();
	}
};
static_assert(alignof(UBPC_PerkSystem_C) == 0x000008, "Wrong alignment on UBPC_PerkSystem_C");
static_assert(sizeof(UBPC_PerkSystem_C) == 0x000180, "Wrong size on UBPC_PerkSystem_C");
static_assert(offsetof(UBPC_PerkSystem_C, UberGraphFrame) == 0x0000A0, "Member 'UBPC_PerkSystem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPC_PerkSystem_C, PerksDataTable) == 0x0000A8, "Member 'UBPC_PerkSystem_C::PerksDataTable' has a wrong offset!");
static_assert(offsetof(UBPC_PerkSystem_C, ActivePerks) == 0x0000D8, "Member 'UBPC_PerkSystem_C::ActivePerks' has a wrong offset!");
static_assert(offsetof(UBPC_PerkSystem_C, AvailablePerks) == 0x0000E8, "Member 'UBPC_PerkSystem_C::AvailablePerks' has a wrong offset!");
static_assert(offsetof(UBPC_PerkSystem_C, UnavailablePerks) == 0x0000F8, "Member 'UBPC_PerkSystem_C::UnavailablePerks' has a wrong offset!");
static_assert(offsetof(UBPC_PerkSystem_C, AchievedActions) == 0x000108, "Member 'UBPC_PerkSystem_C::AchievedActions' has a wrong offset!");
static_assert(offsetof(UBPC_PerkSystem_C, TimeActiveActions) == 0x000158, "Member 'UBPC_PerkSystem_C::TimeActiveActions' has a wrong offset!");
static_assert(offsetof(UBPC_PerkSystem_C, Selected_Traits) == 0x000168, "Member 'UBPC_PerkSystem_C::Selected_Traits' has a wrong offset!");
static_assert(offsetof(UBPC_PerkSystem_C, As_Survival_Player_V2) == 0x000178, "Member 'UBPC_PerkSystem_C::As_Survival_Player_V2' has a wrong offset!");

}

