#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_Taunt

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "S_TauntStruct_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_Taunt.BPC_Taunt_C
// 0x00C8 (0x0168 - 0x00A0)
class UBPC_Taunt_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAnimMontage*                           TauntMontage;                                      // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_V2_C*                   Surv_Ref;                                          // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bTauntIsPlaying;                                   // 0x00B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_TauntStruct                         CurrentTauntStruct;                                // 0x00C0(0x0098)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class FName>                           TauntsPool;                                        // 0x0158(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BPC_Taunt(int32 EntryPoint);
	void InpActEvt_AnyKey_K2Node_InputKeyEvent_0(const struct FKey& Key);
	void OnBlendOut_5DD598944811833BB66094973BAEC5CD(class FName NotifyName);
	void OnBlendOut_6062DF7F4D2B6CCE619448A00ABED786(class FName NotifyName);
	void OnBlendOut_C18BD2AD47DADDB8A7ECC197D6966156(class FName NotifyName);
	void OnBlendOut_F0BBBD134976402CF92654B9B0B68712(class FName NotifyName);
	void OnCompleted_5DD598944811833BB66094973BAEC5CD(class FName NotifyName);
	void OnCompleted_6062DF7F4D2B6CCE619448A00ABED786(class FName NotifyName);
	void OnCompleted_C18BD2AD47DADDB8A7ECC197D6966156(class FName NotifyName);
	void OnCompleted_F0BBBD134976402CF92654B9B0B68712(class FName NotifyName);
	void OnInterrupted_5DD598944811833BB66094973BAEC5CD(class FName NotifyName);
	void OnInterrupted_6062DF7F4D2B6CCE619448A00ABED786(class FName NotifyName);
	void OnInterrupted_C18BD2AD47DADDB8A7ECC197D6966156(class FName NotifyName);
	void OnInterrupted_F0BBBD134976402CF92654B9B0B68712(class FName NotifyName);
	void OnLoaded_73261BBF4AE7C0ACA2343B9B003F7A56(class UObject* Loaded);
	void OnLoaded_73261BBF4AE7C0ACA2343B9B09B1B0A1(class UObject* Loaded);
	void OnLoaded_73261BBF4AE7C0ACA2343B9B3C16F0DF(class UObject* Loaded);
	void OnLoaded_73261BBF4AE7C0ACA2343B9B5DC344A9(class UObject* Loaded);
	void OnLoaded_73261BBF4AE7C0ACA2343B9B7120EE31(class UObject* Loaded);
	void OnNotifyBegin_5DD598944811833BB66094973BAEC5CD(class FName NotifyName);
	void OnNotifyBegin_6062DF7F4D2B6CCE619448A00ABED786(class FName NotifyName);
	void OnNotifyBegin_C18BD2AD47DADDB8A7ECC197D6966156(class FName NotifyName);
	void OnNotifyBegin_F0BBBD134976402CF92654B9B0B68712(class FName NotifyName);
	void OnNotifyEnd_5DD598944811833BB66094973BAEC5CD(class FName NotifyName);
	void OnNotifyEnd_6062DF7F4D2B6CCE619448A00ABED786(class FName NotifyName);
	void OnNotifyEnd_C18BD2AD47DADDB8A7ECC197D6966156(class FName NotifyName);
	void OnNotifyEnd_F0BBBD134976402CF92654B9B0B68712(class FName NotifyName);
	void PlayTauntMontage(class FName RowName);
	void ReceiveBeginPlay();
	void StopTaunt(bool NeedEndAnim, class UAnimMontage* EndAnim);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPC_Taunt_C">();
	}
	static class UBPC_Taunt_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_Taunt_C>();
	}
};
static_assert(alignof(UBPC_Taunt_C) == 0x000008, "Wrong alignment on UBPC_Taunt_C");
static_assert(sizeof(UBPC_Taunt_C) == 0x000168, "Wrong size on UBPC_Taunt_C");
static_assert(offsetof(UBPC_Taunt_C, UberGraphFrame) == 0x0000A0, "Member 'UBPC_Taunt_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPC_Taunt_C, TauntMontage) == 0x0000A8, "Member 'UBPC_Taunt_C::TauntMontage' has a wrong offset!");
static_assert(offsetof(UBPC_Taunt_C, Surv_Ref) == 0x0000B0, "Member 'UBPC_Taunt_C::Surv_Ref' has a wrong offset!");
static_assert(offsetof(UBPC_Taunt_C, bTauntIsPlaying) == 0x0000B8, "Member 'UBPC_Taunt_C::bTauntIsPlaying' has a wrong offset!");
static_assert(offsetof(UBPC_Taunt_C, CurrentTauntStruct) == 0x0000C0, "Member 'UBPC_Taunt_C::CurrentTauntStruct' has a wrong offset!");
static_assert(offsetof(UBPC_Taunt_C, TauntsPool) == 0x000158, "Member 'UBPC_Taunt_C::TauntsPool' has a wrong offset!");

}

