#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_CarStatsComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "StatType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_CarStatsComponent.BPC_CarStatsComponent_C
// 0x00D0 (0x0170 - 0x00A0)
class UBPC_CarStatsComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	FMulticastInlineDelegateProperty_             Fuel_End;                                          // 0x00A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMap<EStatType, double>                       Stats;                                             // 0x00B8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	FMulticastInlineDelegateProperty_             DurabilityEnd;                                     // 0x0108(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          NoFuel;                                            // 0x0118(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NoDurability;                                      // 0x0119(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCriticalDurability;                              // 0x011A(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11B[0x5];                                      // 0x011B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CriticalDurability;                                // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCriticalFuel;                                    // 0x0128(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CriticalFuel;                                      // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Destroy_;                                          // 0x0138(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                As_BP_FGear_Vehicle_Basic;                         // 0x0140(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnFuelChange;                                      // 0x0148(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class AAVS_VehicleMaster_C*                   As_AVS_Vehicle_Master;                             // 0x0158(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnDurabilityChange;                                // 0x0160(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void AddImpulseVehicle(class AAVS_VehicleMaster_C* Vehicle);
	void CalculateFuel(double Delta);
	void DecreaseDurability(double Value);
	void DecreaseFuel(double Value);
	void DestroyCar(class UFMODEvent* SFX, class UNiagaraSystem* VFX, class UObject* Mesh);
	void DurabilityEnd__DelegateSignature();
	void ExecuteUbergraph_BPC_CarStatsComponent(int32 EntryPoint);
	void Fuel_End__DelegateSignature();
	void GetStat(EStatType Key, double* Value);
	void IncreaseDurability(double Value);
	void IncreaseFuel(double Value);
	void IsFullDurability(bool* IsFull);
	void IsFullFuel(bool* IsFull);
	void NeedFuelAmount(double* Value);
	void OnDurabilityChange__DelegateSignature(double Durability);
	void OnFuelChange__DelegateSignature(double Fuel);
	void RadialDamage(class AAVS_VehicleMaster_C* Vehicle);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	double SetStat(EStatType Stat, double Value);
	void SetStat_Multi(const EStatType Key, const double& Value);
	void StatInitialize();
	void UpdateCriticalState();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPC_CarStatsComponent_C">();
	}
	static class UBPC_CarStatsComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_CarStatsComponent_C>();
	}
};
static_assert(alignof(UBPC_CarStatsComponent_C) == 0x000008, "Wrong alignment on UBPC_CarStatsComponent_C");
static_assert(sizeof(UBPC_CarStatsComponent_C) == 0x000170, "Wrong size on UBPC_CarStatsComponent_C");
static_assert(offsetof(UBPC_CarStatsComponent_C, UberGraphFrame) == 0x0000A0, "Member 'UBPC_CarStatsComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPC_CarStatsComponent_C, Fuel_End) == 0x0000A8, "Member 'UBPC_CarStatsComponent_C::Fuel_End' has a wrong offset!");
static_assert(offsetof(UBPC_CarStatsComponent_C, Stats) == 0x0000B8, "Member 'UBPC_CarStatsComponent_C::Stats' has a wrong offset!");
static_assert(offsetof(UBPC_CarStatsComponent_C, DurabilityEnd) == 0x000108, "Member 'UBPC_CarStatsComponent_C::DurabilityEnd' has a wrong offset!");
static_assert(offsetof(UBPC_CarStatsComponent_C, NoFuel) == 0x000118, "Member 'UBPC_CarStatsComponent_C::NoFuel' has a wrong offset!");
static_assert(offsetof(UBPC_CarStatsComponent_C, NoDurability) == 0x000119, "Member 'UBPC_CarStatsComponent_C::NoDurability' has a wrong offset!");
static_assert(offsetof(UBPC_CarStatsComponent_C, IsCriticalDurability) == 0x00011A, "Member 'UBPC_CarStatsComponent_C::IsCriticalDurability' has a wrong offset!");
static_assert(offsetof(UBPC_CarStatsComponent_C, CriticalDurability) == 0x000120, "Member 'UBPC_CarStatsComponent_C::CriticalDurability' has a wrong offset!");
static_assert(offsetof(UBPC_CarStatsComponent_C, IsCriticalFuel) == 0x000128, "Member 'UBPC_CarStatsComponent_C::IsCriticalFuel' has a wrong offset!");
static_assert(offsetof(UBPC_CarStatsComponent_C, CriticalFuel) == 0x000130, "Member 'UBPC_CarStatsComponent_C::CriticalFuel' has a wrong offset!");
static_assert(offsetof(UBPC_CarStatsComponent_C, Destroy_) == 0x000138, "Member 'UBPC_CarStatsComponent_C::Destroy_' has a wrong offset!");
static_assert(offsetof(UBPC_CarStatsComponent_C, As_BP_FGear_Vehicle_Basic) == 0x000140, "Member 'UBPC_CarStatsComponent_C::As_BP_FGear_Vehicle_Basic' has a wrong offset!");
static_assert(offsetof(UBPC_CarStatsComponent_C, OnFuelChange) == 0x000148, "Member 'UBPC_CarStatsComponent_C::OnFuelChange' has a wrong offset!");
static_assert(offsetof(UBPC_CarStatsComponent_C, As_AVS_Vehicle_Master) == 0x000158, "Member 'UBPC_CarStatsComponent_C::As_AVS_Vehicle_Master' has a wrong offset!");
static_assert(offsetof(UBPC_CarStatsComponent_C, OnDurabilityChange) == 0x000160, "Member 'UBPC_CarStatsComponent_C::OnDurabilityChange' has a wrong offset!");

}

