#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_PerkSystem

#include "Basic.hpp"

#include "WS_CharaterPerks_structs.hpp"
#include "S_StatInfo_structs.hpp"


namespace SDK::Params
{

// Function BPC_PerkSystem.BPC_PerkSystem_C.ExecuteUbergraph_BPC_PerkSystem
// 0x01D0 (0x01D0 - 0x0000)
struct BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_StatInfo                            CallFunc_GetDataTableRowFromName_OutRow;           // 0x0058(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWS_CharaterPerks                      K2Node_CustomEvent_Info;                           // 0x00A0(0x00B8)(HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable;                               // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_SpawnObject_ReturnValue;                  // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPerkBaseObjectReborn_C*                K2Node_DynamicCast_AsPerk_Base_Object_Reborn;      // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival;                  // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_V2_C*                   K2Node_DynamicCast_AsSurvival_Player_V2;           // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x3];                                      // 0x01A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x3];                                      // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded;                         // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate;              // 0x01C0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem) == 0x000008, "Wrong alignment on BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem");
static_assert(sizeof(BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem) == 0x0001D0, "Wrong size on BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem");
static_assert(offsetof(BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem, EntryPoint) == 0x000000, "Member 'BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000008, "Member 'BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem, CallFunc_IsEmpty_ReturnValue) == 0x000009, "Member 'BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem, CallFunc_Conv_BoolToString_ReturnValue) == 0x000010, "Member 'BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem::CallFunc_Conv_BoolToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem, CallFunc_BooleanOR_ReturnValue) == 0x000020, "Member 'BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem, CallFunc_Concat_StrStr_ReturnValue) == 0x000028, "Member 'BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000038, "Member 'BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem, Temp_int_Array_Index_Variable) == 0x000048, "Member 'BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem, CallFunc_Array_Get_Item) == 0x00004C, "Member 'BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem, CallFunc_GetDataTableRowFromName_OutRow) == 0x000058, "Member 'BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000098, "Member 'BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem, K2Node_CustomEvent_Info) == 0x0000A0, "Member 'BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem::K2Node_CustomEvent_Info' has a wrong offset!");
static_assert(offsetof(BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem, Temp_class_Variable) == 0x000158, "Member 'BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem, CallFunc_GetOwner_ReturnValue) == 0x000160, "Member 'BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem, CallFunc_SpawnObject_ReturnValue) == 0x000168, "Member 'BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem, CallFunc_GetGameInstance_ReturnValue) == 0x000170, "Member 'BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem, K2Node_DynamicCast_AsPerk_Base_Object_Reborn) == 0x000178, "Member 'BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem::K2Node_DynamicCast_AsPerk_Base_Object_Reborn' has a wrong offset!");
static_assert(offsetof(BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem, K2Node_DynamicCast_bSuccess) == 0x000180, "Member 'BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem, K2Node_DynamicCast_AsGI_Survival) == 0x000188, "Member 'BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem::K2Node_DynamicCast_AsGI_Survival' has a wrong offset!");
static_assert(offsetof(BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem, K2Node_DynamicCast_bSuccess_1) == 0x000190, "Member 'BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem, CallFunc_GetOwner_ReturnValue_1) == 0x000198, "Member 'BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem, K2Node_DynamicCast_AsSurvival_Player_V2) == 0x0001A0, "Member 'BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem::K2Node_DynamicCast_AsSurvival_Player_V2' has a wrong offset!");
static_assert(offsetof(BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem, K2Node_DynamicCast_bSuccess_2) == 0x0001A8, "Member 'BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem, Temp_int_Loop_Counter_Variable) == 0x0001AC, "Member 'BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem, CallFunc_Less_IntInt_ReturnValue) == 0x0001B0, "Member 'BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem, CallFunc_Add_IntInt_ReturnValue) == 0x0001B4, "Member 'BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem, K2Node_CustomEvent_Loaded) == 0x0001B8, "Member 'BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem, K2Node_CreateDelegate_OutputDelegate) == 0x0001C0, "Member 'BPC_PerkSystem_C_ExecuteUbergraph_BPC_PerkSystem::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function BPC_PerkSystem.BPC_PerkSystem_C.LoadPerk
// 0x00B8 (0x00B8 - 0x0000)
struct BPC_PerkSystem_C_LoadPerk final
{
public:
	struct FWS_CharaterPerks                      Info;                                              // 0x0000(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PerkSystem_C_LoadPerk) == 0x000008, "Wrong alignment on BPC_PerkSystem_C_LoadPerk");
static_assert(sizeof(BPC_PerkSystem_C_LoadPerk) == 0x0000B8, "Wrong size on BPC_PerkSystem_C_LoadPerk");
static_assert(offsetof(BPC_PerkSystem_C_LoadPerk, Info) == 0x000000, "Member 'BPC_PerkSystem_C_LoadPerk::Info' has a wrong offset!");

// Function BPC_PerkSystem.BPC_PerkSystem_C.LoadPerks
// 0x0100 (0x0100 - 0x0000)
struct BPC_PerkSystem_C_LoadPerks final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          _Available;                                        // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             K2Node_DynamicCast_AsData_Table;                   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item;                           // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWS_CharaterPerks                      CallFunc_GetDataTableRowFromName_OutRow;           // 0x0038(0x00B8)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F2[0x2];                                       // 0x00F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PerkSystem_C_LoadPerks) == 0x000008, "Wrong alignment on BPC_PerkSystem_C_LoadPerks");
static_assert(sizeof(BPC_PerkSystem_C_LoadPerks) == 0x000100, "Wrong size on BPC_PerkSystem_C_LoadPerks");
static_assert(offsetof(BPC_PerkSystem_C_LoadPerks, Object) == 0x000000, "Member 'BPC_PerkSystem_C_LoadPerks::Object' has a wrong offset!");
static_assert(offsetof(BPC_PerkSystem_C_LoadPerks, _Available) == 0x000008, "Member 'BPC_PerkSystem_C_LoadPerks::_Available' has a wrong offset!");
static_assert(offsetof(BPC_PerkSystem_C_LoadPerks, K2Node_DynamicCast_AsData_Table) == 0x000010, "Member 'BPC_PerkSystem_C_LoadPerks::K2Node_DynamicCast_AsData_Table' has a wrong offset!");
static_assert(offsetof(BPC_PerkSystem_C_LoadPerks, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BPC_PerkSystem_C_LoadPerks::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_PerkSystem_C_LoadPerks, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'BPC_PerkSystem_C_LoadPerks::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPC_PerkSystem_C_LoadPerks, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'BPC_PerkSystem_C_LoadPerks::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPC_PerkSystem_C_LoadPerks, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'BPC_PerkSystem_C_LoadPerks::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PerkSystem_C_LoadPerks, Temp_bool_True_if_break_was_hit_Variable) == 0x000028, "Member 'BPC_PerkSystem_C_LoadPerks::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BPC_PerkSystem_C_LoadPerks, CallFunc_Array_Get_Item) == 0x00002C, "Member 'BPC_PerkSystem_C_LoadPerks::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPC_PerkSystem_C_LoadPerks, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'BPC_PerkSystem_C_LoadPerks::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PerkSystem_C_LoadPerks, CallFunc_GetDataTableRowFromName_OutRow) == 0x000038, "Member 'BPC_PerkSystem_C_LoadPerks::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BPC_PerkSystem_C_LoadPerks, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000F0, "Member 'BPC_PerkSystem_C_LoadPerks::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PerkSystem_C_LoadPerks, CallFunc_Less_IntInt_ReturnValue) == 0x0000F1, "Member 'BPC_PerkSystem_C_LoadPerks::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PerkSystem_C_LoadPerks, CallFunc_Array_Length_ReturnValue_1) == 0x0000F4, "Member 'BPC_PerkSystem_C_LoadPerks::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_PerkSystem_C_LoadPerks, CallFunc_Greater_IntInt_ReturnValue) == 0x0000F8, "Member 'BPC_PerkSystem_C_LoadPerks::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function BPC_PerkSystem.BPC_PerkSystem_C.OnLoaded_1096EADF44D2066402B441BD4B5A2D44
// 0x0008 (0x0008 - 0x0000)
struct BPC_PerkSystem_C_OnLoaded_1096EADF44D2066402B441BD4B5A2D44 final
{
public:
	TSubclassOf<class UObject>                    Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PerkSystem_C_OnLoaded_1096EADF44D2066402B441BD4B5A2D44) == 0x000008, "Wrong alignment on BPC_PerkSystem_C_OnLoaded_1096EADF44D2066402B441BD4B5A2D44");
static_assert(sizeof(BPC_PerkSystem_C_OnLoaded_1096EADF44D2066402B441BD4B5A2D44) == 0x000008, "Wrong size on BPC_PerkSystem_C_OnLoaded_1096EADF44D2066402B441BD4B5A2D44");
static_assert(offsetof(BPC_PerkSystem_C_OnLoaded_1096EADF44D2066402B441BD4B5A2D44, Loaded) == 0x000000, "Member 'BPC_PerkSystem_C_OnLoaded_1096EADF44D2066402B441BD4B5A2D44::Loaded' has a wrong offset!");

}

