#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_Equipment

#include "Basic.hpp"

#include "BPE_Weapon_Type_structs.hpp"
#include "FItemInfo_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "StanceState_structs.hpp"
#include "BPS_WeaponData_structs.hpp"
#include "S_PlayerWeaponAnim_structs.hpp"
#include "BPS_DamageInfo_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BPC_Equipment.BPC_Equipment_C.CallEquipAnim
// 0x0001 (0x0001 - 0x0000)
struct BPC_Equipment_C_CallEquipAnim final
{
public:
	bool                                          Equip;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_Equipment_C_CallEquipAnim) == 0x000001, "Wrong alignment on BPC_Equipment_C_CallEquipAnim");
static_assert(sizeof(BPC_Equipment_C_CallEquipAnim) == 0x000001, "Wrong size on BPC_Equipment_C_CallEquipAnim");
static_assert(offsetof(BPC_Equipment_C_CallEquipAnim, Equip) == 0x000000, "Member 'BPC_Equipment_C_CallEquipAnim::Equip' has a wrong offset!");

// Function BPC_Equipment.BPC_Equipment_C.ExecuteUbergraph_BPC_Equipment
// 0x14B0 (0x14B0 - 0x0000)
struct BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ISurvInterface_C>      K2Node_DynamicCast_AsSurv_Interface;               // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_State;                                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bNewVisibility;                 // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Equip;                          // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_V2_C*                   K2Node_DynamicCast_AsSurvival_Player_V2;           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ISurvInterface_C>      K2Node_DynamicCast_AsSurv_Interface_1;             // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_2;            // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_3;            // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x008C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBPS_DamageInfo>                K2Node_CustomEvent_HitInfo;                        // 0x00A0(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	bool                                          K2Node_CustomEvent_Fire;                           // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_V2_C*                   K2Node_DynamicCast_AsSurvival_Player_V2_1;         // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_4;            // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_5;            // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_6;            // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBPS_WeaponData                        K2Node_CustomEvent_WeaponData;                     // 0x0118(0x04C0)(HasGetValueTypeHash)
	class UJSI_Slot_C*                            K2Node_CustomEvent_ItemState;                      // 0x05D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFItemInfo                             K2Node_CustomEvent_Weapon_ItemInfo;                // 0x05E0(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0800(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_801[0x7];                                      // 0x0801(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_PlayerWeaponAnim                    CallFunc_GetDataTableRowFromName_OutRow;           // 0x0808(0x0088)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0890(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Aim;                                  // 0x0891(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0892(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0893(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_894[0x4];                                      // 0x0894(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0898(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ENetRole                                      CallFunc_GetLocalRole_ReturnValue;                 // 0x08A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x08A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A2[0x2];                                      // 0x08A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x08A4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B4[0x4];                                      // 0x08B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_PickEquipAnim_ReturnValue;                // 0x08B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_PickEquipAnim_ReturnValue_1;              // 0x08C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x08C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C9[0x3];                                      // 0x08C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPlayLength_ReturnValue;                // 0x08CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x08D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x08D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InPhase_Return;                           // 0x08D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x08DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8DB[0x5];                                      // 0x08DB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_PickEquipAnim_ReturnValue_2;              // 0x08E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_PickEquipAnim_ReturnValue_3;              // 0x08E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x08F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x08F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8F2[0x6];                                      // 0x08F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_PickEquipAnim_ReturnValue_4;              // 0x08F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0900(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_901[0x7];                                      // 0x0901(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0908(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_GI_Survival_C>      K2Node_DynamicCast_AsI_GI_Survival;                // 0x0910(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0920(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0921(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsFemale_IsFemale;                     // 0x0922(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_923[0x5];                                      // 0x0923(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0928(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_2;            // 0x0930(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_GI_Survival_C>      K2Node_DynamicCast_AsI_GI_Survival_1;              // 0x0938(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0948(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_949[0x7];                                      // 0x0949(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_GI_Survival_C>      K2Node_DynamicCast_AsI_GI_Survival_2;              // 0x0950(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0960(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsFemale_IsFemale_1;                   // 0x0961(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsFemale_IsFemale_2;                   // 0x0962(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_963[0x5];                                      // 0x0963(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_3;            // 0x0968(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_GI_Survival_C>      K2Node_DynamicCast_AsI_GI_Survival_3;              // 0x0970(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0980(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_1;        // 0x0981(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsFemale_IsFemale_3;                   // 0x0982(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_983[0x5];                                      // 0x0983(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0988(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0990(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0998(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_999[0x3];                                      // 0x0999(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x099C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A4[0xC];                                      // 0x09A4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x09B0(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0A10(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Weapon_C*                           CallFunc_FinishSpawningActor_ReturnValue;          // 0x0A18(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0A20(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Trigger;                        // 0x0A21(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A22[0x6];                                      // 0x0A22(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_7;            // 0x0A28(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FBPS_WeaponData                        K2Node_CustomEvent_WeaponData_1;                   // 0x0A30(0x04C0)(HasGetValueTypeHash)
	class UJSI_Slot_C*                            K2Node_CustomEvent_ItemState_1;                    // 0x0EF0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFItemInfo                             K2Node_CustomEvent_Weapon_ItemInfo_1;              // 0x0EF8(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x1118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1119[0x7];                                     // 0x1119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFMODEvent*                             K2Node_Event_TailSound;                            // 0x1120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_RecoilPower;                          // 0x1128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Weapon_C*                           K2Node_Event_NewParam;                             // 0x1130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_WeaponName;                           // 0x1138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x1140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x1141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1142[0x2];                                     // 0x1142(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x1144(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x1154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1155[0x3];                                     // 0x1155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x1158(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_V2_C*                   K2Node_DynamicCast_AsSurvival_Player_V2_2;         // 0x1168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x1170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1171[0x7];                                     // 0x1171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_8;            // 0x1178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ISurvInterface_C>      K2Node_DynamicCast_AsSurv_Interface_2;             // 0x1180(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x1190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1191[0x7];                                     // 0x1191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x1198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x11A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x11A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11A2[0x6];                                     // 0x11A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_9;            // 0x11A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_PlayerWeaponAnim                    CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x11B0(0x0088)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x1238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1239[0x7];                                     // 0x1239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_PlayerWeaponAnim                    CallFunc_GetDataTableRowFromName_OutRow_2;         // 0x1240(0x0088)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_2;    // 0x12C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C9[0x7];                                     // 0x12C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_PlayerWeaponAnim                    CallFunc_GetDataTableRowFromName_OutRow_3;         // 0x12D0(0x0088)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_3;    // 0x1358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1359[0x3];                                     // 0x1359(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x135C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x1364(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1365[0x3];                                     // 0x1365(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x1368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x1370(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x1380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x1388(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x1398(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x13A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x13A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue_1;                     // 0x13B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameHUD_C>        K2Node_DynamicCast_AsBPI_Game_HUD;                 // 0x13B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x13C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C9[0x7];                                     // 0x13C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_GameHUD_C>        K2Node_DynamicCast_AsBPI_Game_HUD_1;               // 0x13D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x13E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13E1[0x3];                                     // 0x13E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x13E4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13EC[0x4];                                     // 0x13EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_PickUnequipAnim2_NewParam;                // 0x13F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x13F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_PickUnequipAnim2_NewParam_1;              // 0x1400(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x1408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x1409(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_140A[0x6];                                     // 0x140A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_PickUnequipAnim2_NewParam_2;              // 0x1410(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_Select_Default;                             // 0x1418(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_PickUnequipAnim2_NewParam_3;              // 0x1420(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x1428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1429[0x7];                                     // 0x1429(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_PickUnequipAnim2_NewParam_4;              // 0x1430(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_PickUnequipAnim2_NewParam_5;              // 0x1438(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_6;            // 0x1440(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x1450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x1458(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_13;                    // 0x1460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1461[0x7];                                     // 0x1461(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player_1;            // 0x1468(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_14;                    // 0x1470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1471[0x7];                                     // 0x1471(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWeaponAnimAsset*                       K2Node_Select_Default_1;                           // 0x1478(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWeaponAnimAsset*                       K2Node_Select_Default_2;                           // 0x1480(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWeaponAnimAsset*                       K2Node_Select_Default_3;                           // 0x1488(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWeaponAnimAsset*                       K2Node_Select_Default_4;                           // 0x1490(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CreateProxyObjectForPlayMontage_PlayRate_ImplicitCast; // 0x1498(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149C[0x4];                                     // 0x149C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x14A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RetriggerableDelay_Duration_ImplicitCast; // 0x14A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment) == 0x000010, "Wrong alignment on BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment");
static_assert(sizeof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment) == 0x0014B0, "Wrong size on BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, EntryPoint) == 0x000000, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, CallFunc_GetAnimInstance_ReturnValue) == 0x000008, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, K2Node_DynamicCast_AsSurv_Interface) == 0x000010, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::K2Node_DynamicCast_AsSurv_Interface' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, K2Node_Event_State) == 0x000021, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, K2Node_CustomEvent_bNewVisibility) == 0x000022, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::K2Node_CustomEvent_bNewVisibility' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, K2Node_CustomEvent_Equip) == 0x000023, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::K2Node_CustomEvent_Equip' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, K2Node_CustomEvent_NotifyName_4) == 0x000024, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000030, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, K2Node_DynamicCast_AsSurvival_Player_V2) == 0x000040, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::K2Node_DynamicCast_AsSurvival_Player_V2' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, CallFunc_GetAnimInstance_ReturnValue_1) == 0x000050, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000058, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, K2Node_DynamicCast_AsSurv_Interface_1) == 0x000060, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::K2Node_DynamicCast_AsSurv_Interface_1' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, K2Node_DynamicCast_bSuccess_2) == 0x000070, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, CallFunc_GetAnimInstance_ReturnValue_2) == 0x000078, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::CallFunc_GetAnimInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, CallFunc_GetAnimInstance_ReturnValue_3) == 0x000080, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::CallFunc_GetAnimInstance_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000088, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, CallFunc_IsValid_ReturnValue_1) == 0x000089, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, K2Node_CreateDelegate_OutputDelegate) == 0x00008C, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, K2Node_CustomEvent_HitInfo) == 0x0000A0, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::K2Node_CustomEvent_HitInfo' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, K2Node_CustomEvent_Fire) == 0x0000B0, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::K2Node_CustomEvent_Fire' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, K2Node_DynamicCast_AsSurvival_Player_V2_1) == 0x0000B8, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::K2Node_DynamicCast_AsSurvival_Player_V2_1' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, K2Node_DynamicCast_bSuccess_3) == 0x0000C0, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0000C8, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, CallFunc_GetAnimInstance_ReturnValue_4) == 0x0000D0, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::CallFunc_GetAnimInstance_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0000D8, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, CallFunc_GetAnimInstance_ReturnValue_5) == 0x0000E0, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::CallFunc_GetAnimInstance_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, CallFunc_GetVelocity_ReturnValue) == 0x0000E8, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, CallFunc_VSize_ReturnValue) == 0x000100, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, CallFunc_GetAnimInstance_ReturnValue_6) == 0x000108, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::CallFunc_GetAnimInstance_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000110, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, K2Node_CustomEvent_WeaponData) == 0x000118, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::K2Node_CustomEvent_WeaponData' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, K2Node_CustomEvent_ItemState) == 0x0005D8, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::K2Node_CustomEvent_ItemState' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, K2Node_CustomEvent_Weapon_ItemInfo) == 0x0005E0, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::K2Node_CustomEvent_Weapon_ItemInfo' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, CallFunc_IsValid_ReturnValue_2) == 0x000800, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, CallFunc_GetDataTableRowFromName_OutRow) == 0x000808, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000890, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, K2Node_Event_Aim) == 0x000891, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::K2Node_Event_Aim' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, CallFunc_IsValid_ReturnValue_3) == 0x000892, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000893, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, CallFunc_GetOwner_ReturnValue) == 0x000898, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, CallFunc_GetLocalRole_ReturnValue) == 0x0008A0, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::CallFunc_GetLocalRole_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x0008A1, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, K2Node_CreateDelegate_OutputDelegate_1) == 0x0008A4, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, CallFunc_PickEquipAnim_ReturnValue) == 0x0008B8, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::CallFunc_PickEquipAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, CallFunc_PickEquipAnim_ReturnValue_1) == 0x0008C0, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::CallFunc_PickEquipAnim_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, CallFunc_IsValid_ReturnValue_4) == 0x0008C8, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, CallFunc_GetPlayLength_ReturnValue) == 0x0008CC, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::CallFunc_GetPlayLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x0008D0, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, CallFunc_IsLocallyControlled_ReturnValue) == 0x0008D8, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, CallFunc_InPhase_Return) == 0x0008D9, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::CallFunc_InPhase_Return' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, CallFunc_Not_PreBool_ReturnValue) == 0x0008DA, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, CallFunc_PickEquipAnim_ReturnValue_2) == 0x0008E0, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::CallFunc_PickEquipAnim_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, CallFunc_PickEquipAnim_ReturnValue_3) == 0x0008E8, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::CallFunc_PickEquipAnim_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, CallFunc_IsValid_ReturnValue_5) == 0x0008F0, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, CallFunc_IsValid_ReturnValue_6) == 0x0008F1, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, CallFunc_PickEquipAnim_ReturnValue_4) == 0x0008F8, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::CallFunc_PickEquipAnim_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, CallFunc_IsDedicatedServer_ReturnValue) == 0x000900, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, CallFunc_GetGameInstance_ReturnValue) == 0x000908, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, K2Node_DynamicCast_AsI_GI_Survival) == 0x000910, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::K2Node_DynamicCast_AsI_GI_Survival' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, K2Node_DynamicCast_bSuccess_4) == 0x000920, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, Temp_bool_Variable) == 0x000921, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, CallFunc_GetIsFemale_IsFemale) == 0x000922, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::CallFunc_GetIsFemale_IsFemale' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, CallFunc_GetGameInstance_ReturnValue_1) == 0x000928, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, CallFunc_GetGameInstance_ReturnValue_2) == 0x000930, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::CallFunc_GetGameInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, K2Node_DynamicCast_AsI_GI_Survival_1) == 0x000938, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::K2Node_DynamicCast_AsI_GI_Survival_1' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, K2Node_DynamicCast_bSuccess_5) == 0x000948, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, K2Node_DynamicCast_AsI_GI_Survival_2) == 0x000950, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::K2Node_DynamicCast_AsI_GI_Survival_2' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, K2Node_DynamicCast_bSuccess_6) == 0x000960, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, CallFunc_GetIsFemale_IsFemale_1) == 0x000961, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::CallFunc_GetIsFemale_IsFemale_1' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, CallFunc_GetIsFemale_IsFemale_2) == 0x000962, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::CallFunc_GetIsFemale_IsFemale_2' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, CallFunc_GetGameInstance_ReturnValue_3) == 0x000968, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::CallFunc_GetGameInstance_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, K2Node_DynamicCast_AsI_GI_Survival_3) == 0x000970, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::K2Node_DynamicCast_AsI_GI_Survival_3' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, K2Node_DynamicCast_bSuccess_7) == 0x000980, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, CallFunc_IsLocallyControlled_ReturnValue_1) == 0x000981, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::CallFunc_IsLocallyControlled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, CallFunc_GetIsFemale_IsFemale_3) == 0x000982, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::CallFunc_GetIsFemale_IsFemale_3' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, CallFunc_GetOwner_ReturnValue_1) == 0x000988, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, K2Node_DynamicCast_AsCharacter) == 0x000990, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, K2Node_DynamicCast_bSuccess_8) == 0x000998, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, K2Node_CustomEvent_NotifyName_3) == 0x00099C, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, CallFunc_GetTransform_ReturnValue) == 0x0009B0, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000A10, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, CallFunc_FinishSpawningActor_ReturnValue) == 0x000A18, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, CallFunc_IsValid_ReturnValue_7) == 0x000A20, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, K2Node_CustomEvent_Trigger) == 0x000A21, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::K2Node_CustomEvent_Trigger' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, CallFunc_GetAnimInstance_ReturnValue_7) == 0x000A28, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::CallFunc_GetAnimInstance_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, K2Node_CustomEvent_WeaponData_1) == 0x000A30, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::K2Node_CustomEvent_WeaponData_1' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, K2Node_CustomEvent_ItemState_1) == 0x000EF0, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::K2Node_CustomEvent_ItemState_1' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, K2Node_CustomEvent_Weapon_ItemInfo_1) == 0x000EF8, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::K2Node_CustomEvent_Weapon_ItemInfo_1' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x001118, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, K2Node_Event_TailSound) == 0x001120, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::K2Node_Event_TailSound' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, K2Node_Event_RecoilPower) == 0x001128, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::K2Node_Event_RecoilPower' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, K2Node_Event_NewParam) == 0x001130, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::K2Node_Event_NewParam' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, K2Node_Event_WeaponName) == 0x001138, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::K2Node_Event_WeaponName' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, Temp_bool_Variable_1) == 0x001140, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, Temp_bool_Variable_2) == 0x001141, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, K2Node_CreateDelegate_OutputDelegate_2) == 0x001144, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, CallFunc_IsValid_ReturnValue_8) == 0x001154, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment, K2Node_CreateDelegate_OutputDelegate_3) == 0x001158, "Member 'BPC_Equipment_C_ExecuteUbergraph_BPC_Equipment::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
