#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_TAAManager

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPC_TAAManager.BPC_TAAManager_C.ExecuteUbergraph_BPC_TAAManager
// 0x0008 (0x0008 - 0x0000)
struct BPC_TAAManager_C_ExecuteUbergraph_BPC_TAAManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_TAAManager_C_ExecuteUbergraph_BPC_TAAManager) == 0x000004, "Wrong alignment on BPC_TAAManager_C_ExecuteUbergraph_BPC_TAAManager");
static_assert(sizeof(BPC_TAAManager_C_ExecuteUbergraph_BPC_TAAManager) == 0x000008, "Wrong size on BPC_TAAManager_C_ExecuteUbergraph_BPC_TAAManager");
static_assert(offsetof(BPC_TAAManager_C_ExecuteUbergraph_BPC_TAAManager, EntryPoint) == 0x000000, "Member 'BPC_TAAManager_C_ExecuteUbergraph_BPC_TAAManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPC_TAAManager_C_ExecuteUbergraph_BPC_TAAManager, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BPC_TAAManager_C_ExecuteUbergraph_BPC_TAAManager::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function BPC_TAAManager.BPC_TAAManager_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BPC_TAAManager_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_TAAManager_C_ReceiveTick) == 0x000004, "Wrong alignment on BPC_TAAManager_C_ReceiveTick");
static_assert(sizeof(BPC_TAAManager_C_ReceiveTick) == 0x000004, "Wrong size on BPC_TAAManager_C_ReceiveTick");
static_assert(offsetof(BPC_TAAManager_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BPC_TAAManager_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

