#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_BarPlayerComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPC_BarPlayerComponent.BPC_BarPlayerComponent_C.CollisionSwitcher
// 0x0006 (0x0006 - 0x0000)
struct BPC_BarPlayerComponent_C_CollisionSwitcher final
{
public:
	bool                                          On_;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_BarPlayerComponent_C_CollisionSwitcher) == 0x000001, "Wrong alignment on BPC_BarPlayerComponent_C_CollisionSwitcher");
static_assert(sizeof(BPC_BarPlayerComponent_C_CollisionSwitcher) == 0x000006, "Wrong size on BPC_BarPlayerComponent_C_CollisionSwitcher");
static_assert(offsetof(BPC_BarPlayerComponent_C_CollisionSwitcher, On_) == 0x000000, "Member 'BPC_BarPlayerComponent_C_CollisionSwitcher::On_' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_CollisionSwitcher, Temp_bool_Variable) == 0x000001, "Member 'BPC_BarPlayerComponent_C_CollisionSwitcher::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_CollisionSwitcher, Temp_byte_Variable) == 0x000002, "Member 'BPC_BarPlayerComponent_C_CollisionSwitcher::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_CollisionSwitcher, Temp_byte_Variable_1) == 0x000003, "Member 'BPC_BarPlayerComponent_C_CollisionSwitcher::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_CollisionSwitcher, K2Node_Select_Default) == 0x000004, "Member 'BPC_BarPlayerComponent_C_CollisionSwitcher::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_CollisionSwitcher, CallFunc_IsLocallyControlled_ReturnValue) == 0x000005, "Member 'BPC_BarPlayerComponent_C_CollisionSwitcher::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");

// Function BPC_BarPlayerComponent.BPC_BarPlayerComponent_C.ExecuteUbergraph_BPC_BarPlayerComponent
// 0x0480 (0x0480 - 0x0000)
struct BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x005C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x0074(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0084(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           Temp_object_Variable;                              // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Temp_object_Variable_1;                            // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_GameHUD_C*                          K2Node_DynamicCast_AsBP_Game_HUD;                  // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 PlaceIndex)>             K2Node_CreateDelegate_OutputDelegate_5;            // 0x00DC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_1;        // 0x00ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_On__1;                          // 0x00EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EF[0x1];                                       // 0x00EF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class ABarParent_C*                           K2Node_CustomEvent_Sofa_1;                         // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Sit;                            // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_FindEmptySlot_Output;                     // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FindEmptySlot_Index;                      // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival;                  // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_2;        // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_3;        // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_4;        // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_133[0x5];                                      // 0x0133(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UAnimMontage*                     K2Node_Select_Default;                             // 0x0140(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0198(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInHouse_ReturnValue;                    // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival_1;                // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1[0x3];                                      // 0x02A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Select_Default_1;                           // 0x02A4(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_5;        // 0x02AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AE[0x2];                                      // 0x02AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue_1;                     // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_GameHUD_C*                          K2Node_DynamicCast_AsBP_Game_HUD_1;                // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_6;        // 0x02D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D2[0x6];                                      // 0x02D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USceneComponent*>                K2Node_MakeArray_Array;                            // 0x02D8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USceneComponent*                        CallFunc_Array_Get_Item;                           // 0x02E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x02F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue_1;    // 0x0308(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_1;        // 0x0320(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_TeleportTo_ReturnValue;                // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue_1;        // 0x0339(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33A[0x6];                                      // 0x033A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult_1;     // 0x0340(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue_1;        // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_429[0x7];                                      // 0x0429(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_2;            // 0x0430(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival_2;                // 0x0438(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_441[0x7];                                      // 0x0441(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_Select_Default_2;                           // 0x0448(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x0450(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_7;        // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0459(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_8;        // 0x045A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Sit_;                           // 0x045B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45C[0x4];                                      // 0x045C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AChairParent_C*                         K2Node_CustomEvent_Chair;                          // 0x0460(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_On_;                            // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_469[0x7];                                      // 0x0469(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABarParent_C*                           K2Node_CustomEvent_Sofa;                           // 0x0470(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Index;                          // 0x0478(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_TeleportTo_ReturnValue_1;              // 0x047C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent) == 0x000008, "Wrong alignment on BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent");
static_assert(sizeof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent) == 0x000480, "Wrong size on BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, EntryPoint) == 0x000000, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, Temp_struct_Variable) == 0x000004, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, K2Node_CustomEvent_NotifyName_4) == 0x00001C, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, K2Node_CustomEvent_NotifyName_3) == 0x000024, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, K2Node_CreateDelegate_OutputDelegate_1) == 0x00002C, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, K2Node_CustomEvent_NotifyName_2) == 0x00003C, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, K2Node_CreateDelegate_OutputDelegate_2) == 0x000044, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, K2Node_CustomEvent_NotifyName_1) == 0x000054, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, K2Node_CreateDelegate_OutputDelegate_3) == 0x00005C, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, K2Node_CustomEvent_NotifyName) == 0x00006C, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, K2Node_CreateDelegate_OutputDelegate_4) == 0x000074, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, Temp_name_Variable) == 0x000084, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, Temp_bool_Variable) == 0x00008C, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, Temp_object_Variable) == 0x000090, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, Temp_object_Variable_1) == 0x000098, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, Temp_bool_Variable_1) == 0x0000A0, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, CallFunc_GetPlayerController_ReturnValue) == 0x0000A8, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, CallFunc_GetHUD_ReturnValue) == 0x0000B0, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, K2Node_DynamicCast_AsBP_Game_HUD) == 0x0000B8, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::K2Node_DynamicCast_AsBP_Game_HUD' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, K2Node_DynamicCast_bSuccess) == 0x0000C0, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, Temp_bool_Variable_2) == 0x0000C1, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, CallFunc_GetOwner_ReturnValue) == 0x0000C8, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, K2Node_DynamicCast_AsSurvival_Player) == 0x0000D0, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, K2Node_DynamicCast_bSuccess_1) == 0x0000D8, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, K2Node_CreateDelegate_OutputDelegate_5) == 0x0000DC, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, CallFunc_IsLocallyControlled_ReturnValue) == 0x0000EC, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, CallFunc_IsLocallyControlled_ReturnValue_1) == 0x0000ED, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::CallFunc_IsLocallyControlled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, K2Node_CustomEvent_On__1) == 0x0000EE, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::K2Node_CustomEvent_On__1' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, K2Node_CustomEvent_Sofa_1) == 0x0000F0, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::K2Node_CustomEvent_Sofa_1' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, K2Node_CustomEvent_Sit) == 0x0000F8, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::K2Node_CustomEvent_Sit' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, CallFunc_FindEmptySlot_Output) == 0x000100, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::CallFunc_FindEmptySlot_Output' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, CallFunc_FindEmptySlot_Index) == 0x000108, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::CallFunc_FindEmptySlot_Index' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00010C, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, CallFunc_GetGameInstance_ReturnValue) == 0x000110, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, K2Node_DynamicCast_AsGI_Survival) == 0x000118, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::K2Node_DynamicCast_AsGI_Survival' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, K2Node_DynamicCast_bSuccess_2) == 0x000120, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, CallFunc_GetPlayerController_ReturnValue_1) == 0x000128, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, CallFunc_IsLocallyControlled_ReturnValue_2) == 0x000130, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::CallFunc_IsLocallyControlled_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, CallFunc_IsLocallyControlled_ReturnValue_3) == 0x000131, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::CallFunc_IsLocallyControlled_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, CallFunc_IsLocallyControlled_ReturnValue_4) == 0x000132, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::CallFunc_IsLocallyControlled_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, CallFunc_GetAnimInstance_ReturnValue) == 0x000138, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, K2Node_Select_Default) == 0x000140, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000148, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000160, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000178, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, CallFunc_K2_SetActorRotation_ReturnValue) == 0x000190, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000198, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000280, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, CallFunc_GetGameInstance_ReturnValue_1) == 0x000288, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, CallFunc_IsInHouse_ReturnValue) == 0x000290, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::CallFunc_IsInHouse_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, K2Node_DynamicCast_AsGI_Survival_1) == 0x000298, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::K2Node_DynamicCast_AsGI_Survival_1' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, K2Node_DynamicCast_bSuccess_3) == 0x0002A0, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, K2Node_Select_Default_1) == 0x0002A4, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, CallFunc_IsLocallyControlled_ReturnValue_5) == 0x0002AC, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::CallFunc_IsLocallyControlled_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, CallFunc_IsValid_ReturnValue) == 0x0002AD, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, CallFunc_GetPlayerController_ReturnValue_2) == 0x0002B0, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, CallFunc_GetPlayerController_ReturnValue_3) == 0x0002B8, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, CallFunc_GetHUD_ReturnValue_1) == 0x0002C0, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::CallFunc_GetHUD_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, K2Node_DynamicCast_AsBP_Game_HUD_1) == 0x0002C8, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::K2Node_DynamicCast_AsBP_Game_HUD_1' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, K2Node_DynamicCast_bSuccess_4) == 0x0002D0, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, CallFunc_IsLocallyControlled_ReturnValue_6) == 0x0002D1, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::CallFunc_IsLocallyControlled_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, K2Node_MakeArray_Array) == 0x0002D8, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, CallFunc_Array_Get_Item) == 0x0002E8, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x0002F0, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, CallFunc_K2_GetComponentRotation_ReturnValue_1) == 0x000308, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::CallFunc_K2_GetComponentRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, CallFunc_K2_GetActorRotation_ReturnValue_1) == 0x000320, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::CallFunc_K2_GetActorRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, CallFunc_K2_TeleportTo_ReturnValue) == 0x000338, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::CallFunc_K2_TeleportTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, CallFunc_K2_SetActorRotation_ReturnValue_1) == 0x000339, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::CallFunc_K2_SetActorRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, CallFunc_K2_SetActorLocation_SweepHitResult_1) == 0x000340, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::CallFunc_K2_SetActorLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, CallFunc_K2_SetActorLocation_ReturnValue_1) == 0x000428, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::CallFunc_K2_SetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, CallFunc_GetGameInstance_ReturnValue_2) == 0x000430, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::CallFunc_GetGameInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, K2Node_DynamicCast_AsGI_Survival_2) == 0x000438, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::K2Node_DynamicCast_AsGI_Survival_2' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, K2Node_DynamicCast_bSuccess_5) == 0x000440, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, K2Node_Select_Default_2) == 0x000448, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x000450, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, CallFunc_IsLocallyControlled_ReturnValue_7) == 0x000458, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::CallFunc_IsLocallyControlled_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, CallFunc_IsValid_ReturnValue_1) == 0x000459, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, CallFunc_IsLocallyControlled_ReturnValue_8) == 0x00045A, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::CallFunc_IsLocallyControlled_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, K2Node_CustomEvent_Sit_) == 0x00045B, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::K2Node_CustomEvent_Sit_' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, K2Node_CustomEvent_Chair) == 0x000460, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::K2Node_CustomEvent_Chair' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, K2Node_CustomEvent_On_) == 0x000468, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::K2Node_CustomEvent_On_' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, K2Node_CustomEvent_Sofa) == 0x000470, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::K2Node_CustomEvent_Sofa' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, K2Node_CustomEvent_Index) == 0x000478, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::K2Node_CustomEvent_Index' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent, CallFunc_K2_TeleportTo_ReturnValue_1) == 0x00047C, "Member 'BPC_BarPlayerComponent_C_ExecuteUbergraph_BPC_BarPlayerComponent::CallFunc_K2_TeleportTo_ReturnValue_1' has a wrong offset!");

// Function BPC_BarPlayerComponent.BPC_BarPlayerComponent_C.MultiSofa
// 0x0018 (0x0018 - 0x0000)
struct BPC_BarPlayerComponent_C_MultiSofa final
{
public:
	bool                                          On_;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABarParent_C*                           Param_Sofa;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_BarPlayerComponent_C_MultiSofa) == 0x000008, "Wrong alignment on BPC_BarPlayerComponent_C_MultiSofa");
static_assert(sizeof(BPC_BarPlayerComponent_C_MultiSofa) == 0x000018, "Wrong size on BPC_BarPlayerComponent_C_MultiSofa");
static_assert(offsetof(BPC_BarPlayerComponent_C_MultiSofa, On_) == 0x000000, "Member 'BPC_BarPlayerComponent_C_MultiSofa::On_' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_MultiSofa, Param_Sofa) == 0x000008, "Member 'BPC_BarPlayerComponent_C_MultiSofa::Param_Sofa' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_MultiSofa, Param_Index) == 0x000010, "Member 'BPC_BarPlayerComponent_C_MultiSofa::Param_Index' has a wrong offset!");

// Function BPC_BarPlayerComponent.BPC_BarPlayerComponent_C.OnBlendOut_2151BB334E81EB7F3A46A98C59275EBA
// 0x0008 (0x0008 - 0x0000)
struct BPC_BarPlayerComponent_C_OnBlendOut_2151BB334E81EB7F3A46A98C59275EBA final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_BarPlayerComponent_C_OnBlendOut_2151BB334E81EB7F3A46A98C59275EBA) == 0x000004, "Wrong alignment on BPC_BarPlayerComponent_C_OnBlendOut_2151BB334E81EB7F3A46A98C59275EBA");
static_assert(sizeof(BPC_BarPlayerComponent_C_OnBlendOut_2151BB334E81EB7F3A46A98C59275EBA) == 0x000008, "Wrong size on BPC_BarPlayerComponent_C_OnBlendOut_2151BB334E81EB7F3A46A98C59275EBA");
static_assert(offsetof(BPC_BarPlayerComponent_C_OnBlendOut_2151BB334E81EB7F3A46A98C59275EBA, NotifyName) == 0x000000, "Member 'BPC_BarPlayerComponent_C_OnBlendOut_2151BB334E81EB7F3A46A98C59275EBA::NotifyName' has a wrong offset!");

// Function BPC_BarPlayerComponent.BPC_BarPlayerComponent_C.OnCompleted_2151BB334E81EB7F3A46A98C59275EBA
// 0x0008 (0x0008 - 0x0000)
struct BPC_BarPlayerComponent_C_OnCompleted_2151BB334E81EB7F3A46A98C59275EBA final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_BarPlayerComponent_C_OnCompleted_2151BB334E81EB7F3A46A98C59275EBA) == 0x000004, "Wrong alignment on BPC_BarPlayerComponent_C_OnCompleted_2151BB334E81EB7F3A46A98C59275EBA");
static_assert(sizeof(BPC_BarPlayerComponent_C_OnCompleted_2151BB334E81EB7F3A46A98C59275EBA) == 0x000008, "Wrong size on BPC_BarPlayerComponent_C_OnCompleted_2151BB334E81EB7F3A46A98C59275EBA");
static_assert(offsetof(BPC_BarPlayerComponent_C_OnCompleted_2151BB334E81EB7F3A46A98C59275EBA, NotifyName) == 0x000000, "Member 'BPC_BarPlayerComponent_C_OnCompleted_2151BB334E81EB7F3A46A98C59275EBA::NotifyName' has a wrong offset!");

// Function BPC_BarPlayerComponent.BPC_BarPlayerComponent_C.OnInterrupted_2151BB334E81EB7F3A46A98C59275EBA
// 0x0008 (0x0008 - 0x0000)
struct BPC_BarPlayerComponent_C_OnInterrupted_2151BB334E81EB7F3A46A98C59275EBA final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_BarPlayerComponent_C_OnInterrupted_2151BB334E81EB7F3A46A98C59275EBA) == 0x000004, "Wrong alignment on BPC_BarPlayerComponent_C_OnInterrupted_2151BB334E81EB7F3A46A98C59275EBA");
static_assert(sizeof(BPC_BarPlayerComponent_C_OnInterrupted_2151BB334E81EB7F3A46A98C59275EBA) == 0x000008, "Wrong size on BPC_BarPlayerComponent_C_OnInterrupted_2151BB334E81EB7F3A46A98C59275EBA");
static_assert(offsetof(BPC_BarPlayerComponent_C_OnInterrupted_2151BB334E81EB7F3A46A98C59275EBA, NotifyName) == 0x000000, "Member 'BPC_BarPlayerComponent_C_OnInterrupted_2151BB334E81EB7F3A46A98C59275EBA::NotifyName' has a wrong offset!");

// Function BPC_BarPlayerComponent.BPC_BarPlayerComponent_C.OnNotifyBegin_2151BB334E81EB7F3A46A98C59275EBA
// 0x0008 (0x0008 - 0x0000)
struct BPC_BarPlayerComponent_C_OnNotifyBegin_2151BB334E81EB7F3A46A98C59275EBA final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_BarPlayerComponent_C_OnNotifyBegin_2151BB334E81EB7F3A46A98C59275EBA) == 0x000004, "Wrong alignment on BPC_BarPlayerComponent_C_OnNotifyBegin_2151BB334E81EB7F3A46A98C59275EBA");
static_assert(sizeof(BPC_BarPlayerComponent_C_OnNotifyBegin_2151BB334E81EB7F3A46A98C59275EBA) == 0x000008, "Wrong size on BPC_BarPlayerComponent_C_OnNotifyBegin_2151BB334E81EB7F3A46A98C59275EBA");
static_assert(offsetof(BPC_BarPlayerComponent_C_OnNotifyBegin_2151BB334E81EB7F3A46A98C59275EBA, NotifyName) == 0x000000, "Member 'BPC_BarPlayerComponent_C_OnNotifyBegin_2151BB334E81EB7F3A46A98C59275EBA::NotifyName' has a wrong offset!");

// Function BPC_BarPlayerComponent.BPC_BarPlayerComponent_C.OnNotifyEnd_2151BB334E81EB7F3A46A98C59275EBA
// 0x0008 (0x0008 - 0x0000)
struct BPC_BarPlayerComponent_C_OnNotifyEnd_2151BB334E81EB7F3A46A98C59275EBA final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_BarPlayerComponent_C_OnNotifyEnd_2151BB334E81EB7F3A46A98C59275EBA) == 0x000004, "Wrong alignment on BPC_BarPlayerComponent_C_OnNotifyEnd_2151BB334E81EB7F3A46A98C59275EBA");
static_assert(sizeof(BPC_BarPlayerComponent_C_OnNotifyEnd_2151BB334E81EB7F3A46A98C59275EBA) == 0x000008, "Wrong size on BPC_BarPlayerComponent_C_OnNotifyEnd_2151BB334E81EB7F3A46A98C59275EBA");
static_assert(offsetof(BPC_BarPlayerComponent_C_OnNotifyEnd_2151BB334E81EB7F3A46A98C59275EBA, NotifyName) == 0x000000, "Member 'BPC_BarPlayerComponent_C_OnNotifyEnd_2151BB334E81EB7F3A46A98C59275EBA::NotifyName' has a wrong offset!");

// Function BPC_BarPlayerComponent.BPC_BarPlayerComponent_C.ReplicateSwitcher
// 0x0020 (0x0020 - 0x0000)
struct BPC_BarPlayerComponent_C_ReplicateSwitcher final
{
public:
	bool                                          Off_;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            Temp_byte_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            Temp_byte_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USurviveAnimator2_C*                    K2Node_DynamicCast_AsSurvive_Animator_2;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_BarPlayerComponent_C_ReplicateSwitcher) == 0x000008, "Wrong alignment on BPC_BarPlayerComponent_C_ReplicateSwitcher");
static_assert(sizeof(BPC_BarPlayerComponent_C_ReplicateSwitcher) == 0x000020, "Wrong size on BPC_BarPlayerComponent_C_ReplicateSwitcher");
static_assert(offsetof(BPC_BarPlayerComponent_C_ReplicateSwitcher, Off_) == 0x000000, "Member 'BPC_BarPlayerComponent_C_ReplicateSwitcher::Off_' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ReplicateSwitcher, Temp_bool_Variable) == 0x000001, "Member 'BPC_BarPlayerComponent_C_ReplicateSwitcher::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ReplicateSwitcher, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'BPC_BarPlayerComponent_C_ReplicateSwitcher::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ReplicateSwitcher, Temp_byte_Variable) == 0x000003, "Member 'BPC_BarPlayerComponent_C_ReplicateSwitcher::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ReplicateSwitcher, Temp_byte_Variable_1) == 0x000004, "Member 'BPC_BarPlayerComponent_C_ReplicateSwitcher::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ReplicateSwitcher, K2Node_Select_Default) == 0x000005, "Member 'BPC_BarPlayerComponent_C_ReplicateSwitcher::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ReplicateSwitcher, CallFunc_GetAnimInstance_ReturnValue) == 0x000008, "Member 'BPC_BarPlayerComponent_C_ReplicateSwitcher::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ReplicateSwitcher, K2Node_DynamicCast_AsSurvive_Animator_2) == 0x000010, "Member 'BPC_BarPlayerComponent_C_ReplicateSwitcher::K2Node_DynamicCast_AsSurvive_Animator_2' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ReplicateSwitcher, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BPC_BarPlayerComponent_C_ReplicateSwitcher::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BPC_BarPlayerComponent.BPC_BarPlayerComponent_C.ServerChair
// 0x0010 (0x0010 - 0x0000)
struct BPC_BarPlayerComponent_C_ServerChair final
{
public:
	bool                                          Sit_;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AChairParent_C*                         Chair;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_BarPlayerComponent_C_ServerChair) == 0x000008, "Wrong alignment on BPC_BarPlayerComponent_C_ServerChair");
static_assert(sizeof(BPC_BarPlayerComponent_C_ServerChair) == 0x000010, "Wrong size on BPC_BarPlayerComponent_C_ServerChair");
static_assert(offsetof(BPC_BarPlayerComponent_C_ServerChair, Sit_) == 0x000000, "Member 'BPC_BarPlayerComponent_C_ServerChair::Sit_' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ServerChair, Chair) == 0x000008, "Member 'BPC_BarPlayerComponent_C_ServerChair::Chair' has a wrong offset!");

// Function BPC_BarPlayerComponent.BPC_BarPlayerComponent_C.ServerSofa
// 0x0010 (0x0010 - 0x0000)
struct BPC_BarPlayerComponent_C_ServerSofa final
{
public:
	bool                                          On_;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABarParent_C*                           Param_Sofa;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_BarPlayerComponent_C_ServerSofa) == 0x000008, "Wrong alignment on BPC_BarPlayerComponent_C_ServerSofa");
static_assert(sizeof(BPC_BarPlayerComponent_C_ServerSofa) == 0x000010, "Wrong size on BPC_BarPlayerComponent_C_ServerSofa");
static_assert(offsetof(BPC_BarPlayerComponent_C_ServerSofa, On_) == 0x000000, "Member 'BPC_BarPlayerComponent_C_ServerSofa::On_' has a wrong offset!");
static_assert(offsetof(BPC_BarPlayerComponent_C_ServerSofa, Param_Sofa) == 0x000008, "Member 'BPC_BarPlayerComponent_C_ServerSofa::Param_Sofa' has a wrong offset!");

// Function BPC_BarPlayerComponent.BPC_BarPlayerComponent_C.SitEventLogic
// 0x0001 (0x0001 - 0x0000)
struct BPC_BarPlayerComponent_C_SitEventLogic final
{
public:
	bool                                          Param_Sit;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_BarPlayerComponent_C_SitEventLogic) == 0x000001, "Wrong alignment on BPC_BarPlayerComponent_C_SitEventLogic");
static_assert(sizeof(BPC_BarPlayerComponent_C_SitEventLogic) == 0x000001, "Wrong size on BPC_BarPlayerComponent_C_SitEventLogic");
static_assert(offsetof(BPC_BarPlayerComponent_C_SitEventLogic, Param_Sit) == 0x000000, "Member 'BPC_BarPlayerComponent_C_SitEventLogic::Param_Sit' has a wrong offset!");

}

