#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPDA_Acceleration

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPDA_Acceleration.BPDA_Acceleration_C.ExecuteUbergraph_BPDA_Acceleration
// 0x0010 (0x0010 - 0x0000)
struct BPDA_Acceleration_C_ExecuteUbergraph_BPDA_Acceleration final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_RB_Vehicle_C*                       K2Node_Event_Vehicle;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPDA_Acceleration_C_ExecuteUbergraph_BPDA_Acceleration) == 0x000008, "Wrong alignment on BPDA_Acceleration_C_ExecuteUbergraph_BPDA_Acceleration");
static_assert(sizeof(BPDA_Acceleration_C_ExecuteUbergraph_BPDA_Acceleration) == 0x000010, "Wrong size on BPDA_Acceleration_C_ExecuteUbergraph_BPDA_Acceleration");
static_assert(offsetof(BPDA_Acceleration_C_ExecuteUbergraph_BPDA_Acceleration, EntryPoint) == 0x000000, "Member 'BPDA_Acceleration_C_ExecuteUbergraph_BPDA_Acceleration::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPDA_Acceleration_C_ExecuteUbergraph_BPDA_Acceleration, K2Node_Event_Vehicle) == 0x000008, "Member 'BPDA_Acceleration_C_ExecuteUbergraph_BPDA_Acceleration::K2Node_Event_Vehicle' has a wrong offset!");

// Function BPDA_Acceleration.BPDA_Acceleration_C.SetUpgrade
// 0x0008 (0x0008 - 0x0000)
struct BPDA_Acceleration_C_SetUpgrade final
{
public:
	class ABP_RB_Vehicle_C*                       Vehicle;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPDA_Acceleration_C_SetUpgrade) == 0x000008, "Wrong alignment on BPDA_Acceleration_C_SetUpgrade");
static_assert(sizeof(BPDA_Acceleration_C_SetUpgrade) == 0x000008, "Wrong size on BPDA_Acceleration_C_SetUpgrade");
static_assert(offsetof(BPDA_Acceleration_C_SetUpgrade, Vehicle) == 0x000000, "Member 'BPDA_Acceleration_C_SetUpgrade::Vehicle' has a wrong offset!");

}

