#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPDA_Boost

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPDA_Boost.BPDA_Boost_C.ExecuteUbergraph_BPDA_Boost
// 0x0010 (0x0010 - 0x0000)
struct BPDA_Boost_C_ExecuteUbergraph_BPDA_Boost final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_RB_Vehicle_C*                       K2Node_Event_Vehicle;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPDA_Boost_C_ExecuteUbergraph_BPDA_Boost) == 0x000008, "Wrong alignment on BPDA_Boost_C_ExecuteUbergraph_BPDA_Boost");
static_assert(sizeof(BPDA_Boost_C_ExecuteUbergraph_BPDA_Boost) == 0x000010, "Wrong size on BPDA_Boost_C_ExecuteUbergraph_BPDA_Boost");
static_assert(offsetof(BPDA_Boost_C_ExecuteUbergraph_BPDA_Boost, EntryPoint) == 0x000000, "Member 'BPDA_Boost_C_ExecuteUbergraph_BPDA_Boost::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPDA_Boost_C_ExecuteUbergraph_BPDA_Boost, K2Node_Event_Vehicle) == 0x000008, "Member 'BPDA_Boost_C_ExecuteUbergraph_BPDA_Boost::K2Node_Event_Vehicle' has a wrong offset!");

// Function BPDA_Boost.BPDA_Boost_C.SetUpgrade
// 0x0008 (0x0008 - 0x0000)
struct BPDA_Boost_C_SetUpgrade final
{
public:
	class ABP_RB_Vehicle_C*                       Vehicle;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPDA_Boost_C_SetUpgrade) == 0x000008, "Wrong alignment on BPDA_Boost_C_SetUpgrade");
static_assert(sizeof(BPDA_Boost_C_SetUpgrade) == 0x000008, "Wrong size on BPDA_Boost_C_SetUpgrade");
static_assert(offsetof(BPDA_Boost_C_SetUpgrade, Vehicle) == 0x000000, "Member 'BPDA_Boost_C_SetUpgrade::Vehicle' has a wrong offset!");

}

