#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_Settings

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPI_Settings.BPI_Settings_C.OnRowDeselected
// 0x0008 (0x0008 - 0x0000)
struct BPI_Settings_C_OnRowDeselected final
{
public:
	class UUserWidget*                            RowWidgetRef;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_Settings_C_OnRowDeselected) == 0x000008, "Wrong alignment on BPI_Settings_C_OnRowDeselected");
static_assert(sizeof(BPI_Settings_C_OnRowDeselected) == 0x000008, "Wrong size on BPI_Settings_C_OnRowDeselected");
static_assert(offsetof(BPI_Settings_C_OnRowDeselected, RowWidgetRef) == 0x000000, "Member 'BPI_Settings_C_OnRowDeselected::RowWidgetRef' has a wrong offset!");

// Function BPI_Settings.BPI_Settings_C.OnRowHovered
// 0x0008 (0x0008 - 0x0000)
struct BPI_Settings_C_OnRowHovered final
{
public:
	class UUserWidget*                            RowWidgetRef;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_Settings_C_OnRowHovered) == 0x000008, "Wrong alignment on BPI_Settings_C_OnRowHovered");
static_assert(sizeof(BPI_Settings_C_OnRowHovered) == 0x000008, "Wrong size on BPI_Settings_C_OnRowHovered");
static_assert(offsetof(BPI_Settings_C_OnRowHovered, RowWidgetRef) == 0x000000, "Member 'BPI_Settings_C_OnRowHovered::RowWidgetRef' has a wrong offset!");

// Function BPI_Settings.BPI_Settings_C.OnRowSelected
// 0x0008 (0x0008 - 0x0000)
struct BPI_Settings_C_OnRowSelected final
{
public:
	class UUserWidget*                            RowWidgetRef;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_Settings_C_OnRowSelected) == 0x000008, "Wrong alignment on BPI_Settings_C_OnRowSelected");
static_assert(sizeof(BPI_Settings_C_OnRowSelected) == 0x000008, "Wrong size on BPI_Settings_C_OnRowSelected");
static_assert(offsetof(BPI_Settings_C_OnRowSelected, RowWidgetRef) == 0x000000, "Member 'BPI_Settings_C_OnRowSelected::RowWidgetRef' has a wrong offset!");

// Function BPI_Settings.BPI_Settings_C.OnRowUnhovered
// 0x0008 (0x0008 - 0x0000)
struct BPI_Settings_C_OnRowUnhovered final
{
public:
	class UUserWidget*                            RowWidgetRef;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_Settings_C_OnRowUnhovered) == 0x000008, "Wrong alignment on BPI_Settings_C_OnRowUnhovered");
static_assert(sizeof(BPI_Settings_C_OnRowUnhovered) == 0x000008, "Wrong size on BPI_Settings_C_OnRowUnhovered");
static_assert(offsetof(BPI_Settings_C_OnRowUnhovered, RowWidgetRef) == 0x000000, "Member 'BPI_Settings_C_OnRowUnhovered::RowWidgetRef' has a wrong offset!");

}

