#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_HouseSystem

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPI_HouseSystem.BPI_HouseSystem_C.HouseBoxEntered
// 0x0008 (0x0008 - 0x0000)
struct BPI_HouseSystem_C_HouseBoxEntered final
{
public:
	class AHouseBox_C*                            HouseBox;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_HouseSystem_C_HouseBoxEntered) == 0x000008, "Wrong alignment on BPI_HouseSystem_C_HouseBoxEntered");
static_assert(sizeof(BPI_HouseSystem_C_HouseBoxEntered) == 0x000008, "Wrong size on BPI_HouseSystem_C_HouseBoxEntered");
static_assert(offsetof(BPI_HouseSystem_C_HouseBoxEntered, HouseBox) == 0x000000, "Member 'BPI_HouseSystem_C_HouseBoxEntered::HouseBox' has a wrong offset!");

// Function BPI_HouseSystem.BPI_HouseSystem_C.HouseBoxLeaved
// 0x0008 (0x0008 - 0x0000)
struct BPI_HouseSystem_C_HouseBoxLeaved final
{
public:
	class AHouseBox_C*                            HouseBox;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_HouseSystem_C_HouseBoxLeaved) == 0x000008, "Wrong alignment on BPI_HouseSystem_C_HouseBoxLeaved");
static_assert(sizeof(BPI_HouseSystem_C_HouseBoxLeaved) == 0x000008, "Wrong size on BPI_HouseSystem_C_HouseBoxLeaved");
static_assert(offsetof(BPI_HouseSystem_C_HouseBoxLeaved, HouseBox) == 0x000000, "Member 'BPI_HouseSystem_C_HouseBoxLeaved::HouseBox' has a wrong offset!");

}

