#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_SettingRow

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPI_SettingRow.BPI_SettingRow_C.GetIsDefaultValue
// 0x0001 (0x0001 - 0x0000)
struct BPI_SettingRow_C_GetIsDefaultValue final
{
public:
	bool                                          Default;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_SettingRow_C_GetIsDefaultValue) == 0x000001, "Wrong alignment on BPI_SettingRow_C_GetIsDefaultValue");
static_assert(sizeof(BPI_SettingRow_C_GetIsDefaultValue) == 0x000001, "Wrong size on BPI_SettingRow_C_GetIsDefaultValue");
static_assert(offsetof(BPI_SettingRow_C_GetIsDefaultValue, Default) == 0x000000, "Member 'BPI_SettingRow_C_GetIsDefaultValue::Default' has a wrong offset!");

// Function BPI_SettingRow.BPI_SettingRow_C.GetSettingName
// 0x0008 (0x0008 - 0x0000)
struct BPI_SettingRow_C_GetSettingName final
{
public:
	class FName                                   SettingName;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_SettingRow_C_GetSettingName) == 0x000004, "Wrong alignment on BPI_SettingRow_C_GetSettingName");
static_assert(sizeof(BPI_SettingRow_C_GetSettingName) == 0x000008, "Wrong size on BPI_SettingRow_C_GetSettingName");
static_assert(offsetof(BPI_SettingRow_C_GetSettingName, SettingName) == 0x000000, "Member 'BPI_SettingRow_C_GetSettingName::SettingName' has a wrong offset!");

// Function BPI_SettingRow.BPI_SettingRow_C.IsRowHovered
// 0x0001 (0x0001 - 0x0000)
struct BPI_SettingRow_C_IsRowHovered final
{
public:
	bool                                          IsHovered;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_SettingRow_C_IsRowHovered) == 0x000001, "Wrong alignment on BPI_SettingRow_C_IsRowHovered");
static_assert(sizeof(BPI_SettingRow_C_IsRowHovered) == 0x000001, "Wrong size on BPI_SettingRow_C_IsRowHovered");
static_assert(offsetof(BPI_SettingRow_C_IsRowHovered, IsHovered) == 0x000000, "Member 'BPI_SettingRow_C_IsRowHovered::IsHovered' has a wrong offset!");

// Function BPI_SettingRow.BPI_SettingRow_C.IsRowSelected
// 0x0001 (0x0001 - 0x0000)
struct BPI_SettingRow_C_IsRowSelected final
{
public:
	bool                                          IsSelected;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_SettingRow_C_IsRowSelected) == 0x000001, "Wrong alignment on BPI_SettingRow_C_IsRowSelected");
static_assert(sizeof(BPI_SettingRow_C_IsRowSelected) == 0x000001, "Wrong size on BPI_SettingRow_C_IsRowSelected");
static_assert(offsetof(BPI_SettingRow_C_IsRowSelected, IsSelected) == 0x000000, "Member 'BPI_SettingRow_C_IsRowSelected::IsSelected' has a wrong offset!");

// Function BPI_SettingRow.BPI_SettingRow_C.SetParentSettingsWidget
// 0x0008 (0x0008 - 0x0000)
struct BPI_SettingRow_C_SetParentSettingsWidget final
{
public:
	class UUserWidget*                            SettingsWidgetRef;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_SettingRow_C_SetParentSettingsWidget) == 0x000008, "Wrong alignment on BPI_SettingRow_C_SetParentSettingsWidget");
static_assert(sizeof(BPI_SettingRow_C_SetParentSettingsWidget) == 0x000008, "Wrong size on BPI_SettingRow_C_SetParentSettingsWidget");
static_assert(offsetof(BPI_SettingRow_C_SetParentSettingsWidget, SettingsWidgetRef) == 0x000000, "Member 'BPI_SettingRow_C_SetParentSettingsWidget::SettingsWidgetRef' has a wrong offset!");

}

