#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_Crosshair

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPI_Crosshair.BPI_Crosshair_C.Aim
// 0x0001 (0x0001 - 0x0000)
struct BPI_Crosshair_C_Aim final
{
public:
	bool                                          Param_Aim;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_Crosshair_C_Aim) == 0x000001, "Wrong alignment on BPI_Crosshair_C_Aim");
static_assert(sizeof(BPI_Crosshair_C_Aim) == 0x000001, "Wrong size on BPI_Crosshair_C_Aim");
static_assert(offsetof(BPI_Crosshair_C_Aim, Param_Aim) == 0x000000, "Member 'BPI_Crosshair_C_Aim::Param_Aim' has a wrong offset!");

// Function BPI_Crosshair.BPI_Crosshair_C.Shoot
// 0x0002 (0x0002 - 0x0000)
struct BPI_Crosshair_C_Shoot final
{
public:
	bool                                          Shooting;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_Crosshair_C_Shoot) == 0x000001, "Wrong alignment on BPI_Crosshair_C_Shoot");
static_assert(sizeof(BPI_Crosshair_C_Shoot) == 0x000002, "Wrong size on BPI_Crosshair_C_Shoot");
static_assert(offsetof(BPI_Crosshair_C_Shoot, Shooting) == 0x000000, "Member 'BPI_Crosshair_C_Shoot::Shooting' has a wrong offset!");
static_assert(offsetof(BPI_Crosshair_C_Shoot, Result) == 0x000001, "Member 'BPI_Crosshair_C_Shoot::Result' has a wrong offset!");

}

