#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_ABPHead

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPI_ABPHead.BPI_ABPHead_C.GetInLobby
// 0x0001 (0x0001 - 0x0000)
struct BPI_ABPHead_C_GetInLobby final
{
public:
	bool                                          InLobby;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_ABPHead_C_GetInLobby) == 0x000001, "Wrong alignment on BPI_ABPHead_C_GetInLobby");
static_assert(sizeof(BPI_ABPHead_C_GetInLobby) == 0x000001, "Wrong size on BPI_ABPHead_C_GetInLobby");
static_assert(offsetof(BPI_ABPHead_C_GetInLobby, InLobby) == 0x000000, "Member 'BPI_ABPHead_C_GetInLobby::InLobby' has a wrong offset!");

// Function BPI_ABPHead.BPI_ABPHead_C.SetInLobby
// 0x0001 (0x0001 - 0x0000)
struct BPI_ABPHead_C_SetInLobby final
{
public:
	bool                                          InLobby;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_ABPHead_C_SetInLobby) == 0x000001, "Wrong alignment on BPI_ABPHead_C_SetInLobby");
static_assert(sizeof(BPI_ABPHead_C_SetInLobby) == 0x000001, "Wrong size on BPI_ABPHead_C_SetInLobby");
static_assert(offsetof(BPI_ABPHead_C_SetInLobby, InLobby) == 0x000000, "Member 'BPI_ABPHead_C_SetInLobby::InLobby' has a wrong offset!");

}

