#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_WeaponAnimBP

#include "Basic.hpp"

#include "StanceState_structs.hpp"


namespace SDK::Params
{

// Function BPI_WeaponAnimBP.BPI_WeaponAnimBP_C.CallRealoadAnimRefresh
// 0x0002 (0x0002 - 0x0000)
struct BPI_WeaponAnimBP_C_CallRealoadAnimRefresh final
{
public:
	bool                                          Aiming;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EStanceState                                  Stance;                                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_WeaponAnimBP_C_CallRealoadAnimRefresh) == 0x000001, "Wrong alignment on BPI_WeaponAnimBP_C_CallRealoadAnimRefresh");
static_assert(sizeof(BPI_WeaponAnimBP_C_CallRealoadAnimRefresh) == 0x000002, "Wrong size on BPI_WeaponAnimBP_C_CallRealoadAnimRefresh");
static_assert(offsetof(BPI_WeaponAnimBP_C_CallRealoadAnimRefresh, Aiming) == 0x000000, "Member 'BPI_WeaponAnimBP_C_CallRealoadAnimRefresh::Aiming' has a wrong offset!");
static_assert(offsetof(BPI_WeaponAnimBP_C_CallRealoadAnimRefresh, Stance) == 0x000001, "Member 'BPI_WeaponAnimBP_C_CallRealoadAnimRefresh::Stance' has a wrong offset!");

// Function BPI_WeaponAnimBP.BPI_WeaponAnimBP_C.CallReloadAnim
// 0x0002 (0x0002 - 0x0000)
struct BPI_WeaponAnimBP_C_CallReloadAnim final
{
public:
	bool                                          Aiming;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EStanceState                                  Stance;                                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_WeaponAnimBP_C_CallReloadAnim) == 0x000001, "Wrong alignment on BPI_WeaponAnimBP_C_CallReloadAnim");
static_assert(sizeof(BPI_WeaponAnimBP_C_CallReloadAnim) == 0x000002, "Wrong size on BPI_WeaponAnimBP_C_CallReloadAnim");
static_assert(offsetof(BPI_WeaponAnimBP_C_CallReloadAnim, Aiming) == 0x000000, "Member 'BPI_WeaponAnimBP_C_CallReloadAnim::Aiming' has a wrong offset!");
static_assert(offsetof(BPI_WeaponAnimBP_C_CallReloadAnim, Stance) == 0x000001, "Member 'BPI_WeaponAnimBP_C_CallReloadAnim::Stance' has a wrong offset!");

}

