#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS_HitParticles

#include "Basic.hpp"

#include "PhysicsCore_structs.hpp"


namespace SDK
{

// UserDefinedStruct BPS_HitParticles.BPS_HitParticles
// 0x0030 (0x0030 - 0x0000)
struct FBPS_HitParticles final
{
public:
	EPhysicalSurface                              Surface_7_C4E05C8640E5C2A0CE297689F02F33A4;        // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UParticleSystem*>                Particles_3_17881668484AF5B7B338C2B45E5FE6C0;      // 0x0008(0x0010)(Edit, BlueprintVisible)
	TArray<class UNiagaraSystem*>                 Niagara_12_199477064D1C4E1D31228984D51F1B6C;       // 0x0018(0x0010)(Edit, BlueprintVisible)
	class UPhysicalMaterial*                      PhysMat_15_9D9FC6CC49596ECE38F177AE99C236B3;       // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FBPS_HitParticles) == 0x000008, "Wrong alignment on FBPS_HitParticles");
static_assert(sizeof(FBPS_HitParticles) == 0x000030, "Wrong size on FBPS_HitParticles");
static_assert(offsetof(FBPS_HitParticles, Surface_7_C4E05C8640E5C2A0CE297689F02F33A4) == 0x000000, "Member 'FBPS_HitParticles::Surface_7_C4E05C8640E5C2A0CE297689F02F33A4' has a wrong offset!");
static_assert(offsetof(FBPS_HitParticles, Particles_3_17881668484AF5B7B338C2B45E5FE6C0) == 0x000008, "Member 'FBPS_HitParticles::Particles_3_17881668484AF5B7B338C2B45E5FE6C0' has a wrong offset!");
static_assert(offsetof(FBPS_HitParticles, Niagara_12_199477064D1C4E1D31228984D51F1B6C) == 0x000018, "Member 'FBPS_HitParticles::Niagara_12_199477064D1C4E1D31228984D51F1B6C' has a wrong offset!");
static_assert(offsetof(FBPS_HitParticles, PhysMat_15_9D9FC6CC49596ECE38F177AE99C236B3) == 0x000028, "Member 'FBPS_HitParticles::PhysMat_15_9D9FC6CC49596ECE38F177AE99C236B3' has a wrong offset!");

}

