#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS_HitDecals

#include "Basic.hpp"

#include "PhysicsCore_structs.hpp"


namespace SDK
{

// UserDefinedStruct BPS_HitDecals.BPS_HitDecals
// 0x0030 (0x0030 - 0x0000)
struct FBPS_HitDecals final
{
public:
	EPhysicalSurface                              Surface_2_8BDF785748D7605269F5B282822E4B2E;        // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInstance*>              Materials_15_8DB645C946E8E475904E01825A5E86B1;     // 0x0008(0x0010)(Edit, BlueprintVisible)
	TArray<double>                                SizeMultipliers_14_9148E7244BE081490C336EAC3D43A3B9; // 0x0018(0x0010)(Edit, BlueprintVisible)
	class UPhysicalMaterial*                      PhysMat_18_920465B14177FF37F89E6AAEF5080948;       // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FBPS_HitDecals) == 0x000008, "Wrong alignment on FBPS_HitDecals");
static_assert(sizeof(FBPS_HitDecals) == 0x000030, "Wrong size on FBPS_HitDecals");
static_assert(offsetof(FBPS_HitDecals, Surface_2_8BDF785748D7605269F5B282822E4B2E) == 0x000000, "Member 'FBPS_HitDecals::Surface_2_8BDF785748D7605269F5B282822E4B2E' has a wrong offset!");
static_assert(offsetof(FBPS_HitDecals, Materials_15_8DB645C946E8E475904E01825A5E86B1) == 0x000008, "Member 'FBPS_HitDecals::Materials_15_8DB645C946E8E475904E01825A5E86B1' has a wrong offset!");
static_assert(offsetof(FBPS_HitDecals, SizeMultipliers_14_9148E7244BE081490C336EAC3D43A3B9) == 0x000018, "Member 'FBPS_HitDecals::SizeMultipliers_14_9148E7244BE081490C336EAC3D43A3B9' has a wrong offset!");
static_assert(offsetof(FBPS_HitDecals, PhysMat_18_920465B14177FF37F89E6AAEF5080948) == 0x000028, "Member 'FBPS_HitDecals::PhysMat_18_920465B14177FF37F89E6AAEF5080948' has a wrong offset!");

}

