#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BreathSystemInterface

#include "Basic.hpp"

#include "Survival_structs.hpp"


namespace SDK::Params
{

// Function BreathSystemInterface.BreathSystemInterface_C.CallBreathStateChange
// 0x0020 (0x0020 - 0x0000)
struct BreathSystemInterface_C_CallBreathStateChange final
{
public:
	struct FBreathStateMachineStruct              NewState;                                          // 0x0000(0x0009)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CurrentStamina;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DamagedChest;                                      // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DamagedBelly;                                      // 0x0019(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Painkiller;                                        // 0x001A(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BreathSystemInterface_C_CallBreathStateChange) == 0x000008, "Wrong alignment on BreathSystemInterface_C_CallBreathStateChange");
static_assert(sizeof(BreathSystemInterface_C_CallBreathStateChange) == 0x000020, "Wrong size on BreathSystemInterface_C_CallBreathStateChange");
static_assert(offsetof(BreathSystemInterface_C_CallBreathStateChange, NewState) == 0x000000, "Member 'BreathSystemInterface_C_CallBreathStateChange::NewState' has a wrong offset!");
static_assert(offsetof(BreathSystemInterface_C_CallBreathStateChange, CurrentStamina) == 0x000010, "Member 'BreathSystemInterface_C_CallBreathStateChange::CurrentStamina' has a wrong offset!");
static_assert(offsetof(BreathSystemInterface_C_CallBreathStateChange, DamagedChest) == 0x000018, "Member 'BreathSystemInterface_C_CallBreathStateChange::DamagedChest' has a wrong offset!");
static_assert(offsetof(BreathSystemInterface_C_CallBreathStateChange, DamagedBelly) == 0x000019, "Member 'BreathSystemInterface_C_CallBreathStateChange::DamagedBelly' has a wrong offset!");
static_assert(offsetof(BreathSystemInterface_C_CallBreathStateChange, Painkiller) == 0x00001A, "Member 'BreathSystemInterface_C_CallBreathStateChange::Painkiller' has a wrong offset!");

// Function BreathSystemInterface.BreathSystemInterface_C.OnBreathStateChanged
// 0x0014 (0x0014 - 0x0000)
struct BreathSystemInterface_C_OnBreathStateChanged final
{
public:
	struct FBreathStateChangedStruct              State;                                             // 0x0000(0x0014)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(BreathSystemInterface_C_OnBreathStateChanged) == 0x000004, "Wrong alignment on BreathSystemInterface_C_OnBreathStateChanged");
static_assert(sizeof(BreathSystemInterface_C_OnBreathStateChanged) == 0x000014, "Wrong size on BreathSystemInterface_C_OnBreathStateChanged");
static_assert(offsetof(BreathSystemInterface_C_OnBreathStateChanged, State) == 0x000000, "Member 'BreathSystemInterface_C_OnBreathStateChanged::State' has a wrong offset!");

}

