#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_ReturnHome

#include "Basic.hpp"

#include "E_DeerState_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BTT_ReturnHome.BTT_ReturnHome_C.ExecuteUbergraph_BTT_ReturnHome
// 0x00A0 (0x00A0 - 0x0000)
struct BTT_ReturnHome_C_ExecuteUbergraph_BTT_ReturnHome final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	E_DeerState                                   K2Node_CustomEvent_FromState;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(E_DeerState FromState)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(E_DeerState FromState)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_DeerV2_C*                           K2Node_DynamicCast_AsBP_Deer_V2;                   // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetBlackboardValueAsVector_ReturnValue;   // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetRandomReachablePointInRadius_RandomLocation; // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_GetRandomReachablePointInRadius_ReturnValue; // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_ReturnHome_C_ExecuteUbergraph_BTT_ReturnHome) == 0x000008, "Wrong alignment on BTT_ReturnHome_C_ExecuteUbergraph_BTT_ReturnHome");
static_assert(sizeof(BTT_ReturnHome_C_ExecuteUbergraph_BTT_ReturnHome) == 0x0000A0, "Wrong size on BTT_ReturnHome_C_ExecuteUbergraph_BTT_ReturnHome");
static_assert(offsetof(BTT_ReturnHome_C_ExecuteUbergraph_BTT_ReturnHome, EntryPoint) == 0x000000, "Member 'BTT_ReturnHome_C_ExecuteUbergraph_BTT_ReturnHome::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTT_ReturnHome_C_ExecuteUbergraph_BTT_ReturnHome, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BTT_ReturnHome_C_ExecuteUbergraph_BTT_ReturnHome::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BTT_ReturnHome_C_ExecuteUbergraph_BTT_ReturnHome, K2Node_CustomEvent_FromState) == 0x000014, "Member 'BTT_ReturnHome_C_ExecuteUbergraph_BTT_ReturnHome::K2Node_CustomEvent_FromState' has a wrong offset!");
static_assert(offsetof(BTT_ReturnHome_C_ExecuteUbergraph_BTT_ReturnHome, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'BTT_ReturnHome_C_ExecuteUbergraph_BTT_ReturnHome::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BTT_ReturnHome_C_ExecuteUbergraph_BTT_ReturnHome, K2Node_CreateDelegate_OutputDelegate_2) == 0x000028, "Member 'BTT_ReturnHome_C_ExecuteUbergraph_BTT_ReturnHome::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BTT_ReturnHome_C_ExecuteUbergraph_BTT_ReturnHome, K2Node_CreateDelegate_OutputDelegate_3) == 0x000038, "Member 'BTT_ReturnHome_C_ExecuteUbergraph_BTT_ReturnHome::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BTT_ReturnHome_C_ExecuteUbergraph_BTT_ReturnHome, K2Node_Event_OwnerController) == 0x000048, "Member 'BTT_ReturnHome_C_ExecuteUbergraph_BTT_ReturnHome::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_ReturnHome_C_ExecuteUbergraph_BTT_ReturnHome, K2Node_Event_ControlledPawn) == 0x000050, "Member 'BTT_ReturnHome_C_ExecuteUbergraph_BTT_ReturnHome::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_ReturnHome_C_ExecuteUbergraph_BTT_ReturnHome, K2Node_DynamicCast_AsBP_Deer_V2) == 0x000058, "Member 'BTT_ReturnHome_C_ExecuteUbergraph_BTT_ReturnHome::K2Node_DynamicCast_AsBP_Deer_V2' has a wrong offset!");
static_assert(offsetof(BTT_ReturnHome_C_ExecuteUbergraph_BTT_ReturnHome, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'BTT_ReturnHome_C_ExecuteUbergraph_BTT_ReturnHome::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTT_ReturnHome_C_ExecuteUbergraph_BTT_ReturnHome, CallFunc_GetBlackboardValueAsVector_ReturnValue) == 0x000068, "Member 'BTT_ReturnHome_C_ExecuteUbergraph_BTT_ReturnHome::CallFunc_GetBlackboardValueAsVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_ReturnHome_C_ExecuteUbergraph_BTT_ReturnHome, CallFunc_K2_GetRandomReachablePointInRadius_RandomLocation) == 0x000080, "Member 'BTT_ReturnHome_C_ExecuteUbergraph_BTT_ReturnHome::CallFunc_K2_GetRandomReachablePointInRadius_RandomLocation' has a wrong offset!");
static_assert(offsetof(BTT_ReturnHome_C_ExecuteUbergraph_BTT_ReturnHome, CallFunc_K2_GetRandomReachablePointInRadius_ReturnValue) == 0x000098, "Member 'BTT_ReturnHome_C_ExecuteUbergraph_BTT_ReturnHome::CallFunc_K2_GetRandomReachablePointInRadius_ReturnValue' has a wrong offset!");

// Function BTT_ReturnHome.BTT_ReturnHome_C.OnGetScared
// 0x0001 (0x0001 - 0x0000)
struct BTT_ReturnHome_C_OnGetScared final
{
public:
	E_DeerState                                   FromState;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_ReturnHome_C_OnGetScared) == 0x000001, "Wrong alignment on BTT_ReturnHome_C_OnGetScared");
static_assert(sizeof(BTT_ReturnHome_C_OnGetScared) == 0x000001, "Wrong size on BTT_ReturnHome_C_OnGetScared");
static_assert(offsetof(BTT_ReturnHome_C_OnGetScared, FromState) == 0x000000, "Member 'BTT_ReturnHome_C_OnGetScared::FromState' has a wrong offset!");

// Function BTT_ReturnHome.BTT_ReturnHome_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTT_ReturnHome_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          Param_OwnerController;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_ReturnHome_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTT_ReturnHome_C_ReceiveExecuteAI");
static_assert(sizeof(BTT_ReturnHome_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTT_ReturnHome_C_ReceiveExecuteAI");
static_assert(offsetof(BTT_ReturnHome_C_ReceiveExecuteAI, Param_OwnerController) == 0x000000, "Member 'BTT_ReturnHome_C_ReceiveExecuteAI::Param_OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_ReturnHome_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTT_ReturnHome_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

