#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_RunFromDanger

#include "Basic.hpp"

#include "E_DeerState_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BTT_RunFromDanger.BTT_RunFromDanger_C.ExecuteUbergraph_BTT_RunFromDanger
// 0x0068 (0x0068 - 0x0000)
struct BTT_RunFromDanger_C_ExecuteUbergraph_BTT_RunFromDanger final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_DeerV2_C*                           K2Node_DynamicCast_AsBP_Deer_V2;                   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetBlackboardValueAsVector_ReturnValue;   // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_DeerState                                   K2Node_CustomEvent_FromState;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(E_DeerState FromState)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_RunFromDanger_C_ExecuteUbergraph_BTT_RunFromDanger) == 0x000008, "Wrong alignment on BTT_RunFromDanger_C_ExecuteUbergraph_BTT_RunFromDanger");
static_assert(sizeof(BTT_RunFromDanger_C_ExecuteUbergraph_BTT_RunFromDanger) == 0x000068, "Wrong size on BTT_RunFromDanger_C_ExecuteUbergraph_BTT_RunFromDanger");
static_assert(offsetof(BTT_RunFromDanger_C_ExecuteUbergraph_BTT_RunFromDanger, EntryPoint) == 0x000000, "Member 'BTT_RunFromDanger_C_ExecuteUbergraph_BTT_RunFromDanger::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTT_RunFromDanger_C_ExecuteUbergraph_BTT_RunFromDanger, K2Node_Event_OwnerController) == 0x000008, "Member 'BTT_RunFromDanger_C_ExecuteUbergraph_BTT_RunFromDanger::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_RunFromDanger_C_ExecuteUbergraph_BTT_RunFromDanger, K2Node_Event_ControlledPawn) == 0x000010, "Member 'BTT_RunFromDanger_C_ExecuteUbergraph_BTT_RunFromDanger::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_RunFromDanger_C_ExecuteUbergraph_BTT_RunFromDanger, K2Node_DynamicCast_AsBP_Deer_V2) == 0x000018, "Member 'BTT_RunFromDanger_C_ExecuteUbergraph_BTT_RunFromDanger::K2Node_DynamicCast_AsBP_Deer_V2' has a wrong offset!");
static_assert(offsetof(BTT_RunFromDanger_C_ExecuteUbergraph_BTT_RunFromDanger, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BTT_RunFromDanger_C_ExecuteUbergraph_BTT_RunFromDanger::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTT_RunFromDanger_C_ExecuteUbergraph_BTT_RunFromDanger, CallFunc_GetBlackboardValueAsVector_ReturnValue) == 0x000028, "Member 'BTT_RunFromDanger_C_ExecuteUbergraph_BTT_RunFromDanger::CallFunc_GetBlackboardValueAsVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_RunFromDanger_C_ExecuteUbergraph_BTT_RunFromDanger, K2Node_CustomEvent_FromState) == 0x000040, "Member 'BTT_RunFromDanger_C_ExecuteUbergraph_BTT_RunFromDanger::K2Node_CustomEvent_FromState' has a wrong offset!");
static_assert(offsetof(BTT_RunFromDanger_C_ExecuteUbergraph_BTT_RunFromDanger, K2Node_CreateDelegate_OutputDelegate) == 0x000044, "Member 'BTT_RunFromDanger_C_ExecuteUbergraph_BTT_RunFromDanger::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BTT_RunFromDanger_C_ExecuteUbergraph_BTT_RunFromDanger, K2Node_CreateDelegate_OutputDelegate_1) == 0x000054, "Member 'BTT_RunFromDanger_C_ExecuteUbergraph_BTT_RunFromDanger::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function BTT_RunFromDanger.BTT_RunFromDanger_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTT_RunFromDanger_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          Param_OwnerController;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_RunFromDanger_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTT_RunFromDanger_C_ReceiveExecuteAI");
static_assert(sizeof(BTT_RunFromDanger_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTT_RunFromDanger_C_ReceiveExecuteAI");
static_assert(offsetof(BTT_RunFromDanger_C_ReceiveExecuteAI, Param_OwnerController) == 0x000000, "Member 'BTT_RunFromDanger_C_ReceiveExecuteAI::Param_OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_RunFromDanger_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTT_RunFromDanger_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

// Function BTT_RunFromDanger.BTT_RunFromDanger_C.ReinitializePath
// 0x0001 (0x0001 - 0x0000)
struct BTT_RunFromDanger_C_ReinitializePath final
{
public:
	E_DeerState                                   FromState;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_RunFromDanger_C_ReinitializePath) == 0x000001, "Wrong alignment on BTT_RunFromDanger_C_ReinitializePath");
static_assert(sizeof(BTT_RunFromDanger_C_ReinitializePath) == 0x000001, "Wrong size on BTT_RunFromDanger_C_ReinitializePath");
static_assert(offsetof(BTT_RunFromDanger_C_ReinitializePath, FromState) == 0x000000, "Member 'BTT_RunFromDanger_C_ReinitializePath::FromState' has a wrong offset!");

}

