#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_Roam

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Survival_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "E_DeerState_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTT_Roam.BTT_Roam_C
// 0x0068 (0x0110 - 0x00A8)
class UBTT_Roam_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAIMovementComponent_C*                 AIMC;                                              // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FBlackboardKeySelector                 RoamingKey;                                        // 0x00B8(0x0028)(Edit, BlueprintVisible)
	class AAIController*                          OwnerController;                                   // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Random_Location;                                   // 0x00E8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_DeerV2_C*                           DeerV2;                                            // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	Survival::EMovementType                       CPPMovementType;                                   // 0x0108(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BTT_Roam(int32 EntryPoint);
	void FinishRunning();
	void OnGetScared(E_DeerState FromState);
	void ReceiveExecuteAI(class AAIController* Param_OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTT_Roam_C">();
	}
	static class UBTT_Roam_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTT_Roam_C>();
	}
};
static_assert(alignof(UBTT_Roam_C) == 0x000008, "Wrong alignment on UBTT_Roam_C");
static_assert(sizeof(UBTT_Roam_C) == 0x000110, "Wrong size on UBTT_Roam_C");
static_assert(offsetof(UBTT_Roam_C, UberGraphFrame) == 0x0000A8, "Member 'UBTT_Roam_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTT_Roam_C, AIMC) == 0x0000B0, "Member 'UBTT_Roam_C::AIMC' has a wrong offset!");
static_assert(offsetof(UBTT_Roam_C, RoamingKey) == 0x0000B8, "Member 'UBTT_Roam_C::RoamingKey' has a wrong offset!");
static_assert(offsetof(UBTT_Roam_C, OwnerController) == 0x0000E0, "Member 'UBTT_Roam_C::OwnerController' has a wrong offset!");
static_assert(offsetof(UBTT_Roam_C, Random_Location) == 0x0000E8, "Member 'UBTT_Roam_C::Random_Location' has a wrong offset!");
static_assert(offsetof(UBTT_Roam_C, DeerV2) == 0x000100, "Member 'UBTT_Roam_C::DeerV2' has a wrong offset!");
static_assert(offsetof(UBTT_Roam_C, CPPMovementType) == 0x000108, "Member 'UBTT_Roam_C::CPPMovementType' has a wrong offset!");

}

