#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_GenerateRandomPatrolLocation

#include "Basic.hpp"

#include "Survival_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BTT_GenerateRandomPatrolLocation.BTT_GenerateRandomPatrolLocation_C.ExecuteUbergraph_BTT_GenerateRandomPatrolLocation
// 0x0070 (0x0070 - 0x0000)
struct BTT_GenerateRandomPatrolLocation_C_ExecuteUbergraph_BTT_GenerateRandomPatrolLocation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EZombieType                                   Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_2;                              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_3;                              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_4;                              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_5;                              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_6;                              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AZombie_C*                              K2Node_DynamicCast_AsZombie;                       // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EZombieType                                   CallFunc_GetCPPZombieType_ReturnValue;             // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetRandomReachablePointInRadius_RandomLocation; // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_GetRandomReachablePointInRadius_ReturnValue; // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_GenerateRandomPatrolLocation_C_ExecuteUbergraph_BTT_GenerateRandomPatrolLocation) == 0x000008, "Wrong alignment on BTT_GenerateRandomPatrolLocation_C_ExecuteUbergraph_BTT_GenerateRandomPatrolLocation");
static_assert(sizeof(BTT_GenerateRandomPatrolLocation_C_ExecuteUbergraph_BTT_GenerateRandomPatrolLocation) == 0x000070, "Wrong size on BTT_GenerateRandomPatrolLocation_C_ExecuteUbergraph_BTT_GenerateRandomPatrolLocation");
static_assert(offsetof(BTT_GenerateRandomPatrolLocation_C_ExecuteUbergraph_BTT_GenerateRandomPatrolLocation, EntryPoint) == 0x000000, "Member 'BTT_GenerateRandomPatrolLocation_C_ExecuteUbergraph_BTT_GenerateRandomPatrolLocation::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTT_GenerateRandomPatrolLocation_C_ExecuteUbergraph_BTT_GenerateRandomPatrolLocation, Temp_byte_Variable) == 0x000004, "Member 'BTT_GenerateRandomPatrolLocation_C_ExecuteUbergraph_BTT_GenerateRandomPatrolLocation::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BTT_GenerateRandomPatrolLocation_C_ExecuteUbergraph_BTT_GenerateRandomPatrolLocation, Temp_real_Variable) == 0x000008, "Member 'BTT_GenerateRandomPatrolLocation_C_ExecuteUbergraph_BTT_GenerateRandomPatrolLocation::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(BTT_GenerateRandomPatrolLocation_C_ExecuteUbergraph_BTT_GenerateRandomPatrolLocation, Temp_real_Variable_1) == 0x00000C, "Member 'BTT_GenerateRandomPatrolLocation_C_ExecuteUbergraph_BTT_GenerateRandomPatrolLocation::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(BTT_GenerateRandomPatrolLocation_C_ExecuteUbergraph_BTT_GenerateRandomPatrolLocation, Temp_real_Variable_2) == 0x000010, "Member 'BTT_GenerateRandomPatrolLocation_C_ExecuteUbergraph_BTT_GenerateRandomPatrolLocation::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(BTT_GenerateRandomPatrolLocation_C_ExecuteUbergraph_BTT_GenerateRandomPatrolLocation, Temp_real_Variable_3) == 0x000014, "Member 'BTT_GenerateRandomPatrolLocation_C_ExecuteUbergraph_BTT_GenerateRandomPatrolLocation::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(BTT_GenerateRandomPatrolLocation_C_ExecuteUbergraph_BTT_GenerateRandomPatrolLocation, Temp_real_Variable_4) == 0x000018, "Member 'BTT_GenerateRandomPatrolLocation_C_ExecuteUbergraph_BTT_GenerateRandomPatrolLocation::Temp_real_Variable_4' has a wrong offset!");
static_assert(offsetof(BTT_GenerateRandomPatrolLocation_C_ExecuteUbergraph_BTT_GenerateRandomPatrolLocation, Temp_real_Variable_5) == 0x00001C, "Member 'BTT_GenerateRandomPatrolLocation_C_ExecuteUbergraph_BTT_GenerateRandomPatrolLocation::Temp_real_Variable_5' has a wrong offset!");
static_assert(offsetof(BTT_GenerateRandomPatrolLocation_C_ExecuteUbergraph_BTT_GenerateRandomPatrolLocation, Temp_real_Variable_6) == 0x000020, "Member 'BTT_GenerateRandomPatrolLocation_C_ExecuteUbergraph_BTT_GenerateRandomPatrolLocation::Temp_real_Variable_6' has a wrong offset!");
static_assert(offsetof(BTT_GenerateRandomPatrolLocation_C_ExecuteUbergraph_BTT_GenerateRandomPatrolLocation, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'BTT_GenerateRandomPatrolLocation_C_ExecuteUbergraph_BTT_GenerateRandomPatrolLocation::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_GenerateRandomPatrolLocation_C_ExecuteUbergraph_BTT_GenerateRandomPatrolLocation, K2Node_Event_OwnerController) == 0x000028, "Member 'BTT_GenerateRandomPatrolLocation_C_ExecuteUbergraph_BTT_GenerateRandomPatrolLocation::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_GenerateRandomPatrolLocation_C_ExecuteUbergraph_BTT_GenerateRandomPatrolLocation, K2Node_Event_ControlledPawn) == 0x000030, "Member 'BTT_GenerateRandomPatrolLocation_C_ExecuteUbergraph_BTT_GenerateRandomPatrolLocation::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_GenerateRandomPatrolLocation_C_ExecuteUbergraph_BTT_GenerateRandomPatrolLocation, CallFunc_Greater_IntInt_ReturnValue) == 0x000038, "Member 'BTT_GenerateRandomPatrolLocation_C_ExecuteUbergraph_BTT_GenerateRandomPatrolLocation::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_GenerateRandomPatrolLocation_C_ExecuteUbergraph_BTT_GenerateRandomPatrolLocation, K2Node_DynamicCast_AsZombie) == 0x000040, "Member 'BTT_GenerateRandomPatrolLocation_C_ExecuteUbergraph_BTT_GenerateRandomPatrolLocation::K2Node_DynamicCast_AsZombie' has a wrong offset!");
static_assert(offsetof(BTT_GenerateRandomPatrolLocation_C_ExecuteUbergraph_BTT_GenerateRandomPatrolLocation, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BTT_GenerateRandomPatrolLocation_C_ExecuteUbergraph_BTT_GenerateRandomPatrolLocation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTT_GenerateRandomPatrolLocation_C_ExecuteUbergraph_BTT_GenerateRandomPatrolLocation, CallFunc_GetCPPZombieType_ReturnValue) == 0x000049, "Member 'BTT_GenerateRandomPatrolLocation_C_ExecuteUbergraph_BTT_GenerateRandomPatrolLocation::CallFunc_GetCPPZombieType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_GenerateRandomPatrolLocation_C_ExecuteUbergraph_BTT_GenerateRandomPatrolLocation, K2Node_Select_Default) == 0x00004C, "Member 'BTT_GenerateRandomPatrolLocation_C_ExecuteUbergraph_BTT_GenerateRandomPatrolLocation::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BTT_GenerateRandomPatrolLocation_C_ExecuteUbergraph_BTT_GenerateRandomPatrolLocation, CallFunc_K2_GetRandomReachablePointInRadius_RandomLocation) == 0x000050, "Member 'BTT_GenerateRandomPatrolLocation_C_ExecuteUbergraph_BTT_GenerateRandomPatrolLocation::CallFunc_K2_GetRandomReachablePointInRadius_RandomLocation' has a wrong offset!");
static_assert(offsetof(BTT_GenerateRandomPatrolLocation_C_ExecuteUbergraph_BTT_GenerateRandomPatrolLocation, CallFunc_K2_GetRandomReachablePointInRadius_ReturnValue) == 0x000068, "Member 'BTT_GenerateRandomPatrolLocation_C_ExecuteUbergraph_BTT_GenerateRandomPatrolLocation::CallFunc_K2_GetRandomReachablePointInRadius_ReturnValue' has a wrong offset!");

// Function BTT_GenerateRandomPatrolLocation.BTT_GenerateRandomPatrolLocation_C.Patrolling
// 0x0038 (0x0038 - 0x0000)
struct BTT_GenerateRandomPatrolLocation_C_Patrolling final
{
public:
	int32                                         NewIndex;                                          // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetBlackboardValueAsInt_ReturnValue;      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetBlackboardValueAsInt_ReturnValue_1;    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATargetPoint*                           CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_GenerateRandomPatrolLocation_C_Patrolling) == 0x000008, "Wrong alignment on BTT_GenerateRandomPatrolLocation_C_Patrolling");
static_assert(sizeof(BTT_GenerateRandomPatrolLocation_C_Patrolling) == 0x000038, "Wrong size on BTT_GenerateRandomPatrolLocation_C_Patrolling");
static_assert(offsetof(BTT_GenerateRandomPatrolLocation_C_Patrolling, NewIndex) == 0x000000, "Member 'BTT_GenerateRandomPatrolLocation_C_Patrolling::NewIndex' has a wrong offset!");
static_assert(offsetof(BTT_GenerateRandomPatrolLocation_C_Patrolling, CallFunc_GetBlackboardValueAsInt_ReturnValue) == 0x000004, "Member 'BTT_GenerateRandomPatrolLocation_C_Patrolling::CallFunc_GetBlackboardValueAsInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_GenerateRandomPatrolLocation_C_Patrolling, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'BTT_GenerateRandomPatrolLocation_C_Patrolling::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_GenerateRandomPatrolLocation_C_Patrolling, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00000C, "Member 'BTT_GenerateRandomPatrolLocation_C_Patrolling::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_GenerateRandomPatrolLocation_C_Patrolling, CallFunc_GetBlackboardValueAsInt_ReturnValue_1) == 0x000010, "Member 'BTT_GenerateRandomPatrolLocation_C_Patrolling::CallFunc_GetBlackboardValueAsInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTT_GenerateRandomPatrolLocation_C_Patrolling, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'BTT_GenerateRandomPatrolLocation_C_Patrolling::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_GenerateRandomPatrolLocation_C_Patrolling, CallFunc_Array_Get_Item) == 0x000018, "Member 'BTT_GenerateRandomPatrolLocation_C_Patrolling::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BTT_GenerateRandomPatrolLocation_C_Patrolling, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000020, "Member 'BTT_GenerateRandomPatrolLocation_C_Patrolling::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");

// Function BTT_GenerateRandomPatrolLocation.BTT_GenerateRandomPatrolLocation_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTT_GenerateRandomPatrolLocation_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_GenerateRandomPatrolLocation_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTT_GenerateRandomPatrolLocation_C_ReceiveExecuteAI");
static_assert(sizeof(BTT_GenerateRandomPatrolLocation_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTT_GenerateRandomPatrolLocation_C_ReceiveExecuteAI");
static_assert(offsetof(BTT_GenerateRandomPatrolLocation_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTT_GenerateRandomPatrolLocation_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_GenerateRandomPatrolLocation_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTT_GenerateRandomPatrolLocation_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

