#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_RunFromDanger

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "E_DeerState_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTT_RunFromDanger.BTT_RunFromDanger_C
// 0x0078 (0x0120 - 0x00A8)
class UBTT_RunFromDanger_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAIMovementComponent_C*                 AIMC;                                              // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FBlackboardKeySelector                 RunAwayLocationKey;                                // 0x00B8(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 RunAwayKey;                                        // 0x00E0(0x0028)(Edit, BlueprintVisible)
	class UFMODAudioComponent*                    Deer_Roar_Sound;                                   // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          OwnerController;                                   // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_DeerV2_C*                           DeerV2;                                            // 0x0118(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BTT_RunFromDanger(int32 EntryPoint);
	void FinishRunning();
	void ReceiveExecuteAI(class AAIController* Param_OwnerController, class APawn* ControlledPawn);
	void ReinitializePath(E_DeerState FromState);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTT_RunFromDanger_C">();
	}
	static class UBTT_RunFromDanger_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTT_RunFromDanger_C>();
	}
};
static_assert(alignof(UBTT_RunFromDanger_C) == 0x000008, "Wrong alignment on UBTT_RunFromDanger_C");
static_assert(sizeof(UBTT_RunFromDanger_C) == 0x000120, "Wrong size on UBTT_RunFromDanger_C");
static_assert(offsetof(UBTT_RunFromDanger_C, UberGraphFrame) == 0x0000A8, "Member 'UBTT_RunFromDanger_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTT_RunFromDanger_C, AIMC) == 0x0000B0, "Member 'UBTT_RunFromDanger_C::AIMC' has a wrong offset!");
static_assert(offsetof(UBTT_RunFromDanger_C, RunAwayLocationKey) == 0x0000B8, "Member 'UBTT_RunFromDanger_C::RunAwayLocationKey' has a wrong offset!");
static_assert(offsetof(UBTT_RunFromDanger_C, RunAwayKey) == 0x0000E0, "Member 'UBTT_RunFromDanger_C::RunAwayKey' has a wrong offset!");
static_assert(offsetof(UBTT_RunFromDanger_C, Deer_Roar_Sound) == 0x000108, "Member 'UBTT_RunFromDanger_C::Deer_Roar_Sound' has a wrong offset!");
static_assert(offsetof(UBTT_RunFromDanger_C, OwnerController) == 0x000110, "Member 'UBTT_RunFromDanger_C::OwnerController' has a wrong offset!");
static_assert(offsetof(UBTT_RunFromDanger_C, DeerV2) == 0x000118, "Member 'UBTT_RunFromDanger_C::DeerV2' has a wrong offset!");

}

