#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_GenerateRandomPatrolLocation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "Survival_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTT_GenerateRandomPatrolLocation.BTT_GenerateRandomPatrolLocation_C
// 0x0060 (0x0108 - 0x00A8)
class UBTT_GenerateRandomPatrolLocation_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 LocationKey;                                       // 0x00B0(0x0028)(Edit, BlueprintVisible)
	class AZombie_C*                              As_Zombie;                                         // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FBlackboardKeySelector                 CurrentPatrolPointIndexKey;                        // 0x00E0(0x0028)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_BTT_GenerateRandomPatrolLocation(int32 EntryPoint);
	void Patrolling();
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTT_GenerateRandomPatrolLocation_C">();
	}
	static class UBTT_GenerateRandomPatrolLocation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTT_GenerateRandomPatrolLocation_C>();
	}
};
static_assert(alignof(UBTT_GenerateRandomPatrolLocation_C) == 0x000008, "Wrong alignment on UBTT_GenerateRandomPatrolLocation_C");
static_assert(sizeof(UBTT_GenerateRandomPatrolLocation_C) == 0x000108, "Wrong size on UBTT_GenerateRandomPatrolLocation_C");
static_assert(offsetof(UBTT_GenerateRandomPatrolLocation_C, UberGraphFrame) == 0x0000A8, "Member 'UBTT_GenerateRandomPatrolLocation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTT_GenerateRandomPatrolLocation_C, LocationKey) == 0x0000B0, "Member 'UBTT_GenerateRandomPatrolLocation_C::LocationKey' has a wrong offset!");
static_assert(offsetof(UBTT_GenerateRandomPatrolLocation_C, As_Zombie) == 0x0000D8, "Member 'UBTT_GenerateRandomPatrolLocation_C::As_Zombie' has a wrong offset!");
static_assert(offsetof(UBTT_GenerateRandomPatrolLocation_C, CurrentPatrolPointIndexKey) == 0x0000E0, "Member 'UBTT_GenerateRandomPatrolLocation_C::CurrentPatrolPointIndexKey' has a wrong offset!");

}

