#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BugBolide_SkeletalMesh_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "FGearPlugin_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BugBolide_SkeletalMesh_Skeleton_AnimBlueprint.BugBolide_SkeletalMesh_Skeleton_AnimBlueprint_C
// 0x0C70 (0x0FD0 - 0x0360)
class UBugBolide_SkeletalMesh_Skeleton_AnimBlueprint_C final : public UFGearAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0368(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0370(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0378(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x0398(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x03E0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0408(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x0430(0x00E0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0510(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0558(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x0660(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x0788(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x08B0(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x09D8(0x0128)()
	struct FAnimNode_MeshSpaceRefPose             AnimGraphNode_MeshRefPose;                         // 0x0B00(0x0010)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0B10(0x0020)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_1;                            // 0x0B30(0x0250)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt;                              // 0x0D80(0x0250)()

public:
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BugBolide_SkeletalMesh_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_21F5475440464540DCE61095FB884942();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BugBolide_SkeletalMesh_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_981CD05244D0D315752B859339C8BAD2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BugBolide_SkeletalMesh_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_984F81B24497D595DC8BA48D501D65D8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BugBolide_SkeletalMesh_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_F5482327455D15CAF6C9FCAD8E980823();
	void ExecuteUbergraph_BugBolide_SkeletalMesh_Skeleton_AnimBlueprint(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BugBolide_SkeletalMesh_Skeleton_AnimBlueprint_C">();
	}
	static class UBugBolide_SkeletalMesh_Skeleton_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBugBolide_SkeletalMesh_Skeleton_AnimBlueprint_C>();
	}
};
static_assert(alignof(UBugBolide_SkeletalMesh_Skeleton_AnimBlueprint_C) == 0x000010, "Wrong alignment on UBugBolide_SkeletalMesh_Skeleton_AnimBlueprint_C");
static_assert(sizeof(UBugBolide_SkeletalMesh_Skeleton_AnimBlueprint_C) == 0x000FD0, "Wrong size on UBugBolide_SkeletalMesh_Skeleton_AnimBlueprint_C");
static_assert(offsetof(UBugBolide_SkeletalMesh_Skeleton_AnimBlueprint_C, UberGraphFrame) == 0x000360, "Member 'UBugBolide_SkeletalMesh_Skeleton_AnimBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBugBolide_SkeletalMesh_Skeleton_AnimBlueprint_C, AnimBlueprintExtension_PropertyAccess) == 0x000368, "Member 'UBugBolide_SkeletalMesh_Skeleton_AnimBlueprint_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UBugBolide_SkeletalMesh_Skeleton_AnimBlueprint_C, AnimBlueprintExtension_Base) == 0x000370, "Member 'UBugBolide_SkeletalMesh_Skeleton_AnimBlueprint_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UBugBolide_SkeletalMesh_Skeleton_AnimBlueprint_C, AnimGraphNode_Root) == 0x000378, "Member 'UBugBolide_SkeletalMesh_Skeleton_AnimBlueprint_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UBugBolide_SkeletalMesh_Skeleton_AnimBlueprint_C, AnimGraphNode_Slot_1) == 0x000398, "Member 'UBugBolide_SkeletalMesh_Skeleton_AnimBlueprint_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UBugBolide_SkeletalMesh_Skeleton_AnimBlueprint_C, AnimGraphNode_UseCachedPose_1) == 0x0003E0, "Member 'UBugBolide_SkeletalMesh_Skeleton_AnimBlueprint_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UBugBolide_SkeletalMesh_Skeleton_AnimBlueprint_C, AnimGraphNode_UseCachedPose) == 0x000408, "Member 'UBugBolide_SkeletalMesh_Skeleton_AnimBlueprint_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UBugBolide_SkeletalMesh_Skeleton_AnimBlueprint_C, AnimGraphNode_LayeredBoneBlend) == 0x000430, "Member 'UBugBolide_SkeletalMesh_Skeleton_AnimBlueprint_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UBugBolide_SkeletalMesh_Skeleton_AnimBlueprint_C, AnimGraphNode_Slot) == 0x000510, "Member 'UBugBolide_SkeletalMesh_Skeleton_AnimBlueprint_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UBugBolide_SkeletalMesh_Skeleton_AnimBlueprint_C, AnimGraphNode_SaveCachedPose) == 0x000558, "Member 'UBugBolide_SkeletalMesh_Skeleton_AnimBlueprint_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UBugBolide_SkeletalMesh_Skeleton_AnimBlueprint_C, AnimGraphNode_ModifyBone_3) == 0x000660, "Member 'UBugBolide_SkeletalMesh_Skeleton_AnimBlueprint_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(UBugBolide_SkeletalMesh_Skeleton_AnimBlueprint_C, AnimGraphNode_ModifyBone_2) == 0x000788, "Member 'UBugBolide_SkeletalMesh_Skeleton_AnimBlueprint_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UBugBolide_SkeletalMesh_Skeleton_AnimBlueprint_C, AnimGraphNode_ModifyBone_1) == 0x0008B0, "Member 'UBugBolide_SkeletalMesh_Skeleton_AnimBlueprint_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UBugBolide_SkeletalMesh_Skeleton_AnimBlueprint_C, AnimGraphNode_ModifyBone) == 0x0009D8, "Member 'UBugBolide_SkeletalMesh_Skeleton_AnimBlueprint_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UBugBolide_SkeletalMesh_Skeleton_AnimBlueprint_C, AnimGraphNode_MeshRefPose) == 0x000B00, "Member 'UBugBolide_SkeletalMesh_Skeleton_AnimBlueprint_C::AnimGraphNode_MeshRefPose' has a wrong offset!");
static_assert(offsetof(UBugBolide_SkeletalMesh_Skeleton_AnimBlueprint_C, AnimGraphNode_ComponentToLocalSpace) == 0x000B10, "Member 'UBugBolide_SkeletalMesh_Skeleton_AnimBlueprint_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UBugBolide_SkeletalMesh_Skeleton_AnimBlueprint_C, AnimGraphNode_LookAt_1) == 0x000B30, "Member 'UBugBolide_SkeletalMesh_Skeleton_AnimBlueprint_C::AnimGraphNode_LookAt_1' has a wrong offset!");
static_assert(offsetof(UBugBolide_SkeletalMesh_Skeleton_AnimBlueprint_C, AnimGraphNode_LookAt) == 0x000D80, "Member 'UBugBolide_SkeletalMesh_Skeleton_AnimBlueprint_C::AnimGraphNode_LookAt' has a wrong offset!");

}

