#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BuildingInfo_Struct

#include "Basic.hpp"

#include "BuildingInfo_Categories_enum_structs.hpp"


namespace SDK
{

// UserDefinedStruct BuildingInfo_Struct.BuildingInfo_Struct
// 0x00D8 (0x00D8 - 0x0000)
struct FBuildingInfo_Struct final
{
public:
	EBuildingInfo_Categories_enum                 Category_4_E842BF264CB3F4994AE72281466A6DA7;       // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Price_9_70936D33485A52D10F0D0BBD104C6F3F;          // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UPaperSprite>            Image_35_518DD8B246696E051DDD36ACABD3A693;         // 0x0008(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class FText                                   Description_18_514461444138246B3F11F283BAD8E469;   // 0x0038(0x0018)(Edit, BlueprintVisible)
	class FText                                   Name_20_59407074479B87E1834CC29FE1B3A51F;          // 0x0050(0x0018)(Edit, BlueprintVisible)
	TSoftClassPtr<class UClass>                   Class_33_BA52E36B4802C632C928C7A2DC0B2F8D;         // 0x0068(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class FName                                   RowNames_26_67C6F472415CD4D0BE5B11BABB689DB3;      // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Type_29_C1BA4C964D76BCD32A252E8A81F0DE54;          // 0x00A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UStaticMesh>             StaticMesh_34_48CB66E9486A33B6EB26ADA04745D21A;    // 0x00A8(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
static_assert(alignof(FBuildingInfo_Struct) == 0x000008, "Wrong alignment on FBuildingInfo_Struct");
static_assert(sizeof(FBuildingInfo_Struct) == 0x0000D8, "Wrong size on FBuildingInfo_Struct");
static_assert(offsetof(FBuildingInfo_Struct, Category_4_E842BF264CB3F4994AE72281466A6DA7) == 0x000000, "Member 'FBuildingInfo_Struct::Category_4_E842BF264CB3F4994AE72281466A6DA7' has a wrong offset!");
static_assert(offsetof(FBuildingInfo_Struct, Price_9_70936D33485A52D10F0D0BBD104C6F3F) == 0x000004, "Member 'FBuildingInfo_Struct::Price_9_70936D33485A52D10F0D0BBD104C6F3F' has a wrong offset!");
static_assert(offsetof(FBuildingInfo_Struct, Image_35_518DD8B246696E051DDD36ACABD3A693) == 0x000008, "Member 'FBuildingInfo_Struct::Image_35_518DD8B246696E051DDD36ACABD3A693' has a wrong offset!");
static_assert(offsetof(FBuildingInfo_Struct, Description_18_514461444138246B3F11F283BAD8E469) == 0x000038, "Member 'FBuildingInfo_Struct::Description_18_514461444138246B3F11F283BAD8E469' has a wrong offset!");
static_assert(offsetof(FBuildingInfo_Struct, Name_20_59407074479B87E1834CC29FE1B3A51F) == 0x000050, "Member 'FBuildingInfo_Struct::Name_20_59407074479B87E1834CC29FE1B3A51F' has a wrong offset!");
static_assert(offsetof(FBuildingInfo_Struct, Class_33_BA52E36B4802C632C928C7A2DC0B2F8D) == 0x000068, "Member 'FBuildingInfo_Struct::Class_33_BA52E36B4802C632C928C7A2DC0B2F8D' has a wrong offset!");
static_assert(offsetof(FBuildingInfo_Struct, RowNames_26_67C6F472415CD4D0BE5B11BABB689DB3) == 0x000098, "Member 'FBuildingInfo_Struct::RowNames_26_67C6F472415CD4D0BE5B11BABB689DB3' has a wrong offset!");
static_assert(offsetof(FBuildingInfo_Struct, Type_29_C1BA4C964D76BCD32A252E8A81F0DE54) == 0x0000A0, "Member 'FBuildingInfo_Struct::Type_29_C1BA4C964D76BCD32A252E8A81F0DE54' has a wrong offset!");
static_assert(offsetof(FBuildingInfo_Struct, StaticMesh_34_48CB66E9486A33B6EB26ADA04745D21A) == 0x0000A8, "Member 'FBuildingInfo_Struct::StaticMesh_34_48CB66E9486A33B6EB26ADA04745D21A' has a wrong offset!");

}

