#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BunkerElevatorSender

#include "Basic.hpp"


namespace SDK::Params
{

// Function BunkerElevatorSender.BunkerElevatorSender_C.ExecuteUbergraph_BunkerElevatorSender
// 0x0070 (0x0070 - 0x0000)
struct BunkerElevatorSender_C_ExecuteUbergraph_BunkerElevatorSender final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasActorsInside_HasActors;                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGS_TDB_C*                              K2Node_DynamicCast_AsGS_TDB;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Event_DeltaTime;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasBunker_HasBunker;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_1;               // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetBunkerLevelNameByElevator_LevelName;   // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AGS_TDB_C*                              K2Node_DynamicCast_AsGS_TDB_1;                     // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BunkerElevatorSender_C_ExecuteUbergraph_BunkerElevatorSender) == 0x000008, "Wrong alignment on BunkerElevatorSender_C_ExecuteUbergraph_BunkerElevatorSender");
static_assert(sizeof(BunkerElevatorSender_C_ExecuteUbergraph_BunkerElevatorSender) == 0x000070, "Wrong size on BunkerElevatorSender_C_ExecuteUbergraph_BunkerElevatorSender");
static_assert(offsetof(BunkerElevatorSender_C_ExecuteUbergraph_BunkerElevatorSender, EntryPoint) == 0x000000, "Member 'BunkerElevatorSender_C_ExecuteUbergraph_BunkerElevatorSender::EntryPoint' has a wrong offset!");
static_assert(offsetof(BunkerElevatorSender_C_ExecuteUbergraph_BunkerElevatorSender, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BunkerElevatorSender_C_ExecuteUbergraph_BunkerElevatorSender::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BunkerElevatorSender_C_ExecuteUbergraph_BunkerElevatorSender, CallFunc_HasActorsInside_HasActors) == 0x000005, "Member 'BunkerElevatorSender_C_ExecuteUbergraph_BunkerElevatorSender::CallFunc_HasActorsInside_HasActors' has a wrong offset!");
static_assert(offsetof(BunkerElevatorSender_C_ExecuteUbergraph_BunkerElevatorSender, CallFunc_GetGameState_ReturnValue) == 0x000008, "Member 'BunkerElevatorSender_C_ExecuteUbergraph_BunkerElevatorSender::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BunkerElevatorSender_C_ExecuteUbergraph_BunkerElevatorSender, K2Node_DynamicCast_AsGS_TDB) == 0x000010, "Member 'BunkerElevatorSender_C_ExecuteUbergraph_BunkerElevatorSender::K2Node_DynamicCast_AsGS_TDB' has a wrong offset!");
static_assert(offsetof(BunkerElevatorSender_C_ExecuteUbergraph_BunkerElevatorSender, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BunkerElevatorSender_C_ExecuteUbergraph_BunkerElevatorSender::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BunkerElevatorSender_C_ExecuteUbergraph_BunkerElevatorSender, K2Node_Event_DeltaTime) == 0x000020, "Member 'BunkerElevatorSender_C_ExecuteUbergraph_BunkerElevatorSender::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(BunkerElevatorSender_C_ExecuteUbergraph_BunkerElevatorSender, CallFunc_HasBunker_HasBunker) == 0x000028, "Member 'BunkerElevatorSender_C_ExecuteUbergraph_BunkerElevatorSender::CallFunc_HasBunker_HasBunker' has a wrong offset!");
static_assert(offsetof(BunkerElevatorSender_C_ExecuteUbergraph_BunkerElevatorSender, CallFunc_Concat_StrStr_ReturnValue) == 0x000030, "Member 'BunkerElevatorSender_C_ExecuteUbergraph_BunkerElevatorSender::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BunkerElevatorSender_C_ExecuteUbergraph_BunkerElevatorSender, CallFunc_GetGameState_ReturnValue_1) == 0x000040, "Member 'BunkerElevatorSender_C_ExecuteUbergraph_BunkerElevatorSender::CallFunc_GetGameState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BunkerElevatorSender_C_ExecuteUbergraph_BunkerElevatorSender, CallFunc_GetBunkerLevelNameByElevator_LevelName) == 0x000048, "Member 'BunkerElevatorSender_C_ExecuteUbergraph_BunkerElevatorSender::CallFunc_GetBunkerLevelNameByElevator_LevelName' has a wrong offset!");
static_assert(offsetof(BunkerElevatorSender_C_ExecuteUbergraph_BunkerElevatorSender, K2Node_DynamicCast_AsGS_TDB_1) == 0x000058, "Member 'BunkerElevatorSender_C_ExecuteUbergraph_BunkerElevatorSender::K2Node_DynamicCast_AsGS_TDB_1' has a wrong offset!");
static_assert(offsetof(BunkerElevatorSender_C_ExecuteUbergraph_BunkerElevatorSender, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'BunkerElevatorSender_C_ExecuteUbergraph_BunkerElevatorSender::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BunkerElevatorSender_C_ExecuteUbergraph_BunkerElevatorSender, CallFunc_Conv_StringToName_ReturnValue) == 0x000064, "Member 'BunkerElevatorSender_C_ExecuteUbergraph_BunkerElevatorSender::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");

// Function BunkerElevatorSender.BunkerElevatorSender_C.ProcessPreparingToTeleportState
// 0x0008 (0x0008 - 0x0000)
struct BunkerElevatorSender_C_ProcessPreparingToTeleportState final
{
public:
	double                                        DeltaTime;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BunkerElevatorSender_C_ProcessPreparingToTeleportState) == 0x000008, "Wrong alignment on BunkerElevatorSender_C_ProcessPreparingToTeleportState");
static_assert(sizeof(BunkerElevatorSender_C_ProcessPreparingToTeleportState) == 0x000008, "Wrong size on BunkerElevatorSender_C_ProcessPreparingToTeleportState");
static_assert(offsetof(BunkerElevatorSender_C_ProcessPreparingToTeleportState, DeltaTime) == 0x000000, "Member 'BunkerElevatorSender_C_ProcessPreparingToTeleportState::DeltaTime' has a wrong offset!");

// Function BunkerElevatorSender.BunkerElevatorSender_C.RecieverCanAcceptActors
// 0x0001 (0x0001 - 0x0000)
struct BunkerElevatorSender_C_RecieverCanAcceptActors final
{
public:
	bool                                          CanRecieve;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BunkerElevatorSender_C_RecieverCanAcceptActors) == 0x000001, "Wrong alignment on BunkerElevatorSender_C_RecieverCanAcceptActors");
static_assert(sizeof(BunkerElevatorSender_C_RecieverCanAcceptActors) == 0x000001, "Wrong size on BunkerElevatorSender_C_RecieverCanAcceptActors");
static_assert(offsetof(BunkerElevatorSender_C_RecieverCanAcceptActors, CanRecieve) == 0x000000, "Member 'BunkerElevatorSender_C_RecieverCanAcceptActors::CanRecieve' has a wrong offset!");

}

