#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BunkerAreaV2

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BunkerAreaV2.BunkerAreaV2_C.AddPlayerRespawnPoint
// 0x0070 (0x0070 - 0x0000)
struct BunkerAreaV2_C_AddPlayerRespawnPoint final
{
public:
	class ASurvivalPlayer_C*                      Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC;                  // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC_1;                // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetResurrectLocation_Success;             // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetResurrectLocation_Location;            // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BunkerAreaV2_C_AddPlayerRespawnPoint) == 0x000008, "Wrong alignment on BunkerAreaV2_C_AddPlayerRespawnPoint");
static_assert(sizeof(BunkerAreaV2_C_AddPlayerRespawnPoint) == 0x000070, "Wrong size on BunkerAreaV2_C_AddPlayerRespawnPoint");
static_assert(offsetof(BunkerAreaV2_C_AddPlayerRespawnPoint, Player) == 0x000000, "Member 'BunkerAreaV2_C_AddPlayerRespawnPoint::Player' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_AddPlayerRespawnPoint, CallFunc_GetController_ReturnValue) == 0x000008, "Member 'BunkerAreaV2_C_AddPlayerRespawnPoint::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_AddPlayerRespawnPoint, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000010, "Member 'BunkerAreaV2_C_AddPlayerRespawnPoint::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_AddPlayerRespawnPoint, K2Node_DynamicCast_AsBPI_Surv_PC) == 0x000028, "Member 'BunkerAreaV2_C_AddPlayerRespawnPoint::K2Node_DynamicCast_AsBPI_Surv_PC' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_AddPlayerRespawnPoint, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BunkerAreaV2_C_AddPlayerRespawnPoint::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_AddPlayerRespawnPoint, K2Node_DynamicCast_AsBPI_Surv_PC_1) == 0x000040, "Member 'BunkerAreaV2_C_AddPlayerRespawnPoint::K2Node_DynamicCast_AsBPI_Surv_PC_1' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_AddPlayerRespawnPoint, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'BunkerAreaV2_C_AddPlayerRespawnPoint::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_AddPlayerRespawnPoint, CallFunc_SetResurrectLocation_Success) == 0x000051, "Member 'BunkerAreaV2_C_AddPlayerRespawnPoint::CallFunc_SetResurrectLocation_Success' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_AddPlayerRespawnPoint, CallFunc_GetResurrectLocation_Location) == 0x000058, "Member 'BunkerAreaV2_C_AddPlayerRespawnPoint::CallFunc_GetResurrectLocation_Location' has a wrong offset!");

// Function BunkerAreaV2.BunkerAreaV2_C.ConfigureEnabledLights
// 0x0038 (0x0038 - 0x0000)
struct BunkerAreaV2_C_ConfigureEnabledLights final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASquare_lamp_Blueprint_C*               CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ALight*                                 CallFunc_Array_Get_Item_1;                         // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BunkerAreaV2_C_ConfigureEnabledLights) == 0x000008, "Wrong alignment on BunkerAreaV2_C_ConfigureEnabledLights");
static_assert(sizeof(BunkerAreaV2_C_ConfigureEnabledLights) == 0x000038, "Wrong size on BunkerAreaV2_C_ConfigureEnabledLights");
static_assert(offsetof(BunkerAreaV2_C_ConfigureEnabledLights, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'BunkerAreaV2_C_ConfigureEnabledLights::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ConfigureEnabledLights, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'BunkerAreaV2_C_ConfigureEnabledLights::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ConfigureEnabledLights, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BunkerAreaV2_C_ConfigureEnabledLights::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ConfigureEnabledLights, Temp_int_Array_Index_Variable_1) == 0x00000C, "Member 'BunkerAreaV2_C_ConfigureEnabledLights::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ConfigureEnabledLights, Temp_int_Loop_Counter_Variable_1) == 0x000010, "Member 'BunkerAreaV2_C_ConfigureEnabledLights::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ConfigureEnabledLights, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'BunkerAreaV2_C_ConfigureEnabledLights::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ConfigureEnabledLights, CallFunc_Array_Get_Item) == 0x000018, "Member 'BunkerAreaV2_C_ConfigureEnabledLights::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ConfigureEnabledLights, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BunkerAreaV2_C_ConfigureEnabledLights::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ConfigureEnabledLights, CallFunc_Less_IntInt_ReturnValue) == 0x000024, "Member 'BunkerAreaV2_C_ConfigureEnabledLights::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ConfigureEnabledLights, CallFunc_Array_Get_Item_1) == 0x000028, "Member 'BunkerAreaV2_C_ConfigureEnabledLights::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ConfigureEnabledLights, CallFunc_Array_Length_ReturnValue_1) == 0x000030, "Member 'BunkerAreaV2_C_ConfigureEnabledLights::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ConfigureEnabledLights, CallFunc_Less_IntInt_ReturnValue_1) == 0x000034, "Member 'BunkerAreaV2_C_ConfigureEnabledLights::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function BunkerAreaV2.BunkerAreaV2_C.ConfigureInitialLights
// 0x0038 (0x0038 - 0x0000)
struct BunkerAreaV2_C_ConfigureInitialLights final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASquare_lamp_Blueprint_C*               CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ALight*                                 CallFunc_Array_Get_Item_1;                         // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BunkerAreaV2_C_ConfigureInitialLights) == 0x000008, "Wrong alignment on BunkerAreaV2_C_ConfigureInitialLights");
static_assert(sizeof(BunkerAreaV2_C_ConfigureInitialLights) == 0x000038, "Wrong size on BunkerAreaV2_C_ConfigureInitialLights");
static_assert(offsetof(BunkerAreaV2_C_ConfigureInitialLights, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'BunkerAreaV2_C_ConfigureInitialLights::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ConfigureInitialLights, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'BunkerAreaV2_C_ConfigureInitialLights::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ConfigureInitialLights, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BunkerAreaV2_C_ConfigureInitialLights::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ConfigureInitialLights, Temp_int_Array_Index_Variable_1) == 0x00000C, "Member 'BunkerAreaV2_C_ConfigureInitialLights::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ConfigureInitialLights, Temp_int_Loop_Counter_Variable_1) == 0x000010, "Member 'BunkerAreaV2_C_ConfigureInitialLights::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ConfigureInitialLights, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'BunkerAreaV2_C_ConfigureInitialLights::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ConfigureInitialLights, CallFunc_Array_Get_Item) == 0x000018, "Member 'BunkerAreaV2_C_ConfigureInitialLights::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ConfigureInitialLights, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BunkerAreaV2_C_ConfigureInitialLights::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ConfigureInitialLights, CallFunc_Less_IntInt_ReturnValue) == 0x000024, "Member 'BunkerAreaV2_C_ConfigureInitialLights::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ConfigureInitialLights, CallFunc_Array_Get_Item_1) == 0x000028, "Member 'BunkerAreaV2_C_ConfigureInitialLights::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ConfigureInitialLights, CallFunc_Array_Length_ReturnValue_1) == 0x000030, "Member 'BunkerAreaV2_C_ConfigureInitialLights::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ConfigureInitialLights, CallFunc_Less_IntInt_ReturnValue_1) == 0x000034, "Member 'BunkerAreaV2_C_ConfigureInitialLights::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function BunkerAreaV2.BunkerAreaV2_C.ExecuteUbergraph_BunkerAreaV2
// 0x0200 (0x0200 - 0x0000)
struct BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_2;      // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_GS_TDB_C>         K2Node_DynamicCast_AsBPI_GS_TDB;                   // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBunkerSystem_C*                        CallFunc_GetBunkerSystem_BunkerSystem;             // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasBunkerSkyLight_Has;                    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_FogController_C*                    CallFunc_GetActorOfClass_ReturnValue;              // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_FogController_C*                    CallFunc_GetActorOfClass_ReturnValue_1;            // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetBunkerSkyLight_Light;                  // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_CustomEvent_Color;                          // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AElectricityGenerator_C*                K2Node_Event_Generator;                            // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALight*                                 CallFunc_Array_Get_Item;                           // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IElectricityConsumer_C> CallFunc_AddListener_Listener_CastInput;           // 0x0110(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_FogController_C*                    CallFunc_GetActorOfClass_ReturnValue_2;            // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_AmbientController_C*                CallFunc_GetActorOfClass_ReturnValue_3;            // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_AmbientController_C*                CallFunc_GetActorOfClass_ReturnValue_4;            // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_Event_Player;                               // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x015A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15B[0x5];                                      // 0x015B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BlizzardController_C*               CallFunc_GetActorOfClass_ReturnValue_5;            // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetStat_Value;                            // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BlizzardController_C*               CallFunc_GetActorOfClass_ReturnValue_6;            // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_AmbientController_C*                CallFunc_GetActorOfClass_ReturnValue_7;            // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_FogController_C*                    CallFunc_GetActorOfClass_ReturnValue_8;            // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_FogController_C*                    CallFunc_GetActorOfClass_ReturnValue_9;            // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_1;               // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GS_TDB_C>         K2Node_DynamicCast_AsBPI_GS_TDB_1;                 // 0x01A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBunkerSystem_C*                        CallFunc_GetBunkerSystem_BunkerSystem_1;           // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasBunkerGeneratorEnabledLight_Has;       // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CD[0x3];                                      // 0x01CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor_1;                         // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player_1;            // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_1;        // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E2[0x2];                                      // 0x01E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetBunkerGeneratorEnabledLight_Light;     // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetIntensity_NewIntensity_ImplicitCast;   // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetIntensity_NewIntensity_ImplicitCast_1; // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2) == 0x000008, "Wrong alignment on BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2");
static_assert(sizeof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2) == 0x000200, "Wrong size on BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, EntryPoint) == 0x000000, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::EntryPoint' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, CallFunc_HasAuthority_ReturnValue_1) == 0x00000C, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000018, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000028, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000040, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, CallFunc_Vector_Distance_ReturnValue) == 0x000058, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, CallFunc_IsValid_ReturnValue_1) == 0x000060, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000068, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000070, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, CallFunc_Subtract_DoubleDouble_ReturnValue_2) == 0x000080, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::CallFunc_Subtract_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, CallFunc_Less_IntInt_ReturnValue) == 0x000088, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, CallFunc_FClamp_ReturnValue) == 0x000090, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000098, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, CallFunc_GetGameState_ReturnValue) == 0x0000A0, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, CallFunc_Less_DoubleDouble_ReturnValue) == 0x0000A8, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, K2Node_DynamicCast_AsBPI_GS_TDB) == 0x0000B0, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::K2Node_DynamicCast_AsBPI_GS_TDB' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, K2Node_DynamicCast_bSuccess) == 0x0000C0, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, CallFunc_GetBunkerSystem_BunkerSystem) == 0x0000C8, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::CallFunc_GetBunkerSystem_BunkerSystem' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, CallFunc_HasBunkerSkyLight_Has) == 0x0000D0, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::CallFunc_HasBunkerSkyLight_Has' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, CallFunc_GetActorOfClass_ReturnValue) == 0x0000D8, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, CallFunc_GetActorOfClass_ReturnValue_1) == 0x0000E0, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::CallFunc_GetActorOfClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, CallFunc_GetBunkerSkyLight_Light) == 0x0000E8, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::CallFunc_GetBunkerSkyLight_Light' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, K2Node_CustomEvent_Color) == 0x0000F0, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::K2Node_CustomEvent_Color' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, K2Node_Event_Generator) == 0x000100, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::K2Node_Event_Generator' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, CallFunc_Array_Get_Item) == 0x000108, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, CallFunc_AddListener_Listener_CastInput) == 0x000110, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::CallFunc_AddListener_Listener_CastInput' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, CallFunc_Array_Length_ReturnValue_1) == 0x000120, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, CallFunc_Less_IntInt_ReturnValue_1) == 0x000124, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, CallFunc_GetActorOfClass_ReturnValue_2) == 0x000128, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::CallFunc_GetActorOfClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, CallFunc_GetActorOfClass_ReturnValue_3) == 0x000130, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::CallFunc_GetActorOfClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, CallFunc_GetActorOfClass_ReturnValue_4) == 0x000138, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::CallFunc_GetActorOfClass_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, K2Node_Event_Player) == 0x000140, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::K2Node_Event_Player' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, K2Node_Event_OtherActor) == 0x000148, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, K2Node_DynamicCast_AsSurvival_Player) == 0x000150, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, K2Node_DynamicCast_bSuccess_1) == 0x000158, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, CallFunc_IsLocallyControlled_ReturnValue) == 0x000159, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, CallFunc_Array_RemoveItem_ReturnValue) == 0x00015A, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, CallFunc_GetActorOfClass_ReturnValue_5) == 0x000160, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::CallFunc_GetActorOfClass_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, CallFunc_GetStat_Value) == 0x000168, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::CallFunc_GetStat_Value' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000170, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, CallFunc_GetActorOfClass_ReturnValue_6) == 0x000178, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::CallFunc_GetActorOfClass_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, CallFunc_GetActorOfClass_ReturnValue_7) == 0x000180, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::CallFunc_GetActorOfClass_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000188, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, CallFunc_GetActorOfClass_ReturnValue_8) == 0x000190, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::CallFunc_GetActorOfClass_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, CallFunc_GetActorOfClass_ReturnValue_9) == 0x000198, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::CallFunc_GetActorOfClass_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, CallFunc_GetGameState_ReturnValue_1) == 0x0001A0, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::CallFunc_GetGameState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, K2Node_DynamicCast_AsBPI_GS_TDB_1) == 0x0001A8, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::K2Node_DynamicCast_AsBPI_GS_TDB_1' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, K2Node_DynamicCast_bSuccess_2) == 0x0001B8, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, CallFunc_GetBunkerSystem_BunkerSystem_1) == 0x0001C0, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::CallFunc_GetBunkerSystem_BunkerSystem_1' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, K2Node_Event_DeltaSeconds) == 0x0001C8, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, CallFunc_HasBunkerGeneratorEnabledLight_Has) == 0x0001CC, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::CallFunc_HasBunkerGeneratorEnabledLight_Has' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, K2Node_Event_OtherActor_1) == 0x0001D0, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::K2Node_Event_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, K2Node_DynamicCast_AsSurvival_Player_1) == 0x0001D8, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::K2Node_DynamicCast_AsSurvival_Player_1' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, K2Node_DynamicCast_bSuccess_3) == 0x0001E0, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, CallFunc_IsLocallyControlled_ReturnValue_1) == 0x0001E1, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::CallFunc_IsLocallyControlled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, CallFunc_Array_AddUnique_ReturnValue) == 0x0001E4, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, CallFunc_Array_Contains_ReturnValue) == 0x0001E8, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, CallFunc_GetBunkerGeneratorEnabledLight_Light) == 0x0001F0, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::CallFunc_GetBunkerGeneratorEnabledLight_Light' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, CallFunc_SetIntensity_NewIntensity_ImplicitCast) == 0x0001F8, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::CallFunc_SetIntensity_NewIntensity_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2, CallFunc_SetIntensity_NewIntensity_ImplicitCast_1) == 0x0001FC, "Member 'BunkerAreaV2_C_ExecuteUbergraph_BunkerAreaV2::CallFunc_SetIntensity_NewIntensity_ImplicitCast_1' has a wrong offset!");

// Function BunkerAreaV2.BunkerAreaV2_C.OnGeneratorEnabled
// 0x0008 (0x0008 - 0x0000)
struct BunkerAreaV2_C_OnGeneratorEnabled final
{
public:
	class ASurvivalPlayer_C*                      Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BunkerAreaV2_C_OnGeneratorEnabled) == 0x000008, "Wrong alignment on BunkerAreaV2_C_OnGeneratorEnabled");
static_assert(sizeof(BunkerAreaV2_C_OnGeneratorEnabled) == 0x000008, "Wrong size on BunkerAreaV2_C_OnGeneratorEnabled");
static_assert(offsetof(BunkerAreaV2_C_OnGeneratorEnabled, Player) == 0x000000, "Member 'BunkerAreaV2_C_OnGeneratorEnabled::Player' has a wrong offset!");

// Function BunkerAreaV2.BunkerAreaV2_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct BunkerAreaV2_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BunkerAreaV2_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on BunkerAreaV2_C_ReceiveActorBeginOverlap");
static_assert(sizeof(BunkerAreaV2_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on BunkerAreaV2_C_ReceiveActorBeginOverlap");
static_assert(offsetof(BunkerAreaV2_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'BunkerAreaV2_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

// Function BunkerAreaV2.BunkerAreaV2_C.ReceiveActorEndOverlap
// 0x0008 (0x0008 - 0x0000)
struct BunkerAreaV2_C_ReceiveActorEndOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BunkerAreaV2_C_ReceiveActorEndOverlap) == 0x000008, "Wrong alignment on BunkerAreaV2_C_ReceiveActorEndOverlap");
static_assert(sizeof(BunkerAreaV2_C_ReceiveActorEndOverlap) == 0x000008, "Wrong size on BunkerAreaV2_C_ReceiveActorEndOverlap");
static_assert(offsetof(BunkerAreaV2_C_ReceiveActorEndOverlap, OtherActor) == 0x000000, "Member 'BunkerAreaV2_C_ReceiveActorEndOverlap::OtherActor' has a wrong offset!");

// Function BunkerAreaV2.BunkerAreaV2_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BunkerAreaV2_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BunkerAreaV2_C_ReceiveTick) == 0x000004, "Wrong alignment on BunkerAreaV2_C_ReceiveTick");
static_assert(sizeof(BunkerAreaV2_C_ReceiveTick) == 0x000004, "Wrong size on BunkerAreaV2_C_ReceiveTick");
static_assert(offsetof(BunkerAreaV2_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BunkerAreaV2_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BunkerAreaV2.BunkerAreaV2_C.RemovePlayerRespawnPoint
// 0x0048 (0x0048 - 0x0000)
struct BunkerAreaV2_C_RemovePlayerRespawnPoint final
{
public:
	class ASurvivalPlayer_C*                      Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Map_Find_Value;                           // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC;                  // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetResurrectLocation_Success;             // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BunkerAreaV2_C_RemovePlayerRespawnPoint) == 0x000008, "Wrong alignment on BunkerAreaV2_C_RemovePlayerRespawnPoint");
static_assert(sizeof(BunkerAreaV2_C_RemovePlayerRespawnPoint) == 0x000048, "Wrong size on BunkerAreaV2_C_RemovePlayerRespawnPoint");
static_assert(offsetof(BunkerAreaV2_C_RemovePlayerRespawnPoint, Player) == 0x000000, "Member 'BunkerAreaV2_C_RemovePlayerRespawnPoint::Player' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_RemovePlayerRespawnPoint, CallFunc_GetController_ReturnValue) == 0x000008, "Member 'BunkerAreaV2_C_RemovePlayerRespawnPoint::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_RemovePlayerRespawnPoint, CallFunc_Map_Find_Value) == 0x000010, "Member 'BunkerAreaV2_C_RemovePlayerRespawnPoint::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_RemovePlayerRespawnPoint, CallFunc_Map_Find_ReturnValue) == 0x000028, "Member 'BunkerAreaV2_C_RemovePlayerRespawnPoint::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_RemovePlayerRespawnPoint, K2Node_DynamicCast_AsBPI_Surv_PC) == 0x000030, "Member 'BunkerAreaV2_C_RemovePlayerRespawnPoint::K2Node_DynamicCast_AsBPI_Surv_PC' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_RemovePlayerRespawnPoint, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BunkerAreaV2_C_RemovePlayerRespawnPoint::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_RemovePlayerRespawnPoint, CallFunc_SetResurrectLocation_Success) == 0x000041, "Member 'BunkerAreaV2_C_RemovePlayerRespawnPoint::CallFunc_SetResurrectLocation_Success' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_RemovePlayerRespawnPoint, CallFunc_Map_Remove_ReturnValue) == 0x000042, "Member 'BunkerAreaV2_C_RemovePlayerRespawnPoint::CallFunc_Map_Remove_ReturnValue' has a wrong offset!");

// Function BunkerAreaV2.BunkerAreaV2_C.SetLightsColor
// 0x0010 (0x0010 - 0x0000)
struct BunkerAreaV2_C_SetLightsColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BunkerAreaV2_C_SetLightsColor) == 0x000004, "Wrong alignment on BunkerAreaV2_C_SetLightsColor");
static_assert(sizeof(BunkerAreaV2_C_SetLightsColor) == 0x000010, "Wrong size on BunkerAreaV2_C_SetLightsColor");
static_assert(offsetof(BunkerAreaV2_C_SetLightsColor, Color) == 0x000000, "Member 'BunkerAreaV2_C_SetLightsColor::Color' has a wrong offset!");

// Function BunkerAreaV2.BunkerAreaV2_C.SubscribeToGenerator
// 0x0008 (0x0008 - 0x0000)
struct BunkerAreaV2_C_SubscribeToGenerator final
{
public:
	class AElectricityGenerator_C*                Generator;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BunkerAreaV2_C_SubscribeToGenerator) == 0x000008, "Wrong alignment on BunkerAreaV2_C_SubscribeToGenerator");
static_assert(sizeof(BunkerAreaV2_C_SubscribeToGenerator) == 0x000008, "Wrong size on BunkerAreaV2_C_SubscribeToGenerator");
static_assert(offsetof(BunkerAreaV2_C_SubscribeToGenerator, Generator) == 0x000000, "Member 'BunkerAreaV2_C_SubscribeToGenerator::Generator' has a wrong offset!");

// Function BunkerAreaV2.BunkerAreaV2_C.SwitchToMainQuests
// 0x0020 (0x0020 - 0x0000)
struct BunkerAreaV2_C_SwitchToMainQuests final
{
public:
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GS_TDB_C>         K2Node_DynamicCast_AsBPI_GS_TDB;                   // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BunkerAreaV2_C_SwitchToMainQuests) == 0x000008, "Wrong alignment on BunkerAreaV2_C_SwitchToMainQuests");
static_assert(sizeof(BunkerAreaV2_C_SwitchToMainQuests) == 0x000020, "Wrong size on BunkerAreaV2_C_SwitchToMainQuests");
static_assert(offsetof(BunkerAreaV2_C_SwitchToMainQuests, CallFunc_GetGameState_ReturnValue) == 0x000000, "Member 'BunkerAreaV2_C_SwitchToMainQuests::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_SwitchToMainQuests, K2Node_DynamicCast_AsBPI_GS_TDB) == 0x000008, "Member 'BunkerAreaV2_C_SwitchToMainQuests::K2Node_DynamicCast_AsBPI_GS_TDB' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_SwitchToMainQuests, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BunkerAreaV2_C_SwitchToMainQuests::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BunkerAreaV2.BunkerAreaV2_C.SwitchToSideQuests
// 0x0020 (0x0020 - 0x0000)
struct BunkerAreaV2_C_SwitchToSideQuests final
{
public:
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GS_TDB_C>         K2Node_DynamicCast_AsBPI_GS_TDB;                   // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BunkerAreaV2_C_SwitchToSideQuests) == 0x000008, "Wrong alignment on BunkerAreaV2_C_SwitchToSideQuests");
static_assert(sizeof(BunkerAreaV2_C_SwitchToSideQuests) == 0x000020, "Wrong size on BunkerAreaV2_C_SwitchToSideQuests");
static_assert(offsetof(BunkerAreaV2_C_SwitchToSideQuests, CallFunc_GetGameState_ReturnValue) == 0x000000, "Member 'BunkerAreaV2_C_SwitchToSideQuests::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_SwitchToSideQuests, K2Node_DynamicCast_AsBPI_GS_TDB) == 0x000008, "Member 'BunkerAreaV2_C_SwitchToSideQuests::K2Node_DynamicCast_AsBPI_GS_TDB' has a wrong offset!");
static_assert(offsetof(BunkerAreaV2_C_SwitchToSideQuests, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BunkerAreaV2_C_SwitchToSideQuests::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

