#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CameraDummy

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CameraDummy.CameraDummy_C
// 0x00F8 (0x0388 - 0x0290)
class ACameraDummy_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USpotLightComponent*                    Flashlight;                                        // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCineCameraComponent*                   CineCamera;                                        // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube;                                              // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULegacyCameraShake*                     LastShake;                                         // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<class UClass*, class UCameraShakeBase*>  Shakes;                                            // 0x02C8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ASurvivalPlayer_C*                      Pawwn;                                             // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<int32, class UClass*>                    IntShakes;                                         // 0x0328(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        CurrentActiveShake;                                // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	double                                        LastActiveShake;                                   // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void _StanceShakes(int32 ActivatedShake);
	void DisableFlashlight();
	void EnableFlashlight();
	void ExecuteUbergraph_CameraDummy(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void ShakeEnd(const class UClass* Key);
	void ShakePlay(class UClass* ShakeClass);
	void Update();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CameraDummy_C">();
	}
	static class ACameraDummy_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACameraDummy_C>();
	}
};
static_assert(alignof(ACameraDummy_C) == 0x000008, "Wrong alignment on ACameraDummy_C");
static_assert(sizeof(ACameraDummy_C) == 0x000388, "Wrong size on ACameraDummy_C");
static_assert(offsetof(ACameraDummy_C, UberGraphFrame) == 0x000290, "Member 'ACameraDummy_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ACameraDummy_C, Flashlight) == 0x000298, "Member 'ACameraDummy_C::Flashlight' has a wrong offset!");
static_assert(offsetof(ACameraDummy_C, CineCamera) == 0x0002A0, "Member 'ACameraDummy_C::CineCamera' has a wrong offset!");
static_assert(offsetof(ACameraDummy_C, Arrow) == 0x0002A8, "Member 'ACameraDummy_C::Arrow' has a wrong offset!");
static_assert(offsetof(ACameraDummy_C, Cube) == 0x0002B0, "Member 'ACameraDummy_C::Cube' has a wrong offset!");
static_assert(offsetof(ACameraDummy_C, DefaultSceneRoot) == 0x0002B8, "Member 'ACameraDummy_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ACameraDummy_C, LastShake) == 0x0002C0, "Member 'ACameraDummy_C::LastShake' has a wrong offset!");
static_assert(offsetof(ACameraDummy_C, Shakes) == 0x0002C8, "Member 'ACameraDummy_C::Shakes' has a wrong offset!");
static_assert(offsetof(ACameraDummy_C, Pawwn) == 0x000318, "Member 'ACameraDummy_C::Pawwn' has a wrong offset!");
static_assert(offsetof(ACameraDummy_C, Actor) == 0x000320, "Member 'ACameraDummy_C::Actor' has a wrong offset!");
static_assert(offsetof(ACameraDummy_C, IntShakes) == 0x000328, "Member 'ACameraDummy_C::IntShakes' has a wrong offset!");
static_assert(offsetof(ACameraDummy_C, CurrentActiveShake) == 0x000378, "Member 'ACameraDummy_C::CurrentActiveShake' has a wrong offset!");
static_assert(offsetof(ACameraDummy_C, LastActiveShake) == 0x000380, "Member 'ACameraDummy_C::LastActiveShake' has a wrong offset!");

}

