#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CameraSettings

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct CameraSettings.CameraSettings
// 0x0028 (0x0028 - 0x0000)
struct FCameraSettings final
{
public:
	float                                         SpringArmLength_2_A0B81846478BDFD9971D2A8D96044273; // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CameraHeight_9_C3BF45FB4C9C0EB02FFC4F9575CF9A62;   // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SocketOffset_5_3894B6334CF92741FE22C1975FF3C874;   // 0x0008(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CameraFOV_12_39D72C374F662F889AD9F4B552665627;     // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FCameraSettings) == 0x000008, "Wrong alignment on FCameraSettings");
static_assert(sizeof(FCameraSettings) == 0x000028, "Wrong size on FCameraSettings");
static_assert(offsetof(FCameraSettings, SpringArmLength_2_A0B81846478BDFD9971D2A8D96044273) == 0x000000, "Member 'FCameraSettings::SpringArmLength_2_A0B81846478BDFD9971D2A8D96044273' has a wrong offset!");
static_assert(offsetof(FCameraSettings, CameraHeight_9_C3BF45FB4C9C0EB02FFC4F9575CF9A62) == 0x000004, "Member 'FCameraSettings::CameraHeight_9_C3BF45FB4C9C0EB02FFC4F9575CF9A62' has a wrong offset!");
static_assert(offsetof(FCameraSettings, SocketOffset_5_3894B6334CF92741FE22C1975FF3C874) == 0x000008, "Member 'FCameraSettings::SocketOffset_5_3894B6334CF92741FE22C1975FF3C874' has a wrong offset!");
static_assert(offsetof(FCameraSettings, CameraFOV_12_39D72C374F662F889AD9F4B552665627) == 0x000020, "Member 'FCameraSettings::CameraFOV_12_39D72C374F662F889AD9F4B552665627' has a wrong offset!");

}

