#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CameraDummy

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CameraDummy.CameraDummy_C. StanceShakes
// 0x0010 (0x0010 - 0x0000)
struct CameraDummy_C__StanceShakes final
{
public:
	int32                                         ActivatedShake;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CameraDummy_C__StanceShakes) == 0x000008, "Wrong alignment on CameraDummy_C__StanceShakes");
static_assert(sizeof(CameraDummy_C__StanceShakes) == 0x000010, "Wrong size on CameraDummy_C__StanceShakes");
static_assert(offsetof(CameraDummy_C__StanceShakes, ActivatedShake) == 0x000000, "Member 'CameraDummy_C__StanceShakes::ActivatedShake' has a wrong offset!");
static_assert(offsetof(CameraDummy_C__StanceShakes, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000008, "Member 'CameraDummy_C__StanceShakes::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");

// Function CameraDummy.CameraDummy_C.ExecuteUbergraph_CameraDummy
// 0x01C0 (0x01C0 - 0x0000)
struct CameraDummy_C_ExecuteUbergraph_CameraDummy final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFOVAngle_ReturnValue;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0020(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocationAndRotation_SweepHitResult; // 0x00D0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocationAndRotation_ReturnValue; // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CameraDummy_C_ExecuteUbergraph_CameraDummy) == 0x000010, "Wrong alignment on CameraDummy_C_ExecuteUbergraph_CameraDummy");
static_assert(sizeof(CameraDummy_C_ExecuteUbergraph_CameraDummy) == 0x0001C0, "Wrong size on CameraDummy_C_ExecuteUbergraph_CameraDummy");
static_assert(offsetof(CameraDummy_C_ExecuteUbergraph_CameraDummy, EntryPoint) == 0x000000, "Member 'CameraDummy_C_ExecuteUbergraph_CameraDummy::EntryPoint' has a wrong offset!");
static_assert(offsetof(CameraDummy_C_ExecuteUbergraph_CameraDummy, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000008, "Member 'CameraDummy_C_ExecuteUbergraph_CameraDummy::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraDummy_C_ExecuteUbergraph_CameraDummy, CallFunc_GetFOVAngle_ReturnValue) == 0x000010, "Member 'CameraDummy_C_ExecuteUbergraph_CameraDummy::CallFunc_GetFOVAngle_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraDummy_C_ExecuteUbergraph_CameraDummy, K2Node_Event_DeltaSeconds) == 0x000014, "Member 'CameraDummy_C_ExecuteUbergraph_CameraDummy::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(CameraDummy_C_ExecuteUbergraph_CameraDummy, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000020, "Member 'CameraDummy_C_ExecuteUbergraph_CameraDummy::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraDummy_C_ExecuteUbergraph_CameraDummy, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'CameraDummy_C_ExecuteUbergraph_CameraDummy::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraDummy_C_ExecuteUbergraph_CameraDummy, CallFunc_BreakTransform_Location) == 0x000088, "Member 'CameraDummy_C_ExecuteUbergraph_CameraDummy::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(CameraDummy_C_ExecuteUbergraph_CameraDummy, CallFunc_BreakTransform_Rotation) == 0x0000A0, "Member 'CameraDummy_C_ExecuteUbergraph_CameraDummy::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(CameraDummy_C_ExecuteUbergraph_CameraDummy, CallFunc_BreakTransform_Scale) == 0x0000B8, "Member 'CameraDummy_C_ExecuteUbergraph_CameraDummy::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(CameraDummy_C_ExecuteUbergraph_CameraDummy, CallFunc_K2_SetActorLocationAndRotation_SweepHitResult) == 0x0000D0, "Member 'CameraDummy_C_ExecuteUbergraph_CameraDummy::CallFunc_K2_SetActorLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(CameraDummy_C_ExecuteUbergraph_CameraDummy, CallFunc_K2_SetActorLocationAndRotation_ReturnValue) == 0x0001B8, "Member 'CameraDummy_C_ExecuteUbergraph_CameraDummy::CallFunc_K2_SetActorLocationAndRotation_ReturnValue' has a wrong offset!");

// Function CameraDummy.CameraDummy_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct CameraDummy_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CameraDummy_C_ReceiveTick) == 0x000004, "Wrong alignment on CameraDummy_C_ReceiveTick");
static_assert(sizeof(CameraDummy_C_ReceiveTick) == 0x000004, "Wrong size on CameraDummy_C_ReceiveTick");
static_assert(offsetof(CameraDummy_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'CameraDummy_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function CameraDummy.CameraDummy_C.ShakeEnd
// 0x0040 (0x0040 - 0x0000)
struct CameraDummy_C_ShakeEnd final
{
public:
	const class UClass*                           Key;                                               // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetClassDisplayName_ReturnValue;          // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UCameraShakeBase*                       CallFunc_Map_Find_Value;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CameraDummy_C_ShakeEnd) == 0x000008, "Wrong alignment on CameraDummy_C_ShakeEnd");
static_assert(sizeof(CameraDummy_C_ShakeEnd) == 0x000040, "Wrong size on CameraDummy_C_ShakeEnd");
static_assert(offsetof(CameraDummy_C_ShakeEnd, Key) == 0x000000, "Member 'CameraDummy_C_ShakeEnd::Key' has a wrong offset!");
static_assert(offsetof(CameraDummy_C_ShakeEnd, CallFunc_GetClassDisplayName_ReturnValue) == 0x000008, "Member 'CameraDummy_C_ShakeEnd::CallFunc_GetClassDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraDummy_C_ShakeEnd, CallFunc_Map_Find_Value) == 0x000018, "Member 'CameraDummy_C_ShakeEnd::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(CameraDummy_C_ShakeEnd, CallFunc_Map_Find_ReturnValue) == 0x000020, "Member 'CameraDummy_C_ShakeEnd::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraDummy_C_ShakeEnd, CallFunc_Concat_StrStr_ReturnValue) == 0x000028, "Member 'CameraDummy_C_ShakeEnd::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraDummy_C_ShakeEnd, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000038, "Member 'CameraDummy_C_ShakeEnd::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");

// Function CameraDummy.CameraDummy_C.ShakePlay
// 0x0038 (0x0038 - 0x0000)
struct CameraDummy_C_ShakePlay final
{
public:
	class UClass*                                 ShakeClass;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetClassDisplayName_ReturnValue;          // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UCameraShakeBase*                       CallFunc_StartCameraShake_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CameraDummy_C_ShakePlay) == 0x000008, "Wrong alignment on CameraDummy_C_ShakePlay");
static_assert(sizeof(CameraDummy_C_ShakePlay) == 0x000038, "Wrong size on CameraDummy_C_ShakePlay");
static_assert(offsetof(CameraDummy_C_ShakePlay, ShakeClass) == 0x000000, "Member 'CameraDummy_C_ShakePlay::ShakeClass' has a wrong offset!");
static_assert(offsetof(CameraDummy_C_ShakePlay, CallFunc_GetClassDisplayName_ReturnValue) == 0x000008, "Member 'CameraDummy_C_ShakePlay::CallFunc_GetClassDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraDummy_C_ShakePlay, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000018, "Member 'CameraDummy_C_ShakePlay::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraDummy_C_ShakePlay, CallFunc_Concat_StrStr_ReturnValue) == 0x000020, "Member 'CameraDummy_C_ShakePlay::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraDummy_C_ShakePlay, CallFunc_StartCameraShake_ReturnValue) == 0x000030, "Member 'CameraDummy_C_ShakePlay::CallFunc_StartCameraShake_ReturnValue' has a wrong offset!");

}

