#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChairParent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_InteractType_structs.hpp"
#include "E_ActorType_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ChairParent.ChairParent_C.ExecuteUbergraph_ChairParent
// 0x0490 (0x0490 - 0x0000)
struct ChairParent_C_ExecuteUbergraph_ChairParent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USurviveAnimator2_C*                    K2Node_DynamicCast_AsSurvive_Animator_2;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x003C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x006C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x007C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x0084(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0094(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x00A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_Player_8;                             // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_Player_7;                             // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_Player_6;                             // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_Player_5;                             // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_Player_4;                             // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SitIndex;                             // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_SkipAnimation;                        // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_Player_3;                             // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_Player_2;                             // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_Player_1;                             // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_Player;                               // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Visible_1;                            // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Visible;                              // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_102[0x6];                                      // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      K2Node_CustomEvent_Player_2;                       // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_OnTrain;                        // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      K2Node_CustomEvent_Player_1;                       // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Sit_1;                          // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_V2_C*                   K2Node_DynamicCast_AsSurvival_Player_V2;           // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_V2_C*                   K2Node_DynamicCast_AsSurvival_Player_V2_1;         // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetCurrentMontage_ReturnValue;            // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_1;        // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_152[0x6];                                      // 0x0152(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      K2Node_CustomEvent_Player;                         // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Sit;                            // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue_1;                     // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_GameHUD_C*                          K2Node_DynamicCast_AsBP_Game_HUD;                  // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_GameHUD_C*                          K2Node_DynamicCast_AsBP_Game_HUD_1;                // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A2[0x6];                                      // 0x01A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival;                  // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival_1;                // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_2;            // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_3;            // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival_2;                // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival_3;                // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_2;        // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInHouse_ReturnValue;                    // 0x021A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21B[0x5];                                      // 0x021B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_Select_Default;                             // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Select_Default_1;                           // 0x0228(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_3;        // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23A[0x6];                                      // 0x023A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0240(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_TeleportTo_ReturnValue;                // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0260(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x0349(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34A[0x6];                                      // 0x034A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue_1;    // 0x0350(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0368(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_TeleportTo_ReturnValue_1;              // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_381[0x7];                                      // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult_1;     // 0x0388(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue_1;        // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0471(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_472[0x6];                                      // 0x0472(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x0478(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USurviveAnimator2_C*                    K2Node_DynamicCast_AsSurvive_Animator_2_1;         // 0x0480(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChairParent_C_ExecuteUbergraph_ChairParent) == 0x000008, "Wrong alignment on ChairParent_C_ExecuteUbergraph_ChairParent");
static_assert(sizeof(ChairParent_C_ExecuteUbergraph_ChairParent) == 0x000490, "Wrong size on ChairParent_C_ExecuteUbergraph_ChairParent");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, EntryPoint) == 0x000000, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::EntryPoint' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, CallFunc_GetAnimInstance_ReturnValue) == 0x000008, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, K2Node_DynamicCast_AsSurvive_Animator_2) == 0x000010, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::K2Node_DynamicCast_AsSurvive_Animator_2' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, K2Node_CustomEvent_NotifyName_4) == 0x00001C, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, K2Node_CustomEvent_NotifyName_3) == 0x000034, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, K2Node_CreateDelegate_OutputDelegate_1) == 0x00003C, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, K2Node_CustomEvent_NotifyName_2) == 0x00004C, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, K2Node_CreateDelegate_OutputDelegate_2) == 0x000054, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, K2Node_CustomEvent_NotifyName_1) == 0x000064, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, K2Node_CreateDelegate_OutputDelegate_3) == 0x00006C, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, K2Node_CustomEvent_NotifyName) == 0x00007C, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, K2Node_CreateDelegate_OutputDelegate_4) == 0x000084, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, Temp_name_Variable) == 0x000094, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, Temp_bool_Variable) == 0x00009C, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, Temp_struct_Variable) == 0x0000A0, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, Temp_bool_Variable_1) == 0x0000A8, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, K2Node_Event_Player_8) == 0x0000B0, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::K2Node_Event_Player_8' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, K2Node_Event_Player_7) == 0x0000B8, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::K2Node_Event_Player_7' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, K2Node_Event_Player_6) == 0x0000C0, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::K2Node_Event_Player_6' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, K2Node_Event_Player_5) == 0x0000C8, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::K2Node_Event_Player_5' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, K2Node_Event_Player_4) == 0x0000D0, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::K2Node_Event_Player_4' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, K2Node_Event_SitIndex) == 0x0000D8, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::K2Node_Event_SitIndex' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, K2Node_Event_SkipAnimation) == 0x0000DC, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::K2Node_Event_SkipAnimation' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, K2Node_Event_Player_3) == 0x0000E0, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::K2Node_Event_Player_3' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, K2Node_Event_Player_2) == 0x0000E8, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::K2Node_Event_Player_2' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, K2Node_Event_Player_1) == 0x0000F0, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::K2Node_Event_Player_1' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, K2Node_Event_Player) == 0x0000F8, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::K2Node_Event_Player' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, K2Node_Event_Visible_1) == 0x000100, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::K2Node_Event_Visible_1' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, K2Node_Event_Visible) == 0x000101, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::K2Node_Event_Visible' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, K2Node_CustomEvent_Player_2) == 0x000108, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::K2Node_CustomEvent_Player_2' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, K2Node_CustomEvent_OnTrain) == 0x000110, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::K2Node_CustomEvent_OnTrain' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, K2Node_CustomEvent_Player_1) == 0x000118, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::K2Node_CustomEvent_Player_1' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, K2Node_CustomEvent_Sit_1) == 0x000120, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::K2Node_CustomEvent_Sit_1' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, K2Node_DynamicCast_AsSurvival_Player_V2) == 0x000128, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::K2Node_DynamicCast_AsSurvival_Player_V2' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, K2Node_DynamicCast_bSuccess_1) == 0x000130, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, K2Node_DynamicCast_AsSurvival_Player_V2_1) == 0x000138, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::K2Node_DynamicCast_AsSurvival_Player_V2_1' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, K2Node_DynamicCast_bSuccess_2) == 0x000140, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, CallFunc_GetCurrentMontage_ReturnValue) == 0x000148, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::CallFunc_GetCurrentMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, CallFunc_IsLocallyControlled_ReturnValue) == 0x000150, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, CallFunc_IsLocallyControlled_ReturnValue_1) == 0x000151, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::CallFunc_IsLocallyControlled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, K2Node_CustomEvent_Player) == 0x000158, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::K2Node_CustomEvent_Player' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, K2Node_CustomEvent_Sit) == 0x000160, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::K2Node_CustomEvent_Sit' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, CallFunc_GetPlayerController_ReturnValue) == 0x000168, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, CallFunc_GetPlayerController_ReturnValue_1) == 0x000170, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, CallFunc_GetHUD_ReturnValue) == 0x000178, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, CallFunc_GetHUD_ReturnValue_1) == 0x000180, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::CallFunc_GetHUD_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, K2Node_DynamicCast_AsBP_Game_HUD) == 0x000188, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::K2Node_DynamicCast_AsBP_Game_HUD' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, K2Node_DynamicCast_bSuccess_3) == 0x000190, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, K2Node_DynamicCast_AsBP_Game_HUD_1) == 0x000198, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::K2Node_DynamicCast_AsBP_Game_HUD_1' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, K2Node_DynamicCast_bSuccess_4) == 0x0001A0, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, Temp_bool_Has_Been_Initd_Variable) == 0x0001A1, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0001A8, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, CallFunc_GetGameInstance_ReturnValue) == 0x0001C0, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, K2Node_DynamicCast_AsGI_Survival) == 0x0001C8, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::K2Node_DynamicCast_AsGI_Survival' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, K2Node_DynamicCast_bSuccess_5) == 0x0001D0, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, CallFunc_GetGameInstance_ReturnValue_1) == 0x0001D8, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, K2Node_DynamicCast_AsGI_Survival_1) == 0x0001E0, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::K2Node_DynamicCast_AsGI_Survival_1' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, K2Node_DynamicCast_bSuccess_6) == 0x0001E8, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, CallFunc_GetGameInstance_ReturnValue_2) == 0x0001F0, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::CallFunc_GetGameInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, CallFunc_GetGameInstance_ReturnValue_3) == 0x0001F8, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::CallFunc_GetGameInstance_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, K2Node_DynamicCast_AsGI_Survival_2) == 0x000200, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::K2Node_DynamicCast_AsGI_Survival_2' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, K2Node_DynamicCast_bSuccess_7) == 0x000208, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, K2Node_DynamicCast_AsGI_Survival_3) == 0x000210, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::K2Node_DynamicCast_AsGI_Survival_3' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, K2Node_DynamicCast_bSuccess_8) == 0x000218, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, CallFunc_IsLocallyControlled_ReturnValue_2) == 0x000219, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::CallFunc_IsLocallyControlled_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, CallFunc_IsInHouse_ReturnValue) == 0x00021A, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::CallFunc_IsInHouse_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, K2Node_Select_Default) == 0x000220, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, K2Node_Select_Default_1) == 0x000228, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x000230, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, CallFunc_IsValid_ReturnValue) == 0x000238, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, CallFunc_IsLocallyControlled_ReturnValue_3) == 0x000239, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::CallFunc_IsLocallyControlled_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000240, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, CallFunc_K2_TeleportTo_ReturnValue) == 0x000258, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::CallFunc_K2_TeleportTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000260, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000348, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, CallFunc_K2_SetActorRotation_ReturnValue) == 0x000349, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, CallFunc_K2_GetComponentRotation_ReturnValue_1) == 0x000350, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::CallFunc_K2_GetComponentRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000368, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, CallFunc_K2_TeleportTo_ReturnValue_1) == 0x000380, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::CallFunc_K2_TeleportTo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, CallFunc_K2_SetActorLocation_SweepHitResult_1) == 0x000388, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::CallFunc_K2_SetActorLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, CallFunc_K2_SetActorLocation_ReturnValue_1) == 0x000470, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::CallFunc_K2_SetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, Temp_bool_IsClosed_Variable) == 0x000471, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, CallFunc_GetAnimInstance_ReturnValue_1) == 0x000478, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, K2Node_DynamicCast_AsSurvive_Animator_2_1) == 0x000480, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::K2Node_DynamicCast_AsSurvive_Animator_2_1' has a wrong offset!");
static_assert(offsetof(ChairParent_C_ExecuteUbergraph_ChairParent, K2Node_DynamicCast_bSuccess_9) == 0x000488, "Member 'ChairParent_C_ExecuteUbergraph_ChairParent::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");

// Function ChairParent.ChairParent_C.GetActorType
// 0x0001 (0x0001 - 0x0000)
struct ChairParent_C_GetActorType final
{
public:
	E_ActorType                                   ActorType;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChairParent_C_GetActorType) == 0x000001, "Wrong alignment on ChairParent_C_GetActorType");
static_assert(sizeof(ChairParent_C_GetActorType) == 0x000001, "Wrong size on ChairParent_C_GetActorType");
static_assert(offsetof(ChairParent_C_GetActorType, ActorType) == 0x000000, "Member 'ChairParent_C_GetActorType::ActorType' has a wrong offset!");

// Function ChairParent.ChairParent_C.IsLocked?
// 0x0001 (0x0001 - 0x0000)
struct ChairParent_C_IsLocked_ final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChairParent_C_IsLocked_) == 0x000001, "Wrong alignment on ChairParent_C_IsLocked_");
static_assert(sizeof(ChairParent_C_IsLocked_) == 0x000001, "Wrong size on ChairParent_C_IsLocked_");
static_assert(offsetof(ChairParent_C_IsLocked_, Result) == 0x000000, "Member 'ChairParent_C_IsLocked_::Result' has a wrong offset!");

// Function ChairParent.ChairParent_C.OnBeginInteract
// 0x0008 (0x0008 - 0x0000)
struct ChairParent_C_OnBeginInteract final
{
public:
	class APawn*                                  Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChairParent_C_OnBeginInteract) == 0x000008, "Wrong alignment on ChairParent_C_OnBeginInteract");
static_assert(sizeof(ChairParent_C_OnBeginInteract) == 0x000008, "Wrong size on ChairParent_C_OnBeginInteract");
static_assert(offsetof(ChairParent_C_OnBeginInteract, Player) == 0x000000, "Member 'ChairParent_C_OnBeginInteract::Player' has a wrong offset!");

// Function ChairParent.ChairParent_C.OnBlendOut_A0AD71D946455417EAAC7F94C6A4E463
// 0x0008 (0x0008 - 0x0000)
struct ChairParent_C_OnBlendOut_A0AD71D946455417EAAC7F94C6A4E463 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChairParent_C_OnBlendOut_A0AD71D946455417EAAC7F94C6A4E463) == 0x000004, "Wrong alignment on ChairParent_C_OnBlendOut_A0AD71D946455417EAAC7F94C6A4E463");
static_assert(sizeof(ChairParent_C_OnBlendOut_A0AD71D946455417EAAC7F94C6A4E463) == 0x000008, "Wrong size on ChairParent_C_OnBlendOut_A0AD71D946455417EAAC7F94C6A4E463");
static_assert(offsetof(ChairParent_C_OnBlendOut_A0AD71D946455417EAAC7F94C6A4E463, NotifyName) == 0x000000, "Member 'ChairParent_C_OnBlendOut_A0AD71D946455417EAAC7F94C6A4E463::NotifyName' has a wrong offset!");

// Function ChairParent.ChairParent_C.OnCompleted_A0AD71D946455417EAAC7F94C6A4E463
// 0x0008 (0x0008 - 0x0000)
struct ChairParent_C_OnCompleted_A0AD71D946455417EAAC7F94C6A4E463 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChairParent_C_OnCompleted_A0AD71D946455417EAAC7F94C6A4E463) == 0x000004, "Wrong alignment on ChairParent_C_OnCompleted_A0AD71D946455417EAAC7F94C6A4E463");
static_assert(sizeof(ChairParent_C_OnCompleted_A0AD71D946455417EAAC7F94C6A4E463) == 0x000008, "Wrong size on ChairParent_C_OnCompleted_A0AD71D946455417EAAC7F94C6A4E463");
static_assert(offsetof(ChairParent_C_OnCompleted_A0AD71D946455417EAAC7F94C6A4E463, NotifyName) == 0x000000, "Member 'ChairParent_C_OnCompleted_A0AD71D946455417EAAC7F94C6A4E463::NotifyName' has a wrong offset!");

// Function ChairParent.ChairParent_C.OnFocused
// 0x00B8 (0x00B8 - 0x0000)
struct ChairParent_C_OnFocused final
{
public:
	class APawn*                                  Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 HighlightActor;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UActorComponent*                        HighlightActorComponent;                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	E_InteractType                                InteractType;                                      // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        LateTime;                                          // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC;                  // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBeginner_bIsBeginner;                  // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53[0x5];                                       // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameHUD_C>        K2Node_DynamicCast_AsBPI_Game_HUD;                 // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_GameHUD_C>        K2Node_DynamicCast_AsBPI_Game_HUD_1;               // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_PlayerMain_C*                      CallFunc_GetGUI_GUI;                               // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetShowed_Showed;                         // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetInteractTimeBarByActiveIndex_Time;     // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_Interact_C*                          CallFunc_GetInteractTimeBarByActiveIndex_InteractWidget; // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChairParent_C_OnFocused) == 0x000008, "Wrong alignment on ChairParent_C_OnFocused");
static_assert(sizeof(ChairParent_C_OnFocused) == 0x0000B8, "Wrong size on ChairParent_C_OnFocused");
static_assert(offsetof(ChairParent_C_OnFocused, Player) == 0x000000, "Member 'ChairParent_C_OnFocused::Player' has a wrong offset!");
static_assert(offsetof(ChairParent_C_OnFocused, HighlightActor) == 0x000008, "Member 'ChairParent_C_OnFocused::HighlightActor' has a wrong offset!");
static_assert(offsetof(ChairParent_C_OnFocused, HighlightActorComponent) == 0x000010, "Member 'ChairParent_C_OnFocused::HighlightActorComponent' has a wrong offset!");
static_assert(offsetof(ChairParent_C_OnFocused, InteractType) == 0x000018, "Member 'ChairParent_C_OnFocused::InteractType' has a wrong offset!");
static_assert(offsetof(ChairParent_C_OnFocused, LateTime) == 0x000020, "Member 'ChairParent_C_OnFocused::LateTime' has a wrong offset!");
static_assert(offsetof(ChairParent_C_OnFocused, CallFunc_GetPlayerController_ReturnValue) == 0x000028, "Member 'ChairParent_C_OnFocused::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChairParent_C_OnFocused, K2Node_DynamicCast_AsSurvival_Player) == 0x000030, "Member 'ChairParent_C_OnFocused::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(ChairParent_C_OnFocused, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'ChairParent_C_OnFocused::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ChairParent_C_OnFocused, K2Node_DynamicCast_AsBPI_Surv_PC) == 0x000040, "Member 'ChairParent_C_OnFocused::K2Node_DynamicCast_AsBPI_Surv_PC' has a wrong offset!");
static_assert(offsetof(ChairParent_C_OnFocused, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'ChairParent_C_OnFocused::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ChairParent_C_OnFocused, CallFunc_GetBeginner_bIsBeginner) == 0x000051, "Member 'ChairParent_C_OnFocused::CallFunc_GetBeginner_bIsBeginner' has a wrong offset!");
static_assert(offsetof(ChairParent_C_OnFocused, CallFunc_Not_PreBool_ReturnValue) == 0x000052, "Member 'ChairParent_C_OnFocused::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChairParent_C_OnFocused, CallFunc_GetPlayerController_ReturnValue_1) == 0x000058, "Member 'ChairParent_C_OnFocused::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChairParent_C_OnFocused, CallFunc_GetHUD_ReturnValue) == 0x000060, "Member 'ChairParent_C_OnFocused::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChairParent_C_OnFocused, K2Node_DynamicCast_AsBPI_Game_HUD) == 0x000068, "Member 'ChairParent_C_OnFocused::K2Node_DynamicCast_AsBPI_Game_HUD' has a wrong offset!");
static_assert(offsetof(ChairParent_C_OnFocused, K2Node_DynamicCast_bSuccess_2) == 0x000078, "Member 'ChairParent_C_OnFocused::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(ChairParent_C_OnFocused, K2Node_DynamicCast_AsBPI_Game_HUD_1) == 0x000080, "Member 'ChairParent_C_OnFocused::K2Node_DynamicCast_AsBPI_Game_HUD_1' has a wrong offset!");
static_assert(offsetof(ChairParent_C_OnFocused, K2Node_DynamicCast_bSuccess_3) == 0x000090, "Member 'ChairParent_C_OnFocused::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(ChairParent_C_OnFocused, CallFunc_GetGUI_GUI) == 0x000098, "Member 'ChairParent_C_OnFocused::CallFunc_GetGUI_GUI' has a wrong offset!");
static_assert(offsetof(ChairParent_C_OnFocused, CallFunc_GetShowed_Showed) == 0x0000A0, "Member 'ChairParent_C_OnFocused::CallFunc_GetShowed_Showed' has a wrong offset!");
static_assert(offsetof(ChairParent_C_OnFocused, CallFunc_GetInteractTimeBarByActiveIndex_Time) == 0x0000A8, "Member 'ChairParent_C_OnFocused::CallFunc_GetInteractTimeBarByActiveIndex_Time' has a wrong offset!");
static_assert(offsetof(ChairParent_C_OnFocused, CallFunc_GetInteractTimeBarByActiveIndex_InteractWidget) == 0x0000B0, "Member 'ChairParent_C_OnFocused::CallFunc_GetInteractTimeBarByActiveIndex_InteractWidget' has a wrong offset!");

// Function ChairParent.ChairParent_C.OnInteract
// 0x0008 (0x0008 - 0x0000)
struct ChairParent_C_OnInteract final
{
public:
	class APawn*                                  Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChairParent_C_OnInteract) == 0x000008, "Wrong alignment on ChairParent_C_OnInteract");
static_assert(sizeof(ChairParent_C_OnInteract) == 0x000008, "Wrong size on ChairParent_C_OnInteract");
static_assert(offsetof(ChairParent_C_OnInteract, Player) == 0x000000, "Member 'ChairParent_C_OnInteract::Player' has a wrong offset!");

// Function ChairParent.ChairParent_C.OnInteract2
// 0x0008 (0x0008 - 0x0000)
struct ChairParent_C_OnInteract2 final
{
public:
	class APawn*                                  Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChairParent_C_OnInteract2) == 0x000008, "Wrong alignment on ChairParent_C_OnInteract2");
static_assert(sizeof(ChairParent_C_OnInteract2) == 0x000008, "Wrong size on ChairParent_C_OnInteract2");
static_assert(offsetof(ChairParent_C_OnInteract2, Player) == 0x000000, "Member 'ChairParent_C_OnInteract2::Player' has a wrong offset!");

// Function ChairParent.ChairParent_C.OnInteract3
// 0x0008 (0x0008 - 0x0000)
struct ChairParent_C_OnInteract3 final
{
public:
	class APawn*                                  Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChairParent_C_OnInteract3) == 0x000008, "Wrong alignment on ChairParent_C_OnInteract3");
static_assert(sizeof(ChairParent_C_OnInteract3) == 0x000008, "Wrong size on ChairParent_C_OnInteract3");
static_assert(offsetof(ChairParent_C_OnInteract3, Player) == 0x000000, "Member 'ChairParent_C_OnInteract3::Player' has a wrong offset!");

// Function ChairParent.ChairParent_C.OnInteractVehicle
// 0x0010 (0x0010 - 0x0000)
struct ChairParent_C_OnInteractVehicle final
{
public:
	class APawn*                                  Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         SitIndex;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SkipAnimation;                                     // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChairParent_C_OnInteractVehicle) == 0x000008, "Wrong alignment on ChairParent_C_OnInteractVehicle");
static_assert(sizeof(ChairParent_C_OnInteractVehicle) == 0x000010, "Wrong size on ChairParent_C_OnInteractVehicle");
static_assert(offsetof(ChairParent_C_OnInteractVehicle, Player) == 0x000000, "Member 'ChairParent_C_OnInteractVehicle::Player' has a wrong offset!");
static_assert(offsetof(ChairParent_C_OnInteractVehicle, SitIndex) == 0x000008, "Member 'ChairParent_C_OnInteractVehicle::SitIndex' has a wrong offset!");
static_assert(offsetof(ChairParent_C_OnInteractVehicle, SkipAnimation) == 0x00000C, "Member 'ChairParent_C_OnInteractVehicle::SkipAnimation' has a wrong offset!");

// Function ChairParent.ChairParent_C.OnInterrupted_A0AD71D946455417EAAC7F94C6A4E463
// 0x0008 (0x0008 - 0x0000)
struct ChairParent_C_OnInterrupted_A0AD71D946455417EAAC7F94C6A4E463 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChairParent_C_OnInterrupted_A0AD71D946455417EAAC7F94C6A4E463) == 0x000004, "Wrong alignment on ChairParent_C_OnInterrupted_A0AD71D946455417EAAC7F94C6A4E463");
static_assert(sizeof(ChairParent_C_OnInterrupted_A0AD71D946455417EAAC7F94C6A4E463) == 0x000008, "Wrong size on ChairParent_C_OnInterrupted_A0AD71D946455417EAAC7F94C6A4E463");
static_assert(offsetof(ChairParent_C_OnInterrupted_A0AD71D946455417EAAC7F94C6A4E463, NotifyName) == 0x000000, "Member 'ChairParent_C_OnInterrupted_A0AD71D946455417EAAC7F94C6A4E463::NotifyName' has a wrong offset!");

// Function ChairParent.ChairParent_C.OnLocalInteract
// 0x0008 (0x0008 - 0x0000)
struct ChairParent_C_OnLocalInteract final
{
public:
	class APawn*                                  Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChairParent_C_OnLocalInteract) == 0x000008, "Wrong alignment on ChairParent_C_OnLocalInteract");
static_assert(sizeof(ChairParent_C_OnLocalInteract) == 0x000008, "Wrong size on ChairParent_C_OnLocalInteract");
static_assert(offsetof(ChairParent_C_OnLocalInteract, Player) == 0x000000, "Member 'ChairParent_C_OnLocalInteract::Player' has a wrong offset!");

// Function ChairParent.ChairParent_C.OnLostFocus
// 0x0008 (0x0008 - 0x0000)
struct ChairParent_C_OnLostFocus final
{
public:
	class APawn*                                  Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChairParent_C_OnLostFocus) == 0x000008, "Wrong alignment on ChairParent_C_OnLostFocus");
static_assert(sizeof(ChairParent_C_OnLostFocus) == 0x000008, "Wrong size on ChairParent_C_OnLostFocus");
static_assert(offsetof(ChairParent_C_OnLostFocus, Player) == 0x000000, "Member 'ChairParent_C_OnLostFocus::Player' has a wrong offset!");

// Function ChairParent.ChairParent_C.OnNotifyBegin_A0AD71D946455417EAAC7F94C6A4E463
// 0x0008 (0x0008 - 0x0000)
struct ChairParent_C_OnNotifyBegin_A0AD71D946455417EAAC7F94C6A4E463 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChairParent_C_OnNotifyBegin_A0AD71D946455417EAAC7F94C6A4E463) == 0x000004, "Wrong alignment on ChairParent_C_OnNotifyBegin_A0AD71D946455417EAAC7F94C6A4E463");
static_assert(sizeof(ChairParent_C_OnNotifyBegin_A0AD71D946455417EAAC7F94C6A4E463) == 0x000008, "Wrong size on ChairParent_C_OnNotifyBegin_A0AD71D946455417EAAC7F94C6A4E463");
static_assert(offsetof(ChairParent_C_OnNotifyBegin_A0AD71D946455417EAAC7F94C6A4E463, NotifyName) == 0x000000, "Member 'ChairParent_C_OnNotifyBegin_A0AD71D946455417EAAC7F94C6A4E463::NotifyName' has a wrong offset!");

// Function ChairParent.ChairParent_C.OnNotifyEnd_A0AD71D946455417EAAC7F94C6A4E463
// 0x0008 (0x0008 - 0x0000)
struct ChairParent_C_OnNotifyEnd_A0AD71D946455417EAAC7F94C6A4E463 final
{
public:
