#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChairParent

#include "Basic.hpp"

#include "E_InteractType_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "E_ActorType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass ChairParent.ChairParent_C
// 0x0090 (0x0320 - 0x0290)
class AChairParent_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArrowComponent*                        Arrow;                                             // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene1;                                            // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          BoxZakaz;                                          // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        ExitDot;                                           // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        StartLocation;                                     // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           StartAnim;                                         // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           IdleAnim;                                          // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           EndAnim;                                           // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Zanyato;                                           // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           StartAnimFemale;                                   // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           IdleAnimFemale;                                    // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           EndAnimFemale;                                     // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_V2_C*                   As_Survival_Player_V2;                             // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void DestroyInteractable();
	void ExecuteUbergraph_ChairParent(int32 EntryPoint);
	void GetActorType(E_ActorType* ActorType);
	void IsLocked_(bool* Result);
	void Leave();
	void OnBeginInteract(class APawn* Player);
	void OnBlendOut_A0AD71D946455417EAAC7F94C6A4E463(class FName NotifyName);
	void OnCompleted_A0AD71D946455417EAAC7F94C6A4E463(class FName NotifyName);
	void OnFocused(class APawn* Player, class AActor* HighlightActor, class UActorComponent* HighlightActorComponent, E_InteractType* InteractType, double* LateTime);
	void OnInteract(class APawn* Player);
	void OnInteract2(class APawn* Player);
	void OnInteract3(class APawn* Player);
	void OnInteractVehicle(class APawn* Player, int32 SitIndex, bool SkipAnimation);
	void OnInterrupted_A0AD71D946455417EAAC7F94C6A4E463(class FName NotifyName);
	void OnLocalInteract(class APawn* Player);
	void OnLostFocus(class APawn* Player);
	void OnNotifyBegin_A0AD71D946455417EAAC7F94C6A4E463(class FName NotifyName);
	void OnNotifyEnd_A0AD71D946455417EAAC7F94C6A4E463(class FName NotifyName);
	void OnSeen(class APawn* Player);
	void OnSquadCheckComplete();
	void OnStopInteract(class APawn* Player);
	void Run_Lockpicking();
	void Set3DWidgetVisibility(bool Visible);
	void SetTutorial3DWidgetVisibility(bool Visible);
	void SitEventMulti(class ASurvivalPlayer_C* Player, bool Sit);
	void SitEventServer(class ASurvivalPlayer_C* Player, bool Sit);
	void StartChair(class ASurvivalPlayer_C* Player, bool OnTrain);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ChairParent_C">();
	}
	static class AChairParent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AChairParent_C>();
	}
};
static_assert(alignof(AChairParent_C) == 0x000008, "Wrong alignment on AChairParent_C");
static_assert(sizeof(AChairParent_C) == 0x000320, "Wrong size on AChairParent_C");
static_assert(offsetof(AChairParent_C, UberGraphFrame) == 0x000290, "Member 'AChairParent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AChairParent_C, Arrow) == 0x000298, "Member 'AChairParent_C::Arrow' has a wrong offset!");
static_assert(offsetof(AChairParent_C, Scene1) == 0x0002A0, "Member 'AChairParent_C::Scene1' has a wrong offset!");
static_assert(offsetof(AChairParent_C, StaticMesh1) == 0x0002A8, "Member 'AChairParent_C::StaticMesh1' has a wrong offset!");
static_assert(offsetof(AChairParent_C, BoxZakaz) == 0x0002B0, "Member 'AChairParent_C::BoxZakaz' has a wrong offset!");
static_assert(offsetof(AChairParent_C, ExitDot) == 0x0002B8, "Member 'AChairParent_C::ExitDot' has a wrong offset!");
static_assert(offsetof(AChairParent_C, StartLocation) == 0x0002C0, "Member 'AChairParent_C::StartLocation' has a wrong offset!");
static_assert(offsetof(AChairParent_C, StaticMesh) == 0x0002C8, "Member 'AChairParent_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AChairParent_C, Scene) == 0x0002D0, "Member 'AChairParent_C::Scene' has a wrong offset!");
static_assert(offsetof(AChairParent_C, Box) == 0x0002D8, "Member 'AChairParent_C::Box' has a wrong offset!");
static_assert(offsetof(AChairParent_C, StartAnim) == 0x0002E0, "Member 'AChairParent_C::StartAnim' has a wrong offset!");
static_assert(offsetof(AChairParent_C, IdleAnim) == 0x0002E8, "Member 'AChairParent_C::IdleAnim' has a wrong offset!");
static_assert(offsetof(AChairParent_C, EndAnim) == 0x0002F0, "Member 'AChairParent_C::EndAnim' has a wrong offset!");
static_assert(offsetof(AChairParent_C, Zanyato) == 0x0002F8, "Member 'AChairParent_C::Zanyato' has a wrong offset!");
static_assert(offsetof(AChairParent_C, StartAnimFemale) == 0x000300, "Member 'AChairParent_C::StartAnimFemale' has a wrong offset!");
static_assert(offsetof(AChairParent_C, IdleAnimFemale) == 0x000308, "Member 'AChairParent_C::IdleAnimFemale' has a wrong offset!");
static_assert(offsetof(AChairParent_C, EndAnimFemale) == 0x000310, "Member 'AChairParent_C::EndAnimFemale' has a wrong offset!");
static_assert(offsetof(AChairParent_C, As_Survival_Player_V2) == 0x000318, "Member 'AChairParent_C::As_Survival_Player_V2' has a wrong offset!");

}

