#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharSelector

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CharSelector.CharSelector_C
// 0x0020 (0x02A0 - 0x0280)
class UCharSelector_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                NewPers;                                           // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                OldPers;                                           // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class APlayerPlaceholder_C*                   PlayerPlaceholder;                                 // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__CharSelector_NewPers_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__CharSelector_OldPers_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_CharSelector(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CharSelector_C">();
	}
	static class UCharSelector_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCharSelector_C>();
	}
};
static_assert(alignof(UCharSelector_C) == 0x000008, "Wrong alignment on UCharSelector_C");
static_assert(sizeof(UCharSelector_C) == 0x0002A0, "Wrong size on UCharSelector_C");
static_assert(offsetof(UCharSelector_C, UberGraphFrame) == 0x000280, "Member 'UCharSelector_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCharSelector_C, NewPers) == 0x000288, "Member 'UCharSelector_C::NewPers' has a wrong offset!");
static_assert(offsetof(UCharSelector_C, OldPers) == 0x000290, "Member 'UCharSelector_C::OldPers' has a wrong offset!");
static_assert(offsetof(UCharSelector_C, PlayerPlaceholder) == 0x000298, "Member 'UCharSelector_C::PlayerPlaceholder' has a wrong offset!");

}

