#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharSpeedSettings

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct CharSpeedSettings.CharSpeedSettings
// 0x00B8 (0x00B8 - 0x0000)
struct FCharSpeedSettings final
{
public:
	double                                        WalkF_42_FC56DA0E4122A364BD260C8F727BCEA7;         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WalkFRL_43_3077C0084C746D06BC6F92AA20CAA372;       // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WalkRL_62_5C6C56DB4B94DA81EF917093C4BAB075;        // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WalkBRL_45_6F17260445D85996EC86A09833FD6BD5;       // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WalkB_44_6543BBC64E14BDE12CA3DB8CF983CA35;         // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        JogF_46_3C63B0BE43D2104EC19C40B37057837F;          // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        JogFRL_47_CFC1392F465EFC16A31579AB6142D663;        // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        JogRL_56_6B6EFB2244BF550DFC2E02AFF67CF046;         // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        JogBRL_49_38D0B9204F0A78107A9F46A2C5604402;        // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        JogB_48_B07B0E8246A71E71140E64ACB262DC5B;          // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CrouchF_50_F3494FDC4C8942C6777E90AFD5746128;       // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CrouchFRL_58_D1B6B9BD481328232CBB78AB7B449B64;     // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CrouchRL_52_FC042DE547134F8A9689C5AE2E1D4AEE;      // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CrouchBRL_60_96A12F9F4DE532D9A907C0913FF41E70;     // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CrouchB_53_7D43C666421480DFE13CB5986513C037;       // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Run_51_4A8EF2AD49F8B5C81FAD2490DF96A257;           // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StandAim_27_0FDDC8EE4BF29F7360281A8482D15A2B;      // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CrouchAim_29_97FEFF4A43F4EC5EB223BBB5D1E5A68D;     // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CrawlF_65_262E881045D74CAF4CB7C9899088615B;        // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CrawlFRL_67_51297BD24EBAF7A09A6710856FD122D5;      // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CrawlRL_69_0E0BBA1340087C0CCE5624BA22C5A44E;       // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CrawlBRL_71_1EF343F940808BC370CF5E9A910A2034;      // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CrawlB_73_2839E31C4CA23CBF78AB899258A94D56;        // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FCharSpeedSettings) == 0x000008, "Wrong alignment on FCharSpeedSettings");
static_assert(sizeof(FCharSpeedSettings) == 0x0000B8, "Wrong size on FCharSpeedSettings");
static_assert(offsetof(FCharSpeedSettings, WalkF_42_FC56DA0E4122A364BD260C8F727BCEA7) == 0x000000, "Member 'FCharSpeedSettings::WalkF_42_FC56DA0E4122A364BD260C8F727BCEA7' has a wrong offset!");
static_assert(offsetof(FCharSpeedSettings, WalkFRL_43_3077C0084C746D06BC6F92AA20CAA372) == 0x000008, "Member 'FCharSpeedSettings::WalkFRL_43_3077C0084C746D06BC6F92AA20CAA372' has a wrong offset!");
static_assert(offsetof(FCharSpeedSettings, WalkRL_62_5C6C56DB4B94DA81EF917093C4BAB075) == 0x000010, "Member 'FCharSpeedSettings::WalkRL_62_5C6C56DB4B94DA81EF917093C4BAB075' has a wrong offset!");
static_assert(offsetof(FCharSpeedSettings, WalkBRL_45_6F17260445D85996EC86A09833FD6BD5) == 0x000018, "Member 'FCharSpeedSettings::WalkBRL_45_6F17260445D85996EC86A09833FD6BD5' has a wrong offset!");
static_assert(offsetof(FCharSpeedSettings, WalkB_44_6543BBC64E14BDE12CA3DB8CF983CA35) == 0x000020, "Member 'FCharSpeedSettings::WalkB_44_6543BBC64E14BDE12CA3DB8CF983CA35' has a wrong offset!");
static_assert(offsetof(FCharSpeedSettings, JogF_46_3C63B0BE43D2104EC19C40B37057837F) == 0x000028, "Member 'FCharSpeedSettings::JogF_46_3C63B0BE43D2104EC19C40B37057837F' has a wrong offset!");
static_assert(offsetof(FCharSpeedSettings, JogFRL_47_CFC1392F465EFC16A31579AB6142D663) == 0x000030, "Member 'FCharSpeedSettings::JogFRL_47_CFC1392F465EFC16A31579AB6142D663' has a wrong offset!");
static_assert(offsetof(FCharSpeedSettings, JogRL_56_6B6EFB2244BF550DFC2E02AFF67CF046) == 0x000038, "Member 'FCharSpeedSettings::JogRL_56_6B6EFB2244BF550DFC2E02AFF67CF046' has a wrong offset!");
static_assert(offsetof(FCharSpeedSettings, JogBRL_49_38D0B9204F0A78107A9F46A2C5604402) == 0x000040, "Member 'FCharSpeedSettings::JogBRL_49_38D0B9204F0A78107A9F46A2C5604402' has a wrong offset!");
static_assert(offsetof(FCharSpeedSettings, JogB_48_B07B0E8246A71E71140E64ACB262DC5B) == 0x000048, "Member 'FCharSpeedSettings::JogB_48_B07B0E8246A71E71140E64ACB262DC5B' has a wrong offset!");
static_assert(offsetof(FCharSpeedSettings, CrouchF_50_F3494FDC4C8942C6777E90AFD5746128) == 0x000050, "Member 'FCharSpeedSettings::CrouchF_50_F3494FDC4C8942C6777E90AFD5746128' has a wrong offset!");
static_assert(offsetof(FCharSpeedSettings, CrouchFRL_58_D1B6B9BD481328232CBB78AB7B449B64) == 0x000058, "Member 'FCharSpeedSettings::CrouchFRL_58_D1B6B9BD481328232CBB78AB7B449B64' has a wrong offset!");
static_assert(offsetof(FCharSpeedSettings, CrouchRL_52_FC042DE547134F8A9689C5AE2E1D4AEE) == 0x000060, "Member 'FCharSpeedSettings::CrouchRL_52_FC042DE547134F8A9689C5AE2E1D4AEE' has a wrong offset!");
static_assert(offsetof(FCharSpeedSettings, CrouchBRL_60_96A12F9F4DE532D9A907C0913FF41E70) == 0x000068, "Member 'FCharSpeedSettings::CrouchBRL_60_96A12F9F4DE532D9A907C0913FF41E70' has a wrong offset!");
static_assert(offsetof(FCharSpeedSettings, CrouchB_53_7D43C666421480DFE13CB5986513C037) == 0x000070, "Member 'FCharSpeedSettings::CrouchB_53_7D43C666421480DFE13CB5986513C037' has a wrong offset!");
static_assert(offsetof(FCharSpeedSettings, Run_51_4A8EF2AD49F8B5C81FAD2490DF96A257) == 0x000078, "Member 'FCharSpeedSettings::Run_51_4A8EF2AD49F8B5C81FAD2490DF96A257' has a wrong offset!");
static_assert(offsetof(FCharSpeedSettings, StandAim_27_0FDDC8EE4BF29F7360281A8482D15A2B) == 0x000080, "Member 'FCharSpeedSettings::StandAim_27_0FDDC8EE4BF29F7360281A8482D15A2B' has a wrong offset!");
static_assert(offsetof(FCharSpeedSettings, CrouchAim_29_97FEFF4A43F4EC5EB223BBB5D1E5A68D) == 0x000088, "Member 'FCharSpeedSettings::CrouchAim_29_97FEFF4A43F4EC5EB223BBB5D1E5A68D' has a wrong offset!");
static_assert(offsetof(FCharSpeedSettings, CrawlF_65_262E881045D74CAF4CB7C9899088615B) == 0x000090, "Member 'FCharSpeedSettings::CrawlF_65_262E881045D74CAF4CB7C9899088615B' has a wrong offset!");
static_assert(offsetof(FCharSpeedSettings, CrawlFRL_67_51297BD24EBAF7A09A6710856FD122D5) == 0x000098, "Member 'FCharSpeedSettings::CrawlFRL_67_51297BD24EBAF7A09A6710856FD122D5' has a wrong offset!");
static_assert(offsetof(FCharSpeedSettings, CrawlRL_69_0E0BBA1340087C0CCE5624BA22C5A44E) == 0x0000A0, "Member 'FCharSpeedSettings::CrawlRL_69_0E0BBA1340087C0CCE5624BA22C5A44E' has a wrong offset!");
static_assert(offsetof(FCharSpeedSettings, CrawlBRL_71_1EF343F940808BC370CF5E9A910A2034) == 0x0000A8, "Member 'FCharSpeedSettings::CrawlBRL_71_1EF343F940808BC370CF5E9A910A2034' has a wrong offset!");
static_assert(offsetof(FCharSpeedSettings, CrawlB_73_2839E31C4CA23CBF78AB899258A94D56) == 0x0000B0, "Member 'FCharSpeedSettings::CrawlB_73_2839E31C4CA23CBF78AB899258A94D56' has a wrong offset!");

}

