#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterCreateSave

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "EquipmentData_structs.hpp"
#include "WS_BodyFeatures_structs.hpp"
#include "FirebaseFeatures_structs.hpp"


namespace SDK::Params
{

// Function CharacterCreateSave.CharacterCreateSave_C.CharMeshes
// 0x1298 (0x1298 - 0x0000)
struct CharacterCreateSave_C_CharMeshes final
{
public:
	struct FEquipmentData                         CallFunc_GetDataTableRowFromName_OutRow;           // 0x0000(0x0180)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEquipmentData                         CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0188(0x0180)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0310(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_1;         // 0x0318(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          K2Node_DynamicCast_AsSkeletal_Mesh;                // 0x0320(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          K2Node_DynamicCast_AsSkeletal_Mesh_1;              // 0x0330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEquipmentData                         CallFunc_GetDataTableRowFromName_OutRow_2;         // 0x0340(0x0180)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_2;    // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C1[0x7];                                      // 0x04C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_2;         // 0x04C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          K2Node_DynamicCast_AsSkeletal_Mesh_2;              // 0x04D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D9[0x7];                                      // 0x04D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEquipmentData                         CallFunc_GetDataTableRowFromName_OutRow_3;         // 0x04E0(0x0180)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_3;    // 0x0660(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_661[0x7];                                      // 0x0661(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_3;         // 0x0668(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FEquipmentData                         CallFunc_GetDataTableRowFromName_OutRow_4;         // 0x0670(0x0180)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_4;    // 0x07F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7F1[0x7];                                      // 0x07F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          K2Node_DynamicCast_AsSkeletal_Mesh_3;              // 0x07F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0800(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_801[0x7];                                      // 0x0801(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_4;         // 0x0808(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FEquipmentData                         CallFunc_GetDataTableRowFromName_OutRow_5;         // 0x0810(0x0180)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_5;    // 0x0990(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_991[0x7];                                      // 0x0991(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          K2Node_DynamicCast_AsSkeletal_Mesh_4;              // 0x0998(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x09A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A1[0x7];                                      // 0x09A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_5;         // 0x09A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          K2Node_DynamicCast_AsSkeletal_Mesh_5;              // 0x09B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x09B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9B9[0x7];                                      // 0x09B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEquipmentData                         CallFunc_GetDataTableRowFromName_OutRow_6;         // 0x09C0(0x0180)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_6;    // 0x0B40(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B41[0x7];                                      // 0x0B41(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEquipmentData                         CallFunc_GetDataTableRowFromName_OutRow_7;         // 0x0B48(0x0180)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_7;    // 0x0CC8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC9[0x7];                                      // 0x0CC9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_6;         // 0x0CD0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_7;         // 0x0CD8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          K2Node_DynamicCast_AsSkeletal_Mesh_6;              // 0x0CE0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0CE8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CE9[0x7];                                      // 0x0CE9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          K2Node_DynamicCast_AsSkeletal_Mesh_7;              // 0x0CF0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0CF8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CF9[0x7];                                      // 0x0CF9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEquipmentData                         CallFunc_GetDataTableRowFromName_OutRow_8;         // 0x0D00(0x0180)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_8;    // 0x0E80(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E81[0x7];                                      // 0x0E81(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEquipmentData                         CallFunc_GetDataTableRowFromName_OutRow_9;         // 0x0E88(0x0180)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_9;    // 0x1008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1009[0x7];                                     // 0x1009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_8;         // 0x1010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_9;         // 0x1018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          K2Node_DynamicCast_AsSkeletal_Mesh_8;              // 0x1020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x1028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1029[0x7];                                     // 0x1029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          K2Node_DynamicCast_AsSkeletal_Mesh_9;              // 0x1030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x1038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1039[0x7];                                     // 0x1039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x1040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x1050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x1060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x1068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1069[0x7];                                     // 0x1069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWS_BodyFeatures                       CallFunc_GetDataTableRowFromName_OutRow_10;        // 0x1070(0x0088)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_10;   // 0x10F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x10F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10FA[0x6];                                     // 0x10FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_10;        // 0x1100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          K2Node_DynamicCast_AsSkeletal_Mesh_10;             // 0x1108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x1110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_2;          // 0x1111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_3;          // 0x1112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_4;          // 0x1113(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_5;          // 0x1114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1115[0x3];                                     // 0x1115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item_2;                         // 0x1118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x1128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item_3;                         // 0x1130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FWS_BodyFeatures                       CallFunc_GetDataTableRowFromName_OutRow_11;        // 0x1140(0x0088)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_11;   // 0x11C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C9[0x3];                                     // 0x11C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_2;          // 0x11CC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11D4[0x4];                                     // 0x11D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWS_BodyFeatures                       CallFunc_GetDataTableRowFromName_OutRow_12;        // 0x11D8(0x0088)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_12;   // 0x1260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1261[0x7];                                     // 0x1261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_11;        // 0x1268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          K2Node_DynamicCast_AsSkeletal_Mesh_11;             // 0x1270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x1278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1279[0x7];                                     // 0x1279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_12;        // 0x1280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          K2Node_DynamicCast_AsSkeletal_Mesh_12;             // 0x1288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x1290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterCreateSave_C_CharMeshes) == 0x000008, "Wrong alignment on CharacterCreateSave_C_CharMeshes");
static_assert(sizeof(CharacterCreateSave_C_CharMeshes) == 0x001298, "Wrong size on CharacterCreateSave_C_CharMeshes");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, CallFunc_GetDataTableRowFromName_OutRow) == 0x000000, "Member 'CharacterCreateSave_C_CharMeshes::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000180, "Member 'CharacterCreateSave_C_CharMeshes::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000188, "Member 'CharacterCreateSave_C_CharMeshes::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000308, "Member 'CharacterCreateSave_C_CharMeshes::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000310, "Member 'CharacterCreateSave_C_CharMeshes::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, CallFunc_LoadAsset_Blocking_ReturnValue_1) == 0x000318, "Member 'CharacterCreateSave_C_CharMeshes::CallFunc_LoadAsset_Blocking_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, K2Node_DynamicCast_AsSkeletal_Mesh) == 0x000320, "Member 'CharacterCreateSave_C_CharMeshes::K2Node_DynamicCast_AsSkeletal_Mesh' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, K2Node_DynamicCast_bSuccess) == 0x000328, "Member 'CharacterCreateSave_C_CharMeshes::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, K2Node_DynamicCast_AsSkeletal_Mesh_1) == 0x000330, "Member 'CharacterCreateSave_C_CharMeshes::K2Node_DynamicCast_AsSkeletal_Mesh_1' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, K2Node_DynamicCast_bSuccess_1) == 0x000338, "Member 'CharacterCreateSave_C_CharMeshes::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, CallFunc_GetDataTableRowFromName_OutRow_2) == 0x000340, "Member 'CharacterCreateSave_C_CharMeshes::CallFunc_GetDataTableRowFromName_OutRow_2' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, CallFunc_GetDataTableRowFromName_ReturnValue_2) == 0x0004C0, "Member 'CharacterCreateSave_C_CharMeshes::CallFunc_GetDataTableRowFromName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, CallFunc_LoadAsset_Blocking_ReturnValue_2) == 0x0004C8, "Member 'CharacterCreateSave_C_CharMeshes::CallFunc_LoadAsset_Blocking_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, K2Node_DynamicCast_AsSkeletal_Mesh_2) == 0x0004D0, "Member 'CharacterCreateSave_C_CharMeshes::K2Node_DynamicCast_AsSkeletal_Mesh_2' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, K2Node_DynamicCast_bSuccess_2) == 0x0004D8, "Member 'CharacterCreateSave_C_CharMeshes::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, CallFunc_GetDataTableRowFromName_OutRow_3) == 0x0004E0, "Member 'CharacterCreateSave_C_CharMeshes::CallFunc_GetDataTableRowFromName_OutRow_3' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, CallFunc_GetDataTableRowFromName_ReturnValue_3) == 0x000660, "Member 'CharacterCreateSave_C_CharMeshes::CallFunc_GetDataTableRowFromName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, CallFunc_LoadAsset_Blocking_ReturnValue_3) == 0x000668, "Member 'CharacterCreateSave_C_CharMeshes::CallFunc_LoadAsset_Blocking_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, CallFunc_GetDataTableRowFromName_OutRow_4) == 0x000670, "Member 'CharacterCreateSave_C_CharMeshes::CallFunc_GetDataTableRowFromName_OutRow_4' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, CallFunc_GetDataTableRowFromName_ReturnValue_4) == 0x0007F0, "Member 'CharacterCreateSave_C_CharMeshes::CallFunc_GetDataTableRowFromName_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, K2Node_DynamicCast_AsSkeletal_Mesh_3) == 0x0007F8, "Member 'CharacterCreateSave_C_CharMeshes::K2Node_DynamicCast_AsSkeletal_Mesh_3' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, K2Node_DynamicCast_bSuccess_3) == 0x000800, "Member 'CharacterCreateSave_C_CharMeshes::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, CallFunc_LoadAsset_Blocking_ReturnValue_4) == 0x000808, "Member 'CharacterCreateSave_C_CharMeshes::CallFunc_LoadAsset_Blocking_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, CallFunc_GetDataTableRowFromName_OutRow_5) == 0x000810, "Member 'CharacterCreateSave_C_CharMeshes::CallFunc_GetDataTableRowFromName_OutRow_5' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, CallFunc_GetDataTableRowFromName_ReturnValue_5) == 0x000990, "Member 'CharacterCreateSave_C_CharMeshes::CallFunc_GetDataTableRowFromName_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, K2Node_DynamicCast_AsSkeletal_Mesh_4) == 0x000998, "Member 'CharacterCreateSave_C_CharMeshes::K2Node_DynamicCast_AsSkeletal_Mesh_4' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, K2Node_DynamicCast_bSuccess_4) == 0x0009A0, "Member 'CharacterCreateSave_C_CharMeshes::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, CallFunc_LoadAsset_Blocking_ReturnValue_5) == 0x0009A8, "Member 'CharacterCreateSave_C_CharMeshes::CallFunc_LoadAsset_Blocking_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, K2Node_DynamicCast_AsSkeletal_Mesh_5) == 0x0009B0, "Member 'CharacterCreateSave_C_CharMeshes::K2Node_DynamicCast_AsSkeletal_Mesh_5' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, K2Node_DynamicCast_bSuccess_5) == 0x0009B8, "Member 'CharacterCreateSave_C_CharMeshes::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, CallFunc_GetDataTableRowFromName_OutRow_6) == 0x0009C0, "Member 'CharacterCreateSave_C_CharMeshes::CallFunc_GetDataTableRowFromName_OutRow_6' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, CallFunc_GetDataTableRowFromName_ReturnValue_6) == 0x000B40, "Member 'CharacterCreateSave_C_CharMeshes::CallFunc_GetDataTableRowFromName_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, CallFunc_GetDataTableRowFromName_OutRow_7) == 0x000B48, "Member 'CharacterCreateSave_C_CharMeshes::CallFunc_GetDataTableRowFromName_OutRow_7' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, CallFunc_GetDataTableRowFromName_ReturnValue_7) == 0x000CC8, "Member 'CharacterCreateSave_C_CharMeshes::CallFunc_GetDataTableRowFromName_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, CallFunc_LoadAsset_Blocking_ReturnValue_6) == 0x000CD0, "Member 'CharacterCreateSave_C_CharMeshes::CallFunc_LoadAsset_Blocking_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, CallFunc_LoadAsset_Blocking_ReturnValue_7) == 0x000CD8, "Member 'CharacterCreateSave_C_CharMeshes::CallFunc_LoadAsset_Blocking_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, K2Node_DynamicCast_AsSkeletal_Mesh_6) == 0x000CE0, "Member 'CharacterCreateSave_C_CharMeshes::K2Node_DynamicCast_AsSkeletal_Mesh_6' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, K2Node_DynamicCast_bSuccess_6) == 0x000CE8, "Member 'CharacterCreateSave_C_CharMeshes::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, K2Node_DynamicCast_AsSkeletal_Mesh_7) == 0x000CF0, "Member 'CharacterCreateSave_C_CharMeshes::K2Node_DynamicCast_AsSkeletal_Mesh_7' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, K2Node_DynamicCast_bSuccess_7) == 0x000CF8, "Member 'CharacterCreateSave_C_CharMeshes::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, CallFunc_GetDataTableRowFromName_OutRow_8) == 0x000D00, "Member 'CharacterCreateSave_C_CharMeshes::CallFunc_GetDataTableRowFromName_OutRow_8' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, CallFunc_GetDataTableRowFromName_ReturnValue_8) == 0x000E80, "Member 'CharacterCreateSave_C_CharMeshes::CallFunc_GetDataTableRowFromName_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, CallFunc_GetDataTableRowFromName_OutRow_9) == 0x000E88, "Member 'CharacterCreateSave_C_CharMeshes::CallFunc_GetDataTableRowFromName_OutRow_9' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, CallFunc_GetDataTableRowFromName_ReturnValue_9) == 0x001008, "Member 'CharacterCreateSave_C_CharMeshes::CallFunc_GetDataTableRowFromName_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, CallFunc_LoadAsset_Blocking_ReturnValue_8) == 0x001010, "Member 'CharacterCreateSave_C_CharMeshes::CallFunc_LoadAsset_Blocking_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, CallFunc_LoadAsset_Blocking_ReturnValue_9) == 0x001018, "Member 'CharacterCreateSave_C_CharMeshes::CallFunc_LoadAsset_Blocking_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, K2Node_DynamicCast_AsSkeletal_Mesh_8) == 0x001020, "Member 'CharacterCreateSave_C_CharMeshes::K2Node_DynamicCast_AsSkeletal_Mesh_8' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, K2Node_DynamicCast_bSuccess_8) == 0x001028, "Member 'CharacterCreateSave_C_CharMeshes::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, K2Node_DynamicCast_AsSkeletal_Mesh_9) == 0x001030, "Member 'CharacterCreateSave_C_CharMeshes::K2Node_DynamicCast_AsSkeletal_Mesh_9' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, K2Node_DynamicCast_bSuccess_9) == 0x001038, "Member 'CharacterCreateSave_C_CharMeshes::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, CallFunc_Array_Get_Item) == 0x001040, "Member 'CharacterCreateSave_C_CharMeshes::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, CallFunc_Array_Get_Item_1) == 0x001050, "Member 'CharacterCreateSave_C_CharMeshes::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, CallFunc_Conv_StringToName_ReturnValue) == 0x001060, "Member 'CharacterCreateSave_C_CharMeshes::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x001068, "Member 'CharacterCreateSave_C_CharMeshes::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, CallFunc_GetDataTableRowFromName_OutRow_10) == 0x001070, "Member 'CharacterCreateSave_C_CharMeshes::CallFunc_GetDataTableRowFromName_OutRow_10' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, CallFunc_GetDataTableRowFromName_ReturnValue_10) == 0x0010F8, "Member 'CharacterCreateSave_C_CharMeshes::CallFunc_GetDataTableRowFromName_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x0010F9, "Member 'CharacterCreateSave_C_CharMeshes::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, CallFunc_LoadAsset_Blocking_ReturnValue_10) == 0x001100, "Member 'CharacterCreateSave_C_CharMeshes::CallFunc_LoadAsset_Blocking_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, K2Node_DynamicCast_AsSkeletal_Mesh_10) == 0x001108, "Member 'CharacterCreateSave_C_CharMeshes::K2Node_DynamicCast_AsSkeletal_Mesh_10' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, K2Node_DynamicCast_bSuccess_10) == 0x001110, "Member 'CharacterCreateSave_C_CharMeshes::K2Node_DynamicCast_bSuccess_10' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, CallFunc_EqualEqual_StrStr_ReturnValue_2) == 0x001111, "Member 'CharacterCreateSave_C_CharMeshes::CallFunc_EqualEqual_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, CallFunc_EqualEqual_StrStr_ReturnValue_3) == 0x001112, "Member 'CharacterCreateSave_C_CharMeshes::CallFunc_EqualEqual_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, CallFunc_EqualEqual_StrStr_ReturnValue_4) == 0x001113, "Member 'CharacterCreateSave_C_CharMeshes::CallFunc_EqualEqual_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, CallFunc_EqualEqual_StrStr_ReturnValue_5) == 0x001114, "Member 'CharacterCreateSave_C_CharMeshes::CallFunc_EqualEqual_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, CallFunc_Array_Get_Item_2) == 0x001118, "Member 'CharacterCreateSave_C_CharMeshes::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, CallFunc_Conv_StringToName_ReturnValue_1) == 0x001128, "Member 'CharacterCreateSave_C_CharMeshes::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, CallFunc_Array_Get_Item_3) == 0x001130, "Member 'CharacterCreateSave_C_CharMeshes::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, CallFunc_GetDataTableRowFromName_OutRow_11) == 0x001140, "Member 'CharacterCreateSave_C_CharMeshes::CallFunc_GetDataTableRowFromName_OutRow_11' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, CallFunc_GetDataTableRowFromName_ReturnValue_11) == 0x0011C8, "Member 'CharacterCreateSave_C_CharMeshes::CallFunc_GetDataTableRowFromName_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, CallFunc_Conv_StringToName_ReturnValue_2) == 0x0011CC, "Member 'CharacterCreateSave_C_CharMeshes::CallFunc_Conv_StringToName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, CallFunc_GetDataTableRowFromName_OutRow_12) == 0x0011D8, "Member 'CharacterCreateSave_C_CharMeshes::CallFunc_GetDataTableRowFromName_OutRow_12' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, CallFunc_GetDataTableRowFromName_ReturnValue_12) == 0x001260, "Member 'CharacterCreateSave_C_CharMeshes::CallFunc_GetDataTableRowFromName_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, CallFunc_LoadAsset_Blocking_ReturnValue_11) == 0x001268, "Member 'CharacterCreateSave_C_CharMeshes::CallFunc_LoadAsset_Blocking_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, K2Node_DynamicCast_AsSkeletal_Mesh_11) == 0x001270, "Member 'CharacterCreateSave_C_CharMeshes::K2Node_DynamicCast_AsSkeletal_Mesh_11' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, K2Node_DynamicCast_bSuccess_11) == 0x001278, "Member 'CharacterCreateSave_C_CharMeshes::K2Node_DynamicCast_bSuccess_11' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, CallFunc_LoadAsset_Blocking_ReturnValue_12) == 0x001280, "Member 'CharacterCreateSave_C_CharMeshes::CallFunc_LoadAsset_Blocking_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, K2Node_DynamicCast_AsSkeletal_Mesh_12) == 0x001288, "Member 'CharacterCreateSave_C_CharMeshes::K2Node_DynamicCast_AsSkeletal_Mesh_12' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_CharMeshes, K2Node_DynamicCast_bSuccess_12) == 0x001290, "Member 'CharacterCreateSave_C_CharMeshes::K2Node_DynamicCast_bSuccess_12' has a wrong offset!");

// Function CharacterCreateSave.CharacterCreateSave_C.ExecuteUbergraph_CharacterCreateSave
// 0x0410 (0x0410 - 0x0000)
struct CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFirestoreError                               K2Node_CustomEvent_Error_3;                        // 0x0004(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EFirestoreError Error)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EFirestoreError                               K2Node_CustomEvent_Error_2;                        // 0x0018(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EFirestoreError Error)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EFirestoreError                               Temp_byte_Variable;                                // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0030(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	EFirestoreError                               K2Node_CustomEvent_Error_1;                        // 0x0040(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EFirestoreError Error)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EFirestoreError                               K2Node_CustomEvent_Error;                          // 0x0054(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EFirestoreError Error)>        K2Node_CreateDelegate_OutputDelegate_3;            // 0x0058(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EFirestoreError                               Temp_byte_Variable_1;                              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x006C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0080(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSteamUserIDString_ReturnValue;         // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable_1;                            // 0x00A0(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWithEditor_ReturnValue;                 // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue_1;                    // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UFirestoreCollectionReference*          CallFunc_GetCollection_ReturnValue;                // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UFirestoreDocumentReference*            CallFunc_GetDocumentFromPath_ReturnValue;          // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFirestoreDocumentSnapshot             K2Node_CustomEvent_DataSnapshot;                   // 0x0108(0x0010)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFirestoreSetOptions                   CallFunc_Merge_ReturnValue;                        // 0x0128(0x0008)()
	TMap<class FString, struct FFirestoreFieldValue> CallFunc_GetData_ReturnValue;                      // 0x0130(0x0050)()
	struct FFirestoreFieldValue                   CallFunc_Map_Find_Value;                           // 0x0180(0x0008)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFirestoreFieldValue>           CallFunc_StringArrayToFirebaseArray_Result;        // 0x0190(0x0010)(ReferenceParm)
	TMap<class FString, struct FFirestoreFieldValue> CallFunc_FieldValue_ToMap_ReturnValue;             // 0x01A0(0x0050)()
	struct FFirestoreFieldValue                   CallFunc_FieldValue_FromArray_ReturnValue;         // 0x01F0(0x0008)()
	struct FFirestoreFieldValue                   CallFunc_Map_Find_Value_1;                         // 0x01F8(0x0008)()
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, struct FFirestoreFieldValue> K2Node_MakeMap_Map;                                // 0x0208(0x0050)(ConstParm)
	TArray<struct FFirestoreFieldValue>           CallFunc_FieldValue_ToArray_ReturnValue;           // 0x0258(0x0010)(ReferenceParm)
	struct FFirestoreFieldValue                   CallFunc_FieldValue_FromMap_ReturnValue;           // 0x0268(0x0008)()
	TArray<class FString>                         CallFunc_FirebaseArrayToStringArray_Result;        // 0x0270(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFirestoreFieldValue>           CallFunc_StringArrayToFirebaseArray_Result_1;      // 0x0288(0x0010)(ReferenceParm)
	class UFirestoreCollectionReference*          CallFunc_GetCollection_ReturnValue_1;              // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFirestoreFieldValue                   CallFunc_FieldValue_FromArray_ReturnValue_1;       // 0x02A0(0x0008)()
	class UFirestoreDocumentReference*            CallFunc_GetDocumentFromPath_ReturnValue_1;        // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TMap<class FString, struct FFirestoreFieldValue> K2Node_MakeMap_Map_1;                              // 0x02B0(0x0050)(ConstParm)
	struct FFirestoreSetOptions                   Temp_struct_Variable;                              // 0x0300(0x0008)(ConstParm)
	class UDocumentReferenceSetProxy*             CallFunc_Set_ReturnValue;                          // 0x0308(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFirestoreFieldValue>           CallFunc_StringArrayToFirebaseArray_Result_2;      // 0x0310(0x0010)(ReferenceParm)
	struct FFirestoreFieldValue                   CallFunc_FieldValue_FromArray_ReturnValue_2;       // 0x0320(0x0008)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         K2Node_MakeArray_Array;                            // 0x0330(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FFirestoreFieldValue>           CallFunc_StringArrayToFirebaseArray_Result_3;      // 0x0340(0x0010)(ReferenceParm)
	struct FFirestoreFieldValue                   CallFunc_FieldValue_FromArray_ReturnValue_3;       // 0x0350(0x0008)()
	TMap<class FString, struct FFirestoreFieldValue> K2Node_MakeMap_Map_2;                              // 0x0358(0x0050)(ConstParm)
	struct FFirestoreFieldValue                   CallFunc_FieldValue_FromMap_ReturnValue_1;         // 0x03A8(0x0008)()
	TMap<class FString, struct FFirestoreFieldValue> K2Node_MakeMap_Map_3;                              // 0x03B0(0x0050)(ConstParm)
	class UDocumentReferenceSetProxy*             CallFunc_Set_ReturnValue_1;                        // 0x0400(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave) == 0x000008, "Wrong alignment on CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave");
static_assert(sizeof(CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave) == 0x000410, "Wrong size on CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave");
static_assert(offsetof(CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave, EntryPoint) == 0x000000, "Member 'CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave::EntryPoint' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave, K2Node_CustomEvent_Error_3) == 0x000004, "Member 'CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave::K2Node_CustomEvent_Error_3' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave, K2Node_CustomEvent_Error_2) == 0x000018, "Member 'CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave::K2Node_CustomEvent_Error_2' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave, K2Node_CreateDelegate_OutputDelegate_1) == 0x00001C, "Member 'CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave, Temp_byte_Variable) == 0x00002C, "Member 'CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave, Temp_string_Variable) == 0x000030, "Member 'CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave, K2Node_CustomEvent_Error_1) == 0x000040, "Member 'CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave::K2Node_CustomEvent_Error_1' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave, K2Node_CreateDelegate_OutputDelegate_2) == 0x000044, "Member 'CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave, K2Node_CustomEvent_Error) == 0x000054, "Member 'CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave::K2Node_CustomEvent_Error' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave, K2Node_CreateDelegate_OutputDelegate_3) == 0x000058, "Member 'CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave, Temp_byte_Variable_1) == 0x000068, "Member 'CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave, K2Node_CreateDelegate_OutputDelegate_4) == 0x00006C, "Member 'CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000080, "Member 'CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave, CallFunc_GetSteamUserIDString_ReturnValue) == 0x000088, "Member 'CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave::CallFunc_GetSteamUserIDString_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave, CallFunc_IsEmpty_ReturnValue) == 0x000098, "Member 'CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave, Temp_string_Variable_1) == 0x0000A0, "Member 'CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave, CallFunc_IsWithEditor_ReturnValue) == 0x0000B0, "Member 'CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave::CallFunc_IsWithEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave, CallFunc_IsEmpty_ReturnValue_1) == 0x0000B1, "Member 'CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave::CallFunc_IsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave, CallFunc_SelectString_ReturnValue) == 0x0000B8, "Member 'CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave, CallFunc_Concat_StrStr_ReturnValue) == 0x0000C8, "Member 'CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave, CallFunc_GetCollection_ReturnValue) == 0x0000D8, "Member 'CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave::CallFunc_GetCollection_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000E0, "Member 'CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave, CallFunc_GetDocumentFromPath_ReturnValue) == 0x0000F0, "Member 'CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave::CallFunc_GetDocumentFromPath_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0000F8, "Member 'CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave, K2Node_CustomEvent_DataSnapshot) == 0x000108, "Member 'CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave::K2Node_CustomEvent_DataSnapshot' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000118, "Member 'CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave, CallFunc_Merge_ReturnValue) == 0x000128, "Member 'CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave::CallFunc_Merge_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave, CallFunc_GetData_ReturnValue) == 0x000130, "Member 'CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave::CallFunc_GetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave, CallFunc_Map_Find_Value) == 0x000180, "Member 'CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave, CallFunc_Map_Find_ReturnValue) == 0x000188, "Member 'CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave, CallFunc_StringArrayToFirebaseArray_Result) == 0x000190, "Member 'CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave::CallFunc_StringArrayToFirebaseArray_Result' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave, CallFunc_FieldValue_ToMap_ReturnValue) == 0x0001A0, "Member 'CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave::CallFunc_FieldValue_ToMap_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave, CallFunc_FieldValue_FromArray_ReturnValue) == 0x0001F0, "Member 'CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave::CallFunc_FieldValue_FromArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave, CallFunc_Map_Find_Value_1) == 0x0001F8, "Member 'CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave, CallFunc_Map_Find_ReturnValue_1) == 0x000200, "Member 'CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave, K2Node_MakeMap_Map) == 0x000208, "Member 'CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave::K2Node_MakeMap_Map' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave, CallFunc_FieldValue_ToArray_ReturnValue) == 0x000258, "Member 'CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave::CallFunc_FieldValue_ToArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave, CallFunc_FieldValue_FromMap_ReturnValue) == 0x000268, "Member 'CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave::CallFunc_FieldValue_FromMap_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave, CallFunc_FirebaseArrayToStringArray_Result) == 0x000270, "Member 'CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave::CallFunc_FirebaseArrayToStringArray_Result' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave, CallFunc_Array_IsEmpty_ReturnValue) == 0x000280, "Member 'CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave, CallFunc_StringArrayToFirebaseArray_Result_1) == 0x000288, "Member 'CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave::CallFunc_StringArrayToFirebaseArray_Result_1' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave, CallFunc_GetCollection_ReturnValue_1) == 0x000298, "Member 'CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave::CallFunc_GetCollection_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave, CallFunc_FieldValue_FromArray_ReturnValue_1) == 0x0002A0, "Member 'CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave::CallFunc_FieldValue_FromArray_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave, CallFunc_GetDocumentFromPath_ReturnValue_1) == 0x0002A8, "Member 'CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave::CallFunc_GetDocumentFromPath_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave, K2Node_MakeMap_Map_1) == 0x0002B0, "Member 'CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave::K2Node_MakeMap_Map_1' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave, Temp_struct_Variable) == 0x000300, "Member 'CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave, CallFunc_Set_ReturnValue) == 0x000308, "Member 'CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave::CallFunc_Set_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave, CallFunc_StringArrayToFirebaseArray_Result_2) == 0x000310, "Member 'CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave::CallFunc_StringArrayToFirebaseArray_Result_2' has a wrong offset!");
static_assert(offsetof(CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave, CallFunc_FieldValue_FromArray_ReturnValue_2) == 0x000320, "Member 'CharacterCreateSave_C_ExecuteUbergraph_CharacterCreateSave::CallFunc_FieldValue_FromArray_ReturnValue_2' has a wrong offset!");
