#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CheckInventoryQuest

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ItemCount_structs.hpp"
#include "QuestV2_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CheckInventoryQuest.CheckInventoryQuest_C
// 0x0030 (0x00B8 - 0x0088)
class UCheckInventoryQuest_C : public UQuestV2_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0088(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<struct FItemCount>                     NeedItems;                                         // 0x0090(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          PlayerHasAllItems;                                 // 0x00A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         EquipmentSlots;                                    // 0x00A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_CheckInventoryQuest(int32 EntryPoint);
	void Initialize(const struct FQuestData& Data);
	void OnQuestEvent(const class FString& QuestEvent, int32 CurrentQuestIndex);
	void ProcessLocalTrigger(const class FString& Trigger, int32 QuestID, bool* Result);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CheckInventoryQuest_C">();
	}
	static class UCheckInventoryQuest_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCheckInventoryQuest_C>();
	}
};
static_assert(alignof(UCheckInventoryQuest_C) == 0x000008, "Wrong alignment on UCheckInventoryQuest_C");
static_assert(sizeof(UCheckInventoryQuest_C) == 0x0000B8, "Wrong size on UCheckInventoryQuest_C");
static_assert(offsetof(UCheckInventoryQuest_C, UberGraphFrame) == 0x000088, "Member 'UCheckInventoryQuest_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCheckInventoryQuest_C, NeedItems) == 0x000090, "Member 'UCheckInventoryQuest_C::NeedItems' has a wrong offset!");
static_assert(offsetof(UCheckInventoryQuest_C, PlayerHasAllItems) == 0x0000A0, "Member 'UCheckInventoryQuest_C::PlayerHasAllItems' has a wrong offset!");
static_assert(offsetof(UCheckInventoryQuest_C, EquipmentSlots) == 0x0000A8, "Member 'UCheckInventoryQuest_C::EquipmentSlots' has a wrong offset!");

}

