#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Chris__1__Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct Chris__1__Skeleton_AnimBlueprint.Chris__1__Skeleton_AnimBlueprint_C.AnimBlueprintGeneratedConstantData
// 0x0147 (0x0148 - 0x0001)
struct Chris__1__Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	bool                                          __BoolProperty_94;                                 // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_95;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_96;                                  // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_97;                                // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_98;                               // 0x0014(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_99;                                // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_100;                                // 0x0044(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_101;                                // 0x0045(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_102;                                // 0x0048(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_103;                                 // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_104;                                // 0x0058(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_105;                                  // 0x0060(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_106;                                // 0x0068(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_107;                                // 0x0069(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_108;                                // 0x006A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B[0x5];                                       // 0x006B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_109;                               // 0x0070(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_110;                                // 0x0080(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_111;                                // 0x0088(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_112;                              // 0x0090(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00B0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0130(0x0018)()
};
static_assert(alignof(Chris__1__Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on Chris__1__Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(Chris__1__Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData) == 0x000148, "Wrong size on Chris__1__Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(Chris__1__Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __BoolProperty_94) == 0x000001, "Member 'Chris__1__Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__BoolProperty_94' has a wrong offset!");
static_assert(offsetof(Chris__1__Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_95) == 0x000004, "Member 'Chris__1__Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_95' has a wrong offset!");
static_assert(offsetof(Chris__1__Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __IntProperty_96) == 0x00000C, "Member 'Chris__1__Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__IntProperty_96' has a wrong offset!");
static_assert(offsetof(Chris__1__Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __FloatProperty_97) == 0x000010, "Member 'Chris__1__Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__FloatProperty_97' has a wrong offset!");
static_assert(offsetof(Chris__1__Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __StructProperty_98) == 0x000014, "Member 'Chris__1__Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__StructProperty_98' has a wrong offset!");
static_assert(offsetof(Chris__1__Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __FloatProperty_99) == 0x000040, "Member 'Chris__1__Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__FloatProperty_99' has a wrong offset!");
static_assert(offsetof(Chris__1__Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __EnumProperty_100) == 0x000044, "Member 'Chris__1__Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__EnumProperty_100' has a wrong offset!");
static_assert(offsetof(Chris__1__Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __ByteProperty_101) == 0x000045, "Member 'Chris__1__Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__ByteProperty_101' has a wrong offset!");
static_assert(offsetof(Chris__1__Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_102) == 0x000048, "Member 'Chris__1__Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_102' has a wrong offset!");
static_assert(offsetof(Chris__1__Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __IntProperty_103) == 0x000050, "Member 'Chris__1__Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__IntProperty_103' has a wrong offset!");
static_assert(offsetof(Chris__1__Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __BlendProfile_104) == 0x000058, "Member 'Chris__1__Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__BlendProfile_104' has a wrong offset!");
static_assert(offsetof(Chris__1__Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __CurveFloat_105) == 0x000060, "Member 'Chris__1__Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__CurveFloat_105' has a wrong offset!");
static_assert(offsetof(Chris__1__Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __BoolProperty_106) == 0x000068, "Member 'Chris__1__Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__BoolProperty_106' has a wrong offset!");
static_assert(offsetof(Chris__1__Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __EnumProperty_107) == 0x000069, "Member 'Chris__1__Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__EnumProperty_107' has a wrong offset!");
static_assert(offsetof(Chris__1__Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __EnumProperty_108) == 0x00006A, "Member 'Chris__1__Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__EnumProperty_108' has a wrong offset!");
static_assert(offsetof(Chris__1__Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __ArrayProperty_109) == 0x000070, "Member 'Chris__1__Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__ArrayProperty_109' has a wrong offset!");
static_assert(offsetof(Chris__1__Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_110) == 0x000080, "Member 'Chris__1__Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_110' has a wrong offset!");
static_assert(offsetof(Chris__1__Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_111) == 0x000088, "Member 'Chris__1__Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_111' has a wrong offset!");
static_assert(offsetof(Chris__1__Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __StructProperty_112) == 0x000090, "Member 'Chris__1__Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__StructProperty_112' has a wrong offset!");
static_assert(offsetof(Chris__1__Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000B0, "Member 'Chris__1__Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(Chris__1__Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000130, "Member 'Chris__1__Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct Chris__1__Skeleton_AnimBlueprint.Chris__1__Skeleton_AnimBlueprint_C.AnimBlueprintGeneratedMutableData
// 0x0001 (0x0002 - 0x0001)
struct Chris__1__Skeleton_AnimBlueprint::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Chris__1__Skeleton_AnimBlueprint::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on Chris__1__Skeleton_AnimBlueprint::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(Chris__1__Skeleton_AnimBlueprint::FAnimBlueprintGeneratedMutableData) == 0x000002, "Wrong size on Chris__1__Skeleton_AnimBlueprint::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(Chris__1__Skeleton_AnimBlueprint::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'Chris__1__Skeleton_AnimBlueprint::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");

}

