#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ClimbParams

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct ClimbParams.ClimbParams
// 0x00A8 (0x00A8 - 0x0000)
struct FClimbParams final
{
public:
	class UAnimMontage*                           AnimMontage_2_685027524299C4031F7ADABE1830A9C0;    // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCurveVector*                           PositionCorrectionCurve_5_1274FC9A4691D87E38ADA5AD5C9609F7; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         StartingPosition_8_A0086F1C489E1A8FCC7A089DA9098F30; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PlayRate_10_5A4BA53444A8472EC2A69682EDEC3BD2;      // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                StartingOffset_13_7B27764744192BFEE1BE5EA4E7430459; // 0x0018(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                EndingOffset_18_5A5E2B7247ECBDCD209C15AF1943AA26;  // 0x0030(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BoneRoot_21_5CDC5A804A585EC376F4B4A53CB51369;      // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveVector*                           PositionLerpCurve_24_85D17E9B42832242D114BBBB9729709A; // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                AdditionalOffset_27_67CCB0CD4B44AA584501998641ACAD65; // 0x0058(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          In_29_42DDD461462E112A4EE940A136ACD591;            // 0x0070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DistanceToCutOff_33_E473D8DE47D1E748CD1A53836EB562D4; // 0x0074(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CutOffTime_35_109817F64251AEDE0C610A84A9BC1DC1;    // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BlendoutTime_37_A156E0D94FFA7ED3F3E55DB028DD6537;  // 0x007C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ObstacleWidth_40_2E76D7C84DC9B44CEA5876B961E2CD7E; // 0x0080(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            RootMotion_X_45_EB7302BF49DE083BCB2EF0B9DEDB5926;  // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            RootMotion_Y_46_66EC1D4B4575AE5FC0B0EA89E3E9D429;  // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            RootMotion_Z_47_C773E2A24BD5FB06BB41FB8715444D7B;  // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCurveVector*                           LerpValues_50_EC6A30844577D6762098FF96CD305C5B;    // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FClimbParams) == 0x000008, "Wrong alignment on FClimbParams");
static_assert(sizeof(FClimbParams) == 0x0000A8, "Wrong size on FClimbParams");
static_assert(offsetof(FClimbParams, AnimMontage_2_685027524299C4031F7ADABE1830A9C0) == 0x000000, "Member 'FClimbParams::AnimMontage_2_685027524299C4031F7ADABE1830A9C0' has a wrong offset!");
static_assert(offsetof(FClimbParams, PositionCorrectionCurve_5_1274FC9A4691D87E38ADA5AD5C9609F7) == 0x000008, "Member 'FClimbParams::PositionCorrectionCurve_5_1274FC9A4691D87E38ADA5AD5C9609F7' has a wrong offset!");
static_assert(offsetof(FClimbParams, StartingPosition_8_A0086F1C489E1A8FCC7A089DA9098F30) == 0x000010, "Member 'FClimbParams::StartingPosition_8_A0086F1C489E1A8FCC7A089DA9098F30' has a wrong offset!");
static_assert(offsetof(FClimbParams, PlayRate_10_5A4BA53444A8472EC2A69682EDEC3BD2) == 0x000014, "Member 'FClimbParams::PlayRate_10_5A4BA53444A8472EC2A69682EDEC3BD2' has a wrong offset!");
static_assert(offsetof(FClimbParams, StartingOffset_13_7B27764744192BFEE1BE5EA4E7430459) == 0x000018, "Member 'FClimbParams::StartingOffset_13_7B27764744192BFEE1BE5EA4E7430459' has a wrong offset!");
static_assert(offsetof(FClimbParams, EndingOffset_18_5A5E2B7247ECBDCD209C15AF1943AA26) == 0x000030, "Member 'FClimbParams::EndingOffset_18_5A5E2B7247ECBDCD209C15AF1943AA26' has a wrong offset!");
static_assert(offsetof(FClimbParams, BoneRoot_21_5CDC5A804A585EC376F4B4A53CB51369) == 0x000048, "Member 'FClimbParams::BoneRoot_21_5CDC5A804A585EC376F4B4A53CB51369' has a wrong offset!");
static_assert(offsetof(FClimbParams, PositionLerpCurve_24_85D17E9B42832242D114BBBB9729709A) == 0x000050, "Member 'FClimbParams::PositionLerpCurve_24_85D17E9B42832242D114BBBB9729709A' has a wrong offset!");
static_assert(offsetof(FClimbParams, AdditionalOffset_27_67CCB0CD4B44AA584501998641ACAD65) == 0x000058, "Member 'FClimbParams::AdditionalOffset_27_67CCB0CD4B44AA584501998641ACAD65' has a wrong offset!");
static_assert(offsetof(FClimbParams, In_29_42DDD461462E112A4EE940A136ACD591) == 0x000070, "Member 'FClimbParams::In_29_42DDD461462E112A4EE940A136ACD591' has a wrong offset!");
static_assert(offsetof(FClimbParams, DistanceToCutOff_33_E473D8DE47D1E748CD1A53836EB562D4) == 0x000074, "Member 'FClimbParams::DistanceToCutOff_33_E473D8DE47D1E748CD1A53836EB562D4' has a wrong offset!");
static_assert(offsetof(FClimbParams, CutOffTime_35_109817F64251AEDE0C610A84A9BC1DC1) == 0x000078, "Member 'FClimbParams::CutOffTime_35_109817F64251AEDE0C610A84A9BC1DC1' has a wrong offset!");
static_assert(offsetof(FClimbParams, BlendoutTime_37_A156E0D94FFA7ED3F3E55DB028DD6537) == 0x00007C, "Member 'FClimbParams::BlendoutTime_37_A156E0D94FFA7ED3F3E55DB028DD6537' has a wrong offset!");
static_assert(offsetof(FClimbParams, ObstacleWidth_40_2E76D7C84DC9B44CEA5876B961E2CD7E) == 0x000080, "Member 'FClimbParams::ObstacleWidth_40_2E76D7C84DC9B44CEA5876B961E2CD7E' has a wrong offset!");
static_assert(offsetof(FClimbParams, RootMotion_X_45_EB7302BF49DE083BCB2EF0B9DEDB5926) == 0x000088, "Member 'FClimbParams::RootMotion_X_45_EB7302BF49DE083BCB2EF0B9DEDB5926' has a wrong offset!");
static_assert(offsetof(FClimbParams, RootMotion_Y_46_66EC1D4B4575AE5FC0B0EA89E3E9D429) == 0x000090, "Member 'FClimbParams::RootMotion_Y_46_66EC1D4B4575AE5FC0B0EA89E3E9D429' has a wrong offset!");
static_assert(offsetof(FClimbParams, RootMotion_Z_47_C773E2A24BD5FB06BB41FB8715444D7B) == 0x000098, "Member 'FClimbParams::RootMotion_Z_47_C773E2A24BD5FB06BB41FB8715444D7B' has a wrong offset!");
static_assert(offsetof(FClimbParams, LerpValues_50_EC6A30844577D6762098FF96CD305C5B) == 0x0000A0, "Member 'FClimbParams::LerpValues_50_EC6A30844577D6762098FF96CD305C5B' has a wrong offset!");

}

