#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CloseInGameShop

#include "Basic.hpp"


namespace SDK::Params
{

// Function CloseInGameShop.CloseInGameShop_C.ExecuteAction
// 0x0010 (0x0010 - 0x0000)
struct CloseInGameShop_C_ExecuteAction final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAGSGraphNode*                          NodeOwner;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CloseInGameShop_C_ExecuteAction) == 0x000008, "Wrong alignment on CloseInGameShop_C_ExecuteAction");
static_assert(sizeof(CloseInGameShop_C_ExecuteAction) == 0x000010, "Wrong size on CloseInGameShop_C_ExecuteAction");
static_assert(offsetof(CloseInGameShop_C_ExecuteAction, PlayerController) == 0x000000, "Member 'CloseInGameShop_C_ExecuteAction::PlayerController' has a wrong offset!");
static_assert(offsetof(CloseInGameShop_C_ExecuteAction, NodeOwner) == 0x000008, "Member 'CloseInGameShop_C_ExecuteAction::NodeOwner' has a wrong offset!");

// Function CloseInGameShop.CloseInGameShop_C.ExecuteUbergraph_CloseInGameShop
// 0x0098 (0x0098 - 0x0000)
struct CloseInGameShop_C_ExecuteUbergraph_CloseInGameShop final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_Event_playerController;                     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAGSGraphNode*                          K2Node_Event_nodeOwner;                            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_GameHUD_C*                          K2Node_DynamicCast_AsBP_Game_HUD;                  // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AInGameShop_C*                          CallFunc_GetActorOfClass_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AInGameShop_C*                          K2Node_DynamicCast_AsIn_Game_Shop;                 // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC;                  // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC_1;                // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CloseInGameShop_C_ExecuteUbergraph_CloseInGameShop) == 0x000008, "Wrong alignment on CloseInGameShop_C_ExecuteUbergraph_CloseInGameShop");
static_assert(sizeof(CloseInGameShop_C_ExecuteUbergraph_CloseInGameShop) == 0x000098, "Wrong size on CloseInGameShop_C_ExecuteUbergraph_CloseInGameShop");
static_assert(offsetof(CloseInGameShop_C_ExecuteUbergraph_CloseInGameShop, EntryPoint) == 0x000000, "Member 'CloseInGameShop_C_ExecuteUbergraph_CloseInGameShop::EntryPoint' has a wrong offset!");
static_assert(offsetof(CloseInGameShop_C_ExecuteUbergraph_CloseInGameShop, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'CloseInGameShop_C_ExecuteUbergraph_CloseInGameShop::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(CloseInGameShop_C_ExecuteUbergraph_CloseInGameShop, K2Node_Event_playerController) == 0x000010, "Member 'CloseInGameShop_C_ExecuteUbergraph_CloseInGameShop::K2Node_Event_playerController' has a wrong offset!");
static_assert(offsetof(CloseInGameShop_C_ExecuteUbergraph_CloseInGameShop, K2Node_Event_nodeOwner) == 0x000018, "Member 'CloseInGameShop_C_ExecuteUbergraph_CloseInGameShop::K2Node_Event_nodeOwner' has a wrong offset!");
static_assert(offsetof(CloseInGameShop_C_ExecuteUbergraph_CloseInGameShop, CallFunc_GetHUD_ReturnValue) == 0x000020, "Member 'CloseInGameShop_C_ExecuteUbergraph_CloseInGameShop::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(CloseInGameShop_C_ExecuteUbergraph_CloseInGameShop, K2Node_DynamicCast_AsBP_Game_HUD) == 0x000028, "Member 'CloseInGameShop_C_ExecuteUbergraph_CloseInGameShop::K2Node_DynamicCast_AsBP_Game_HUD' has a wrong offset!");
static_assert(offsetof(CloseInGameShop_C_ExecuteUbergraph_CloseInGameShop, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'CloseInGameShop_C_ExecuteUbergraph_CloseInGameShop::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CloseInGameShop_C_ExecuteUbergraph_CloseInGameShop, CallFunc_GetActorOfClass_ReturnValue) == 0x000038, "Member 'CloseInGameShop_C_ExecuteUbergraph_CloseInGameShop::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(CloseInGameShop_C_ExecuteUbergraph_CloseInGameShop, K2Node_DynamicCast_AsIn_Game_Shop) == 0x000040, "Member 'CloseInGameShop_C_ExecuteUbergraph_CloseInGameShop::K2Node_DynamicCast_AsIn_Game_Shop' has a wrong offset!");
static_assert(offsetof(CloseInGameShop_C_ExecuteUbergraph_CloseInGameShop, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'CloseInGameShop_C_ExecuteUbergraph_CloseInGameShop::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(CloseInGameShop_C_ExecuteUbergraph_CloseInGameShop, CallFunc_GetPlayerController_ReturnValue_1) == 0x000050, "Member 'CloseInGameShop_C_ExecuteUbergraph_CloseInGameShop::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CloseInGameShop_C_ExecuteUbergraph_CloseInGameShop, CallFunc_GetPlayerController_ReturnValue_2) == 0x000058, "Member 'CloseInGameShop_C_ExecuteUbergraph_CloseInGameShop::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CloseInGameShop_C_ExecuteUbergraph_CloseInGameShop, K2Node_DynamicCast_AsBPI_Surv_PC) == 0x000060, "Member 'CloseInGameShop_C_ExecuteUbergraph_CloseInGameShop::K2Node_DynamicCast_AsBPI_Surv_PC' has a wrong offset!");
static_assert(offsetof(CloseInGameShop_C_ExecuteUbergraph_CloseInGameShop, K2Node_DynamicCast_bSuccess_2) == 0x000070, "Member 'CloseInGameShop_C_ExecuteUbergraph_CloseInGameShop::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(CloseInGameShop_C_ExecuteUbergraph_CloseInGameShop, K2Node_DynamicCast_AsBPI_Surv_PC_1) == 0x000078, "Member 'CloseInGameShop_C_ExecuteUbergraph_CloseInGameShop::K2Node_DynamicCast_AsBPI_Surv_PC_1' has a wrong offset!");
static_assert(offsetof(CloseInGameShop_C_ExecuteUbergraph_CloseInGameShop, K2Node_DynamicCast_bSuccess_3) == 0x000088, "Member 'CloseInGameShop_C_ExecuteUbergraph_CloseInGameShop::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(CloseInGameShop_C_ExecuteUbergraph_CloseInGameShop, CallFunc_GetPlayerPawn_ReturnValue) == 0x000090, "Member 'CloseInGameShop_C_ExecuteUbergraph_CloseInGameShop::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");

}

