#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CollectAndCheckInventoryQuest

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CheckInventoryQuest_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CollectAndCheckInventoryQuest.CollectAndCheckInventoryQuest_C
// 0x0028 (0x00E0 - 0x00B8)
class UCollectAndCheckInventoryQuest_C final : public UCheckInventoryQuest_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_CollectAndCheckInventoryQuest_C;    // 0x00B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FString                                 Tag;                                               // 0x00C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<TScriptInterface<class II_Highlightable_C>> Highlightables;                                    // 0x00D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_CollectAndCheckInventoryQuest(int32 EntryPoint);
	void Initialize(const struct FQuestData& Data);
	void QuestActivated();
	void QuestDeactivated();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CollectAndCheckInventoryQuest_C">();
	}
	static class UCollectAndCheckInventoryQuest_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCollectAndCheckInventoryQuest_C>();
	}
};
static_assert(alignof(UCollectAndCheckInventoryQuest_C) == 0x000008, "Wrong alignment on UCollectAndCheckInventoryQuest_C");
static_assert(sizeof(UCollectAndCheckInventoryQuest_C) == 0x0000E0, "Wrong size on UCollectAndCheckInventoryQuest_C");
static_assert(offsetof(UCollectAndCheckInventoryQuest_C, UberGraphFrame_CollectAndCheckInventoryQuest_C) == 0x0000B8, "Member 'UCollectAndCheckInventoryQuest_C::UberGraphFrame_CollectAndCheckInventoryQuest_C' has a wrong offset!");
static_assert(offsetof(UCollectAndCheckInventoryQuest_C, Tag) == 0x0000C0, "Member 'UCollectAndCheckInventoryQuest_C::Tag' has a wrong offset!");
static_assert(offsetof(UCollectAndCheckInventoryQuest_C, Highlightables) == 0x0000D0, "Member 'UCollectAndCheckInventoryQuest_C::Highlightables' has a wrong offset!");

}

