#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ContainerWindowWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function ContainerWindowWidget.ContainerWindowWidget_C.ExecuteUbergraph_ContainerWindowWidget
// 0x0010 (0x0010 - 0x0000)
struct ContainerWindowWidget_C_ExecuteUbergraph_ContainerWindowWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJSI_Slot_C*                            K2Node_Event_ItemRef;                              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ContainerWindowWidget_C_ExecuteUbergraph_ContainerWindowWidget) == 0x000008, "Wrong alignment on ContainerWindowWidget_C_ExecuteUbergraph_ContainerWindowWidget");
static_assert(sizeof(ContainerWindowWidget_C_ExecuteUbergraph_ContainerWindowWidget) == 0x000010, "Wrong size on ContainerWindowWidget_C_ExecuteUbergraph_ContainerWindowWidget");
static_assert(offsetof(ContainerWindowWidget_C_ExecuteUbergraph_ContainerWindowWidget, EntryPoint) == 0x000000, "Member 'ContainerWindowWidget_C_ExecuteUbergraph_ContainerWindowWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(ContainerWindowWidget_C_ExecuteUbergraph_ContainerWindowWidget, K2Node_Event_ItemRef) == 0x000008, "Member 'ContainerWindowWidget_C_ExecuteUbergraph_ContainerWindowWidget::K2Node_Event_ItemRef' has a wrong offset!");

// Function ContainerWindowWidget.ContainerWindowWidget_C.GetListOfContainers
// 0x0010 (0x0010 - 0x0000)
struct ContainerWindowWidget_C_GetListOfContainers final
{
public:
	TArray<class UJSIContainer_C*>                Containers;                                        // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
};
static_assert(alignof(ContainerWindowWidget_C_GetListOfContainers) == 0x000008, "Wrong alignment on ContainerWindowWidget_C_GetListOfContainers");
static_assert(sizeof(ContainerWindowWidget_C_GetListOfContainers) == 0x000010, "Wrong size on ContainerWindowWidget_C_GetListOfContainers");
static_assert(offsetof(ContainerWindowWidget_C_GetListOfContainers, Containers) == 0x000000, "Member 'ContainerWindowWidget_C_GetListOfContainers::Containers' has a wrong offset!");

// Function ContainerWindowWidget.ContainerWindowWidget_C.SetItemReference
// 0x0008 (0x0008 - 0x0000)
struct ContainerWindowWidget_C_SetItemReference final
{
public:
	class UJSI_Slot_C*                            Param_ItemRef;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ContainerWindowWidget_C_SetItemReference) == 0x000008, "Wrong alignment on ContainerWindowWidget_C_SetItemReference");
static_assert(sizeof(ContainerWindowWidget_C_SetItemReference) == 0x000008, "Wrong size on ContainerWindowWidget_C_SetItemReference");
static_assert(offsetof(ContainerWindowWidget_C_SetItemReference, Param_ItemRef) == 0x000000, "Member 'ContainerWindowWidget_C_SetItemReference::Param_ItemRef' has a wrong offset!");

}

