#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CountTriggerQuest

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "QuestV2_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CountTriggerQuest.CountTriggerQuest_C
// 0x0010 (0x0098 - 0x0088)
class UCountTriggerQuest_C final : public UQuestV2_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0088(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         Amount;                                            // 0x0090(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x0094(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CountTriggerQuest(int32 EntryPoint);
	void Initialize(const struct FQuestData& Data);
	void IsMyQuestEvent(const class FString& QuestEvent, int32 CurrentQuestIndex, bool* Result);
	void OnQuestEvent(const class FString& QuestEvent, int32 CurrentQuestIndex);
	void Opa();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CountTriggerQuest_C">();
	}
	static class UCountTriggerQuest_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCountTriggerQuest_C>();
	}
};
static_assert(alignof(UCountTriggerQuest_C) == 0x000008, "Wrong alignment on UCountTriggerQuest_C");
static_assert(sizeof(UCountTriggerQuest_C) == 0x000098, "Wrong size on UCountTriggerQuest_C");
static_assert(offsetof(UCountTriggerQuest_C, UberGraphFrame) == 0x000088, "Member 'UCountTriggerQuest_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCountTriggerQuest_C, Amount) == 0x000090, "Member 'UCountTriggerQuest_C::Amount' has a wrong offset!");
static_assert(offsetof(UCountTriggerQuest_C, Count) == 0x000094, "Member 'UCountTriggerQuest_C::Count' has a wrong offset!");

}

