#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CS_VehicleHitDestructible

#include "Basic.hpp"


namespace SDK::Params
{

// Function CS_VehicleHitDestructible.CS_VehicleHitDestructible_C.ExecuteUbergraph_CS_VehicleHitDestructible
// 0x0008 (0x0008 - 0x0000)
struct CS_VehicleHitDestructible_C_ExecuteUbergraph_CS_VehicleHitDestructible final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Scale;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CS_VehicleHitDestructible_C_ExecuteUbergraph_CS_VehicleHitDestructible) == 0x000004, "Wrong alignment on CS_VehicleHitDestructible_C_ExecuteUbergraph_CS_VehicleHitDestructible");
static_assert(sizeof(CS_VehicleHitDestructible_C_ExecuteUbergraph_CS_VehicleHitDestructible) == 0x000008, "Wrong size on CS_VehicleHitDestructible_C_ExecuteUbergraph_CS_VehicleHitDestructible");
static_assert(offsetof(CS_VehicleHitDestructible_C_ExecuteUbergraph_CS_VehicleHitDestructible, EntryPoint) == 0x000000, "Member 'CS_VehicleHitDestructible_C_ExecuteUbergraph_CS_VehicleHitDestructible::EntryPoint' has a wrong offset!");
static_assert(offsetof(CS_VehicleHitDestructible_C_ExecuteUbergraph_CS_VehicleHitDestructible, K2Node_Event_Scale) == 0x000004, "Member 'CS_VehicleHitDestructible_C_ExecuteUbergraph_CS_VehicleHitDestructible::K2Node_Event_Scale' has a wrong offset!");

// Function CS_VehicleHitDestructible.CS_VehicleHitDestructible_C.ReceivePlayShake_2
// 0x0004 (0x0004 - 0x0000)
struct CS_VehicleHitDestructible_C_ReceivePlayShake_2 final
{
public:
	float                                         Scale;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CS_VehicleHitDestructible_C_ReceivePlayShake_2) == 0x000004, "Wrong alignment on CS_VehicleHitDestructible_C_ReceivePlayShake_2");
static_assert(sizeof(CS_VehicleHitDestructible_C_ReceivePlayShake_2) == 0x000004, "Wrong size on CS_VehicleHitDestructible_C_ReceivePlayShake_2");
static_assert(offsetof(CS_VehicleHitDestructible_C_ReceivePlayShake_2, Scale) == 0x000000, "Member 'CS_VehicleHitDestructible_C_ReceivePlayShake_2::Scale' has a wrong offset!");

}

