#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomQuestData

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct CustomQuestData.CustomQuestData
// 0x0020 (0x0020 - 0x0000)
struct FCustomQuestData final
{
public:
	bool                                          BoolValue_1_D6A1AEB642E93CA90323FAB881CE2850;      // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 StringValue_7_C2CD122240607D22C0626B80B1B21E6F;    // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         IntValue_6_CCA6C5974C118536505B0BA385782ECF;       // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FCustomQuestData) == 0x000008, "Wrong alignment on FCustomQuestData");
static_assert(sizeof(FCustomQuestData) == 0x000020, "Wrong size on FCustomQuestData");
static_assert(offsetof(FCustomQuestData, BoolValue_1_D6A1AEB642E93CA90323FAB881CE2850) == 0x000000, "Member 'FCustomQuestData::BoolValue_1_D6A1AEB642E93CA90323FAB881CE2850' has a wrong offset!");
static_assert(offsetof(FCustomQuestData, StringValue_7_C2CD122240607D22C0626B80B1B21E6F) == 0x000008, "Member 'FCustomQuestData::StringValue_7_C2CD122240607D22C0626B80B1B21E6F' has a wrong offset!");
static_assert(offsetof(FCustomQuestData, IntValue_6_CCA6C5974C118536505B0BA385782ECF) == 0x000018, "Member 'FCustomQuestData::IntValue_6_CCA6C5974C118536505B0BA385782ECF' has a wrong offset!");

}

