#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomSkyLight

#include "Basic.hpp"

#include "MieStruct_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BackgroundCloudsCSLStruct_structs.hpp"
#include "FogCSLStruct_structs.hpp"
#include "SkyAtmosphereCSLStruct_structs.hpp"
#include "ArtDirectionStruct_structs.hpp"
#include "RayleighStruct_structs.hpp"
#include "DirectionalLightCSLStruct_structs.hpp"
#include "SettingCSLStruct_structs.hpp"
#include "DayCycleState_structs.hpp"
#include "SunPosition_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CustomSkyLight.CustomSkyLight_C.AzimuthCalc
// 0x00C0 (0x00C0 - 0x0000)
struct CustomSkyLight_C_AzimuthCalc final
{
public:
	double                                        DeltaTime;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDayCycleState                                Temp_byte_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDayCycleState                                Temp_byte_Variable_1;                              // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_7;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_8;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_9;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDayCycleState                                Temp_byte_Variable_2;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetHMSFromSolarTime_Hour;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetHMSFromSolarTime_Minute;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetHMSFromSolarTime_Second;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_1;                           // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1;  // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDayCycleState                                Temp_byte_Variable_3;                              // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default_2;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default_3;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_4;                           // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_5;                           // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDST_IsDST;                              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSunPositionData                       CallFunc_GetSunPosition_SunPositionData;           // 0x0078(0x0028)(NoDestructor)
	float                                         CallFunc_GetSunPosition_Latitude_ImplicitCast;     // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSunPosition_TimeZone_ImplicitCast;     // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSunPosition_Longitude_ImplicitCast;    // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_CorrectedElevation_ImplicitCast; // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_Azimuth_ImplicitCast;           // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomSkyLight_C_AzimuthCalc) == 0x000008, "Wrong alignment on CustomSkyLight_C_AzimuthCalc");
static_assert(sizeof(CustomSkyLight_C_AzimuthCalc) == 0x0000C0, "Wrong size on CustomSkyLight_C_AzimuthCalc");
static_assert(offsetof(CustomSkyLight_C_AzimuthCalc, DeltaTime) == 0x000000, "Member 'CustomSkyLight_C_AzimuthCalc::DeltaTime' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_AzimuthCalc, Temp_bool_Variable) == 0x000008, "Member 'CustomSkyLight_C_AzimuthCalc::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_AzimuthCalc, Temp_bool_Variable_1) == 0x000009, "Member 'CustomSkyLight_C_AzimuthCalc::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_AzimuthCalc, Temp_bool_Variable_2) == 0x00000A, "Member 'CustomSkyLight_C_AzimuthCalc::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_AzimuthCalc, Temp_bool_Variable_3) == 0x00000B, "Member 'CustomSkyLight_C_AzimuthCalc::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_AzimuthCalc, Temp_byte_Variable) == 0x00000C, "Member 'CustomSkyLight_C_AzimuthCalc::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_AzimuthCalc, Temp_bool_Variable_4) == 0x00000D, "Member 'CustomSkyLight_C_AzimuthCalc::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_AzimuthCalc, Temp_byte_Variable_1) == 0x00000E, "Member 'CustomSkyLight_C_AzimuthCalc::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_AzimuthCalc, Temp_bool_Variable_5) == 0x00000F, "Member 'CustomSkyLight_C_AzimuthCalc::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_AzimuthCalc, Temp_bool_Variable_6) == 0x000010, "Member 'CustomSkyLight_C_AzimuthCalc::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_AzimuthCalc, Temp_bool_Variable_7) == 0x000011, "Member 'CustomSkyLight_C_AzimuthCalc::Temp_bool_Variable_7' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_AzimuthCalc, Temp_bool_Variable_8) == 0x000012, "Member 'CustomSkyLight_C_AzimuthCalc::Temp_bool_Variable_8' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_AzimuthCalc, Temp_bool_Variable_9) == 0x000013, "Member 'CustomSkyLight_C_AzimuthCalc::Temp_bool_Variable_9' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_AzimuthCalc, Temp_byte_Variable_2) == 0x000014, "Member 'CustomSkyLight_C_AzimuthCalc::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_AzimuthCalc, CallFunc_GetHMSFromSolarTime_Hour) == 0x000018, "Member 'CustomSkyLight_C_AzimuthCalc::CallFunc_GetHMSFromSolarTime_Hour' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_AzimuthCalc, CallFunc_GetHMSFromSolarTime_Minute) == 0x00001C, "Member 'CustomSkyLight_C_AzimuthCalc::CallFunc_GetHMSFromSolarTime_Minute' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_AzimuthCalc, CallFunc_GetHMSFromSolarTime_Second) == 0x000020, "Member 'CustomSkyLight_C_AzimuthCalc::CallFunc_GetHMSFromSolarTime_Second' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_AzimuthCalc, K2Node_Select_Default) == 0x000028, "Member 'CustomSkyLight_C_AzimuthCalc::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_AzimuthCalc, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000030, "Member 'CustomSkyLight_C_AzimuthCalc::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_AzimuthCalc, K2Node_Select_Default_1) == 0x000031, "Member 'CustomSkyLight_C_AzimuthCalc::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_AzimuthCalc, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1) == 0x000032, "Member 'CustomSkyLight_C_AzimuthCalc::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_AzimuthCalc, Temp_byte_Variable_3) == 0x000033, "Member 'CustomSkyLight_C_AzimuthCalc::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_AzimuthCalc, K2Node_Select_Default_2) == 0x000038, "Member 'CustomSkyLight_C_AzimuthCalc::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_AzimuthCalc, K2Node_Select_Default_3) == 0x000040, "Member 'CustomSkyLight_C_AzimuthCalc::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_AzimuthCalc, K2Node_Select_Default_4) == 0x000048, "Member 'CustomSkyLight_C_AzimuthCalc::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_AzimuthCalc, K2Node_Select_Default_5) == 0x000049, "Member 'CustomSkyLight_C_AzimuthCalc::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_AzimuthCalc, CallFunc_SelectFloat_ReturnValue) == 0x000050, "Member 'CustomSkyLight_C_AzimuthCalc::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_AzimuthCalc, CallFunc_SelectFloat_ReturnValue_1) == 0x000058, "Member 'CustomSkyLight_C_AzimuthCalc::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_AzimuthCalc, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000060, "Member 'CustomSkyLight_C_AzimuthCalc::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_AzimuthCalc, CallFunc_MapRangeClamped_ReturnValue) == 0x000068, "Member 'CustomSkyLight_C_AzimuthCalc::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_AzimuthCalc, CallFunc_IsDST_IsDST) == 0x000070, "Member 'CustomSkyLight_C_AzimuthCalc::CallFunc_IsDST_IsDST' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_AzimuthCalc, CallFunc_GetSunPosition_SunPositionData) == 0x000078, "Member 'CustomSkyLight_C_AzimuthCalc::CallFunc_GetSunPosition_SunPositionData' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_AzimuthCalc, CallFunc_GetSunPosition_Latitude_ImplicitCast) == 0x0000A0, "Member 'CustomSkyLight_C_AzimuthCalc::CallFunc_GetSunPosition_Latitude_ImplicitCast' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_AzimuthCalc, CallFunc_GetSunPosition_TimeZone_ImplicitCast) == 0x0000A4, "Member 'CustomSkyLight_C_AzimuthCalc::CallFunc_GetSunPosition_TimeZone_ImplicitCast' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_AzimuthCalc, CallFunc_GetSunPosition_Longitude_ImplicitCast) == 0x0000A8, "Member 'CustomSkyLight_C_AzimuthCalc::CallFunc_GetSunPosition_Longitude_ImplicitCast' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_AzimuthCalc, K2Node_VariableSet_CorrectedElevation_ImplicitCast) == 0x0000B0, "Member 'CustomSkyLight_C_AzimuthCalc::K2Node_VariableSet_CorrectedElevation_ImplicitCast' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_AzimuthCalc, K2Node_VariableSet_Azimuth_ImplicitCast) == 0x0000B8, "Member 'CustomSkyLight_C_AzimuthCalc::K2Node_VariableSet_Azimuth_ImplicitCast' has a wrong offset!");

// Function CustomSkyLight.CustomSkyLight_C.BackCloudsSettingsTransition
// 0x04A0 (0x04A0 - 0x0000)
struct CustomSkyLight_C_BackCloudsSettingsTransition final
{
public:
	struct FSettingCSLStruct                      From;                                              // 0x0000(0x0188)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	struct FSettingCSLStruct                      Transition;                                        // 0x0188(0x0188)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	struct FSettingCSLStruct                      To;                                                // 0x0310(0x0188)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomSkyLight_C_BackCloudsSettingsTransition) == 0x000008, "Wrong alignment on CustomSkyLight_C_BackCloudsSettingsTransition");
static_assert(sizeof(CustomSkyLight_C_BackCloudsSettingsTransition) == 0x0004A0, "Wrong size on CustomSkyLight_C_BackCloudsSettingsTransition");
static_assert(offsetof(CustomSkyLight_C_BackCloudsSettingsTransition, From) == 0x000000, "Member 'CustomSkyLight_C_BackCloudsSettingsTransition::From' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_BackCloudsSettingsTransition, Transition) == 0x000188, "Member 'CustomSkyLight_C_BackCloudsSettingsTransition::Transition' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_BackCloudsSettingsTransition, To) == 0x000310, "Member 'CustomSkyLight_C_BackCloudsSettingsTransition::To' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_BackCloudsSettingsTransition, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000498, "Member 'CustomSkyLight_C_BackCloudsSettingsTransition::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");

// Function CustomSkyLight.CustomSkyLight_C.CalculateAlpha
// 0x01B0 (0x01B0 - 0x0000)
struct CustomSkyLight_C_CalculateAlpha final
{
public:
	double                                        InterpTime;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_1;     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1;  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_2;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_3;      // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_4;      // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_5;      // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_ReturnValue_2;                     // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_2;                // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue_1;                        // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_6;      // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_3;                     // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue_3;                // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_2;  // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDayCycleState                                Temp_byte_Variable;                                // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F3[0x5];                                       // 0x00F3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<double>                                K2Node_MakeArray_Array;                            // 0x00F8(0x0010)(ReferenceParm)
	double                                        K2Node_Select_Default;                             // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NormalizeTime_ReturnValue;                // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Array_Get_Item;                           // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDayCycleState                                Temp_byte_Variable_1;                              // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_NormalizeTime_ReturnValue_1;              // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_7;      // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default_1;                           // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_4;                     // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_2;        // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_2;           // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_2;     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast; // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast_1; // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast_1;     // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_RotAlpha_ImplicitCast;          // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast_2;     // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomSkyLight_C_CalculateAlpha) == 0x000008, "Wrong alignment on CustomSkyLight_C_CalculateAlpha");
static_assert(sizeof(CustomSkyLight_C_CalculateAlpha) == 0x0001B0, "Wrong size on CustomSkyLight_C_CalculateAlpha");
static_assert(offsetof(CustomSkyLight_C_CalculateAlpha, InterpTime) == 0x000000, "Member 'CustomSkyLight_C_CalculateAlpha::InterpTime' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateAlpha, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000008, "Member 'CustomSkyLight_C_CalculateAlpha::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateAlpha, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000010, "Member 'CustomSkyLight_C_CalculateAlpha::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateAlpha, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000018, "Member 'CustomSkyLight_C_CalculateAlpha::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateAlpha, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000020, "Member 'CustomSkyLight_C_CalculateAlpha::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateAlpha, CallFunc_SelectFloat_ReturnValue) == 0x000028, "Member 'CustomSkyLight_C_CalculateAlpha::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateAlpha, CallFunc_LessEqual_DoubleDouble_ReturnValue_1) == 0x000030, "Member 'CustomSkyLight_C_CalculateAlpha::CallFunc_LessEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateAlpha, CallFunc_SelectFloat_ReturnValue_1) == 0x000038, "Member 'CustomSkyLight_C_CalculateAlpha::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateAlpha, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1) == 0x000040, "Member 'CustomSkyLight_C_CalculateAlpha::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateAlpha, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000048, "Member 'CustomSkyLight_C_CalculateAlpha::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateAlpha, CallFunc_Subtract_DoubleDouble_ReturnValue_2) == 0x000050, "Member 'CustomSkyLight_C_CalculateAlpha::CallFunc_Subtract_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateAlpha, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000058, "Member 'CustomSkyLight_C_CalculateAlpha::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateAlpha, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000060, "Member 'CustomSkyLight_C_CalculateAlpha::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateAlpha, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000068, "Member 'CustomSkyLight_C_CalculateAlpha::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateAlpha, CallFunc_Subtract_DoubleDouble_ReturnValue_3) == 0x000070, "Member 'CustomSkyLight_C_CalculateAlpha::CallFunc_Subtract_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateAlpha, CallFunc_FClamp_ReturnValue) == 0x000078, "Member 'CustomSkyLight_C_CalculateAlpha::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateAlpha, CallFunc_Abs_ReturnValue) == 0x000080, "Member 'CustomSkyLight_C_CalculateAlpha::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateAlpha, CallFunc_Subtract_DoubleDouble_ReturnValue_4) == 0x000088, "Member 'CustomSkyLight_C_CalculateAlpha::CallFunc_Subtract_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateAlpha, CallFunc_FClamp_ReturnValue_1) == 0x000090, "Member 'CustomSkyLight_C_CalculateAlpha::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateAlpha, CallFunc_Subtract_DoubleDouble_ReturnValue_5) == 0x000098, "Member 'CustomSkyLight_C_CalculateAlpha::CallFunc_Subtract_DoubleDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateAlpha, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x0000A0, "Member 'CustomSkyLight_C_CalculateAlpha::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateAlpha, CallFunc_FClamp_ReturnValue_2) == 0x0000A8, "Member 'CustomSkyLight_C_CalculateAlpha::CallFunc_FClamp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateAlpha, CallFunc_SelectFloat_ReturnValue_2) == 0x0000B0, "Member 'CustomSkyLight_C_CalculateAlpha::CallFunc_SelectFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateAlpha, CallFunc_Abs_ReturnValue_1) == 0x0000B8, "Member 'CustomSkyLight_C_CalculateAlpha::CallFunc_Abs_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateAlpha, CallFunc_Subtract_DoubleDouble_ReturnValue_6) == 0x0000C0, "Member 'CustomSkyLight_C_CalculateAlpha::CallFunc_Subtract_DoubleDouble_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateAlpha, Temp_real_Variable) == 0x0000C8, "Member 'CustomSkyLight_C_CalculateAlpha::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateAlpha, CallFunc_FClamp_ReturnValue_3) == 0x0000D0, "Member 'CustomSkyLight_C_CalculateAlpha::CallFunc_FClamp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateAlpha, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000D8, "Member 'CustomSkyLight_C_CalculateAlpha::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateAlpha, CallFunc_SelectFloat_ReturnValue_3) == 0x0000E0, "Member 'CustomSkyLight_C_CalculateAlpha::CallFunc_SelectFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateAlpha, Temp_real_Variable_1) == 0x0000E8, "Member 'CustomSkyLight_C_CalculateAlpha::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateAlpha, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_2) == 0x0000F0, "Member 'CustomSkyLight_C_CalculateAlpha::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateAlpha, CallFunc_BooleanOR_ReturnValue) == 0x0000F1, "Member 'CustomSkyLight_C_CalculateAlpha::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateAlpha, Temp_byte_Variable) == 0x0000F2, "Member 'CustomSkyLight_C_CalculateAlpha::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateAlpha, K2Node_MakeArray_Array) == 0x0000F8, "Member 'CustomSkyLight_C_CalculateAlpha::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateAlpha, K2Node_Select_Default) == 0x000108, "Member 'CustomSkyLight_C_CalculateAlpha::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateAlpha, CallFunc_NormalizeTime_ReturnValue) == 0x000110, "Member 'CustomSkyLight_C_CalculateAlpha::CallFunc_NormalizeTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateAlpha, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000118, "Member 'CustomSkyLight_C_CalculateAlpha::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateAlpha, CallFunc_Array_Get_Item) == 0x000120, "Member 'CustomSkyLight_C_CalculateAlpha::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateAlpha, Temp_byte_Variable_1) == 0x000128, "Member 'CustomSkyLight_C_CalculateAlpha::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateAlpha, CallFunc_NormalizeTime_ReturnValue_1) == 0x000130, "Member 'CustomSkyLight_C_CalculateAlpha::CallFunc_NormalizeTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateAlpha, CallFunc_Subtract_DoubleDouble_ReturnValue_7) == 0x000138, "Member 'CustomSkyLight_C_CalculateAlpha::CallFunc_Subtract_DoubleDouble_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateAlpha, K2Node_Select_Default_1) == 0x000140, "Member 'CustomSkyLight_C_CalculateAlpha::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateAlpha, CallFunc_FClamp_ReturnValue_4) == 0x000148, "Member 'CustomSkyLight_C_CalculateAlpha::CallFunc_FClamp_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateAlpha, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000150, "Member 'CustomSkyLight_C_CalculateAlpha::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateAlpha, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000158, "Member 'CustomSkyLight_C_CalculateAlpha::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateAlpha, CallFunc_Divide_DoubleDouble_ReturnValue_2) == 0x000160, "Member 'CustomSkyLight_C_CalculateAlpha::CallFunc_Divide_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateAlpha, CallFunc_Add_DoubleDouble_ReturnValue_2) == 0x000168, "Member 'CustomSkyLight_C_CalculateAlpha::CallFunc_Add_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateAlpha, CallFunc_LessEqual_DoubleDouble_ReturnValue_2) == 0x000170, "Member 'CustomSkyLight_C_CalculateAlpha::CallFunc_LessEqual_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateAlpha, CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast) == 0x000178, "Member 'CustomSkyLight_C_CalculateAlpha::CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateAlpha, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000180, "Member 'CustomSkyLight_C_CalculateAlpha::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateAlpha, CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast_1) == 0x000188, "Member 'CustomSkyLight_C_CalculateAlpha::CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateAlpha, CallFunc_Divide_DoubleDouble_A_ImplicitCast_1) == 0x000190, "Member 'CustomSkyLight_C_CalculateAlpha::CallFunc_Divide_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateAlpha, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000198, "Member 'CustomSkyLight_C_CalculateAlpha::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateAlpha, K2Node_VariableSet_RotAlpha_ImplicitCast) == 0x0001A0, "Member 'CustomSkyLight_C_CalculateAlpha::K2Node_VariableSet_RotAlpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateAlpha, CallFunc_Divide_DoubleDouble_A_ImplicitCast_2) == 0x0001A8, "Member 'CustomSkyLight_C_CalculateAlpha::CallFunc_Divide_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");

// Function CustomSkyLight.CustomSkyLight_C.CalculateInsideSettings
// 0x0938 (0x0938 - 0x0000)
struct CustomSkyLight_C_CalculateInsideSettings final
{
public:
	EDayCycleState                                Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDayCycleState                                Temp_byte_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDayCycleState                                Temp_byte_Variable_2;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSettingCSLStruct                      K2Node_Select_Default;                             // 0x0008(0x0188)(NoDestructor, HasGetValueTypeHash)
	struct FSettingCSLStruct                      K2Node_Select_Default_1;                           // 0x0190(0x0188)(NoDestructor, HasGetValueTypeHash)
	struct FSettingCSLStruct                      K2Node_Select_Default_2;                           // 0x0318(0x0188)(NoDestructor, HasGetValueTypeHash)
	struct FSettingCSLStruct                      CallFunc_OneSettingToAnother_Result;               // 0x04A0(0x0188)(NoDestructor, HasGetValueTypeHash)
	struct FSettingCSLStruct                      CallFunc_OneSettingToAnother_Result_1;             // 0x0628(0x0188)(NoDestructor, HasGetValueTypeHash)
	struct FSettingCSLStruct                      CallFunc_OneSettingToAnother_Result_2;             // 0x07B0(0x0188)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomSkyLight_C_CalculateInsideSettings) == 0x000008, "Wrong alignment on CustomSkyLight_C_CalculateInsideSettings");
static_assert(sizeof(CustomSkyLight_C_CalculateInsideSettings) == 0x000938, "Wrong size on CustomSkyLight_C_CalculateInsideSettings");
static_assert(offsetof(CustomSkyLight_C_CalculateInsideSettings, Temp_byte_Variable) == 0x000000, "Member 'CustomSkyLight_C_CalculateInsideSettings::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateInsideSettings, Temp_byte_Variable_1) == 0x000001, "Member 'CustomSkyLight_C_CalculateInsideSettings::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateInsideSettings, Temp_byte_Variable_2) == 0x000002, "Member 'CustomSkyLight_C_CalculateInsideSettings::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateInsideSettings, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000003, "Member 'CustomSkyLight_C_CalculateInsideSettings::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateInsideSettings, K2Node_Select_Default) == 0x000008, "Member 'CustomSkyLight_C_CalculateInsideSettings::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateInsideSettings, K2Node_Select_Default_1) == 0x000190, "Member 'CustomSkyLight_C_CalculateInsideSettings::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateInsideSettings, K2Node_Select_Default_2) == 0x000318, "Member 'CustomSkyLight_C_CalculateInsideSettings::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateInsideSettings, CallFunc_OneSettingToAnother_Result) == 0x0004A0, "Member 'CustomSkyLight_C_CalculateInsideSettings::CallFunc_OneSettingToAnother_Result' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateInsideSettings, CallFunc_OneSettingToAnother_Result_1) == 0x000628, "Member 'CustomSkyLight_C_CalculateInsideSettings::CallFunc_OneSettingToAnother_Result_1' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CalculateInsideSettings, CallFunc_OneSettingToAnother_Result_2) == 0x0007B0, "Member 'CustomSkyLight_C_CalculateInsideSettings::CallFunc_OneSettingToAnother_Result_2' has a wrong offset!");

// Function CustomSkyLight.CustomSkyLight_C.ChangeDayCycleState
// 0x0038 (0x0038 - 0x0000)
struct CustomSkyLight_C_ChangeDayCycleState final
{
public:
	EDayCycleState                                NewState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGS_TDB_C*                              K2Node_DynamicCast_AsGS_TDB;                       // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomSkyLight_C_ChangeDayCycleState) == 0x000008, "Wrong alignment on CustomSkyLight_C_ChangeDayCycleState");
static_assert(sizeof(CustomSkyLight_C_ChangeDayCycleState) == 0x000038, "Wrong size on CustomSkyLight_C_ChangeDayCycleState");
static_assert(offsetof(CustomSkyLight_C_ChangeDayCycleState, NewState) == 0x000000, "Member 'CustomSkyLight_C_ChangeDayCycleState::NewState' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_ChangeDayCycleState, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000008, "Member 'CustomSkyLight_C_ChangeDayCycleState::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_ChangeDayCycleState, CallFunc_GetGameState_ReturnValue) == 0x000020, "Member 'CustomSkyLight_C_ChangeDayCycleState::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_ChangeDayCycleState, K2Node_DynamicCast_AsGS_TDB) == 0x000028, "Member 'CustomSkyLight_C_ChangeDayCycleState::K2Node_DynamicCast_AsGS_TDB' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_ChangeDayCycleState, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'CustomSkyLight_C_ChangeDayCycleState::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_ChangeDayCycleState, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000031, "Member 'CustomSkyLight_C_ChangeDayCycleState::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function CustomSkyLight.CustomSkyLight_C.CheckDayTime
// 0x0068 (0x0068 - 0x0000)
struct CustomSkyLight_C_CheckDayTime final
{
public:
	EDayCycleState                                Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDayCycleState                                Temp_byte_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDayCycleState                                Temp_byte_Variable_2;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetCurrentSolarTime_Result;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetCurrentSolarTime_Result_1;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDayCycleState                                Temp_byte_Variable_3;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDayCycleState                                Temp_byte_Variable_4;                              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Array_Get_Item_1;                         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1;  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDayCycleState                                K2Node_Select_Default;                             // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Array_Get_Item_2;                         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_2;  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Array_Get_Item_3;                         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_3;  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomSkyLight_C_CheckDayTime) == 0x000008, "Wrong alignment on CustomSkyLight_C_CheckDayTime");
static_assert(sizeof(CustomSkyLight_C_CheckDayTime) == 0x000068, "Wrong size on CustomSkyLight_C_CheckDayTime");
static_assert(offsetof(CustomSkyLight_C_CheckDayTime, Temp_byte_Variable) == 0x000000, "Member 'CustomSkyLight_C_CheckDayTime::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CheckDayTime, Temp_byte_Variable_1) == 0x000001, "Member 'CustomSkyLight_C_CheckDayTime::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CheckDayTime, Temp_byte_Variable_2) == 0x000002, "Member 'CustomSkyLight_C_CheckDayTime::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CheckDayTime, CallFunc_GetCurrentSolarTime_Result) == 0x000008, "Member 'CustomSkyLight_C_CheckDayTime::CallFunc_GetCurrentSolarTime_Result' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CheckDayTime, CallFunc_FTrunc_ReturnValue) == 0x000010, "Member 'CustomSkyLight_C_CheckDayTime::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CheckDayTime, CallFunc_Divide_IntInt_ReturnValue) == 0x000014, "Member 'CustomSkyLight_C_CheckDayTime::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CheckDayTime, CallFunc_GetCurrentSolarTime_Result_1) == 0x000018, "Member 'CustomSkyLight_C_CheckDayTime::CallFunc_GetCurrentSolarTime_Result_1' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CheckDayTime, Temp_byte_Variable_3) == 0x000020, "Member 'CustomSkyLight_C_CheckDayTime::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CheckDayTime, CallFunc_Array_Get_Item) == 0x000028, "Member 'CustomSkyLight_C_CheckDayTime::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CheckDayTime, Temp_byte_Variable_4) == 0x000030, "Member 'CustomSkyLight_C_CheckDayTime::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CheckDayTime, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000031, "Member 'CustomSkyLight_C_CheckDayTime::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CheckDayTime, Temp_int_Variable) == 0x000034, "Member 'CustomSkyLight_C_CheckDayTime::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CheckDayTime, CallFunc_Array_Get_Item_1) == 0x000038, "Member 'CustomSkyLight_C_CheckDayTime::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CheckDayTime, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1) == 0x000040, "Member 'CustomSkyLight_C_CheckDayTime::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CheckDayTime, K2Node_Select_Default) == 0x000041, "Member 'CustomSkyLight_C_CheckDayTime::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CheckDayTime, CallFunc_Array_Get_Item_2) == 0x000048, "Member 'CustomSkyLight_C_CheckDayTime::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CheckDayTime, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_2) == 0x000050, "Member 'CustomSkyLight_C_CheckDayTime::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CheckDayTime, CallFunc_Array_Get_Item_3) == 0x000058, "Member 'CustomSkyLight_C_CheckDayTime::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(CustomSkyLight_C_CheckDayTime, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_3) == 0x000060, "Member 'CustomSkyLight_C_CheckDayTime::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_3' has a wrong offset!");

// Function CustomSkyLight.CustomSkyLight_C.CheckVolumetricScattering
// 0x0028 (0x0028 - 0x0000)
struct CustomSkyLight_C_CheckVolumetricScattering final
{
public:
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue_1;    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast;   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast_1; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVolumetricScatteringIntensity_NewIntensity_ImplicitCast; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_EqualEqual_DoubleDouble_B_ImplicitCast;   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomSkyLight_C_CheckVolumetricScattering) == 0x000008, "Wrong alignment on CustomSkyLight_C_CheckVolumetricScattering");
static_assert(sizeof(CustomSkyLight_C_CheckVolumetricScattering) == 0x000028, "Wrong size on CustomSkyLight_C_CheckVolumetricScattering");
static_assert(offsetof(CustomSkyLight_C_CheckVolumetricScattering, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000000, "Member 'CustomSkyLight_C_CheckVolumetricScattering::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
