#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CutsceneCar_SD45

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CutsceneCar_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CutsceneCar_SD45.CutsceneCar_SD45_C
// 0x0090 (0x06D0 - 0x0640)
class ACutsceneCar_SD45_C final : public ACutsceneCar_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_CutsceneCar_SD45_C;                 // 0x0640(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 Helmet;                                            // 0x0648(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCableComponent*                        Cable;                                             // 0x0650(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPhysicsConstraintComponent*            PhysicsConstraint;                                 // 0x0658(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Body;                                              // 0x0660(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Weapon;                                            // 0x0668(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Hair;                                              // 0x0670(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Backpack;                                          // 0x0678(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Pants;                                             // 0x0680(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 WheelMaterials;                                    // 0x0688(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UMaterialInstanceDynamic*>       TireMats;                                          // 0x0698(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FName>                           WheelBoneNames;                                    // 0x06A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UUIW_CarStats_C*                        CarUI;                                             // 0x06B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentFuel;                                       // 0x06C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UIOpened;                                          // 0x06C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CutsceneCar_SD45(int32 EntryPoint);
	void HideCarUI();
	void InitTireMaterials();
	void ShowCarUI();
	void UpdateTireDeformation(class UMaterialInstanceDynamic* MaterialInstance, int32 Param_WheelIndex);
	void UserConstructionScript();
	void PassengerQuit();
	void PlayExitAnims(class UAnimInstance* PlayerAnimInst);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CutsceneCar_SD45_C">();
	}
	static class ACutsceneCar_SD45_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACutsceneCar_SD45_C>();
	}
};
static_assert(alignof(ACutsceneCar_SD45_C) == 0x000008, "Wrong alignment on ACutsceneCar_SD45_C");
static_assert(sizeof(ACutsceneCar_SD45_C) == 0x0006D0, "Wrong size on ACutsceneCar_SD45_C");
static_assert(offsetof(ACutsceneCar_SD45_C, UberGraphFrame_CutsceneCar_SD45_C) == 0x000640, "Member 'ACutsceneCar_SD45_C::UberGraphFrame_CutsceneCar_SD45_C' has a wrong offset!");
static_assert(offsetof(ACutsceneCar_SD45_C, Helmet) == 0x000648, "Member 'ACutsceneCar_SD45_C::Helmet' has a wrong offset!");
static_assert(offsetof(ACutsceneCar_SD45_C, Cable) == 0x000650, "Member 'ACutsceneCar_SD45_C::Cable' has a wrong offset!");
static_assert(offsetof(ACutsceneCar_SD45_C, PhysicsConstraint) == 0x000658, "Member 'ACutsceneCar_SD45_C::PhysicsConstraint' has a wrong offset!");
static_assert(offsetof(ACutsceneCar_SD45_C, Body) == 0x000660, "Member 'ACutsceneCar_SD45_C::Body' has a wrong offset!");
static_assert(offsetof(ACutsceneCar_SD45_C, Weapon) == 0x000668, "Member 'ACutsceneCar_SD45_C::Weapon' has a wrong offset!");
static_assert(offsetof(ACutsceneCar_SD45_C, Hair) == 0x000670, "Member 'ACutsceneCar_SD45_C::Hair' has a wrong offset!");
static_assert(offsetof(ACutsceneCar_SD45_C, Backpack) == 0x000678, "Member 'ACutsceneCar_SD45_C::Backpack' has a wrong offset!");
static_assert(offsetof(ACutsceneCar_SD45_C, Pants) == 0x000680, "Member 'ACutsceneCar_SD45_C::Pants' has a wrong offset!");
static_assert(offsetof(ACutsceneCar_SD45_C, WheelMaterials) == 0x000688, "Member 'ACutsceneCar_SD45_C::WheelMaterials' has a wrong offset!");
static_assert(offsetof(ACutsceneCar_SD45_C, TireMats) == 0x000698, "Member 'ACutsceneCar_SD45_C::TireMats' has a wrong offset!");
static_assert(offsetof(ACutsceneCar_SD45_C, WheelBoneNames) == 0x0006A8, "Member 'ACutsceneCar_SD45_C::WheelBoneNames' has a wrong offset!");
static_assert(offsetof(ACutsceneCar_SD45_C, CarUI) == 0x0006B8, "Member 'ACutsceneCar_SD45_C::CarUI' has a wrong offset!");
static_assert(offsetof(ACutsceneCar_SD45_C, CurrentFuel) == 0x0006C0, "Member 'ACutsceneCar_SD45_C::CurrentFuel' has a wrong offset!");
static_assert(offsetof(ACutsceneCar_SD45_C, UIOpened) == 0x0006C8, "Member 'ACutsceneCar_SD45_C::UIOpened' has a wrong offset!");

}

