#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Cutscene_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Cutscene_AnimBP.Cutscene_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct Cutscene_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Cutscene_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on Cutscene_AnimBP_C_AnimGraph");
static_assert(sizeof(Cutscene_AnimBP_C_AnimGraph) == 0x000010, "Wrong size on Cutscene_AnimBP_C_AnimGraph");
static_assert(offsetof(Cutscene_AnimBP_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'Cutscene_AnimBP_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function Cutscene_AnimBP.Cutscene_AnimBP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct Cutscene_AnimBP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cutscene_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on Cutscene_AnimBP_C_BlueprintUpdateAnimation");
static_assert(sizeof(Cutscene_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on Cutscene_AnimBP_C_BlueprintUpdateAnimation");
static_assert(offsetof(Cutscene_AnimBP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'Cutscene_AnimBP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function Cutscene_AnimBP.Cutscene_AnimBP_C.ExecuteUbergraph_Cutscene_AnimBP
// 0x0190 (0x0190 - 0x0000)
struct Cutscene_AnimBP_C_ExecuteUbergraph_Cutscene_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          CallFunc_GetSkeletalMesh_DEPRECATED_ReturnValue;   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x0020(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformToBoneSpace_OutPosition;         // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_TransformToBoneSpace_OutRotation;         // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0100(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetOwningComponent_ReturnValue;           // 0x0160(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_Pitch_ImplicitCast;             // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_Yaw_ImplicitCast;               // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cutscene_AnimBP_C_ExecuteUbergraph_Cutscene_AnimBP) == 0x000010, "Wrong alignment on Cutscene_AnimBP_C_ExecuteUbergraph_Cutscene_AnimBP");
static_assert(sizeof(Cutscene_AnimBP_C_ExecuteUbergraph_Cutscene_AnimBP) == 0x000190, "Wrong size on Cutscene_AnimBP_C_ExecuteUbergraph_Cutscene_AnimBP");
static_assert(offsetof(Cutscene_AnimBP_C_ExecuteUbergraph_Cutscene_AnimBP, EntryPoint) == 0x000000, "Member 'Cutscene_AnimBP_C_ExecuteUbergraph_Cutscene_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Cutscene_AnimBP_C_ExecuteUbergraph_Cutscene_AnimBP, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'Cutscene_AnimBP_C_ExecuteUbergraph_Cutscene_AnimBP::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(Cutscene_AnimBP_C_ExecuteUbergraph_Cutscene_AnimBP, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'Cutscene_AnimBP_C_ExecuteUbergraph_Cutscene_AnimBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cutscene_AnimBP_C_ExecuteUbergraph_Cutscene_AnimBP, CallFunc_GetSkeletalMesh_DEPRECATED_ReturnValue) == 0x000010, "Member 'Cutscene_AnimBP_C_ExecuteUbergraph_Cutscene_AnimBP::CallFunc_GetSkeletalMesh_DEPRECATED_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cutscene_AnimBP_C_ExecuteUbergraph_Cutscene_AnimBP, CallFunc_IsValid_ReturnValue_1) == 0x000018, "Member 'Cutscene_AnimBP_C_ExecuteUbergraph_Cutscene_AnimBP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Cutscene_AnimBP_C_ExecuteUbergraph_Cutscene_AnimBP, CallFunc_GetSocketTransform_ReturnValue) == 0x000020, "Member 'Cutscene_AnimBP_C_ExecuteUbergraph_Cutscene_AnimBP::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cutscene_AnimBP_C_ExecuteUbergraph_Cutscene_AnimBP, CallFunc_BooleanAND_ReturnValue) == 0x000080, "Member 'Cutscene_AnimBP_C_ExecuteUbergraph_Cutscene_AnimBP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cutscene_AnimBP_C_ExecuteUbergraph_Cutscene_AnimBP, CallFunc_BreakTransform_Location) == 0x000088, "Member 'Cutscene_AnimBP_C_ExecuteUbergraph_Cutscene_AnimBP::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(Cutscene_AnimBP_C_ExecuteUbergraph_Cutscene_AnimBP, CallFunc_BreakTransform_Rotation) == 0x0000A0, "Member 'Cutscene_AnimBP_C_ExecuteUbergraph_Cutscene_AnimBP::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(Cutscene_AnimBP_C_ExecuteUbergraph_Cutscene_AnimBP, CallFunc_BreakTransform_Scale) == 0x0000B8, "Member 'Cutscene_AnimBP_C_ExecuteUbergraph_Cutscene_AnimBP::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(Cutscene_AnimBP_C_ExecuteUbergraph_Cutscene_AnimBP, CallFunc_TransformToBoneSpace_OutPosition) == 0x0000D0, "Member 'Cutscene_AnimBP_C_ExecuteUbergraph_Cutscene_AnimBP::CallFunc_TransformToBoneSpace_OutPosition' has a wrong offset!");
static_assert(offsetof(Cutscene_AnimBP_C_ExecuteUbergraph_Cutscene_AnimBP, CallFunc_TransformToBoneSpace_OutRotation) == 0x0000E8, "Member 'Cutscene_AnimBP_C_ExecuteUbergraph_Cutscene_AnimBP::CallFunc_TransformToBoneSpace_OutRotation' has a wrong offset!");
static_assert(offsetof(Cutscene_AnimBP_C_ExecuteUbergraph_Cutscene_AnimBP, CallFunc_MakeTransform_ReturnValue) == 0x000100, "Member 'Cutscene_AnimBP_C_ExecuteUbergraph_Cutscene_AnimBP::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cutscene_AnimBP_C_ExecuteUbergraph_Cutscene_AnimBP, CallFunc_GetOwningComponent_ReturnValue) == 0x000160, "Member 'Cutscene_AnimBP_C_ExecuteUbergraph_Cutscene_AnimBP::CallFunc_GetOwningComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cutscene_AnimBP_C_ExecuteUbergraph_Cutscene_AnimBP, CallFunc_BreakRotator_Roll) == 0x000168, "Member 'Cutscene_AnimBP_C_ExecuteUbergraph_Cutscene_AnimBP::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Cutscene_AnimBP_C_ExecuteUbergraph_Cutscene_AnimBP, CallFunc_BreakRotator_Pitch) == 0x00016C, "Member 'Cutscene_AnimBP_C_ExecuteUbergraph_Cutscene_AnimBP::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Cutscene_AnimBP_C_ExecuteUbergraph_Cutscene_AnimBP, CallFunc_BreakRotator_Yaw) == 0x000170, "Member 'Cutscene_AnimBP_C_ExecuteUbergraph_Cutscene_AnimBP::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Cutscene_AnimBP_C_ExecuteUbergraph_Cutscene_AnimBP, K2Node_VariableSet_Pitch_ImplicitCast) == 0x000178, "Member 'Cutscene_AnimBP_C_ExecuteUbergraph_Cutscene_AnimBP::K2Node_VariableSet_Pitch_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Cutscene_AnimBP_C_ExecuteUbergraph_Cutscene_AnimBP, K2Node_VariableSet_Yaw_ImplicitCast) == 0x000180, "Member 'Cutscene_AnimBP_C_ExecuteUbergraph_Cutscene_AnimBP::K2Node_VariableSet_Yaw_ImplicitCast' has a wrong offset!");

}

