#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DayCycleSettingsCSLStruct

#include "Basic.hpp"

#include "SettingCSLStruct_structs.hpp"


namespace SDK
{

// UserDefinedStruct DayCycleSettingsCSLStruct.DayCycleSettingsCSLStruct
// 0x0C48 (0x0C48 - 0x0000)
struct FDayCycleSettingsCSLStruct final
{
public:
	struct FSettingCSLStruct                      Morning_12_61AEC83543278624DCF9BF986CEAEDE0;       // 0x0000(0x0188)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FSettingCSLStruct                      Day_13_C33F67F1432A05BF4A3672A56BA54929;           // 0x0188(0x0188)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FSettingCSLStruct                      Evening_14_4ADEEA38420A7D84C9A73C8623270AF6;       // 0x0310(0x0188)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FSettingCSLStruct                      Night_15_00A51A794CB567EE87DAADB433E60D92;         // 0x0498(0x0188)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	bool                                          IncludeTransitionSettings_16_B878AD9F49A7BA3873964184E6378E7F; // 0x0620(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_621[0x7];                                      // 0x0621(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSettingCSLStruct                      NightToMorning_17_D0EEAD6944FB300CEBBCECB04C693FDF; // 0x0628(0x0188)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FSettingCSLStruct                      MorningToDay_18_1F49343C43691B92510F47B828CD646D;  // 0x07B0(0x0188)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FSettingCSLStruct                      DayToEvening_19_E82E6F65489E07ABF1D0E8A347C1A1F1;  // 0x0938(0x0188)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FSettingCSLStruct                      EveningToNight_20_1397C1294BDB2DB7C14AEA956B33BA19; // 0x0AC0(0x0188)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FDayCycleSettingsCSLStruct) == 0x000008, "Wrong alignment on FDayCycleSettingsCSLStruct");
static_assert(sizeof(FDayCycleSettingsCSLStruct) == 0x000C48, "Wrong size on FDayCycleSettingsCSLStruct");
static_assert(offsetof(FDayCycleSettingsCSLStruct, Morning_12_61AEC83543278624DCF9BF986CEAEDE0) == 0x000000, "Member 'FDayCycleSettingsCSLStruct::Morning_12_61AEC83543278624DCF9BF986CEAEDE0' has a wrong offset!");
static_assert(offsetof(FDayCycleSettingsCSLStruct, Day_13_C33F67F1432A05BF4A3672A56BA54929) == 0x000188, "Member 'FDayCycleSettingsCSLStruct::Day_13_C33F67F1432A05BF4A3672A56BA54929' has a wrong offset!");
static_assert(offsetof(FDayCycleSettingsCSLStruct, Evening_14_4ADEEA38420A7D84C9A73C8623270AF6) == 0x000310, "Member 'FDayCycleSettingsCSLStruct::Evening_14_4ADEEA38420A7D84C9A73C8623270AF6' has a wrong offset!");
static_assert(offsetof(FDayCycleSettingsCSLStruct, Night_15_00A51A794CB567EE87DAADB433E60D92) == 0x000498, "Member 'FDayCycleSettingsCSLStruct::Night_15_00A51A794CB567EE87DAADB433E60D92' has a wrong offset!");
static_assert(offsetof(FDayCycleSettingsCSLStruct, IncludeTransitionSettings_16_B878AD9F49A7BA3873964184E6378E7F) == 0x000620, "Member 'FDayCycleSettingsCSLStruct::IncludeTransitionSettings_16_B878AD9F49A7BA3873964184E6378E7F' has a wrong offset!");
static_assert(offsetof(FDayCycleSettingsCSLStruct, NightToMorning_17_D0EEAD6944FB300CEBBCECB04C693FDF) == 0x000628, "Member 'FDayCycleSettingsCSLStruct::NightToMorning_17_D0EEAD6944FB300CEBBCECB04C693FDF' has a wrong offset!");
static_assert(offsetof(FDayCycleSettingsCSLStruct, MorningToDay_18_1F49343C43691B92510F47B828CD646D) == 0x0007B0, "Member 'FDayCycleSettingsCSLStruct::MorningToDay_18_1F49343C43691B92510F47B828CD646D' has a wrong offset!");
static_assert(offsetof(FDayCycleSettingsCSLStruct, DayToEvening_19_E82E6F65489E07ABF1D0E8A347C1A1F1) == 0x000938, "Member 'FDayCycleSettingsCSLStruct::DayToEvening_19_E82E6F65489E07ABF1D0E8A347C1A1F1' has a wrong offset!");
static_assert(offsetof(FDayCycleSettingsCSLStruct, EveningToNight_20_1397C1294BDB2DB7C14AEA956B33BA19) == 0x000AC0, "Member 'FDayCycleSettingsCSLStruct::EveningToNight_20_1397C1294BDB2DB7C14AEA956B33BA19' has a wrong offset!");

}

