#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DayTimeController

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function DayTimeController.DayTimeController_C.BunkerEntered
// 0x0020 (0x0020 - 0x0000)
struct DayTimeController_C_BunkerEntered final
{
public:
	class ASurvivalPlayer_C*                      Survival;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                EnterPoint;                                        // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DayTimeController_C_BunkerEntered) == 0x000008, "Wrong alignment on DayTimeController_C_BunkerEntered");
static_assert(sizeof(DayTimeController_C_BunkerEntered) == 0x000020, "Wrong size on DayTimeController_C_BunkerEntered");
static_assert(offsetof(DayTimeController_C_BunkerEntered, Survival) == 0x000000, "Member 'DayTimeController_C_BunkerEntered::Survival' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_BunkerEntered, EnterPoint) == 0x000008, "Member 'DayTimeController_C_BunkerEntered::EnterPoint' has a wrong offset!");

// Function DayTimeController.DayTimeController_C.BunkerExit
// 0x0020 (0x0020 - 0x0000)
struct DayTimeController_C_BunkerExit final
{
public:
	class ASurvivalPlayer_C*                      Survival;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ExitPoint;                                         // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DayTimeController_C_BunkerExit) == 0x000008, "Wrong alignment on DayTimeController_C_BunkerExit");
static_assert(sizeof(DayTimeController_C_BunkerExit) == 0x000020, "Wrong size on DayTimeController_C_BunkerExit");
static_assert(offsetof(DayTimeController_C_BunkerExit, Survival) == 0x000000, "Member 'DayTimeController_C_BunkerExit::Survival' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_BunkerExit, ExitPoint) == 0x000008, "Member 'DayTimeController_C_BunkerExit::ExitPoint' has a wrong offset!");

// Function DayTimeController.DayTimeController_C.CalculateTime
// 0x0048 (0x0048 - 0x0000)
struct DayTimeController_C_CalculateTime final
{
public:
	double                                        Delta;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DayTimeController_C_CalculateTime) == 0x000008, "Wrong alignment on DayTimeController_C_CalculateTime");
static_assert(sizeof(DayTimeController_C_CalculateTime) == 0x000048, "Wrong size on DayTimeController_C_CalculateTime");
static_assert(offsetof(DayTimeController_C_CalculateTime, Delta) == 0x000000, "Member 'DayTimeController_C_CalculateTime::Delta' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_CalculateTime, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000008, "Member 'DayTimeController_C_CalculateTime::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_CalculateTime, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000009, "Member 'DayTimeController_C_CalculateTime::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_CalculateTime, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000010, "Member 'DayTimeController_C_CalculateTime::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_CalculateTime, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000018, "Member 'DayTimeController_C_CalculateTime::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_CalculateTime, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000020, "Member 'DayTimeController_C_CalculateTime::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_CalculateTime, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000028, "Member 'DayTimeController_C_CalculateTime::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_CalculateTime, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000030, "Member 'DayTimeController_C_CalculateTime::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_CalculateTime, CallFunc_FClamp_ReturnValue) == 0x000038, "Member 'DayTimeController_C_CalculateTime::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_CalculateTime, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000040, "Member 'DayTimeController_C_CalculateTime::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");

// Function DayTimeController.DayTimeController_C.ExecuteUbergraph_DayTimeController
// 0x04A0 (0x04A0 - 0x0000)
struct DayTimeController_C_ExecuteUbergraph_DayTimeController final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default;                             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_2;        // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue_1;        // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue_1;              // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue_2;              // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetLinearColorValue_ReturnValue;          // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetLinearColorValue_ReturnValue_1;        // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 CallFunc_Conv_LinearColorToColor_ReturnValue;      // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetLinearColorValue_ReturnValue_2;        // 0x0114(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetLinearColorValue_ReturnValue_3;        // 0x0124(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue_3;              // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue_4;              // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0168(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x3];                                      // 0x0251(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AStaticMeshActor*                       CallFunc_Array_Get_Item;                           // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0284(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_285[0x3];                                      // 0x0285(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AStaticMeshActor*                       CallFunc_Array_Get_Item_1;                         // 0x0288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue_1;                // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AStaticMeshActor*                       CallFunc_Array_Get_Item_2;                         // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x02AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AD[0x3];                                      // 0x02AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AStaticMeshActor*                       CallFunc_Array_Get_Item_3;                         // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x02BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BD[0x3];                                      // 0x02BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_3;             // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CA[0x2];                                      // 0x02CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetLinearColorValue_ReturnValue_4;        // 0x02CC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetLinearColorValue_ReturnValue_5;        // 0x02DC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetLinearColorValue_ReturnValue_6;        // 0x02EC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x02FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x02FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FE[0x2];                                      // 0x02FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default_1;                           // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_CustomEvent_Survival_1;                     // 0x0310(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_EnterPoint;                     // 0x0318(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_CustomEvent_Survival;                       // 0x0330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_ExitPoint;                      // 0x0338(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0350(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0368(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance2D_ReturnValue;            // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance2D_ReturnValue_1;          // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_3;        // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_4;        // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1;  // 0x03A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A2[0x6];                                      // 0x03A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_ReturnValue_2;                     // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_3;                     // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x03C0(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x03D0(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue_5;              // 0x03D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DC[0x4];                                      // 0x03DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_1;                       // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_1; // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x03F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F2[0x2];                                      // 0x03F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatValue_ReturnValue_6;              // 0x03F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_2;                       // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_3;                       // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_CalculateTime_Delta_ImplicitCast;         // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Pitch_ImplicitCast;           // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Pitch_ImplicitCast_1;         // 0x0414(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_InTime_ImplicitCast;        // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_InTime_ImplicitCast_1;      // 0x041C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_InTime_ImplicitCast_2;      // 0x0420(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLinearColorValue_InTime_ImplicitCast;  // 0x0424(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLinearColorValue_InTime_ImplicitCast_1; // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLinearColorValue_InTime_ImplicitCast_2; // 0x042C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLinearColorValue_InTime_ImplicitCast_3; // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_InTime_ImplicitCast_3;      // 0x0434(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_InTime_ImplicitCast_4;      // 0x0438(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLinearColorValue_InTime_ImplicitCast_4; // 0x043C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLinearColorValue_InTime_ImplicitCast_5; // 0x0440(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLinearColorValue_InTime_ImplicitCast_6; // 0x0444(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0448(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1;  // 0x044C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_InTime_ImplicitCast_5;      // 0x0450(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_454[0x4];                                      // 0x0454(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_B_ImplicitCast;                      // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_SkyLightIntensity_ImplicitCast; // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetIntensity_NewIntensity_ImplicitCast;   // 0x0468(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetIntensity_NewIntensity_ImplicitCast_1; // 0x046C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_SkyLightIntensity_ImplicitCast_1; // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_LightIntensity_ImplicitCast;    // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_LightIntensity_ImplicitCast_1;  // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_InTime_ImplicitCast_6;      // 0x0488(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48C[0x4];                                      // 0x048C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_B_ImplicitCast_1;                    // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetIntensity_NewIntensity_ImplicitCast_2; // 0x0498(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetIntensity_NewIntensity_ImplicitCast_3; // 0x049C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DayTimeController_C_ExecuteUbergraph_DayTimeController) == 0x000008, "Wrong alignment on DayTimeController_C_ExecuteUbergraph_DayTimeController");
static_assert(sizeof(DayTimeController_C_ExecuteUbergraph_DayTimeController) == 0x0004A0, "Wrong size on DayTimeController_C_ExecuteUbergraph_DayTimeController");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, EntryPoint) == 0x000000, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::EntryPoint' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, Temp_bool_Has_Been_Initd_Variable) == 0x000024, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, Temp_int_Array_Index_Variable) == 0x000030, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000034, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, Temp_real_Variable) == 0x000038, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, Temp_int_Loop_Counter_Variable_1) == 0x000040, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_Add_IntInt_ReturnValue_1) == 0x000044, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, Temp_int_Array_Index_Variable_1) == 0x000048, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, K2Node_Event_DeltaSeconds) == 0x00004C, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, Temp_bool_Has_Been_Initd_Variable_1) == 0x000050, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, Temp_bool_Variable) == 0x000051, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000058, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_FClamp_ReturnValue) == 0x000060, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000068, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000070, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_MakeRotator_ReturnValue) == 0x000078, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_K2_SetActorRotation_ReturnValue) == 0x000090, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_MapRangeClamped_ReturnValue) == 0x000098, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, K2Node_Select_Default) == 0x0000A0, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x0000A8, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_Divide_DoubleDouble_ReturnValue_2) == 0x0000B0, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_Divide_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0000B8, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_FClamp_ReturnValue_1) == 0x0000C0, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_MakeRotator_ReturnValue_1) == 0x0000C8, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_K2_SetActorRotation_ReturnValue_1) == 0x0000E0, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_K2_SetActorRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_GetFloatValue_ReturnValue) == 0x0000E4, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_GetFloatValue_ReturnValue_1) == 0x0000E8, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_GetFloatValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_GetFloatValue_ReturnValue_2) == 0x0000EC, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_GetFloatValue_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_GetLinearColorValue_ReturnValue) == 0x0000F0, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_GetLinearColorValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_GetLinearColorValue_ReturnValue_1) == 0x000100, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_GetLinearColorValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_Conv_LinearColorToColor_ReturnValue) == 0x000110, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_Conv_LinearColorToColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_GetLinearColorValue_ReturnValue_2) == 0x000114, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_GetLinearColorValue_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_GetLinearColorValue_ReturnValue_3) == 0x000124, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_GetLinearColorValue_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_GetFloatValue_ReturnValue_3) == 0x000134, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_GetFloatValue_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_GetFloatValue_ReturnValue_4) == 0x000138, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_GetFloatValue_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_GetPlayerPawn_ReturnValue) == 0x000140, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_IsValid_ReturnValue) == 0x000148, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000150, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000168, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000250, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_Array_Length_ReturnValue) == 0x000254, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_Greater_IntInt_ReturnValue) == 0x000258, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_Array_Get_Item) == 0x000260, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, Temp_real_Variable_1) == 0x000268, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_GetMaterial_ReturnValue) == 0x000270, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000278, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_Array_Length_ReturnValue_1) == 0x000280, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000284, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_Array_Get_Item_1) == 0x000288, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_GetMaterial_ReturnValue_1) == 0x000290, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_GetMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_Array_Get_Item_2) == 0x000298, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x0002A0, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_Array_Length_ReturnValue_2) == 0x0002A8, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_Less_IntInt_ReturnValue) == 0x0002AC, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_Array_Get_Item_3) == 0x0002B0, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_Array_Length_ReturnValue_3) == 0x0002B8, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_Less_IntInt_ReturnValue_1) == 0x0002BC, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_Array_Length_ReturnValue_4) == 0x0002C0, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_Array_Length_ReturnValue_5) == 0x0002C4, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_Array_Length_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_Greater_IntInt_ReturnValue_2) == 0x0002C8, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_Greater_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_Greater_IntInt_ReturnValue_3) == 0x0002C9, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_Greater_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_GetLinearColorValue_ReturnValue_4) == 0x0002CC, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_GetLinearColorValue_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_GetLinearColorValue_ReturnValue_5) == 0x0002DC, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_GetLinearColorValue_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_GetLinearColorValue_ReturnValue_6) == 0x0002EC, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_GetLinearColorValue_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, Temp_bool_IsClosed_Variable) == 0x0002FC, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, Temp_bool_Variable_1) == 0x0002FD, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, K2Node_Select_Default_1) == 0x000300, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000308, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, K2Node_CustomEvent_Survival_1) == 0x000310, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::K2Node_CustomEvent_Survival_1' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, K2Node_CustomEvent_EnterPoint) == 0x000318, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::K2Node_CustomEvent_EnterPoint' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, K2Node_CustomEvent_Survival) == 0x000330, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::K2Node_CustomEvent_Survival' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, K2Node_CustomEvent_ExitPoint) == 0x000338, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::K2Node_CustomEvent_ExitPoint' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000350, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000368, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_Vector_Distance2D_ReturnValue) == 0x000380, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_Vector_Distance2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_Vector_Distance2D_ReturnValue_1) == 0x000388, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_Vector_Distance2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_Divide_DoubleDouble_ReturnValue_3) == 0x000390, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_Divide_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_Divide_DoubleDouble_ReturnValue_4) == 0x000398, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_Divide_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x0003A0, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1) == 0x0003A1, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_FClamp_ReturnValue_2) == 0x0003A8, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_FClamp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_FClamp_ReturnValue_3) == 0x0003B0, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_FClamp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x0003B8, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0003C0, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_GetWorldDeltaSeconds_ReturnValue_1) == 0x0003C8, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_GetWorldDeltaSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x0003D0, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_GetFloatValue_ReturnValue_5) == 0x0003D8, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_GetFloatValue_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_Lerp_ReturnValue) == 0x0003E0, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_Lerp_ReturnValue_1) == 0x0003E8, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_1) == 0x0003F0, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_1' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, Temp_bool_IsClosed_Variable_1) == 0x0003F1, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_GetFloatValue_ReturnValue_6) == 0x0003F4, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_GetFloatValue_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_Lerp_ReturnValue_2) == 0x0003F8, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_Lerp_ReturnValue_3) == 0x000400, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_Lerp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_CalculateTime_Delta_ImplicitCast) == 0x000408, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_CalculateTime_Delta_ImplicitCast' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_MakeRotator_Pitch_ImplicitCast) == 0x000410, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_MakeRotator_Pitch_ImplicitCast' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_MakeRotator_Pitch_ImplicitCast_1) == 0x000414, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_MakeRotator_Pitch_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(DayTimeController_C_ExecuteUbergraph_DayTimeController, CallFunc_GetFloatValue_InTime_ImplicitCast) == 0x000418, "Member 'DayTimeController_C_ExecuteUbergraph_DayTimeController::CallFunc_GetFloatValue_InTime_ImplicitCast' has a wrong offset!");
