#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DeadBodyLootPoint

#include "Basic.hpp"

#include "S_LootChanceModifier_structs.hpp"


namespace SDK::Params
{

// Function DeadBodyLootPoint.DeadBodyLootPoint_C.ExecuteUbergraph_DeadBodyLootPoint
// 0x0048 (0x0048 - 0x0000)
struct DeadBodyLootPoint_C_ExecuteUbergraph_DeadBodyLootPoint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerDeadBodyV2_C*                    K2Node_DynamicCast_AsPlayer_Dead_Body_V2;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NewParam)>         K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NewParam)>         K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetBoneName__Pelvis__BoneName;            // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DeadBodyLootPoint_C_ExecuteUbergraph_DeadBodyLootPoint) == 0x000008, "Wrong alignment on DeadBodyLootPoint_C_ExecuteUbergraph_DeadBodyLootPoint");
static_assert(sizeof(DeadBodyLootPoint_C_ExecuteUbergraph_DeadBodyLootPoint) == 0x000048, "Wrong size on DeadBodyLootPoint_C_ExecuteUbergraph_DeadBodyLootPoint");
static_assert(offsetof(DeadBodyLootPoint_C_ExecuteUbergraph_DeadBodyLootPoint, EntryPoint) == 0x000000, "Member 'DeadBodyLootPoint_C_ExecuteUbergraph_DeadBodyLootPoint::EntryPoint' has a wrong offset!");
static_assert(offsetof(DeadBodyLootPoint_C_ExecuteUbergraph_DeadBodyLootPoint, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'DeadBodyLootPoint_C_ExecuteUbergraph_DeadBodyLootPoint::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(DeadBodyLootPoint_C_ExecuteUbergraph_DeadBodyLootPoint, CallFunc_HasAuthority_ReturnValue_1) == 0x000005, "Member 'DeadBodyLootPoint_C_ExecuteUbergraph_DeadBodyLootPoint::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DeadBodyLootPoint_C_ExecuteUbergraph_DeadBodyLootPoint, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'DeadBodyLootPoint_C_ExecuteUbergraph_DeadBodyLootPoint::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(DeadBodyLootPoint_C_ExecuteUbergraph_DeadBodyLootPoint, K2Node_DynamicCast_AsPlayer_Dead_Body_V2) == 0x000010, "Member 'DeadBodyLootPoint_C_ExecuteUbergraph_DeadBodyLootPoint::K2Node_DynamicCast_AsPlayer_Dead_Body_V2' has a wrong offset!");
static_assert(offsetof(DeadBodyLootPoint_C_ExecuteUbergraph_DeadBodyLootPoint, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'DeadBodyLootPoint_C_ExecuteUbergraph_DeadBodyLootPoint::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(DeadBodyLootPoint_C_ExecuteUbergraph_DeadBodyLootPoint, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'DeadBodyLootPoint_C_ExecuteUbergraph_DeadBodyLootPoint::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(DeadBodyLootPoint_C_ExecuteUbergraph_DeadBodyLootPoint, K2Node_CreateDelegate_OutputDelegate_1) == 0x00002C, "Member 'DeadBodyLootPoint_C_ExecuteUbergraph_DeadBodyLootPoint::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(DeadBodyLootPoint_C_ExecuteUbergraph_DeadBodyLootPoint, CallFunc_GetBoneName__Pelvis__BoneName) == 0x00003C, "Member 'DeadBodyLootPoint_C_ExecuteUbergraph_DeadBodyLootPoint::CallFunc_GetBoneName__Pelvis__BoneName' has a wrong offset!");
static_assert(offsetof(DeadBodyLootPoint_C_ExecuteUbergraph_DeadBodyLootPoint, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000044, "Member 'DeadBodyLootPoint_C_ExecuteUbergraph_DeadBodyLootPoint::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(DeadBodyLootPoint_C_ExecuteUbergraph_DeadBodyLootPoint, CallFunc_IsValid_ReturnValue) == 0x000045, "Member 'DeadBodyLootPoint_C_ExecuteUbergraph_DeadBodyLootPoint::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(DeadBodyLootPoint_C_ExecuteUbergraph_DeadBodyLootPoint, CallFunc_IsValid_ReturnValue_1) == 0x000046, "Member 'DeadBodyLootPoint_C_ExecuteUbergraph_DeadBodyLootPoint::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DeadBodyLootPoint_C_ExecuteUbergraph_DeadBodyLootPoint, CallFunc_BooleanAND_ReturnValue) == 0x000047, "Member 'DeadBodyLootPoint_C_ExecuteUbergraph_DeadBodyLootPoint::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function DeadBodyLootPoint.DeadBodyLootPoint_C.OnToggleDeadBodyTimer
// 0x0028 (0x0028 - 0x0000)
struct DeadBodyLootPoint_C_OnToggleDeadBodyTimer final
{
public:
	bool                                          NewState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerDeadBodyV2_C*                    K2Node_DynamicCast_AsPlayer_Dead_Body_V2;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DeadBodyLootPoint_C_OnToggleDeadBodyTimer) == 0x000008, "Wrong alignment on DeadBodyLootPoint_C_OnToggleDeadBodyTimer");
static_assert(sizeof(DeadBodyLootPoint_C_OnToggleDeadBodyTimer) == 0x000028, "Wrong size on DeadBodyLootPoint_C_OnToggleDeadBodyTimer");
static_assert(offsetof(DeadBodyLootPoint_C_OnToggleDeadBodyTimer, NewState) == 0x000000, "Member 'DeadBodyLootPoint_C_OnToggleDeadBodyTimer::NewState' has a wrong offset!");
static_assert(offsetof(DeadBodyLootPoint_C_OnToggleDeadBodyTimer, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'DeadBodyLootPoint_C_OnToggleDeadBodyTimer::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(DeadBodyLootPoint_C_OnToggleDeadBodyTimer, CallFunc_HasAuthority_ReturnValue) == 0x000010, "Member 'DeadBodyLootPoint_C_OnToggleDeadBodyTimer::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(DeadBodyLootPoint_C_OnToggleDeadBodyTimer, K2Node_DynamicCast_AsPlayer_Dead_Body_V2) == 0x000018, "Member 'DeadBodyLootPoint_C_OnToggleDeadBodyTimer::K2Node_DynamicCast_AsPlayer_Dead_Body_V2' has a wrong offset!");
static_assert(offsetof(DeadBodyLootPoint_C_OnToggleDeadBodyTimer, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'DeadBodyLootPoint_C_OnToggleDeadBodyTimer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(DeadBodyLootPoint_C_OnToggleDeadBodyTimer, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'DeadBodyLootPoint_C_OnToggleDeadBodyTimer::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function DeadBodyLootPoint.DeadBodyLootPoint_C.UserConstructionScript
// 0x000A (0x000A - 0x0000)
struct DeadBodyLootPoint_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_LootChanceModifier                  K2Node_MakeStruct_S_LootChanceModifier;            // 0x0001(0x0009)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DeadBodyLootPoint_C_UserConstructionScript) == 0x000001, "Wrong alignment on DeadBodyLootPoint_C_UserConstructionScript");
static_assert(sizeof(DeadBodyLootPoint_C_UserConstructionScript) == 0x00000A, "Wrong size on DeadBodyLootPoint_C_UserConstructionScript");
static_assert(offsetof(DeadBodyLootPoint_C_UserConstructionScript, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'DeadBodyLootPoint_C_UserConstructionScript::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(DeadBodyLootPoint_C_UserConstructionScript, K2Node_MakeStruct_S_LootChanceModifier) == 0x000001, "Member 'DeadBodyLootPoint_C_UserConstructionScript::K2Node_MakeStruct_S_LootChanceModifier' has a wrong offset!");

}

