#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Debug_FX_widget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function Debug_FX_widget.Debug_FX_widget_C.BndEvt__Debug_FX_widget_EditableTextBox_1_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct Debug_FX_widget_C_BndEvt__Debug_FX_widget_EditableTextBox_1_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Debug_FX_widget_C_BndEvt__Debug_FX_widget_EditableTextBox_1_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000008, "Wrong alignment on Debug_FX_widget_C_BndEvt__Debug_FX_widget_EditableTextBox_1_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(sizeof(Debug_FX_widget_C_BndEvt__Debug_FX_widget_EditableTextBox_1_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000020, "Wrong size on Debug_FX_widget_C_BndEvt__Debug_FX_widget_EditableTextBox_1_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(offsetof(Debug_FX_widget_C_BndEvt__Debug_FX_widget_EditableTextBox_1_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature, Text) == 0x000000, "Member 'Debug_FX_widget_C_BndEvt__Debug_FX_widget_EditableTextBox_1_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature::Text' has a wrong offset!");
static_assert(offsetof(Debug_FX_widget_C_BndEvt__Debug_FX_widget_EditableTextBox_1_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature, CommitMethod) == 0x000018, "Member 'Debug_FX_widget_C_BndEvt__Debug_FX_widget_EditableTextBox_1_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature::CommitMethod' has a wrong offset!");

// Function Debug_FX_widget.Debug_FX_widget_C.BndEvt__Debug_FX_widget_EditableTextBox_2_K2Node_ComponentBoundEvent_3_OnEditableTextBoxCommittedEvent__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct Debug_FX_widget_C_BndEvt__Debug_FX_widget_EditableTextBox_2_K2Node_ComponentBoundEvent_3_OnEditableTextBoxCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Debug_FX_widget_C_BndEvt__Debug_FX_widget_EditableTextBox_2_K2Node_ComponentBoundEvent_3_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000008, "Wrong alignment on Debug_FX_widget_C_BndEvt__Debug_FX_widget_EditableTextBox_2_K2Node_ComponentBoundEvent_3_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(sizeof(Debug_FX_widget_C_BndEvt__Debug_FX_widget_EditableTextBox_2_K2Node_ComponentBoundEvent_3_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000020, "Wrong size on Debug_FX_widget_C_BndEvt__Debug_FX_widget_EditableTextBox_2_K2Node_ComponentBoundEvent_3_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(offsetof(Debug_FX_widget_C_BndEvt__Debug_FX_widget_EditableTextBox_2_K2Node_ComponentBoundEvent_3_OnEditableTextBoxCommittedEvent__DelegateSignature, Text) == 0x000000, "Member 'Debug_FX_widget_C_BndEvt__Debug_FX_widget_EditableTextBox_2_K2Node_ComponentBoundEvent_3_OnEditableTextBoxCommittedEvent__DelegateSignature::Text' has a wrong offset!");
static_assert(offsetof(Debug_FX_widget_C_BndEvt__Debug_FX_widget_EditableTextBox_2_K2Node_ComponentBoundEvent_3_OnEditableTextBoxCommittedEvent__DelegateSignature, CommitMethod) == 0x000018, "Member 'Debug_FX_widget_C_BndEvt__Debug_FX_widget_EditableTextBox_2_K2Node_ComponentBoundEvent_3_OnEditableTextBoxCommittedEvent__DelegateSignature::CommitMethod' has a wrong offset!");

// Function Debug_FX_widget.Debug_FX_widget_C.BndEvt__Debug_FX_widget_EditableTextBox_32_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct Debug_FX_widget_C_BndEvt__Debug_FX_widget_EditableTextBox_32_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Debug_FX_widget_C_BndEvt__Debug_FX_widget_EditableTextBox_32_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000008, "Wrong alignment on Debug_FX_widget_C_BndEvt__Debug_FX_widget_EditableTextBox_32_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(sizeof(Debug_FX_widget_C_BndEvt__Debug_FX_widget_EditableTextBox_32_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000020, "Wrong size on Debug_FX_widget_C_BndEvt__Debug_FX_widget_EditableTextBox_32_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(offsetof(Debug_FX_widget_C_BndEvt__Debug_FX_widget_EditableTextBox_32_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature, Text) == 0x000000, "Member 'Debug_FX_widget_C_BndEvt__Debug_FX_widget_EditableTextBox_32_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature::Text' has a wrong offset!");
static_assert(offsetof(Debug_FX_widget_C_BndEvt__Debug_FX_widget_EditableTextBox_32_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature, CommitMethod) == 0x000018, "Member 'Debug_FX_widget_C_BndEvt__Debug_FX_widget_EditableTextBox_32_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature::CommitMethod' has a wrong offset!");

// Function Debug_FX_widget.Debug_FX_widget_C.BndEvt__Debug_FX_widget_EditableTextBox_3_K2Node_ComponentBoundEvent_4_OnEditableTextBoxCommittedEvent__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct Debug_FX_widget_C_BndEvt__Debug_FX_widget_EditableTextBox_3_K2Node_ComponentBoundEvent_4_OnEditableTextBoxCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Debug_FX_widget_C_BndEvt__Debug_FX_widget_EditableTextBox_3_K2Node_ComponentBoundEvent_4_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000008, "Wrong alignment on Debug_FX_widget_C_BndEvt__Debug_FX_widget_EditableTextBox_3_K2Node_ComponentBoundEvent_4_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(sizeof(Debug_FX_widget_C_BndEvt__Debug_FX_widget_EditableTextBox_3_K2Node_ComponentBoundEvent_4_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000020, "Wrong size on Debug_FX_widget_C_BndEvt__Debug_FX_widget_EditableTextBox_3_K2Node_ComponentBoundEvent_4_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(offsetof(Debug_FX_widget_C_BndEvt__Debug_FX_widget_EditableTextBox_3_K2Node_ComponentBoundEvent_4_OnEditableTextBoxCommittedEvent__DelegateSignature, Text) == 0x000000, "Member 'Debug_FX_widget_C_BndEvt__Debug_FX_widget_EditableTextBox_3_K2Node_ComponentBoundEvent_4_OnEditableTextBoxCommittedEvent__DelegateSignature::Text' has a wrong offset!");
static_assert(offsetof(Debug_FX_widget_C_BndEvt__Debug_FX_widget_EditableTextBox_3_K2Node_ComponentBoundEvent_4_OnEditableTextBoxCommittedEvent__DelegateSignature, CommitMethod) == 0x000018, "Member 'Debug_FX_widget_C_BndEvt__Debug_FX_widget_EditableTextBox_3_K2Node_ComponentBoundEvent_4_OnEditableTextBoxCommittedEvent__DelegateSignature::CommitMethod' has a wrong offset!");

// Function Debug_FX_widget.Debug_FX_widget_C.BndEvt__Debug_FX_widget_EditableTextBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct Debug_FX_widget_C_BndEvt__Debug_FX_widget_EditableTextBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Debug_FX_widget_C_BndEvt__Debug_FX_widget_EditableTextBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000008, "Wrong alignment on Debug_FX_widget_C_BndEvt__Debug_FX_widget_EditableTextBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(sizeof(Debug_FX_widget_C_BndEvt__Debug_FX_widget_EditableTextBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000020, "Wrong size on Debug_FX_widget_C_BndEvt__Debug_FX_widget_EditableTextBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(offsetof(Debug_FX_widget_C_BndEvt__Debug_FX_widget_EditableTextBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature, Text) == 0x000000, "Member 'Debug_FX_widget_C_BndEvt__Debug_FX_widget_EditableTextBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature::Text' has a wrong offset!");
static_assert(offsetof(Debug_FX_widget_C_BndEvt__Debug_FX_widget_EditableTextBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature, CommitMethod) == 0x000018, "Member 'Debug_FX_widget_C_BndEvt__Debug_FX_widget_EditableTextBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature::CommitMethod' has a wrong offset!");

// Function Debug_FX_widget.Debug_FX_widget_C.ExecuteUbergraph_Debug_FX_widget
// 0x0180 (0x0180 - 0x0000)
struct Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_Text_4;                 // 0x0040(0x0018)(ConstParm)
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod_4;         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text_3;                 // 0x0060(0x0018)(ConstParm)
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod_3;         // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_StringToDouble_ReturnValue;          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_StringToDouble_ReturnValue_1;        // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_Text_2;                 // 0x00B0(0x0018)(ConstParm)
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod_2;         // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text_1;                 // 0x00D0(0x0018)(ConstParm)
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod_1;         // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_3;          // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_StringToDouble_ReturnValue_2;        // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_StringToDouble_ReturnValue_3;        // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0120(0x0018)(ConstParm)
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod;           // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_4;          // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AAVS_VehicleMaster_C*                   K2Node_DynamicCast_AsAVS_Vehicle_Master;           // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_StringToDouble_ReturnValue_4;        // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DEBUG_SetFXSpawnRate_SpawnRate_ST4_ImplicitCast; // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DEBUG_SetFXSpawnRate_SpawnRate_ImplicitCast; // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DEBUG_SetFXSpawnRate_SpawnRate_ST_ImplicitCast; // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DEBUG_SetFXSpawnRate_SpawnRate_ST2_ImplicitCast; // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DEBUG_SetFXSpawnRate_SpawnRate_ST3_ImplicitCast; // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget) == 0x000008, "Wrong alignment on Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget");
static_assert(sizeof(Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget) == 0x000180, "Wrong size on Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget");
static_assert(offsetof(Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget, EntryPoint) == 0x000000, "Member 'Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget::EntryPoint' has a wrong offset!");
static_assert(offsetof(Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget, K2Node_Event_MyGeometry) == 0x000004, "Member 'Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget, K2Node_ComponentBoundEvent_Text_4) == 0x000040, "Member 'Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget::K2Node_ComponentBoundEvent_Text_4' has a wrong offset!");
static_assert(offsetof(Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget, K2Node_ComponentBoundEvent_CommitMethod_4) == 0x000058, "Member 'Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget::K2Node_ComponentBoundEvent_CommitMethod_4' has a wrong offset!");
static_assert(offsetof(Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget, K2Node_ComponentBoundEvent_Text_3) == 0x000060, "Member 'Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget::K2Node_ComponentBoundEvent_Text_3' has a wrong offset!");
static_assert(offsetof(Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget, K2Node_ComponentBoundEvent_CommitMethod_3) == 0x000078, "Member 'Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget::K2Node_ComponentBoundEvent_CommitMethod_3' has a wrong offset!");
static_assert(offsetof(Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget, CallFunc_Conv_TextToString_ReturnValue) == 0x000080, "Member 'Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000090, "Member 'Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget, CallFunc_Conv_StringToDouble_ReturnValue) == 0x0000A0, "Member 'Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget::CallFunc_Conv_StringToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget, CallFunc_Conv_StringToDouble_ReturnValue_1) == 0x0000A8, "Member 'Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget::CallFunc_Conv_StringToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget, K2Node_ComponentBoundEvent_Text_2) == 0x0000B0, "Member 'Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget::K2Node_ComponentBoundEvent_Text_2' has a wrong offset!");
static_assert(offsetof(Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget, K2Node_ComponentBoundEvent_CommitMethod_2) == 0x0000C8, "Member 'Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget::K2Node_ComponentBoundEvent_CommitMethod_2' has a wrong offset!");
static_assert(offsetof(Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget, K2Node_ComponentBoundEvent_Text_1) == 0x0000D0, "Member 'Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget::K2Node_ComponentBoundEvent_Text_1' has a wrong offset!");
static_assert(offsetof(Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget, K2Node_ComponentBoundEvent_CommitMethod_1) == 0x0000E8, "Member 'Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget::K2Node_ComponentBoundEvent_CommitMethod_1' has a wrong offset!");
static_assert(offsetof(Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget, CallFunc_Conv_TextToString_ReturnValue_2) == 0x0000F0, "Member 'Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget, CallFunc_Conv_TextToString_ReturnValue_3) == 0x000100, "Member 'Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget::CallFunc_Conv_TextToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget, CallFunc_Conv_StringToDouble_ReturnValue_2) == 0x000110, "Member 'Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget::CallFunc_Conv_StringToDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget, CallFunc_Conv_StringToDouble_ReturnValue_3) == 0x000118, "Member 'Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget::CallFunc_Conv_StringToDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget, K2Node_ComponentBoundEvent_Text) == 0x000120, "Member 'Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget, K2Node_ComponentBoundEvent_CommitMethod) == 0x000138, "Member 'Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget::K2Node_ComponentBoundEvent_CommitMethod' has a wrong offset!");
static_assert(offsetof(Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget, CallFunc_Conv_TextToString_ReturnValue_4) == 0x000140, "Member 'Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget::CallFunc_Conv_TextToString_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget, K2Node_DynamicCast_AsAVS_Vehicle_Master) == 0x000150, "Member 'Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget::K2Node_DynamicCast_AsAVS_Vehicle_Master' has a wrong offset!");
static_assert(offsetof(Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget, K2Node_DynamicCast_bSuccess) == 0x000158, "Member 'Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget, CallFunc_Conv_StringToDouble_ReturnValue_4) == 0x000160, "Member 'Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget::CallFunc_Conv_StringToDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget, CallFunc_DEBUG_SetFXSpawnRate_SpawnRate_ST4_ImplicitCast) == 0x000168, "Member 'Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget::CallFunc_DEBUG_SetFXSpawnRate_SpawnRate_ST4_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget, CallFunc_DEBUG_SetFXSpawnRate_SpawnRate_ImplicitCast) == 0x00016C, "Member 'Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget::CallFunc_DEBUG_SetFXSpawnRate_SpawnRate_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget, CallFunc_DEBUG_SetFXSpawnRate_SpawnRate_ST_ImplicitCast) == 0x000170, "Member 'Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget::CallFunc_DEBUG_SetFXSpawnRate_SpawnRate_ST_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget, CallFunc_DEBUG_SetFXSpawnRate_SpawnRate_ST2_ImplicitCast) == 0x000174, "Member 'Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget::CallFunc_DEBUG_SetFXSpawnRate_SpawnRate_ST2_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget, CallFunc_DEBUG_SetFXSpawnRate_SpawnRate_ST3_ImplicitCast) == 0x000178, "Member 'Debug_FX_widget_C_ExecuteUbergraph_Debug_FX_widget::CallFunc_DEBUG_SetFXSpawnRate_SpawnRate_ST3_ImplicitCast' has a wrong offset!");

// Function Debug_FX_widget.Debug_FX_widget_C.SetHintText
// 0x00A0 (0x00A0 - 0x0000)
struct Debug_FX_widget_C_SetHintText final
{
public:
	double                                        SR;                                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SRST;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SRST2;                                             // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SRST3;                                             // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SRST4;                                             // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0028(0x0018)()
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_1;          // 0x0040(0x0018)()
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_2;          // 0x0058(0x0018)()
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_3;          // 0x0070(0x0018)()
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_4;          // 0x0088(0x0018)()
};
static_assert(alignof(Debug_FX_widget_C_SetHintText) == 0x000008, "Wrong alignment on Debug_FX_widget_C_SetHintText");
static_assert(sizeof(Debug_FX_widget_C_SetHintText) == 0x0000A0, "Wrong size on Debug_FX_widget_C_SetHintText");
static_assert(offsetof(Debug_FX_widget_C_SetHintText, SR) == 0x000000, "Member 'Debug_FX_widget_C_SetHintText::SR' has a wrong offset!");
static_assert(offsetof(Debug_FX_widget_C_SetHintText, SRST) == 0x000008, "Member 'Debug_FX_widget_C_SetHintText::SRST' has a wrong offset!");
static_assert(offsetof(Debug_FX_widget_C_SetHintText, SRST2) == 0x000010, "Member 'Debug_FX_widget_C_SetHintText::SRST2' has a wrong offset!");
static_assert(offsetof(Debug_FX_widget_C_SetHintText, SRST3) == 0x000018, "Member 'Debug_FX_widget_C_SetHintText::SRST3' has a wrong offset!");
static_assert(offsetof(Debug_FX_widget_C_SetHintText, SRST4) == 0x000020, "Member 'Debug_FX_widget_C_SetHintText::SRST4' has a wrong offset!");
static_assert(offsetof(Debug_FX_widget_C_SetHintText, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000028, "Member 'Debug_FX_widget_C_SetHintText::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Debug_FX_widget_C_SetHintText, CallFunc_Conv_DoubleToText_ReturnValue_1) == 0x000040, "Member 'Debug_FX_widget_C_SetHintText::CallFunc_Conv_DoubleToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Debug_FX_widget_C_SetHintText, CallFunc_Conv_DoubleToText_ReturnValue_2) == 0x000058, "Member 'Debug_FX_widget_C_SetHintText::CallFunc_Conv_DoubleToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Debug_FX_widget_C_SetHintText, CallFunc_Conv_DoubleToText_ReturnValue_3) == 0x000070, "Member 'Debug_FX_widget_C_SetHintText::CallFunc_Conv_DoubleToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Debug_FX_widget_C_SetHintText, CallFunc_Conv_DoubleToText_ReturnValue_4) == 0x000088, "Member 'Debug_FX_widget_C_SetHintText::CallFunc_Conv_DoubleToText_ReturnValue_4' has a wrong offset!");

// Function Debug_FX_widget.Debug_FX_widget_C.Tick
// 0x003C (0x003C - 0x0000)
struct Debug_FX_widget_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Debug_FX_widget_C_Tick) == 0x000004, "Wrong alignment on Debug_FX_widget_C_Tick");
static_assert(sizeof(Debug_FX_widget_C_Tick) == 0x00003C, "Wrong size on Debug_FX_widget_C_Tick");
static_assert(offsetof(Debug_FX_widget_C_Tick, MyGeometry) == 0x000000, "Member 'Debug_FX_widget_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(Debug_FX_widget_C_Tick, InDeltaTime) == 0x000038, "Member 'Debug_FX_widget_C_Tick::InDeltaTime' has a wrong offset!");

}

