#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DecalDelaySpawner

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function DecalDelaySpawner.DecalDelaySpawner_C.Call
// 0x0068 (0x0068 - 0x0000)
struct DecalDelaySpawner_C_Call final
{
public:
	class UMaterialInterface*                     DecalMaterial;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        AttachToComponent;                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DecalSize;                                         // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AttachPointName;                                   // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x0048(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        Delay;                                             // 0x0060(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DecalDelaySpawner_C_Call) == 0x000008, "Wrong alignment on DecalDelaySpawner_C_Call");
static_assert(sizeof(DecalDelaySpawner_C_Call) == 0x000068, "Wrong size on DecalDelaySpawner_C_Call");
static_assert(offsetof(DecalDelaySpawner_C_Call, DecalMaterial) == 0x000000, "Member 'DecalDelaySpawner_C_Call::DecalMaterial' has a wrong offset!");
static_assert(offsetof(DecalDelaySpawner_C_Call, AttachToComponent) == 0x000008, "Member 'DecalDelaySpawner_C_Call::AttachToComponent' has a wrong offset!");
static_assert(offsetof(DecalDelaySpawner_C_Call, DecalSize) == 0x000010, "Member 'DecalDelaySpawner_C_Call::DecalSize' has a wrong offset!");
static_assert(offsetof(DecalDelaySpawner_C_Call, AttachPointName) == 0x000028, "Member 'DecalDelaySpawner_C_Call::AttachPointName' has a wrong offset!");
static_assert(offsetof(DecalDelaySpawner_C_Call, Location) == 0x000030, "Member 'DecalDelaySpawner_C_Call::Location' has a wrong offset!");
static_assert(offsetof(DecalDelaySpawner_C_Call, Rotation) == 0x000048, "Member 'DecalDelaySpawner_C_Call::Rotation' has a wrong offset!");
static_assert(offsetof(DecalDelaySpawner_C_Call, Delay) == 0x000060, "Member 'DecalDelaySpawner_C_Call::Delay' has a wrong offset!");

// Function DecalDelaySpawner.DecalDelaySpawner_C.ExecuteUbergraph_DecalDelaySpawner
// 0x00A0 (0x00A0 - 0x0000)
struct DecalDelaySpawner_C_ExecuteUbergraph_DecalDelaySpawner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_CustomEvent_DecalMaterial;                  // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        K2Node_CustomEvent_AttachToComponent;              // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_DecalSize;                      // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_AttachPointName;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Location;                       // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_CustomEvent_Rotation;                       // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        K2Node_CustomEvent_Delay;                          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0088(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        CallFunc_SpawnDecalAttached_ReturnValue;           // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DecalDelaySpawner_C_ExecuteUbergraph_DecalDelaySpawner) == 0x000008, "Wrong alignment on DecalDelaySpawner_C_ExecuteUbergraph_DecalDelaySpawner");
static_assert(sizeof(DecalDelaySpawner_C_ExecuteUbergraph_DecalDelaySpawner) == 0x0000A0, "Wrong size on DecalDelaySpawner_C_ExecuteUbergraph_DecalDelaySpawner");
static_assert(offsetof(DecalDelaySpawner_C_ExecuteUbergraph_DecalDelaySpawner, EntryPoint) == 0x000000, "Member 'DecalDelaySpawner_C_ExecuteUbergraph_DecalDelaySpawner::EntryPoint' has a wrong offset!");
static_assert(offsetof(DecalDelaySpawner_C_ExecuteUbergraph_DecalDelaySpawner, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'DecalDelaySpawner_C_ExecuteUbergraph_DecalDelaySpawner::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(DecalDelaySpawner_C_ExecuteUbergraph_DecalDelaySpawner, K2Node_CustomEvent_DecalMaterial) == 0x000018, "Member 'DecalDelaySpawner_C_ExecuteUbergraph_DecalDelaySpawner::K2Node_CustomEvent_DecalMaterial' has a wrong offset!");
static_assert(offsetof(DecalDelaySpawner_C_ExecuteUbergraph_DecalDelaySpawner, K2Node_CustomEvent_AttachToComponent) == 0x000020, "Member 'DecalDelaySpawner_C_ExecuteUbergraph_DecalDelaySpawner::K2Node_CustomEvent_AttachToComponent' has a wrong offset!");
static_assert(offsetof(DecalDelaySpawner_C_ExecuteUbergraph_DecalDelaySpawner, K2Node_CustomEvent_DecalSize) == 0x000028, "Member 'DecalDelaySpawner_C_ExecuteUbergraph_DecalDelaySpawner::K2Node_CustomEvent_DecalSize' has a wrong offset!");
static_assert(offsetof(DecalDelaySpawner_C_ExecuteUbergraph_DecalDelaySpawner, K2Node_CustomEvent_AttachPointName) == 0x000040, "Member 'DecalDelaySpawner_C_ExecuteUbergraph_DecalDelaySpawner::K2Node_CustomEvent_AttachPointName' has a wrong offset!");
static_assert(offsetof(DecalDelaySpawner_C_ExecuteUbergraph_DecalDelaySpawner, K2Node_CustomEvent_Location) == 0x000048, "Member 'DecalDelaySpawner_C_ExecuteUbergraph_DecalDelaySpawner::K2Node_CustomEvent_Location' has a wrong offset!");
static_assert(offsetof(DecalDelaySpawner_C_ExecuteUbergraph_DecalDelaySpawner, K2Node_CustomEvent_Rotation) == 0x000060, "Member 'DecalDelaySpawner_C_ExecuteUbergraph_DecalDelaySpawner::K2Node_CustomEvent_Rotation' has a wrong offset!");
static_assert(offsetof(DecalDelaySpawner_C_ExecuteUbergraph_DecalDelaySpawner, K2Node_CustomEvent_Delay) == 0x000078, "Member 'DecalDelaySpawner_C_ExecuteUbergraph_DecalDelaySpawner::K2Node_CustomEvent_Delay' has a wrong offset!");
static_assert(offsetof(DecalDelaySpawner_C_ExecuteUbergraph_DecalDelaySpawner, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'DecalDelaySpawner_C_ExecuteUbergraph_DecalDelaySpawner::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(DecalDelaySpawner_C_ExecuteUbergraph_DecalDelaySpawner, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000088, "Member 'DecalDelaySpawner_C_ExecuteUbergraph_DecalDelaySpawner::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(DecalDelaySpawner_C_ExecuteUbergraph_DecalDelaySpawner, CallFunc_SpawnDecalAttached_ReturnValue) == 0x000090, "Member 'DecalDelaySpawner_C_ExecuteUbergraph_DecalDelaySpawner::CallFunc_SpawnDecalAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(DecalDelaySpawner_C_ExecuteUbergraph_DecalDelaySpawner, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x000098, "Member 'DecalDelaySpawner_C_ExecuteUbergraph_DecalDelaySpawner::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");

}

