#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DecreasePlayerStatsOnTutorialStart

#include "Basic.hpp"

#include "QuestFramework_structs.hpp"


namespace SDK::Params
{

// Function DecreasePlayerStatsOnTutorialStart.DecreasePlayerStatsOnTutorialStart_C.ExecuteEvent
// 0x0028 (0x0028 - 0x0000)
struct DecreasePlayerStatsOnTutorialStart_C_ExecuteEvent final
{
public:
	class UQuestContext*                          Context;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FQuestEventPayload                     Payload;                                           // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(DecreasePlayerStatsOnTutorialStart_C_ExecuteEvent) == 0x000008, "Wrong alignment on DecreasePlayerStatsOnTutorialStart_C_ExecuteEvent");
static_assert(sizeof(DecreasePlayerStatsOnTutorialStart_C_ExecuteEvent) == 0x000028, "Wrong size on DecreasePlayerStatsOnTutorialStart_C_ExecuteEvent");
static_assert(offsetof(DecreasePlayerStatsOnTutorialStart_C_ExecuteEvent, Context) == 0x000000, "Member 'DecreasePlayerStatsOnTutorialStart_C_ExecuteEvent::Context' has a wrong offset!");
static_assert(offsetof(DecreasePlayerStatsOnTutorialStart_C_ExecuteEvent, Payload) == 0x000008, "Member 'DecreasePlayerStatsOnTutorialStart_C_ExecuteEvent::Payload' has a wrong offset!");

// Function DecreasePlayerStatsOnTutorialStart.DecreasePlayerStatsOnTutorialStart_C.ExecuteUbergraph_DecreasePlayerStatsOnTutorialStart
// 0x0078 (0x0078 - 0x0000)
struct DecreasePlayerStatsOnTutorialStart_C_ExecuteUbergraph_DecreasePlayerStatsOnTutorialStart final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UQuestContext*                          K2Node_Event_Context;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FQuestEventPayload                     K2Node_Event_Payload;                              // 0x0010(0x0020)(ConstParm, NoDestructor)
	class AController*                            CallFunc_GetOwnerController_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC;                  // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      CallFunc_GetPlayerRef_SurvivalPlayer;              // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetStat_Value;                            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DecreasePlayerStatsOnTutorialStart_C_ExecuteUbergraph_DecreasePlayerStatsOnTutorialStart) == 0x000008, "Wrong alignment on DecreasePlayerStatsOnTutorialStart_C_ExecuteUbergraph_DecreasePlayerStatsOnTutorialStart");
static_assert(sizeof(DecreasePlayerStatsOnTutorialStart_C_ExecuteUbergraph_DecreasePlayerStatsOnTutorialStart) == 0x000078, "Wrong size on DecreasePlayerStatsOnTutorialStart_C_ExecuteUbergraph_DecreasePlayerStatsOnTutorialStart");
static_assert(offsetof(DecreasePlayerStatsOnTutorialStart_C_ExecuteUbergraph_DecreasePlayerStatsOnTutorialStart, EntryPoint) == 0x000000, "Member 'DecreasePlayerStatsOnTutorialStart_C_ExecuteUbergraph_DecreasePlayerStatsOnTutorialStart::EntryPoint' has a wrong offset!");
static_assert(offsetof(DecreasePlayerStatsOnTutorialStart_C_ExecuteUbergraph_DecreasePlayerStatsOnTutorialStart, K2Node_Event_Context) == 0x000008, "Member 'DecreasePlayerStatsOnTutorialStart_C_ExecuteUbergraph_DecreasePlayerStatsOnTutorialStart::K2Node_Event_Context' has a wrong offset!");
static_assert(offsetof(DecreasePlayerStatsOnTutorialStart_C_ExecuteUbergraph_DecreasePlayerStatsOnTutorialStart, K2Node_Event_Payload) == 0x000010, "Member 'DecreasePlayerStatsOnTutorialStart_C_ExecuteUbergraph_DecreasePlayerStatsOnTutorialStart::K2Node_Event_Payload' has a wrong offset!");
static_assert(offsetof(DecreasePlayerStatsOnTutorialStart_C_ExecuteUbergraph_DecreasePlayerStatsOnTutorialStart, CallFunc_GetOwnerController_ReturnValue) == 0x000030, "Member 'DecreasePlayerStatsOnTutorialStart_C_ExecuteUbergraph_DecreasePlayerStatsOnTutorialStart::CallFunc_GetOwnerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(DecreasePlayerStatsOnTutorialStart_C_ExecuteUbergraph_DecreasePlayerStatsOnTutorialStart, K2Node_DynamicCast_AsBPI_Surv_PC) == 0x000038, "Member 'DecreasePlayerStatsOnTutorialStart_C_ExecuteUbergraph_DecreasePlayerStatsOnTutorialStart::K2Node_DynamicCast_AsBPI_Surv_PC' has a wrong offset!");
static_assert(offsetof(DecreasePlayerStatsOnTutorialStart_C_ExecuteUbergraph_DecreasePlayerStatsOnTutorialStart, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'DecreasePlayerStatsOnTutorialStart_C_ExecuteUbergraph_DecreasePlayerStatsOnTutorialStart::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(DecreasePlayerStatsOnTutorialStart_C_ExecuteUbergraph_DecreasePlayerStatsOnTutorialStart, CallFunc_GetPlayerRef_SurvivalPlayer) == 0x000050, "Member 'DecreasePlayerStatsOnTutorialStart_C_ExecuteUbergraph_DecreasePlayerStatsOnTutorialStart::CallFunc_GetPlayerRef_SurvivalPlayer' has a wrong offset!");
static_assert(offsetof(DecreasePlayerStatsOnTutorialStart_C_ExecuteUbergraph_DecreasePlayerStatsOnTutorialStart, CallFunc_GetStat_Value) == 0x000058, "Member 'DecreasePlayerStatsOnTutorialStart_C_ExecuteUbergraph_DecreasePlayerStatsOnTutorialStart::CallFunc_GetStat_Value' has a wrong offset!");
static_assert(offsetof(DecreasePlayerStatsOnTutorialStart_C_ExecuteUbergraph_DecreasePlayerStatsOnTutorialStart, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'DecreasePlayerStatsOnTutorialStart_C_ExecuteUbergraph_DecreasePlayerStatsOnTutorialStart::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(DecreasePlayerStatsOnTutorialStart_C_ExecuteUbergraph_DecreasePlayerStatsOnTutorialStart, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000061, "Member 'DecreasePlayerStatsOnTutorialStart_C_ExecuteUbergraph_DecreasePlayerStatsOnTutorialStart::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(DecreasePlayerStatsOnTutorialStart_C_ExecuteUbergraph_DecreasePlayerStatsOnTutorialStart, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000068, "Member 'DecreasePlayerStatsOnTutorialStart_C_ExecuteUbergraph_DecreasePlayerStatsOnTutorialStart::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(DecreasePlayerStatsOnTutorialStart_C_ExecuteUbergraph_DecreasePlayerStatsOnTutorialStart, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000070, "Member 'DecreasePlayerStatsOnTutorialStart_C_ExecuteUbergraph_DecreasePlayerStatsOnTutorialStart::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");

}

