#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DisassembleSettings

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct DisassembleSettings.DisassembleSettings
// 0x0010 (0x0010 - 0x0000)
struct FDisassembleSettings final
{
public:
	bool                                          DIsassembable_1_7B25A4CD4A89DB8177B3188099045245;  // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Metal_4_3F2ABB79428AE99E2D075D9D2BC92E9E;          // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Rag_6_1EC879494FDB3A05F875A08DF69F5F77;            // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Chemical_8_F3AE2A9F497FEDDEE01389B71F8D9C92;       // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FDisassembleSettings) == 0x000004, "Wrong alignment on FDisassembleSettings");
static_assert(sizeof(FDisassembleSettings) == 0x000010, "Wrong size on FDisassembleSettings");
static_assert(offsetof(FDisassembleSettings, DIsassembable_1_7B25A4CD4A89DB8177B3188099045245) == 0x000000, "Member 'FDisassembleSettings::DIsassembable_1_7B25A4CD4A89DB8177B3188099045245' has a wrong offset!");
static_assert(offsetof(FDisassembleSettings, Metal_4_3F2ABB79428AE99E2D075D9D2BC92E9E) == 0x000004, "Member 'FDisassembleSettings::Metal_4_3F2ABB79428AE99E2D075D9D2BC92E9E' has a wrong offset!");
static_assert(offsetof(FDisassembleSettings, Rag_6_1EC879494FDB3A05F875A08DF69F5F77) == 0x000008, "Member 'FDisassembleSettings::Rag_6_1EC879494FDB3A05F875A08DF69F5F77' has a wrong offset!");
static_assert(offsetof(FDisassembleSettings, Chemical_8_F3AE2A9F497FEDDEE01389B71F8D9C92) == 0x00000C, "Member 'FDisassembleSettings::Chemical_8_F3AE2A9F497FEDDEE01389B71F8D9C92' has a wrong offset!");

}

