#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DodgeChellenger__1__Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function DodgeChellenger__1__Skeleton_AnimBlueprint.DodgeChellenger__1__Skeleton_AnimBlueprint_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct DodgeChellenger__1__Skeleton_AnimBlueprint_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_AnimGraph) == 0x000008, "Wrong alignment on DodgeChellenger__1__Skeleton_AnimBlueprint_C_AnimGraph");
static_assert(sizeof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_AnimGraph) == 0x000010, "Wrong size on DodgeChellenger__1__Skeleton_AnimBlueprint_C_AnimGraph");
static_assert(offsetof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'DodgeChellenger__1__Skeleton_AnimBlueprint_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function DodgeChellenger__1__Skeleton_AnimBlueprint.DodgeChellenger__1__Skeleton_AnimBlueprint_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct DodgeChellenger__1__Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on DodgeChellenger__1__Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation");
static_assert(sizeof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on DodgeChellenger__1__Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation");
static_assert(offsetof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'DodgeChellenger__1__Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function DodgeChellenger__1__Skeleton_AnimBlueprint.DodgeChellenger__1__Skeleton_AnimBlueprint_C.CalculateBackHodovaia
// 0x0180 (0x0180 - 0x0000)
struct DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia final
{
public:
	struct FVector                                LeftWheel;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RightWheel;                                        // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Translation;                                       // 0x0030(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Angle;                                             // 0x0048(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BaseLocation_Hodovaya;                             // 0x0050(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector3f_X;                          // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector3f_Y;                          // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector3f_Z;                          // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector3f_X_1;                        // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector3f_Y_1;                        // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector3f_Z_1;                        // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_IntToVector_ReturnValue;             // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue_1;               // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Dot_VectorVector_ReturnValue;             // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorVector_ReturnValue;          // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_DegAcos_ReturnValue;                      // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              CallFunc_BreakVector3f_InVec_ImplicitCast;         // 0x0158(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              CallFunc_BreakVector3f_InVec_ImplicitCast_1;       // 0x0164(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_B_ImplicitCast;      // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia) == 0x000008, "Wrong alignment on DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia");
static_assert(sizeof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia) == 0x000180, "Wrong size on DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia");
static_assert(offsetof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia, LeftWheel) == 0x000000, "Member 'DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia::LeftWheel' has a wrong offset!");
static_assert(offsetof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia, RightWheel) == 0x000018, "Member 'DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia::RightWheel' has a wrong offset!");
static_assert(offsetof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia, Translation) == 0x000030, "Member 'DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia::Translation' has a wrong offset!");
static_assert(offsetof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia, Angle) == 0x000048, "Member 'DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia::Angle' has a wrong offset!");
static_assert(offsetof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia, BaseLocation_Hodovaya) == 0x000050, "Member 'DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia::BaseLocation_Hodovaya' has a wrong offset!");
static_assert(offsetof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000068, "Member 'DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x000080, "Member 'DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia, CallFunc_BreakVector3f_X) == 0x000098, "Member 'DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia::CallFunc_BreakVector3f_X' has a wrong offset!");
static_assert(offsetof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia, CallFunc_BreakVector3f_Y) == 0x00009C, "Member 'DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia::CallFunc_BreakVector3f_Y' has a wrong offset!");
static_assert(offsetof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia, CallFunc_BreakVector3f_Z) == 0x0000A0, "Member 'DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia::CallFunc_BreakVector3f_Z' has a wrong offset!");
static_assert(offsetof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia, CallFunc_BreakVector3f_X_1) == 0x0000A4, "Member 'DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia::CallFunc_BreakVector3f_X_1' has a wrong offset!");
static_assert(offsetof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia, CallFunc_BreakVector3f_Y_1) == 0x0000A8, "Member 'DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia::CallFunc_BreakVector3f_Y_1' has a wrong offset!");
static_assert(offsetof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia, CallFunc_BreakVector3f_Z_1) == 0x0000AC, "Member 'DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia::CallFunc_BreakVector3f_Z_1' has a wrong offset!");
static_assert(offsetof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia, CallFunc_Conv_IntToVector_ReturnValue) == 0x0000B0, "Member 'DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia::CallFunc_Conv_IntToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0000C8, "Member 'DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia, CallFunc_SelectVector_ReturnValue) == 0x0000D0, "Member 'DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia, CallFunc_SelectFloat_ReturnValue) == 0x0000E8, "Member 'DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia, CallFunc_Normal_ReturnValue) == 0x0000F0, "Member 'DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia, CallFunc_SelectVector_ReturnValue_1) == 0x000108, "Member 'DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia::CallFunc_SelectVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia, CallFunc_Dot_VectorVector_ReturnValue) == 0x000120, "Member 'DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia, CallFunc_Divide_VectorVector_ReturnValue) == 0x000128, "Member 'DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia::CallFunc_Divide_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia, CallFunc_DegAcos_ReturnValue) == 0x000140, "Member 'DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia::CallFunc_DegAcos_ReturnValue' has a wrong offset!");
static_assert(offsetof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000148, "Member 'DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000150, "Member 'DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia, CallFunc_BreakVector3f_InVec_ImplicitCast) == 0x000158, "Member 'DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia::CallFunc_BreakVector3f_InVec_ImplicitCast' has a wrong offset!");
static_assert(offsetof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia, CallFunc_BreakVector3f_InVec_ImplicitCast_1) == 0x000164, "Member 'DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia::CallFunc_BreakVector3f_InVec_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia, CallFunc_Greater_DoubleDouble_B_ImplicitCast) == 0x000170, "Member 'DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia::CallFunc_Greater_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000178, "Member 'DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateBackHodovaia::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function DodgeChellenger__1__Skeleton_AnimBlueprint.DodgeChellenger__1__Skeleton_AnimBlueprint_C.CalculateRubberRotation
// 0x0068 (0x0068 - 0x0000)
struct DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateRubberRotation final
{
public:
	double                                        Steering;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               RubberBasePos;                                     // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               NewRotation;                                       // 0x0020(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_MakeRotator_Pitch_ImplicitCast;           // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateRubberRotation) == 0x000008, "Wrong alignment on DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateRubberRotation");
static_assert(sizeof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateRubberRotation) == 0x000068, "Wrong size on DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateRubberRotation");
static_assert(offsetof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateRubberRotation, Steering) == 0x000000, "Member 'DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateRubberRotation::Steering' has a wrong offset!");
static_assert(offsetof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateRubberRotation, RubberBasePos) == 0x000008, "Member 'DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateRubberRotation::RubberBasePos' has a wrong offset!");
static_assert(offsetof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateRubberRotation, NewRotation) == 0x000020, "Member 'DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateRubberRotation::NewRotation' has a wrong offset!");
static_assert(offsetof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateRubberRotation, CallFunc_BreakRotator_Roll) == 0x000038, "Member 'DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateRubberRotation::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateRubberRotation, CallFunc_BreakRotator_Pitch) == 0x00003C, "Member 'DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateRubberRotation::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateRubberRotation, CallFunc_BreakRotator_Yaw) == 0x000040, "Member 'DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateRubberRotation::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateRubberRotation, CallFunc_MakeRotator_ReturnValue) == 0x000048, "Member 'DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateRubberRotation::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateRubberRotation, CallFunc_MakeRotator_Pitch_ImplicitCast) == 0x000060, "Member 'DodgeChellenger__1__Skeleton_AnimBlueprint_C_CalculateRubberRotation::CallFunc_MakeRotator_Pitch_ImplicitCast' has a wrong offset!");

// Function DodgeChellenger__1__Skeleton_AnimBlueprint.DodgeChellenger__1__Skeleton_AnimBlueprint_C.ExecuteUbergraph_DodgeChellenger__1__Skeleton_AnimBlueprint
// 0x0018 (0x0018 - 0x0000)
struct DodgeChellenger__1__Skeleton_AnimBlueprint_C_ExecuteUbergraph_DodgeChellenger__1__Skeleton_AnimBlueprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetOwningComponent_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_ExecuteUbergraph_DodgeChellenger__1__Skeleton_AnimBlueprint) == 0x000008, "Wrong alignment on DodgeChellenger__1__Skeleton_AnimBlueprint_C_ExecuteUbergraph_DodgeChellenger__1__Skeleton_AnimBlueprint");
static_assert(sizeof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_ExecuteUbergraph_DodgeChellenger__1__Skeleton_AnimBlueprint) == 0x000018, "Wrong size on DodgeChellenger__1__Skeleton_AnimBlueprint_C_ExecuteUbergraph_DodgeChellenger__1__Skeleton_AnimBlueprint");
static_assert(offsetof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_ExecuteUbergraph_DodgeChellenger__1__Skeleton_AnimBlueprint, EntryPoint) == 0x000000, "Member 'DodgeChellenger__1__Skeleton_AnimBlueprint_C_ExecuteUbergraph_DodgeChellenger__1__Skeleton_AnimBlueprint::EntryPoint' has a wrong offset!");
static_assert(offsetof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_ExecuteUbergraph_DodgeChellenger__1__Skeleton_AnimBlueprint, CallFunc_GetOwningComponent_ReturnValue) == 0x000008, "Member 'DodgeChellenger__1__Skeleton_AnimBlueprint_C_ExecuteUbergraph_DodgeChellenger__1__Skeleton_AnimBlueprint::CallFunc_GetOwningComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_ExecuteUbergraph_DodgeChellenger__1__Skeleton_AnimBlueprint, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'DodgeChellenger__1__Skeleton_AnimBlueprint_C_ExecuteUbergraph_DodgeChellenger__1__Skeleton_AnimBlueprint::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_ExecuteUbergraph_DodgeChellenger__1__Skeleton_AnimBlueprint, K2Node_Event_DeltaTimeX) == 0x000014, "Member 'DodgeChellenger__1__Skeleton_AnimBlueprint_C_ExecuteUbergraph_DodgeChellenger__1__Skeleton_AnimBlueprint::K2Node_Event_DeltaTimeX' has a wrong offset!");

// Function DodgeChellenger__1__Skeleton_AnimBlueprint.DodgeChellenger__1__Skeleton_AnimBlueprint_C.setSteering
// 0x0010 (0x0010 - 0x0000)
struct DodgeChellenger__1__Skeleton_AnimBlueprint_C_SetSteering final
{
public:
	double                                        Steering;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NewParam;                                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_SetSteering) == 0x000008, "Wrong alignment on DodgeChellenger__1__Skeleton_AnimBlueprint_C_SetSteering");
static_assert(sizeof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_SetSteering) == 0x000010, "Wrong size on DodgeChellenger__1__Skeleton_AnimBlueprint_C_SetSteering");
static_assert(offsetof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_SetSteering, Steering) == 0x000000, "Member 'DodgeChellenger__1__Skeleton_AnimBlueprint_C_SetSteering::Steering' has a wrong offset!");
static_assert(offsetof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_SetSteering, NewParam) == 0x000008, "Member 'DodgeChellenger__1__Skeleton_AnimBlueprint_C_SetSteering::NewParam' has a wrong offset!");

// Function DodgeChellenger__1__Skeleton_AnimBlueprint.DodgeChellenger__1__Skeleton_AnimBlueprint_C.Wheel_DeltaZ
// 0x0068 (0x0068 - 0x0000)
struct DodgeChellenger__1__Skeleton_AnimBlueprint_C_Wheel_DeltaZ final
{
public:
	struct FVector                                WheelActualPosition;                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                WheelBasePosition;                                 // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DeltaZ;                                            // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_Wheel_DeltaZ) == 0x000008, "Wrong alignment on DodgeChellenger__1__Skeleton_AnimBlueprint_C_Wheel_DeltaZ");
static_assert(sizeof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_Wheel_DeltaZ) == 0x000068, "Wrong size on DodgeChellenger__1__Skeleton_AnimBlueprint_C_Wheel_DeltaZ");
static_assert(offsetof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_Wheel_DeltaZ, WheelActualPosition) == 0x000000, "Member 'DodgeChellenger__1__Skeleton_AnimBlueprint_C_Wheel_DeltaZ::WheelActualPosition' has a wrong offset!");
static_assert(offsetof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_Wheel_DeltaZ, WheelBasePosition) == 0x000018, "Member 'DodgeChellenger__1__Skeleton_AnimBlueprint_C_Wheel_DeltaZ::WheelBasePosition' has a wrong offset!");
static_assert(offsetof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_Wheel_DeltaZ, DeltaZ) == 0x000030, "Member 'DodgeChellenger__1__Skeleton_AnimBlueprint_C_Wheel_DeltaZ::DeltaZ' has a wrong offset!");
static_assert(offsetof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_Wheel_DeltaZ, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000038, "Member 'DodgeChellenger__1__Skeleton_AnimBlueprint_C_Wheel_DeltaZ::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_Wheel_DeltaZ, CallFunc_BreakVector_X) == 0x000050, "Member 'DodgeChellenger__1__Skeleton_AnimBlueprint_C_Wheel_DeltaZ::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_Wheel_DeltaZ, CallFunc_BreakVector_Y) == 0x000058, "Member 'DodgeChellenger__1__Skeleton_AnimBlueprint_C_Wheel_DeltaZ::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(DodgeChellenger__1__Skeleton_AnimBlueprint_C_Wheel_DeltaZ, CallFunc_BreakVector_Z) == 0x000060, "Member 'DodgeChellenger__1__Skeleton_AnimBlueprint_C_Wheel_DeltaZ::CallFunc_BreakVector_Z' has a wrong offset!");

}

