#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DodgeChellenger__1__Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FGearPlugin_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass DodgeChellenger__1__Skeleton_AnimBlueprint.DodgeChellenger__1__Skeleton_AnimBlueprint_C
// 0x0980 (0x0CE0 - 0x0360)
class UDodgeChellenger__1__Skeleton_AnimBlueprint_C final : public UFGearAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0368(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0370(0x0008)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0378(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x03A0(0x00E0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x0480(0x0048)()
	struct FAnimNode_MeshSpaceRefPose             AnimGraphNode_MeshRefPose;                         // 0x04C8(0x0010)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x04D8(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x04F8(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x0620(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0748(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0870(0x0128)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0998(0x0048)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x09E0(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0A00(0x0108)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0B08(0x0028)()
	class USkeletalMeshComponent*                 DodgeMesh;                                         // 0x0B30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                L_F_Wheel;                                         // 0x0B38(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                R_F_Wheel;                                         // 0x0B50(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                L_B_Wheel;                                         // 0x0B68(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                R_B_Wheel;                                         // 0x0B80(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               L_F_Wheel_rot;                                     // 0x0B98(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               R_F_Wheel_rot;                                     // 0x0BB0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BC8[0x8];                                      // 0x0BC8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             NewVar;                                            // 0x0BD0(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Back_Hodovaya_Translation;                         // 0x0C30(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Back_Hodovaya_Rotation;                            // 0x0C48(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                L_B_SuspentionDelta;                               // 0x0C60(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                R_B_SuspentionDelta;                               // 0x0C78(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                R_F_WheelSuspension_2_Delta;                       // 0x0C90(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                L_F_WheelSuspension_2_Delta;                       // 0x0CA8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WheelSteering;                                     // 0x0CC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               NewRubber_rot;                                     // 0x0CC8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void BlueprintBeginPlay();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void CalculateBackHodovaia(const struct FVector& LeftWheel, const struct FVector& RightWheel, struct FVector* Translation, double* Angle);
	void CalculateRubberRotation(double Steering, const struct FRotator& RubberBasePos, struct FRotator* NewRotation);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_DodgeChellenger__1__Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_2E7B45B945889C3ED0E7EC9422453C61();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_DodgeChellenger__1__Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_8241F434490F4EF8852205B22167E081();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_DodgeChellenger__1__Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_91A5B74B4F028535B5168DBABB10A311();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_DodgeChellenger__1__Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_C722080D4FFA23F62965C096B58F1F09();
	void ExecuteUbergraph_DodgeChellenger__1__Skeleton_AnimBlueprint(int32 EntryPoint);
	void SetSteering(double Steering, double* NewParam);
	void Wheel_DeltaZ(const struct FVector& WheelActualPosition, const struct FVector& WheelBasePosition, double* DeltaZ);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DodgeChellenger__1__Skeleton_AnimBlueprint_C">();
	}
	static class UDodgeChellenger__1__Skeleton_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDodgeChellenger__1__Skeleton_AnimBlueprint_C>();
	}
};
static_assert(alignof(UDodgeChellenger__1__Skeleton_AnimBlueprint_C) == 0x000010, "Wrong alignment on UDodgeChellenger__1__Skeleton_AnimBlueprint_C");
static_assert(sizeof(UDodgeChellenger__1__Skeleton_AnimBlueprint_C) == 0x000CE0, "Wrong size on UDodgeChellenger__1__Skeleton_AnimBlueprint_C");
static_assert(offsetof(UDodgeChellenger__1__Skeleton_AnimBlueprint_C, UberGraphFrame) == 0x000360, "Member 'UDodgeChellenger__1__Skeleton_AnimBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDodgeChellenger__1__Skeleton_AnimBlueprint_C, AnimBlueprintExtension_PropertyAccess) == 0x000368, "Member 'UDodgeChellenger__1__Skeleton_AnimBlueprint_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UDodgeChellenger__1__Skeleton_AnimBlueprint_C, AnimBlueprintExtension_Base) == 0x000370, "Member 'UDodgeChellenger__1__Skeleton_AnimBlueprint_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UDodgeChellenger__1__Skeleton_AnimBlueprint_C, AnimGraphNode_UseCachedPose_1) == 0x000378, "Member 'UDodgeChellenger__1__Skeleton_AnimBlueprint_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UDodgeChellenger__1__Skeleton_AnimBlueprint_C, AnimGraphNode_LayeredBoneBlend) == 0x0003A0, "Member 'UDodgeChellenger__1__Skeleton_AnimBlueprint_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UDodgeChellenger__1__Skeleton_AnimBlueprint_C, AnimGraphNode_Slot_1) == 0x000480, "Member 'UDodgeChellenger__1__Skeleton_AnimBlueprint_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UDodgeChellenger__1__Skeleton_AnimBlueprint_C, AnimGraphNode_MeshRefPose) == 0x0004C8, "Member 'UDodgeChellenger__1__Skeleton_AnimBlueprint_C::AnimGraphNode_MeshRefPose' has a wrong offset!");
static_assert(offsetof(UDodgeChellenger__1__Skeleton_AnimBlueprint_C, AnimGraphNode_Root) == 0x0004D8, "Member 'UDodgeChellenger__1__Skeleton_AnimBlueprint_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UDodgeChellenger__1__Skeleton_AnimBlueprint_C, AnimGraphNode_ModifyBone_3) == 0x0004F8, "Member 'UDodgeChellenger__1__Skeleton_AnimBlueprint_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(UDodgeChellenger__1__Skeleton_AnimBlueprint_C, AnimGraphNode_ModifyBone_2) == 0x000620, "Member 'UDodgeChellenger__1__Skeleton_AnimBlueprint_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UDodgeChellenger__1__Skeleton_AnimBlueprint_C, AnimGraphNode_ModifyBone_1) == 0x000748, "Member 'UDodgeChellenger__1__Skeleton_AnimBlueprint_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UDodgeChellenger__1__Skeleton_AnimBlueprint_C, AnimGraphNode_ModifyBone) == 0x000870, "Member 'UDodgeChellenger__1__Skeleton_AnimBlueprint_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UDodgeChellenger__1__Skeleton_AnimBlueprint_C, AnimGraphNode_Slot) == 0x000998, "Member 'UDodgeChellenger__1__Skeleton_AnimBlueprint_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UDodgeChellenger__1__Skeleton_AnimBlueprint_C, AnimGraphNode_ComponentToLocalSpace) == 0x0009E0, "Member 'UDodgeChellenger__1__Skeleton_AnimBlueprint_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UDodgeChellenger__1__Skeleton_AnimBlueprint_C, AnimGraphNode_SaveCachedPose) == 0x000A00, "Member 'UDodgeChellenger__1__Skeleton_AnimBlueprint_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UDodgeChellenger__1__Skeleton_AnimBlueprint_C, AnimGraphNode_UseCachedPose) == 0x000B08, "Member 'UDodgeChellenger__1__Skeleton_AnimBlueprint_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UDodgeChellenger__1__Skeleton_AnimBlueprint_C, DodgeMesh) == 0x000B30, "Member 'UDodgeChellenger__1__Skeleton_AnimBlueprint_C::DodgeMesh' has a wrong offset!");
static_assert(offsetof(UDodgeChellenger__1__Skeleton_AnimBlueprint_C, L_F_Wheel) == 0x000B38, "Member 'UDodgeChellenger__1__Skeleton_AnimBlueprint_C::L_F_Wheel' has a wrong offset!");
static_assert(offsetof(UDodgeChellenger__1__Skeleton_AnimBlueprint_C, R_F_Wheel) == 0x000B50, "Member 'UDodgeChellenger__1__Skeleton_AnimBlueprint_C::R_F_Wheel' has a wrong offset!");
static_assert(offsetof(UDodgeChellenger__1__Skeleton_AnimBlueprint_C, L_B_Wheel) == 0x000B68, "Member 'UDodgeChellenger__1__Skeleton_AnimBlueprint_C::L_B_Wheel' has a wrong offset!");
static_assert(offsetof(UDodgeChellenger__1__Skeleton_AnimBlueprint_C, R_B_Wheel) == 0x000B80, "Member 'UDodgeChellenger__1__Skeleton_AnimBlueprint_C::R_B_Wheel' has a wrong offset!");
static_assert(offsetof(UDodgeChellenger__1__Skeleton_AnimBlueprint_C, L_F_Wheel_rot) == 0x000B98, "Member 'UDodgeChellenger__1__Skeleton_AnimBlueprint_C::L_F_Wheel_rot' has a wrong offset!");
static_assert(offsetof(UDodgeChellenger__1__Skeleton_AnimBlueprint_C, R_F_Wheel_rot) == 0x000BB0, "Member 'UDodgeChellenger__1__Skeleton_AnimBlueprint_C::R_F_Wheel_rot' has a wrong offset!");
static_assert(offsetof(UDodgeChellenger__1__Skeleton_AnimBlueprint_C, NewVar) == 0x000BD0, "Member 'UDodgeChellenger__1__Skeleton_AnimBlueprint_C::NewVar' has a wrong offset!");
static_assert(offsetof(UDodgeChellenger__1__Skeleton_AnimBlueprint_C, Back_Hodovaya_Translation) == 0x000C30, "Member 'UDodgeChellenger__1__Skeleton_AnimBlueprint_C::Back_Hodovaya_Translation' has a wrong offset!");
static_assert(offsetof(UDodgeChellenger__1__Skeleton_AnimBlueprint_C, Back_Hodovaya_Rotation) == 0x000C48, "Member 'UDodgeChellenger__1__Skeleton_AnimBlueprint_C::Back_Hodovaya_Rotation' has a wrong offset!");
static_assert(offsetof(UDodgeChellenger__1__Skeleton_AnimBlueprint_C, L_B_SuspentionDelta) == 0x000C60, "Member 'UDodgeChellenger__1__Skeleton_AnimBlueprint_C::L_B_SuspentionDelta' has a wrong offset!");
static_assert(offsetof(UDodgeChellenger__1__Skeleton_AnimBlueprint_C, R_B_SuspentionDelta) == 0x000C78, "Member 'UDodgeChellenger__1__Skeleton_AnimBlueprint_C::R_B_SuspentionDelta' has a wrong offset!");
static_assert(offsetof(UDodgeChellenger__1__Skeleton_AnimBlueprint_C, R_F_WheelSuspension_2_Delta) == 0x000C90, "Member 'UDodgeChellenger__1__Skeleton_AnimBlueprint_C::R_F_WheelSuspension_2_Delta' has a wrong offset!");
static_assert(offsetof(UDodgeChellenger__1__Skeleton_AnimBlueprint_C, L_F_WheelSuspension_2_Delta) == 0x000CA8, "Member 'UDodgeChellenger__1__Skeleton_AnimBlueprint_C::L_F_WheelSuspension_2_Delta' has a wrong offset!");
static_assert(offsetof(UDodgeChellenger__1__Skeleton_AnimBlueprint_C, WheelSteering) == 0x000CC0, "Member 'UDodgeChellenger__1__Skeleton_AnimBlueprint_C::WheelSteering' has a wrong offset!");
static_assert(offsetof(UDodgeChellenger__1__Skeleton_AnimBlueprint_C, NewRubber_rot) == 0x000CC8, "Member 'UDodgeChellenger__1__Skeleton_AnimBlueprint_C::NewRubber_rot' has a wrong offset!");

}

