#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DoubleDoor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function DoubleDoor.DoubleDoor_C.AddBlocker
// 0x0008 (0x0008 - 0x0000)
struct DoubleDoor_C_AddBlocker final
{
public:
	class AElectricityBlocker_C*                  Blocker;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DoubleDoor_C_AddBlocker) == 0x000008, "Wrong alignment on DoubleDoor_C_AddBlocker");
static_assert(sizeof(DoubleDoor_C_AddBlocker) == 0x000008, "Wrong size on DoubleDoor_C_AddBlocker");
static_assert(offsetof(DoubleDoor_C_AddBlocker, Blocker) == 0x000000, "Member 'DoubleDoor_C_AddBlocker::Blocker' has a wrong offset!");

// Function DoubleDoor.DoubleDoor_C.ExecuteUbergraph_DoubleDoor
// 0x01C8 (0x01C8 - 0x0000)
struct DoubleDoor_C_ExecuteUbergraph_DoubleDoor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFMODAudioComponent*                    CallFunc_FMODPlayEventAttached_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AElectricityBlocker_C*                  K2Node_Event_Blocker;                              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AElectricityBlocker_C*                  K2Node_Event_Blocker_1;                            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_Player_2;                             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IElectricityBlockerListener_C> CallFunc_AddListener_Listener_CastInput;           // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFMODAudioComponent*                    CallFunc_FMODPlayEventAttached_ReturnValue_1;      // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_Zero_ReturnValue;                  // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_Event_Player_1;                             // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x00A0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_Player;                               // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GeneralInterface_C> K2Node_DynamicCast_AsBPI_General_Interface;        // 0x0198(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_GeneralInterface_C> K2Node_DynamicCast_AsBPI_General_Interface_1;      // 0x01B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DoubleDoor_C_ExecuteUbergraph_DoubleDoor) == 0x000008, "Wrong alignment on DoubleDoor_C_ExecuteUbergraph_DoubleDoor");
static_assert(sizeof(DoubleDoor_C_ExecuteUbergraph_DoubleDoor) == 0x0001C8, "Wrong size on DoubleDoor_C_ExecuteUbergraph_DoubleDoor");
static_assert(offsetof(DoubleDoor_C_ExecuteUbergraph_DoubleDoor, EntryPoint) == 0x000000, "Member 'DoubleDoor_C_ExecuteUbergraph_DoubleDoor::EntryPoint' has a wrong offset!");
static_assert(offsetof(DoubleDoor_C_ExecuteUbergraph_DoubleDoor, CallFunc_FMODPlayEventAttached_ReturnValue) == 0x000008, "Member 'DoubleDoor_C_ExecuteUbergraph_DoubleDoor::CallFunc_FMODPlayEventAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoubleDoor_C_ExecuteUbergraph_DoubleDoor, K2Node_Event_Blocker) == 0x000010, "Member 'DoubleDoor_C_ExecuteUbergraph_DoubleDoor::K2Node_Event_Blocker' has a wrong offset!");
static_assert(offsetof(DoubleDoor_C_ExecuteUbergraph_DoubleDoor, K2Node_Event_Blocker_1) == 0x000018, "Member 'DoubleDoor_C_ExecuteUbergraph_DoubleDoor::K2Node_Event_Blocker_1' has a wrong offset!");
static_assert(offsetof(DoubleDoor_C_ExecuteUbergraph_DoubleDoor, K2Node_Event_Player_2) == 0x000020, "Member 'DoubleDoor_C_ExecuteUbergraph_DoubleDoor::K2Node_Event_Player_2' has a wrong offset!");
static_assert(offsetof(DoubleDoor_C_ExecuteUbergraph_DoubleDoor, CallFunc_AddListener_Listener_CastInput) == 0x000028, "Member 'DoubleDoor_C_ExecuteUbergraph_DoubleDoor::CallFunc_AddListener_Listener_CastInput' has a wrong offset!");
static_assert(offsetof(DoubleDoor_C_ExecuteUbergraph_DoubleDoor, CallFunc_FMODPlayEventAttached_ReturnValue_1) == 0x000038, "Member 'DoubleDoor_C_ExecuteUbergraph_DoubleDoor::CallFunc_FMODPlayEventAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DoubleDoor_C_ExecuteUbergraph_DoubleDoor, CallFunc_Vector_Zero_ReturnValue) == 0x000040, "Member 'DoubleDoor_C_ExecuteUbergraph_DoubleDoor::CallFunc_Vector_Zero_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoubleDoor_C_ExecuteUbergraph_DoubleDoor, Temp_real_Variable) == 0x000058, "Member 'DoubleDoor_C_ExecuteUbergraph_DoubleDoor::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(DoubleDoor_C_ExecuteUbergraph_DoubleDoor, K2Node_Event_Player_1) == 0x000060, "Member 'DoubleDoor_C_ExecuteUbergraph_DoubleDoor::K2Node_Event_Player_1' has a wrong offset!");
static_assert(offsetof(DoubleDoor_C_ExecuteUbergraph_DoubleDoor, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'DoubleDoor_C_ExecuteUbergraph_DoubleDoor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoubleDoor_C_ExecuteUbergraph_DoubleDoor, CallFunc_Vector_Distance_ReturnValue) == 0x000070, "Member 'DoubleDoor_C_ExecuteUbergraph_DoubleDoor::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoubleDoor_C_ExecuteUbergraph_DoubleDoor, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000078, "Member 'DoubleDoor_C_ExecuteUbergraph_DoubleDoor::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoubleDoor_C_ExecuteUbergraph_DoubleDoor, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000080, "Member 'DoubleDoor_C_ExecuteUbergraph_DoubleDoor::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoubleDoor_C_ExecuteUbergraph_DoubleDoor, CallFunc_MakeVector_ReturnValue) == 0x000088, "Member 'DoubleDoor_C_ExecuteUbergraph_DoubleDoor::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoubleDoor_C_ExecuteUbergraph_DoubleDoor, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x0000A0, "Member 'DoubleDoor_C_ExecuteUbergraph_DoubleDoor::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(DoubleDoor_C_ExecuteUbergraph_DoubleDoor, K2Node_Event_DeltaSeconds) == 0x000188, "Member 'DoubleDoor_C_ExecuteUbergraph_DoubleDoor::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(DoubleDoor_C_ExecuteUbergraph_DoubleDoor, K2Node_Event_Player) == 0x000190, "Member 'DoubleDoor_C_ExecuteUbergraph_DoubleDoor::K2Node_Event_Player' has a wrong offset!");
static_assert(offsetof(DoubleDoor_C_ExecuteUbergraph_DoubleDoor, K2Node_DynamicCast_AsBPI_General_Interface) == 0x000198, "Member 'DoubleDoor_C_ExecuteUbergraph_DoubleDoor::K2Node_DynamicCast_AsBPI_General_Interface' has a wrong offset!");
static_assert(offsetof(DoubleDoor_C_ExecuteUbergraph_DoubleDoor, K2Node_DynamicCast_bSuccess) == 0x0001A8, "Member 'DoubleDoor_C_ExecuteUbergraph_DoubleDoor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(DoubleDoor_C_ExecuteUbergraph_DoubleDoor, K2Node_DynamicCast_AsBPI_General_Interface_1) == 0x0001B0, "Member 'DoubleDoor_C_ExecuteUbergraph_DoubleDoor::K2Node_DynamicCast_AsBPI_General_Interface_1' has a wrong offset!");
static_assert(offsetof(DoubleDoor_C_ExecuteUbergraph_DoubleDoor, K2Node_DynamicCast_bSuccess_1) == 0x0001C0, "Member 'DoubleDoor_C_ExecuteUbergraph_DoubleDoor::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function DoubleDoor.DoubleDoor_C.GeneratorEnabledClientSide
// 0x0008 (0x0008 - 0x0000)
struct DoubleDoor_C_GeneratorEnabledClientSide final
{
public:
	class ASurvivalPlayer_C*                      Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DoubleDoor_C_GeneratorEnabledClientSide) == 0x000008, "Wrong alignment on DoubleDoor_C_GeneratorEnabledClientSide");
static_assert(sizeof(DoubleDoor_C_GeneratorEnabledClientSide) == 0x000008, "Wrong size on DoubleDoor_C_GeneratorEnabledClientSide");
static_assert(offsetof(DoubleDoor_C_GeneratorEnabledClientSide, Player) == 0x000000, "Member 'DoubleDoor_C_GeneratorEnabledClientSide::Player' has a wrong offset!");

// Function DoubleDoor.DoubleDoor_C.OnBreakBlocker
// 0x0008 (0x0008 - 0x0000)
struct DoubleDoor_C_OnBreakBlocker final
{
public:
	class AElectricityBlocker_C*                  Blocker;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DoubleDoor_C_OnBreakBlocker) == 0x000008, "Wrong alignment on DoubleDoor_C_OnBreakBlocker");
static_assert(sizeof(DoubleDoor_C_OnBreakBlocker) == 0x000008, "Wrong size on DoubleDoor_C_OnBreakBlocker");
static_assert(offsetof(DoubleDoor_C_OnBreakBlocker, Blocker) == 0x000000, "Member 'DoubleDoor_C_OnBreakBlocker::Blocker' has a wrong offset!");

// Function DoubleDoor.DoubleDoor_C.OnInteract
// 0x0008 (0x0008 - 0x0000)
struct DoubleDoor_C_OnInteract final
{
public:
	class APawn*                                  Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DoubleDoor_C_OnInteract) == 0x000008, "Wrong alignment on DoubleDoor_C_OnInteract");
static_assert(sizeof(DoubleDoor_C_OnInteract) == 0x000008, "Wrong size on DoubleDoor_C_OnInteract");
static_assert(offsetof(DoubleDoor_C_OnInteract, Player) == 0x000000, "Member 'DoubleDoor_C_OnInteract::Player' has a wrong offset!");

// Function DoubleDoor.DoubleDoor_C.OnLocalInteract
// 0x0008 (0x0008 - 0x0000)
struct DoubleDoor_C_OnLocalInteract final
{
public:
	class APawn*                                  Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DoubleDoor_C_OnLocalInteract) == 0x000008, "Wrong alignment on DoubleDoor_C_OnLocalInteract");
static_assert(sizeof(DoubleDoor_C_OnLocalInteract) == 0x000008, "Wrong size on DoubleDoor_C_OnLocalInteract");
static_assert(offsetof(DoubleDoor_C_OnLocalInteract, Player) == 0x000000, "Member 'DoubleDoor_C_OnLocalInteract::Player' has a wrong offset!");

// Function DoubleDoor.DoubleDoor_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct DoubleDoor_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DoubleDoor_C_ReceiveTick) == 0x000004, "Wrong alignment on DoubleDoor_C_ReceiveTick");
static_assert(sizeof(DoubleDoor_C_ReceiveTick) == 0x000004, "Wrong size on DoubleDoor_C_ReceiveTick");
static_assert(offsetof(DoubleDoor_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'DoubleDoor_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

