#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DoubleDoor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SimpleDoor_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DoubleDoor.DoubleDoor_C
// 0x0040 (0x0458 - 0x0418)
class ADoubleDoor_C final : public ASimpleDoor_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_DoubleDoor_C;                       // 0x0418(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box_0;                                             // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube4;                                             // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DoorContainer1;                                    // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          IsBlocked;                                         // 0x0438(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasTrigger;                                        // 0x0439(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43A[0x6];                                      // 0x043A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Trigger;                                           // 0x0440(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class AElectricityBlocker_C*                  DoorBlocker;                                       // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)

public:
	void AddBlocker(class AElectricityBlocker_C* Blocker);
	void ExecuteUbergraph_DoubleDoor(int32 EntryPoint);
	void GeneratorEnabledClientSide(class ASurvivalPlayer_C* Player);
	void OnBreakBlocker(class AElectricityBlocker_C* Blocker);
	void OnInteract(class APawn* Player);
	void OnLocalInteract(class APawn* Player);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void UnlockDoubleDoorClientSide();
	void UnlockDoubleDoorServerSide();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DoubleDoor_C">();
	}
	static class ADoubleDoor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADoubleDoor_C>();
	}
};
static_assert(alignof(ADoubleDoor_C) == 0x000008, "Wrong alignment on ADoubleDoor_C");
static_assert(sizeof(ADoubleDoor_C) == 0x000458, "Wrong size on ADoubleDoor_C");
static_assert(offsetof(ADoubleDoor_C, UberGraphFrame_DoubleDoor_C) == 0x000418, "Member 'ADoubleDoor_C::UberGraphFrame_DoubleDoor_C' has a wrong offset!");
static_assert(offsetof(ADoubleDoor_C, Box_0) == 0x000420, "Member 'ADoubleDoor_C::Box_0' has a wrong offset!");
static_assert(offsetof(ADoubleDoor_C, Cube4) == 0x000428, "Member 'ADoubleDoor_C::Cube4' has a wrong offset!");
static_assert(offsetof(ADoubleDoor_C, DoorContainer1) == 0x000430, "Member 'ADoubleDoor_C::DoorContainer1' has a wrong offset!");
static_assert(offsetof(ADoubleDoor_C, IsBlocked) == 0x000438, "Member 'ADoubleDoor_C::IsBlocked' has a wrong offset!");
static_assert(offsetof(ADoubleDoor_C, HasTrigger) == 0x000439, "Member 'ADoubleDoor_C::HasTrigger' has a wrong offset!");
static_assert(offsetof(ADoubleDoor_C, Trigger) == 0x000440, "Member 'ADoubleDoor_C::Trigger' has a wrong offset!");
static_assert(offsetof(ADoubleDoor_C, DoorBlocker) == 0x000450, "Member 'ADoubleDoor_C::DoorBlocker' has a wrong offset!");

}

