#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DropItemAmountSelector

#include "Basic.hpp"

#include "E_ShopContainer_structs.hpp"
#include "FMODStudio_structs.hpp"
#include "JSItemType_structs.hpp"
#include "FItemInfo_structs.hpp"
#include "Engine_structs.hpp"
#include "AttachmentInfo_structs.hpp"


namespace SDK::Params
{

// Function DropItemAmountSelector.DropItemAmountSelector_C.BndEvt__DropItemAmountSelector_Slider_539_K2Node_ComponentBoundEvent_18_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct DropItemAmountSelector_C_BndEvt__DropItemAmountSelector_Slider_539_K2Node_ComponentBoundEvent_18_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DropItemAmountSelector_C_BndEvt__DropItemAmountSelector_Slider_539_K2Node_ComponentBoundEvent_18_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on DropItemAmountSelector_C_BndEvt__DropItemAmountSelector_Slider_539_K2Node_ComponentBoundEvent_18_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(DropItemAmountSelector_C_BndEvt__DropItemAmountSelector_Slider_539_K2Node_ComponentBoundEvent_18_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on DropItemAmountSelector_C_BndEvt__DropItemAmountSelector_Slider_539_K2Node_ComponentBoundEvent_18_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(DropItemAmountSelector_C_BndEvt__DropItemAmountSelector_Slider_539_K2Node_ComponentBoundEvent_18_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'DropItemAmountSelector_C_BndEvt__DropItemAmountSelector_Slider_539_K2Node_ComponentBoundEvent_18_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function DropItemAmountSelector.DropItemAmountSelector_C.BndEvt__DropItemAmountSelector_Slider_Main_K2Node_ComponentBoundEvent_6_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct DropItemAmountSelector_C_BndEvt__DropItemAmountSelector_Slider_Main_K2Node_ComponentBoundEvent_6_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DropItemAmountSelector_C_BndEvt__DropItemAmountSelector_Slider_Main_K2Node_ComponentBoundEvent_6_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on DropItemAmountSelector_C_BndEvt__DropItemAmountSelector_Slider_Main_K2Node_ComponentBoundEvent_6_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(DropItemAmountSelector_C_BndEvt__DropItemAmountSelector_Slider_Main_K2Node_ComponentBoundEvent_6_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on DropItemAmountSelector_C_BndEvt__DropItemAmountSelector_Slider_Main_K2Node_ComponentBoundEvent_6_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(DropItemAmountSelector_C_BndEvt__DropItemAmountSelector_Slider_Main_K2Node_ComponentBoundEvent_6_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'DropItemAmountSelector_C_BndEvt__DropItemAmountSelector_Slider_Main_K2Node_ComponentBoundEvent_6_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function DropItemAmountSelector.DropItemAmountSelector_C.CalculatePrice
// 0x0550 (0x0550 - 0x0000)
struct DropItemAmountSelector_C_CalculatePrice final
{
public:
	bool                                          UseSellPrice;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ResultPrice;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Price;                                             // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBPC_PlayerStatsComponent_C*            BPC_PlayerStats;                                   // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJSItemType                                   Temp_byte_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_4;                              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_5;                              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_6;                              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_7;                              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_8;                              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_9;                              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC;                  // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      CallFunc_GetPlayerRef_SurvivalPlayer;              // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFItemInfo                             CallFunc_GetDataTableRowFromName_OutRow;           // 0x00B0(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D1[0x3];                                      // 0x02D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAttachmentInfo                        CallFunc_Array_Get_Item;                           // 0x02D4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x02F0(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJSItemType                                   Temp_byte_Variable_1;                              // 0x0511(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_512[0x6];                                      // 0x0512(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x0518(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default_1;                           // 0x0528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0538(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0540(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0548(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DropItemAmountSelector_C_CalculatePrice) == 0x000008, "Wrong alignment on DropItemAmountSelector_C_CalculatePrice");
static_assert(sizeof(DropItemAmountSelector_C_CalculatePrice) == 0x000550, "Wrong size on DropItemAmountSelector_C_CalculatePrice");
static_assert(offsetof(DropItemAmountSelector_C_CalculatePrice, UseSellPrice) == 0x000000, "Member 'DropItemAmountSelector_C_CalculatePrice::UseSellPrice' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_CalculatePrice, ResultPrice) == 0x000004, "Member 'DropItemAmountSelector_C_CalculatePrice::ResultPrice' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_CalculatePrice, Price) == 0x000008, "Member 'DropItemAmountSelector_C_CalculatePrice::Price' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_CalculatePrice, BPC_PlayerStats) == 0x000010, "Member 'DropItemAmountSelector_C_CalculatePrice::BPC_PlayerStats' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_CalculatePrice, Temp_real_Variable) == 0x000018, "Member 'DropItemAmountSelector_C_CalculatePrice::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_CalculatePrice, Temp_real_Variable_1) == 0x000020, "Member 'DropItemAmountSelector_C_CalculatePrice::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_CalculatePrice, Temp_real_Variable_2) == 0x000028, "Member 'DropItemAmountSelector_C_CalculatePrice::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_CalculatePrice, Temp_real_Variable_3) == 0x000030, "Member 'DropItemAmountSelector_C_CalculatePrice::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_CalculatePrice, Temp_byte_Variable) == 0x000038, "Member 'DropItemAmountSelector_C_CalculatePrice::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_CalculatePrice, Temp_real_Variable_4) == 0x000040, "Member 'DropItemAmountSelector_C_CalculatePrice::Temp_real_Variable_4' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_CalculatePrice, Temp_real_Variable_5) == 0x000048, "Member 'DropItemAmountSelector_C_CalculatePrice::Temp_real_Variable_5' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_CalculatePrice, Temp_real_Variable_6) == 0x000050, "Member 'DropItemAmountSelector_C_CalculatePrice::Temp_real_Variable_6' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_CalculatePrice, Temp_real_Variable_7) == 0x000058, "Member 'DropItemAmountSelector_C_CalculatePrice::Temp_real_Variable_7' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_CalculatePrice, Temp_real_Variable_8) == 0x000060, "Member 'DropItemAmountSelector_C_CalculatePrice::Temp_real_Variable_8' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_CalculatePrice, Temp_int_Array_Index_Variable) == 0x000068, "Member 'DropItemAmountSelector_C_CalculatePrice::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_CalculatePrice, Temp_int_Loop_Counter_Variable) == 0x00006C, "Member 'DropItemAmountSelector_C_CalculatePrice::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_CalculatePrice, CallFunc_Add_IntInt_ReturnValue) == 0x000070, "Member 'DropItemAmountSelector_C_CalculatePrice::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_CalculatePrice, Temp_real_Variable_9) == 0x000078, "Member 'DropItemAmountSelector_C_CalculatePrice::Temp_real_Variable_9' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_CalculatePrice, CallFunc_FTrunc_ReturnValue) == 0x000080, "Member 'DropItemAmountSelector_C_CalculatePrice::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_CalculatePrice, CallFunc_GetPlayerController_ReturnValue) == 0x000088, "Member 'DropItemAmountSelector_C_CalculatePrice::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_CalculatePrice, K2Node_DynamicCast_AsBPI_Surv_PC) == 0x000090, "Member 'DropItemAmountSelector_C_CalculatePrice::K2Node_DynamicCast_AsBPI_Surv_PC' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_CalculatePrice, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'DropItemAmountSelector_C_CalculatePrice::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_CalculatePrice, CallFunc_GetPlayerRef_SurvivalPlayer) == 0x0000A8, "Member 'DropItemAmountSelector_C_CalculatePrice::CallFunc_GetPlayerRef_SurvivalPlayer' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_CalculatePrice, CallFunc_GetDataTableRowFromName_OutRow) == 0x0000B0, "Member 'DropItemAmountSelector_C_CalculatePrice::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_CalculatePrice, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0002D0, "Member 'DropItemAmountSelector_C_CalculatePrice::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_CalculatePrice, CallFunc_Array_Get_Item) == 0x0002D4, "Member 'DropItemAmountSelector_C_CalculatePrice::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_CalculatePrice, CallFunc_Array_Length_ReturnValue) == 0x0002E4, "Member 'DropItemAmountSelector_C_CalculatePrice::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_CalculatePrice, CallFunc_Less_IntInt_ReturnValue) == 0x0002E8, "Member 'DropItemAmountSelector_C_CalculatePrice::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_CalculatePrice, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x0002F0, "Member 'DropItemAmountSelector_C_CalculatePrice::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_CalculatePrice, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000510, "Member 'DropItemAmountSelector_C_CalculatePrice::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_CalculatePrice, Temp_byte_Variable_1) == 0x000511, "Member 'DropItemAmountSelector_C_CalculatePrice::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_CalculatePrice, K2Node_Select_Default) == 0x000518, "Member 'DropItemAmountSelector_C_CalculatePrice::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_CalculatePrice, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000520, "Member 'DropItemAmountSelector_C_CalculatePrice::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_CalculatePrice, K2Node_Select_Default_1) == 0x000528, "Member 'DropItemAmountSelector_C_CalculatePrice::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_CalculatePrice, CallFunc_SelectFloat_ReturnValue) == 0x000530, "Member 'DropItemAmountSelector_C_CalculatePrice::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_CalculatePrice, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000538, "Member 'DropItemAmountSelector_C_CalculatePrice::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_CalculatePrice, CallFunc_SelectFloat_ReturnValue_1) == 0x000540, "Member 'DropItemAmountSelector_C_CalculatePrice::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_CalculatePrice, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000548, "Member 'DropItemAmountSelector_C_CalculatePrice::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");

// Function DropItemAmountSelector.DropItemAmountSelector_C.Change Count Of Split Item
// 0x00C0 (0x00C0 - 0x0000)
struct DropItemAmountSelector_C_Change_Count_Of_Split_Item final
{
public:
	bool                                          bIsNeedToIncrease;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
	int32                                         Temp_int_Variable_1;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0028(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue;           // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue_1;         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x0080(0x0018)()
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_InRange_FloatFloat_Value_ImplicitCast;    // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_InRange_FloatFloat_Value_ImplicitCast_1;  // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DropItemAmountSelector_C_Change_Count_Of_Split_Item) == 0x000008, "Wrong alignment on DropItemAmountSelector_C_Change_Count_Of_Split_Item");
static_assert(sizeof(DropItemAmountSelector_C_Change_Count_Of_Split_Item) == 0x0000C0, "Wrong size on DropItemAmountSelector_C_Change_Count_Of_Split_Item");
static_assert(offsetof(DropItemAmountSelector_C_Change_Count_Of_Split_Item, bIsNeedToIncrease) == 0x000000, "Member 'DropItemAmountSelector_C_Change_Count_Of_Split_Item::bIsNeedToIncrease' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_Change_Count_Of_Split_Item, Temp_int_Variable) == 0x000004, "Member 'DropItemAmountSelector_C_Change_Count_Of_Split_Item::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_Change_Count_Of_Split_Item, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'DropItemAmountSelector_C_Change_Count_Of_Split_Item::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_Change_Count_Of_Split_Item, Temp_int_Variable_1) == 0x000020, "Member 'DropItemAmountSelector_C_Change_Count_Of_Split_Item::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_Change_Count_Of_Split_Item, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000028, "Member 'DropItemAmountSelector_C_Change_Count_Of_Split_Item::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_Change_Count_Of_Split_Item, CallFunc_Greater_IntInt_ReturnValue) == 0x000040, "Member 'DropItemAmountSelector_C_Change_Count_Of_Split_Item::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_Change_Count_Of_Split_Item, CallFunc_InRange_FloatFloat_ReturnValue) == 0x000041, "Member 'DropItemAmountSelector_C_Change_Count_Of_Split_Item::CallFunc_InRange_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_Change_Count_Of_Split_Item, CallFunc_Subtract_IntInt_ReturnValue) == 0x000044, "Member 'DropItemAmountSelector_C_Change_Count_Of_Split_Item::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_Change_Count_Of_Split_Item, CallFunc_BooleanAND_ReturnValue) == 0x000048, "Member 'DropItemAmountSelector_C_Change_Count_Of_Split_Item::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_Change_Count_Of_Split_Item, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000050, "Member 'DropItemAmountSelector_C_Change_Count_Of_Split_Item::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_Change_Count_Of_Split_Item, CallFunc_InRange_FloatFloat_ReturnValue_1) == 0x000058, "Member 'DropItemAmountSelector_C_Change_Count_Of_Split_Item::CallFunc_InRange_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_Change_Count_Of_Split_Item, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000060, "Member 'DropItemAmountSelector_C_Change_Count_Of_Split_Item::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_Change_Count_Of_Split_Item, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000068, "Member 'DropItemAmountSelector_C_Change_Count_Of_Split_Item::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_Change_Count_Of_Split_Item, CallFunc_FClamp_ReturnValue) == 0x000070, "Member 'DropItemAmountSelector_C_Change_Count_Of_Split_Item::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_Change_Count_Of_Split_Item, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000078, "Member 'DropItemAmountSelector_C_Change_Count_Of_Split_Item::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_Change_Count_Of_Split_Item, CallFunc_Conv_IntToText_ReturnValue_2) == 0x000080, "Member 'DropItemAmountSelector_C_Change_Count_Of_Split_Item::CallFunc_Conv_IntToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_Change_Count_Of_Split_Item, CallFunc_PlayEvent2D_ReturnValue) == 0x000098, "Member 'DropItemAmountSelector_C_Change_Count_Of_Split_Item::CallFunc_PlayEvent2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_Change_Count_Of_Split_Item, CallFunc_Add_IntInt_ReturnValue) == 0x0000A0, "Member 'DropItemAmountSelector_C_Change_Count_Of_Split_Item::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_Change_Count_Of_Split_Item, CallFunc_InRange_FloatFloat_Value_ImplicitCast) == 0x0000A8, "Member 'DropItemAmountSelector_C_Change_Count_Of_Split_Item::CallFunc_InRange_FloatFloat_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_Change_Count_Of_Split_Item, CallFunc_InRange_FloatFloat_Value_ImplicitCast_1) == 0x0000B0, "Member 'DropItemAmountSelector_C_Change_Count_Of_Split_Item::CallFunc_InRange_FloatFloat_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_Change_Count_Of_Split_Item, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x0000B8, "Member 'DropItemAmountSelector_C_Change_Count_Of_Split_Item::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");

// Function DropItemAmountSelector.DropItemAmountSelector_C.DropItems
// 0x02E0 (0x02E0 - 0x0000)
struct DropItemAmountSelector_C_DropItems final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_GameHUD_C*                          K2Node_DynamicCast_AsBP_Game_HUD;                  // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UJSIContainer_C*                        K2Node_Select_Default;                             // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue_1;                     // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_GameHUD_C*                          K2Node_DynamicCast_AsBP_Game_HUD_1;                // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJSI_Slot_C*                            CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCount_Count;                           // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x007E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x007F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJSIContainer_C*                        K2Node_Select_Default_1;                           // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJSI_Slot_C*                            CallFunc_Array_Get_Item_1;                         // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCount_Count_1;                         // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MoveItemToContainer_Moved_;               // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_UpdateCount_Count;                        // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddNewInventoryItem_Added;                // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AddNewInventoryItem_SlotIndex;            // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFItemInfo                             CallFunc_AddNewInventoryItem_ItemInfo;             // 0x00B0(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	class UJSI_Slot_C*                            CallFunc_AddNewInventoryItem_SlotItemRef;          // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddNewInventoryItem_StackRemainder;       // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DropItemAmountSelector_C_DropItems) == 0x000008, "Wrong alignment on DropItemAmountSelector_C_DropItems");
static_assert(sizeof(DropItemAmountSelector_C_DropItems) == 0x0002E0, "Wrong size on DropItemAmountSelector_C_DropItems");
static_assert(offsetof(DropItemAmountSelector_C_DropItems, Count) == 0x000000, "Member 'DropItemAmountSelector_C_DropItems::Count' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_DropItems, Temp_bool_Variable) == 0x000004, "Member 'DropItemAmountSelector_C_DropItems::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_DropItems, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000008, "Member 'DropItemAmountSelector_C_DropItems::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_DropItems, K2Node_DynamicCast_AsSurvival_Player) == 0x000010, "Member 'DropItemAmountSelector_C_DropItems::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_DropItems, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'DropItemAmountSelector_C_DropItems::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_DropItems, CallFunc_GetPlayerController_ReturnValue) == 0x000020, "Member 'DropItemAmountSelector_C_DropItems::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_DropItems, CallFunc_GetHUD_ReturnValue) == 0x000028, "Member 'DropItemAmountSelector_C_DropItems::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_DropItems, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'DropItemAmountSelector_C_DropItems::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_DropItems, K2Node_DynamicCast_AsBP_Game_HUD) == 0x000038, "Member 'DropItemAmountSelector_C_DropItems::K2Node_DynamicCast_AsBP_Game_HUD' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_DropItems, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'DropItemAmountSelector_C_DropItems::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_DropItems, CallFunc_IsValid_ReturnValue_1) == 0x000041, "Member 'DropItemAmountSelector_C_DropItems::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_DropItems, CallFunc_BooleanAND_ReturnValue) == 0x000042, "Member 'DropItemAmountSelector_C_DropItems::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_DropItems, CallFunc_GetPlayerController_ReturnValue_1) == 0x000048, "Member 'DropItemAmountSelector_C_DropItems::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_DropItems, K2Node_Select_Default) == 0x000050, "Member 'DropItemAmountSelector_C_DropItems::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_DropItems, CallFunc_GetHUD_ReturnValue_1) == 0x000058, "Member 'DropItemAmountSelector_C_DropItems::CallFunc_GetHUD_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_DropItems, K2Node_DynamicCast_AsBP_Game_HUD_1) == 0x000060, "Member 'DropItemAmountSelector_C_DropItems::K2Node_DynamicCast_AsBP_Game_HUD_1' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_DropItems, K2Node_DynamicCast_bSuccess_2) == 0x000068, "Member 'DropItemAmountSelector_C_DropItems::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_DropItems, CallFunc_IsValid_ReturnValue_2) == 0x000069, "Member 'DropItemAmountSelector_C_DropItems::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_DropItems, CallFunc_Array_Get_Item) == 0x000070, "Member 'DropItemAmountSelector_C_DropItems::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_DropItems, CallFunc_GetCount_Count) == 0x000078, "Member 'DropItemAmountSelector_C_DropItems::CallFunc_GetCount_Count' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_DropItems, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00007C, "Member 'DropItemAmountSelector_C_DropItems::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_DropItems, Temp_bool_Variable_1) == 0x00007D, "Member 'DropItemAmountSelector_C_DropItems::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_DropItems, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x00007E, "Member 'DropItemAmountSelector_C_DropItems::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_DropItems, CallFunc_BooleanOR_ReturnValue) == 0x00007F, "Member 'DropItemAmountSelector_C_DropItems::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_DropItems, K2Node_Select_Default_1) == 0x000080, "Member 'DropItemAmountSelector_C_DropItems::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_DropItems, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000088, "Member 'DropItemAmountSelector_C_DropItems::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_DropItems, CallFunc_BooleanAND_ReturnValue_1) == 0x000089, "Member 'DropItemAmountSelector_C_DropItems::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_DropItems, CallFunc_IsValid_ReturnValue_3) == 0x00008A, "Member 'DropItemAmountSelector_C_DropItems::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_DropItems, CallFunc_BooleanAND_ReturnValue_2) == 0x00008B, "Member 'DropItemAmountSelector_C_DropItems::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_DropItems, CallFunc_Array_Get_Item_1) == 0x000090, "Member 'DropItemAmountSelector_C_DropItems::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_DropItems, CallFunc_GetCount_Count_1) == 0x000098, "Member 'DropItemAmountSelector_C_DropItems::CallFunc_GetCount_Count_1' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_DropItems, CallFunc_MoveItemToContainer_Moved_) == 0x00009C, "Member 'DropItemAmountSelector_C_DropItems::CallFunc_MoveItemToContainer_Moved_' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_DropItems, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000A0, "Member 'DropItemAmountSelector_C_DropItems::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_DropItems, CallFunc_UpdateCount_Count) == 0x0000A4, "Member 'DropItemAmountSelector_C_DropItems::CallFunc_UpdateCount_Count' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_DropItems, CallFunc_AddNewInventoryItem_Added) == 0x0000A8, "Member 'DropItemAmountSelector_C_DropItems::CallFunc_AddNewInventoryItem_Added' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_DropItems, CallFunc_AddNewInventoryItem_SlotIndex) == 0x0000AC, "Member 'DropItemAmountSelector_C_DropItems::CallFunc_AddNewInventoryItem_SlotIndex' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_DropItems, CallFunc_AddNewInventoryItem_ItemInfo) == 0x0000B0, "Member 'DropItemAmountSelector_C_DropItems::CallFunc_AddNewInventoryItem_ItemInfo' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_DropItems, CallFunc_AddNewInventoryItem_SlotItemRef) == 0x0002D0, "Member 'DropItemAmountSelector_C_DropItems::CallFunc_AddNewInventoryItem_SlotItemRef' has a wrong offset!");
static_assert(offsetof(DropItemAmountSelector_C_DropItems, CallFunc_AddNewInventoryItem_StackRemainder) == 0x0002D8, "Member 'DropItemAmountSelector_C_DropItems::CallFunc_AddNewInventoryItem_StackRemainder' has a wrong offset!");

// Function DropItemAmountSelector.DropItemAmountSelector_C.ExecuteUbergraph_DropItemAmountSelector
// 0x02E0 (0x02E0 - 0x0000)
struct DropItemAmountSelector_C_ExecuteUbergraph_DropItemAmountSelector final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0048(0x0018)()
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_ShopContainer                               Temp_byte_Variable;                                // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0067(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B[0x5];                                       // 0x006B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0070(0x0018)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC;                  // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC_1;                // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_TabsWindow_C*                        CallFunc_GetTabsWidget_Widget;                     // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_TabsWindow_C*                        CallFunc_GetTabsWidget_Widget_1;                   // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_ComponentBoundEvent_Value_1;                // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue;           // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0130(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x0148(0x0018)()
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue;       // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue_1;     // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_162[0x2];                                      // 0x0162(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_ComponentBoundEvent_Value;                  // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_1;                // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0170(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_2;           // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCount_Count;                           // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_3;             // 0x01A8(0x0018)()
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_2;                // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_3;                // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetCount_Count_1;                         // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_4;             // 0x01E0(0x0018)()
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_3;           // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_4;           // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
