#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DropItemBackGwidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "FItemInfo_structs.hpp"


namespace SDK::Params
{

// Function DropItemBackGwidget.DropItemBackGwidget_C.ExecuteUbergraph_DropItemBackGwidget
// 0x0040 (0x0040 - 0x0000)
struct DropItemBackGwidget_C_ExecuteUbergraph_DropItemBackGwidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDropItemAmountSelector_C*              CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ASurvPC_C*                              K2Node_DynamicCast_AsSurv_PC;                      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UJSI_Slot_C*                            K2Node_CustomEvent_Slot;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJSIContainer_C*                        K2Node_CustomEvent_FromContainer;                  // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJSIContainer_C*                        K2Node_CustomEvent_ToContainer;                    // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DropItemBackGwidget_C_ExecuteUbergraph_DropItemBackGwidget) == 0x000008, "Wrong alignment on DropItemBackGwidget_C_ExecuteUbergraph_DropItemBackGwidget");
static_assert(sizeof(DropItemBackGwidget_C_ExecuteUbergraph_DropItemBackGwidget) == 0x000040, "Wrong size on DropItemBackGwidget_C_ExecuteUbergraph_DropItemBackGwidget");
static_assert(offsetof(DropItemBackGwidget_C_ExecuteUbergraph_DropItemBackGwidget, EntryPoint) == 0x000000, "Member 'DropItemBackGwidget_C_ExecuteUbergraph_DropItemBackGwidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(DropItemBackGwidget_C_ExecuteUbergraph_DropItemBackGwidget, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'DropItemBackGwidget_C_ExecuteUbergraph_DropItemBackGwidget::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropItemBackGwidget_C_ExecuteUbergraph_DropItemBackGwidget, CallFunc_Create_ReturnValue) == 0x000010, "Member 'DropItemBackGwidget_C_ExecuteUbergraph_DropItemBackGwidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropItemBackGwidget_C_ExecuteUbergraph_DropItemBackGwidget, K2Node_DynamicCast_AsSurv_PC) == 0x000018, "Member 'DropItemBackGwidget_C_ExecuteUbergraph_DropItemBackGwidget::K2Node_DynamicCast_AsSurv_PC' has a wrong offset!");
static_assert(offsetof(DropItemBackGwidget_C_ExecuteUbergraph_DropItemBackGwidget, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'DropItemBackGwidget_C_ExecuteUbergraph_DropItemBackGwidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(DropItemBackGwidget_C_ExecuteUbergraph_DropItemBackGwidget, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'DropItemBackGwidget_C_ExecuteUbergraph_DropItemBackGwidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropItemBackGwidget_C_ExecuteUbergraph_DropItemBackGwidget, CallFunc_IsVisible_ReturnValue) == 0x000022, "Member 'DropItemBackGwidget_C_ExecuteUbergraph_DropItemBackGwidget::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropItemBackGwidget_C_ExecuteUbergraph_DropItemBackGwidget, K2Node_CustomEvent_Slot) == 0x000028, "Member 'DropItemBackGwidget_C_ExecuteUbergraph_DropItemBackGwidget::K2Node_CustomEvent_Slot' has a wrong offset!");
static_assert(offsetof(DropItemBackGwidget_C_ExecuteUbergraph_DropItemBackGwidget, K2Node_CustomEvent_FromContainer) == 0x000030, "Member 'DropItemBackGwidget_C_ExecuteUbergraph_DropItemBackGwidget::K2Node_CustomEvent_FromContainer' has a wrong offset!");
static_assert(offsetof(DropItemBackGwidget_C_ExecuteUbergraph_DropItemBackGwidget, K2Node_CustomEvent_ToContainer) == 0x000038, "Member 'DropItemBackGwidget_C_ExecuteUbergraph_DropItemBackGwidget::K2Node_CustomEvent_ToContainer' has a wrong offset!");

// Function DropItemBackGwidget.DropItemBackGwidget_C.ItemDropRequest__DelegateSignature
// 0x0238 (0x0238 - 0x0000)
struct DropItemBackGwidget_C_ItemDropRequest__DelegateSignature final
{
public:
	class UJSI_Slot_C*                            ItemRef;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFItemInfo                             ItemInfo;                                          // 0x0008(0x0220)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x0228(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJSIContainer_C*                        Container;                                         // 0x0230(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DropItemBackGwidget_C_ItemDropRequest__DelegateSignature) == 0x000008, "Wrong alignment on DropItemBackGwidget_C_ItemDropRequest__DelegateSignature");
static_assert(sizeof(DropItemBackGwidget_C_ItemDropRequest__DelegateSignature) == 0x000238, "Wrong size on DropItemBackGwidget_C_ItemDropRequest__DelegateSignature");
static_assert(offsetof(DropItemBackGwidget_C_ItemDropRequest__DelegateSignature, ItemRef) == 0x000000, "Member 'DropItemBackGwidget_C_ItemDropRequest__DelegateSignature::ItemRef' has a wrong offset!");
static_assert(offsetof(DropItemBackGwidget_C_ItemDropRequest__DelegateSignature, ItemInfo) == 0x000008, "Member 'DropItemBackGwidget_C_ItemDropRequest__DelegateSignature::ItemInfo' has a wrong offset!");
static_assert(offsetof(DropItemBackGwidget_C_ItemDropRequest__DelegateSignature, Count) == 0x000228, "Member 'DropItemBackGwidget_C_ItemDropRequest__DelegateSignature::Count' has a wrong offset!");
static_assert(offsetof(DropItemBackGwidget_C_ItemDropRequest__DelegateSignature, Container) == 0x000230, "Member 'DropItemBackGwidget_C_ItemDropRequest__DelegateSignature::Container' has a wrong offset!");

// Function DropItemBackGwidget.DropItemBackGwidget_C.OnDrop
// 0x0168 (0x0168 - 0x0000)
struct DropItemBackGwidget_C_OnDrop final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          PointerEvent;                                      // 0x0038(0x0078)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UDragDropOperation*                     Operation;                                         // 0x00B0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x00B8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDropItemAmountSelector_C*              CallFunc_Create_ReturnValue;                       // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJigSDragOperation_C*                   K2Node_DynamicCast_AsJig_SDrag_Operation;          // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC;                  // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMPInGameInventory_C*                   CallFunc_GetInventoryWidget_Widget;                // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x010B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC_1;                // 0x0118(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      CallFunc_GetPlayerRef_SurvivalPlayer;              // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameHUD_C>        K2Node_DynamicCast_AsBPI_Game_HUD;                 // 0x0140(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMPInGameInventory_C*                   CallFunc_GetInventoryWidget_Widget_1;              // 0x0158(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0162(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsBeginner_IsBeginner;                 // 0x0163(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DropItemBackGwidget_C_OnDrop) == 0x000008, "Wrong alignment on DropItemBackGwidget_C_OnDrop");
static_assert(sizeof(DropItemBackGwidget_C_OnDrop) == 0x000168, "Wrong size on DropItemBackGwidget_C_OnDrop");
static_assert(offsetof(DropItemBackGwidget_C_OnDrop, MyGeometry) == 0x000000, "Member 'DropItemBackGwidget_C_OnDrop::MyGeometry' has a wrong offset!");
static_assert(offsetof(DropItemBackGwidget_C_OnDrop, PointerEvent) == 0x000038, "Member 'DropItemBackGwidget_C_OnDrop::PointerEvent' has a wrong offset!");
static_assert(offsetof(DropItemBackGwidget_C_OnDrop, Operation) == 0x0000B0, "Member 'DropItemBackGwidget_C_OnDrop::Operation' has a wrong offset!");
static_assert(offsetof(DropItemBackGwidget_C_OnDrop, ReturnValue) == 0x0000B8, "Member 'DropItemBackGwidget_C_OnDrop::ReturnValue' has a wrong offset!");
static_assert(offsetof(DropItemBackGwidget_C_OnDrop, CallFunc_Create_ReturnValue) == 0x0000C0, "Member 'DropItemBackGwidget_C_OnDrop::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropItemBackGwidget_C_OnDrop, K2Node_DynamicCast_AsJig_SDrag_Operation) == 0x0000C8, "Member 'DropItemBackGwidget_C_OnDrop::K2Node_DynamicCast_AsJig_SDrag_Operation' has a wrong offset!");
static_assert(offsetof(DropItemBackGwidget_C_OnDrop, K2Node_DynamicCast_bSuccess) == 0x0000D0, "Member 'DropItemBackGwidget_C_OnDrop::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(DropItemBackGwidget_C_OnDrop, CallFunc_GetPlayerController_ReturnValue) == 0x0000D8, "Member 'DropItemBackGwidget_C_OnDrop::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropItemBackGwidget_C_OnDrop, CallFunc_IsValid_ReturnValue) == 0x0000E0, "Member 'DropItemBackGwidget_C_OnDrop::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropItemBackGwidget_C_OnDrop, K2Node_DynamicCast_AsBPI_Surv_PC) == 0x0000E8, "Member 'DropItemBackGwidget_C_OnDrop::K2Node_DynamicCast_AsBPI_Surv_PC' has a wrong offset!");
static_assert(offsetof(DropItemBackGwidget_C_OnDrop, K2Node_DynamicCast_bSuccess_1) == 0x0000F8, "Member 'DropItemBackGwidget_C_OnDrop::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(DropItemBackGwidget_C_OnDrop, CallFunc_GetInventoryWidget_Widget) == 0x000100, "Member 'DropItemBackGwidget_C_OnDrop::CallFunc_GetInventoryWidget_Widget' has a wrong offset!");
static_assert(offsetof(DropItemBackGwidget_C_OnDrop, CallFunc_IsValid_ReturnValue_1) == 0x000108, "Member 'DropItemBackGwidget_C_OnDrop::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DropItemBackGwidget_C_OnDrop, CallFunc_BooleanAND_ReturnValue) == 0x000109, "Member 'DropItemBackGwidget_C_OnDrop::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropItemBackGwidget_C_OnDrop, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x00010A, "Member 'DropItemBackGwidget_C_OnDrop::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropItemBackGwidget_C_OnDrop, CallFunc_BooleanAND_ReturnValue_1) == 0x00010B, "Member 'DropItemBackGwidget_C_OnDrop::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DropItemBackGwidget_C_OnDrop, CallFunc_GetPlayerController_ReturnValue_1) == 0x000110, "Member 'DropItemBackGwidget_C_OnDrop::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DropItemBackGwidget_C_OnDrop, K2Node_DynamicCast_AsBPI_Surv_PC_1) == 0x000118, "Member 'DropItemBackGwidget_C_OnDrop::K2Node_DynamicCast_AsBPI_Surv_PC_1' has a wrong offset!");
static_assert(offsetof(DropItemBackGwidget_C_OnDrop, K2Node_DynamicCast_bSuccess_2) == 0x000128, "Member 'DropItemBackGwidget_C_OnDrop::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(DropItemBackGwidget_C_OnDrop, CallFunc_GetHUD_ReturnValue) == 0x000130, "Member 'DropItemBackGwidget_C_OnDrop::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropItemBackGwidget_C_OnDrop, CallFunc_GetPlayerRef_SurvivalPlayer) == 0x000138, "Member 'DropItemBackGwidget_C_OnDrop::CallFunc_GetPlayerRef_SurvivalPlayer' has a wrong offset!");
static_assert(offsetof(DropItemBackGwidget_C_OnDrop, K2Node_DynamicCast_AsBPI_Game_HUD) == 0x000140, "Member 'DropItemBackGwidget_C_OnDrop::K2Node_DynamicCast_AsBPI_Game_HUD' has a wrong offset!");
static_assert(offsetof(DropItemBackGwidget_C_OnDrop, K2Node_DynamicCast_bSuccess_3) == 0x000150, "Member 'DropItemBackGwidget_C_OnDrop::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(DropItemBackGwidget_C_OnDrop, CallFunc_GetInventoryWidget_Widget_1) == 0x000158, "Member 'DropItemBackGwidget_C_OnDrop::CallFunc_GetInventoryWidget_Widget_1' has a wrong offset!");
static_assert(offsetof(DropItemBackGwidget_C_OnDrop, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000160, "Member 'DropItemBackGwidget_C_OnDrop::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropItemBackGwidget_C_OnDrop, CallFunc_Not_PreBool_ReturnValue) == 0x000161, "Member 'DropItemBackGwidget_C_OnDrop::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropItemBackGwidget_C_OnDrop, CallFunc_IsValid_ReturnValue_2) == 0x000162, "Member 'DropItemBackGwidget_C_OnDrop::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DropItemBackGwidget_C_OnDrop, CallFunc_GetIsBeginner_IsBeginner) == 0x000163, "Member 'DropItemBackGwidget_C_OnDrop::CallFunc_GetIsBeginner_IsBeginner' has a wrong offset!");

// Function DropItemBackGwidget.DropItemBackGwidget_C.OnDropDeniedInTutorial__DelegateSignature
// 0x0002 (0x0002 - 0x0000)
struct DropItemBackGwidget_C_OnDropDeniedInTutorial__DelegateSignature final
{
public:
	bool                                          TutorReason;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsProtectiveCase;                                  // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DropItemBackGwidget_C_OnDropDeniedInTutorial__DelegateSignature) == 0x000001, "Wrong alignment on DropItemBackGwidget_C_OnDropDeniedInTutorial__DelegateSignature");
static_assert(sizeof(DropItemBackGwidget_C_OnDropDeniedInTutorial__DelegateSignature) == 0x000002, "Wrong size on DropItemBackGwidget_C_OnDropDeniedInTutorial__DelegateSignature");
static_assert(offsetof(DropItemBackGwidget_C_OnDropDeniedInTutorial__DelegateSignature, TutorReason) == 0x000000, "Member 'DropItemBackGwidget_C_OnDropDeniedInTutorial__DelegateSignature::TutorReason' has a wrong offset!");
static_assert(offsetof(DropItemBackGwidget_C_OnDropDeniedInTutorial__DelegateSignature, IsProtectiveCase) == 0x000001, "Member 'DropItemBackGwidget_C_OnDropDeniedInTutorial__DelegateSignature::IsProtectiveCase' has a wrong offset!");

// Function DropItemBackGwidget.DropItemBackGwidget_C.OnToggleSplitDialog
// 0x0020 (0x0020 - 0x0000)
struct DropItemBackGwidget_C_OnToggleSplitDialog final
{
public:
	bool                                          NewState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_Tab_C>              K2Node_DynamicCast_AsI_Tab;                        // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DropItemBackGwidget_C_OnToggleSplitDialog) == 0x000008, "Wrong alignment on DropItemBackGwidget_C_OnToggleSplitDialog");
static_assert(sizeof(DropItemBackGwidget_C_OnToggleSplitDialog) == 0x000020, "Wrong size on DropItemBackGwidget_C_OnToggleSplitDialog");
static_assert(offsetof(DropItemBackGwidget_C_OnToggleSplitDialog, NewState) == 0x000000, "Member 'DropItemBackGwidget_C_OnToggleSplitDialog::NewState' has a wrong offset!");
static_assert(offsetof(DropItemBackGwidget_C_OnToggleSplitDialog, K2Node_DynamicCast_AsI_Tab) == 0x000008, "Member 'DropItemBackGwidget_C_OnToggleSplitDialog::K2Node_DynamicCast_AsI_Tab' has a wrong offset!");
static_assert(offsetof(DropItemBackGwidget_C_OnToggleSplitDialog, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'DropItemBackGwidget_C_OnToggleSplitDialog::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(DropItemBackGwidget_C_OnToggleSplitDialog, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'DropItemBackGwidget_C_OnToggleSplitDialog::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function DropItemBackGwidget.DropItemBackGwidget_C.Set Parent Widget
// 0x0008 (0x0008 - 0x0000)
struct DropItemBackGwidget_C_Set_Parent_Widget final
{
public:
	class UUserWidget*                            NewWidget;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DropItemBackGwidget_C_Set_Parent_Widget) == 0x000008, "Wrong alignment on DropItemBackGwidget_C_Set_Parent_Widget");
static_assert(sizeof(DropItemBackGwidget_C_Set_Parent_Widget) == 0x000008, "Wrong size on DropItemBackGwidget_C_Set_Parent_Widget");
static_assert(offsetof(DropItemBackGwidget_C_Set_Parent_Widget, NewWidget) == 0x000000, "Member 'DropItemBackGwidget_C_Set_Parent_Widget::NewWidget' has a wrong offset!");

// Function DropItemBackGwidget.DropItemBackGwidget_C.ShowSelector
// 0x0018 (0x0018 - 0x0000)
struct DropItemBackGwidget_C_ShowSelector final
{
public:
	class UJSI_Slot_C*                            Param_Slot;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJSIContainer_C*                        FromContainer;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJSIContainer_C*                        ToContainer;                                       // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DropItemBackGwidget_C_ShowSelector) == 0x000008, "Wrong alignment on DropItemBackGwidget_C_ShowSelector");
static_assert(sizeof(DropItemBackGwidget_C_ShowSelector) == 0x000018, "Wrong size on DropItemBackGwidget_C_ShowSelector");
static_assert(offsetof(DropItemBackGwidget_C_ShowSelector, Param_Slot) == 0x000000, "Member 'DropItemBackGwidget_C_ShowSelector::Param_Slot' has a wrong offset!");
static_assert(offsetof(DropItemBackGwidget_C_ShowSelector, FromContainer) == 0x000008, "Member 'DropItemBackGwidget_C_ShowSelector::FromContainer' has a wrong offset!");
static_assert(offsetof(DropItemBackGwidget_C_ShowSelector, ToContainer) == 0x000010, "Member 'DropItemBackGwidget_C_ShowSelector::ToContainer' has a wrong offset!");

}

