#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DroppingHelmet

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DroppingHelmet.DroppingHelmet_C
// 0x0018 (0x02A8 - 0x0290)
class ADroppingHelmet_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Visor;                                             // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Helmet;                                            // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__DroppingHelmet_Helmet_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void BndEvt__DroppingHelmet_Visor_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void ExecuteUbergraph_DroppingHelmet(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DroppingHelmet_C">();
	}
	static class ADroppingHelmet_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADroppingHelmet_C>();
	}
};
static_assert(alignof(ADroppingHelmet_C) == 0x000008, "Wrong alignment on ADroppingHelmet_C");
static_assert(sizeof(ADroppingHelmet_C) == 0x0002A8, "Wrong size on ADroppingHelmet_C");
static_assert(offsetof(ADroppingHelmet_C, UberGraphFrame) == 0x000290, "Member 'ADroppingHelmet_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ADroppingHelmet_C, Visor) == 0x000298, "Member 'ADroppingHelmet_C::Visor' has a wrong offset!");
static_assert(offsetof(ADroppingHelmet_C, Helmet) == 0x0002A0, "Member 'ADroppingHelmet_C::Helmet' has a wrong offset!");

}

