#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DropItemBackGwidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DropItemBackGwidget.DropItemBackGwidget_C
// 0x0060 (0x02E0 - 0x0280)
class UDropItemBackGwidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_30;                                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             ItemDropRequest;                                   // 0x0290(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UDropItemAmountSelector_C*              AmountSelector;                                    // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJSI_Slot_C*                            SlotReference;                                     // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            ParentWidget;                                      // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnButtonPressed;                                   // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class ASurvPC_C*                              As_Surv_PC;                                        // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnDropDeniedInTutorial;                            // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__DropItemBackGwidget_Button_30_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Destruct();
	void ExecuteUbergraph_DropItemBackGwidget(int32 EntryPoint);
	void ItemDropRequest__DelegateSignature(class UJSI_Slot_C* ItemRef, const struct FFItemInfo& ItemInfo, int32 Count, class UJSIContainer_C* Container);
	void OnButtonPressed__DelegateSignature();
	bool OnDrop(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);
	void OnDropDeniedInTutorial__DelegateSignature(bool TutorReason, bool IsProtectiveCase);
	void OnInitialized();
	void OnToggleSplitDialog(bool NewState);
	void Set_Parent_Widget(class UUserWidget* NewWidget);
	void ShowSelector(class UJSI_Slot_C* Param_Slot, class UJSIContainer_C* FromContainer, class UJSIContainer_C* ToContainer);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DropItemBackGwidget_C">();
	}
	static class UDropItemBackGwidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDropItemBackGwidget_C>();
	}
};
static_assert(alignof(UDropItemBackGwidget_C) == 0x000008, "Wrong alignment on UDropItemBackGwidget_C");
static_assert(sizeof(UDropItemBackGwidget_C) == 0x0002E0, "Wrong size on UDropItemBackGwidget_C");
static_assert(offsetof(UDropItemBackGwidget_C, UberGraphFrame) == 0x000280, "Member 'UDropItemBackGwidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDropItemBackGwidget_C, Button_30) == 0x000288, "Member 'UDropItemBackGwidget_C::Button_30' has a wrong offset!");
static_assert(offsetof(UDropItemBackGwidget_C, ItemDropRequest) == 0x000290, "Member 'UDropItemBackGwidget_C::ItemDropRequest' has a wrong offset!");
static_assert(offsetof(UDropItemBackGwidget_C, AmountSelector) == 0x0002A0, "Member 'UDropItemBackGwidget_C::AmountSelector' has a wrong offset!");
static_assert(offsetof(UDropItemBackGwidget_C, SlotReference) == 0x0002A8, "Member 'UDropItemBackGwidget_C::SlotReference' has a wrong offset!");
static_assert(offsetof(UDropItemBackGwidget_C, ParentWidget) == 0x0002B0, "Member 'UDropItemBackGwidget_C::ParentWidget' has a wrong offset!");
static_assert(offsetof(UDropItemBackGwidget_C, OnButtonPressed) == 0x0002B8, "Member 'UDropItemBackGwidget_C::OnButtonPressed' has a wrong offset!");
static_assert(offsetof(UDropItemBackGwidget_C, As_Surv_PC) == 0x0002C8, "Member 'UDropItemBackGwidget_C::As_Surv_PC' has a wrong offset!");
static_assert(offsetof(UDropItemBackGwidget_C, OnDropDeniedInTutorial) == 0x0002D0, "Member 'UDropItemBackGwidget_C::OnDropDeniedInTutorial' has a wrong offset!");

}

