#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Effect

#include "Basic.hpp"

#include "StatType_structs.hpp"
#include "EffectType_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Effect.Effect_C.AddStatValue
// 0x00A0 (0x00A0 - 0x0000)
struct Effect_C_AddStatValue final
{
public:
	class AActor*                                 Param_Actor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EStatType                                     Param_StatType;                                    // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        NewValue;                                          // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FunctionReturnValue;                               // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FunctionResult;                                    // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_StatsInterface_C>   K2Node_DynamicCast_AsI_Stats_Interface;            // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPC_PlayerStatsComponent_C*            CallFunc_GetStatsComponent_PlayerStats;            // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetStat_Value;                            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetStat_ReturnValue;                      // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Effect_C_AddStatValue) == 0x000008, "Wrong alignment on Effect_C_AddStatValue");
static_assert(sizeof(Effect_C_AddStatValue) == 0x0000A0, "Wrong size on Effect_C_AddStatValue");
static_assert(offsetof(Effect_C_AddStatValue, Param_Actor) == 0x000000, "Member 'Effect_C_AddStatValue::Param_Actor' has a wrong offset!");
static_assert(offsetof(Effect_C_AddStatValue, Param_StatType) == 0x000008, "Member 'Effect_C_AddStatValue::Param_StatType' has a wrong offset!");
static_assert(offsetof(Effect_C_AddStatValue, NewValue) == 0x000010, "Member 'Effect_C_AddStatValue::NewValue' has a wrong offset!");
static_assert(offsetof(Effect_C_AddStatValue, Result) == 0x000018, "Member 'Effect_C_AddStatValue::Result' has a wrong offset!");
static_assert(offsetof(Effect_C_AddStatValue, ReturnValue) == 0x000020, "Member 'Effect_C_AddStatValue::ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_C_AddStatValue, FunctionReturnValue) == 0x000028, "Member 'Effect_C_AddStatValue::FunctionReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_C_AddStatValue, FunctionResult) == 0x000030, "Member 'Effect_C_AddStatValue::FunctionResult' has a wrong offset!");
static_assert(offsetof(Effect_C_AddStatValue, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000031, "Member 'Effect_C_AddStatValue::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_C_AddStatValue, CallFunc_Abs_ReturnValue) == 0x000038, "Member 'Effect_C_AddStatValue::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_C_AddStatValue, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000040, "Member 'Effect_C_AddStatValue::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_C_AddStatValue, K2Node_DynamicCast_AsI_Stats_Interface) == 0x000048, "Member 'Effect_C_AddStatValue::K2Node_DynamicCast_AsI_Stats_Interface' has a wrong offset!");
static_assert(offsetof(Effect_C_AddStatValue, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'Effect_C_AddStatValue::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Effect_C_AddStatValue, CallFunc_GetStatsComponent_PlayerStats) == 0x000060, "Member 'Effect_C_AddStatValue::CallFunc_GetStatsComponent_PlayerStats' has a wrong offset!");
static_assert(offsetof(Effect_C_AddStatValue, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'Effect_C_AddStatValue::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_C_AddStatValue, CallFunc_GetStat_Value) == 0x000070, "Member 'Effect_C_AddStatValue::CallFunc_GetStat_Value' has a wrong offset!");
static_assert(offsetof(Effect_C_AddStatValue, K2Node_SwitchEnum_CmpSuccess) == 0x000078, "Member 'Effect_C_AddStatValue::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Effect_C_AddStatValue, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000080, "Member 'Effect_C_AddStatValue::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_C_AddStatValue, CallFunc_IsValid_ReturnValue_1) == 0x000088, "Member 'Effect_C_AddStatValue::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Effect_C_AddStatValue, CallFunc_FClamp_ReturnValue) == 0x000090, "Member 'Effect_C_AddStatValue::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_C_AddStatValue, CallFunc_SetStat_ReturnValue) == 0x000098, "Member 'Effect_C_AddStatValue::CallFunc_SetStat_ReturnValue' has a wrong offset!");

// Function Effect.Effect_C.CheckArenalinEffect
// 0x0010 (0x0010 - 0x0000)
struct Effect_C_CheckArenalinEffect final
{
public:
	class UBPC_PlayerStatsComponent_C*            PlayerStats;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EStatType                                     StatsType;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Find;                                              // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Effect_C_CheckArenalinEffect) == 0x000008, "Wrong alignment on Effect_C_CheckArenalinEffect");
static_assert(sizeof(Effect_C_CheckArenalinEffect) == 0x000010, "Wrong size on Effect_C_CheckArenalinEffect");
static_assert(offsetof(Effect_C_CheckArenalinEffect, PlayerStats) == 0x000000, "Member 'Effect_C_CheckArenalinEffect::PlayerStats' has a wrong offset!");
static_assert(offsetof(Effect_C_CheckArenalinEffect, StatsType) == 0x000008, "Member 'Effect_C_CheckArenalinEffect::StatsType' has a wrong offset!");
static_assert(offsetof(Effect_C_CheckArenalinEffect, Find) == 0x000009, "Member 'Effect_C_CheckArenalinEffect::Find' has a wrong offset!");
static_assert(offsetof(Effect_C_CheckArenalinEffect, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00000A, "Member 'Effect_C_CheckArenalinEffect::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function Effect.Effect_C.ExecuteUbergraph_Effect
// 0x02A8 (0x02A8 - 0x0000)
struct Effect_C_ExecuteUbergraph_Effect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_StatsInterface_C>   K2Node_DynamicCast_AsI_Stats_Interface;            // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPC_PlayerStatsComponent_C*            CallFunc_GetStatsComponent_PlayerStats;            // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4;                              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_5;                              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_6;                              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_7;                              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_8;                              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_9;                              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_10;                             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_11;                             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_12;                             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_13;                             // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_14;                             // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_15;                             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_16;                             // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_17;                             // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_18;                             // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_19;                             // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_20;                             // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_21;                             // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_22;                             // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_StatsInterface_C>   K2Node_DynamicCast_AsI_Stats_Interface_1;          // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPC_PlayerStatsComponent_C*            CallFunc_GetStatsComponent_PlayerStats_1;          // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_StatsInterface_C>   K2Node_DynamicCast_AsI_Stats_Interface_2;          // 0x0110(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPC_PlayerStatsComponent_C*            CallFunc_GetStatsComponent_PlayerStats_2;          // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetStat_Value;                            // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_23;                             // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_StatsInterface_C>   K2Node_DynamicCast_AsI_Stats_Interface_3;          // 0x0158(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_24;                             // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_25;                             // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0180(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_26;                             // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19A[0x6];                                      // 0x019A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SetStat_ReturnValue;                      // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x3];                                      // 0x01A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x01AC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x01C0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StopEffectByName_return;                  // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x01CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x01CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckArenalinEffect_Find;                 // 0x01D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D3[0x5];                                      // 0x01D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_27;                             // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_StatsInterface_C>   K2Node_DynamicCast_AsI_Stats_Interface_4;          // 0x01E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StopEffectByName_return_1;                // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F2[0x6];                                      // 0x01F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_28;                             // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_29;                             // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_30;                             // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_31;                             // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_32;                             // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EStatType                                     Temp_byte_Variable;                                // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddStatValue_Result;                      // 0x023A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23B[0x5];                                      // 0x023B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_AddStatValue_ReturnValue;                 // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0248(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25A[0x6];                                      // 0x025A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x026A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x026B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EffectType                                    Temp_byte_Variable_1;                              // 0x026C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26D[0x3];                                      // 0x026D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Actor;                          // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EffectType                                    K2Node_CustomEvent_EffectType;                     // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EStatType                                     K2Node_CustomEvent_StatType;                       // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27A[0x6];                                      // 0x027A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_StatValue;                      // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Duration;                       // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetStat_Value_1;                          // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_1;                           // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1[0x3];                                      // 0x02A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Effect_C_ExecuteUbergraph_Effect) == 0x000008, "Wrong alignment on Effect_C_ExecuteUbergraph_Effect");
static_assert(sizeof(Effect_C_ExecuteUbergraph_Effect) == 0x0002A8, "Wrong size on Effect_C_ExecuteUbergraph_Effect");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, EntryPoint) == 0x000000, "Member 'Effect_C_ExecuteUbergraph_Effect::EntryPoint' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, Temp_real_Variable) == 0x000008, "Member 'Effect_C_ExecuteUbergraph_Effect::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, K2Node_DynamicCast_AsI_Stats_Interface) == 0x000010, "Member 'Effect_C_ExecuteUbergraph_Effect::K2Node_DynamicCast_AsI_Stats_Interface' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'Effect_C_ExecuteUbergraph_Effect::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, CallFunc_GetStatsComponent_PlayerStats) == 0x000028, "Member 'Effect_C_ExecuteUbergraph_Effect::CallFunc_GetStatsComponent_PlayerStats' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, Temp_real_Variable_1) == 0x000030, "Member 'Effect_C_ExecuteUbergraph_Effect::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, Temp_real_Variable_2) == 0x000038, "Member 'Effect_C_ExecuteUbergraph_Effect::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, Temp_real_Variable_3) == 0x000040, "Member 'Effect_C_ExecuteUbergraph_Effect::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, Temp_real_Variable_4) == 0x000048, "Member 'Effect_C_ExecuteUbergraph_Effect::Temp_real_Variable_4' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, Temp_real_Variable_5) == 0x000050, "Member 'Effect_C_ExecuteUbergraph_Effect::Temp_real_Variable_5' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, Temp_real_Variable_6) == 0x000058, "Member 'Effect_C_ExecuteUbergraph_Effect::Temp_real_Variable_6' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, Temp_real_Variable_7) == 0x000060, "Member 'Effect_C_ExecuteUbergraph_Effect::Temp_real_Variable_7' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, Temp_real_Variable_8) == 0x000068, "Member 'Effect_C_ExecuteUbergraph_Effect::Temp_real_Variable_8' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, Temp_real_Variable_9) == 0x000070, "Member 'Effect_C_ExecuteUbergraph_Effect::Temp_real_Variable_9' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, Temp_real_Variable_10) == 0x000078, "Member 'Effect_C_ExecuteUbergraph_Effect::Temp_real_Variable_10' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, Temp_real_Variable_11) == 0x000080, "Member 'Effect_C_ExecuteUbergraph_Effect::Temp_real_Variable_11' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, Temp_real_Variable_12) == 0x000088, "Member 'Effect_C_ExecuteUbergraph_Effect::Temp_real_Variable_12' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, Temp_real_Variable_13) == 0x000090, "Member 'Effect_C_ExecuteUbergraph_Effect::Temp_real_Variable_13' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, Temp_real_Variable_14) == 0x000098, "Member 'Effect_C_ExecuteUbergraph_Effect::Temp_real_Variable_14' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, Temp_real_Variable_15) == 0x0000A0, "Member 'Effect_C_ExecuteUbergraph_Effect::Temp_real_Variable_15' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, Temp_real_Variable_16) == 0x0000A8, "Member 'Effect_C_ExecuteUbergraph_Effect::Temp_real_Variable_16' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, Temp_real_Variable_17) == 0x0000B0, "Member 'Effect_C_ExecuteUbergraph_Effect::Temp_real_Variable_17' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, Temp_real_Variable_18) == 0x0000B8, "Member 'Effect_C_ExecuteUbergraph_Effect::Temp_real_Variable_18' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, Temp_real_Variable_19) == 0x0000C0, "Member 'Effect_C_ExecuteUbergraph_Effect::Temp_real_Variable_19' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, Temp_real_Variable_20) == 0x0000C8, "Member 'Effect_C_ExecuteUbergraph_Effect::Temp_real_Variable_20' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, Temp_real_Variable_21) == 0x0000D0, "Member 'Effect_C_ExecuteUbergraph_Effect::Temp_real_Variable_21' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, Temp_real_Variable_22) == 0x0000D8, "Member 'Effect_C_ExecuteUbergraph_Effect::Temp_real_Variable_22' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, K2Node_SwitchEnum_CmpSuccess) == 0x0000E0, "Member 'Effect_C_ExecuteUbergraph_Effect::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, K2Node_DynamicCast_AsI_Stats_Interface_1) == 0x0000E8, "Member 'Effect_C_ExecuteUbergraph_Effect::K2Node_DynamicCast_AsI_Stats_Interface_1' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, K2Node_DynamicCast_bSuccess_1) == 0x0000F8, "Member 'Effect_C_ExecuteUbergraph_Effect::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, CallFunc_GetStatsComponent_PlayerStats_1) == 0x000100, "Member 'Effect_C_ExecuteUbergraph_Effect::CallFunc_GetStatsComponent_PlayerStats_1' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, K2Node_SwitchEnum_CmpSuccess_1) == 0x000108, "Member 'Effect_C_ExecuteUbergraph_Effect::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, K2Node_DynamicCast_AsI_Stats_Interface_2) == 0x000110, "Member 'Effect_C_ExecuteUbergraph_Effect::K2Node_DynamicCast_AsI_Stats_Interface_2' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, K2Node_DynamicCast_bSuccess_2) == 0x000120, "Member 'Effect_C_ExecuteUbergraph_Effect::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, CallFunc_GetStatsComponent_PlayerStats_2) == 0x000128, "Member 'Effect_C_ExecuteUbergraph_Effect::CallFunc_GetStatsComponent_PlayerStats_2' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000130, "Member 'Effect_C_ExecuteUbergraph_Effect::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, CallFunc_GetStat_Value) == 0x000138, "Member 'Effect_C_ExecuteUbergraph_Effect::CallFunc_GetStat_Value' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000140, "Member 'Effect_C_ExecuteUbergraph_Effect::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, Temp_real_Variable_23) == 0x000148, "Member 'Effect_C_ExecuteUbergraph_Effect::Temp_real_Variable_23' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000150, "Member 'Effect_C_ExecuteUbergraph_Effect::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, K2Node_DynamicCast_AsI_Stats_Interface_3) == 0x000158, "Member 'Effect_C_ExecuteUbergraph_Effect::K2Node_DynamicCast_AsI_Stats_Interface_3' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, K2Node_DynamicCast_bSuccess_3) == 0x000168, "Member 'Effect_C_ExecuteUbergraph_Effect::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, Temp_real_Variable_24) == 0x000170, "Member 'Effect_C_ExecuteUbergraph_Effect::Temp_real_Variable_24' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, Temp_real_Variable_25) == 0x000178, "Member 'Effect_C_ExecuteUbergraph_Effect::Temp_real_Variable_25' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, K2Node_CreateDelegate_OutputDelegate) == 0x000180, "Member 'Effect_C_ExecuteUbergraph_Effect::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, Temp_real_Variable_26) == 0x000190, "Member 'Effect_C_ExecuteUbergraph_Effect::Temp_real_Variable_26' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000198, "Member 'Effect_C_ExecuteUbergraph_Effect::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, CallFunc_Not_PreBool_ReturnValue) == 0x000199, "Member 'Effect_C_ExecuteUbergraph_Effect::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, CallFunc_SetStat_ReturnValue) == 0x0001A0, "Member 'Effect_C_ExecuteUbergraph_Effect::CallFunc_SetStat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, CallFunc_BooleanAND_ReturnValue) == 0x0001A8, "Member 'Effect_C_ExecuteUbergraph_Effect::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001AC, "Member 'Effect_C_ExecuteUbergraph_Effect::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0001C0, "Member 'Effect_C_ExecuteUbergraph_Effect::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x0001C8, "Member 'Effect_C_ExecuteUbergraph_Effect::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, CallFunc_StopEffectByName_return) == 0x0001C9, "Member 'Effect_C_ExecuteUbergraph_Effect::CallFunc_StopEffectByName_return' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x0001CA, "Member 'Effect_C_ExecuteUbergraph_Effect::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0001CB, "Member 'Effect_C_ExecuteUbergraph_Effect::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, CallFunc_Array_Length_ReturnValue) == 0x0001CC, "Member 'Effect_C_ExecuteUbergraph_Effect::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0001D0, "Member 'Effect_C_ExecuteUbergraph_Effect::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, CallFunc_BooleanAND_ReturnValue_1) == 0x0001D1, "Member 'Effect_C_ExecuteUbergraph_Effect::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, CallFunc_CheckArenalinEffect_Find) == 0x0001D2, "Member 'Effect_C_ExecuteUbergraph_Effect::CallFunc_CheckArenalinEffect_Find' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, Temp_real_Variable_27) == 0x0001D8, "Member 'Effect_C_ExecuteUbergraph_Effect::Temp_real_Variable_27' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, K2Node_DynamicCast_AsI_Stats_Interface_4) == 0x0001E0, "Member 'Effect_C_ExecuteUbergraph_Effect::K2Node_DynamicCast_AsI_Stats_Interface_4' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, K2Node_DynamicCast_bSuccess_4) == 0x0001F0, "Member 'Effect_C_ExecuteUbergraph_Effect::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, CallFunc_StopEffectByName_return_1) == 0x0001F1, "Member 'Effect_C_ExecuteUbergraph_Effect::CallFunc_StopEffectByName_return_1' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, Temp_real_Variable_28) == 0x0001F8, "Member 'Effect_C_ExecuteUbergraph_Effect::Temp_real_Variable_28' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, Temp_real_Variable_29) == 0x000200, "Member 'Effect_C_ExecuteUbergraph_Effect::Temp_real_Variable_29' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, Temp_real_Variable_30) == 0x000208, "Member 'Effect_C_ExecuteUbergraph_Effect::Temp_real_Variable_30' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, Temp_real_Variable_31) == 0x000210, "Member 'Effect_C_ExecuteUbergraph_Effect::Temp_real_Variable_31' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, Temp_real_Variable_32) == 0x000218, "Member 'Effect_C_ExecuteUbergraph_Effect::Temp_real_Variable_32' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, Temp_byte_Variable) == 0x000220, "Member 'Effect_C_ExecuteUbergraph_Effect::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, K2Node_Select_Default) == 0x000228, "Member 'Effect_C_ExecuteUbergraph_Effect::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000230, "Member 'Effect_C_ExecuteUbergraph_Effect::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000238, "Member 'Effect_C_ExecuteUbergraph_Effect::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, CallFunc_BooleanAND_ReturnValue_2) == 0x000239, "Member 'Effect_C_ExecuteUbergraph_Effect::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, CallFunc_AddStatValue_Result) == 0x00023A, "Member 'Effect_C_ExecuteUbergraph_Effect::CallFunc_AddStatValue_Result' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, CallFunc_AddStatValue_ReturnValue) == 0x000240, "Member 'Effect_C_ExecuteUbergraph_Effect::CallFunc_AddStatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000248, "Member 'Effect_C_ExecuteUbergraph_Effect::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000250, "Member 'Effect_C_ExecuteUbergraph_Effect::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, Temp_bool_Variable) == 0x000258, "Member 'Effect_C_ExecuteUbergraph_Effect::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, Temp_bool_Variable_1) == 0x000259, "Member 'Effect_C_ExecuteUbergraph_Effect::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000260, "Member 'Effect_C_ExecuteUbergraph_Effect::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, Temp_bool_Variable_2) == 0x000268, "Member 'Effect_C_ExecuteUbergraph_Effect::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, Temp_bool_Variable_3) == 0x000269, "Member 'Effect_C_ExecuteUbergraph_Effect::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, Temp_bool_Variable_4) == 0x00026A, "Member 'Effect_C_ExecuteUbergraph_Effect::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, Temp_bool_Variable_5) == 0x00026B, "Member 'Effect_C_ExecuteUbergraph_Effect::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, Temp_byte_Variable_1) == 0x00026C, "Member 'Effect_C_ExecuteUbergraph_Effect::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, K2Node_CustomEvent_Actor) == 0x000270, "Member 'Effect_C_ExecuteUbergraph_Effect::K2Node_CustomEvent_Actor' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, K2Node_CustomEvent_EffectType) == 0x000278, "Member 'Effect_C_ExecuteUbergraph_Effect::K2Node_CustomEvent_EffectType' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, K2Node_CustomEvent_StatType) == 0x000279, "Member 'Effect_C_ExecuteUbergraph_Effect::K2Node_CustomEvent_StatType' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, K2Node_CustomEvent_StatValue) == 0x000280, "Member 'Effect_C_ExecuteUbergraph_Effect::K2Node_CustomEvent_StatValue' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, K2Node_CustomEvent_Duration) == 0x000288, "Member 'Effect_C_ExecuteUbergraph_Effect::K2Node_CustomEvent_Duration' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000290, "Member 'Effect_C_ExecuteUbergraph_Effect::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, CallFunc_GetStat_Value_1) == 0x000298, "Member 'Effect_C_ExecuteUbergraph_Effect::CallFunc_GetStat_Value_1' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, K2Node_Select_Default_1) == 0x0002A0, "Member 'Effect_C_ExecuteUbergraph_Effect::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(Effect_C_ExecuteUbergraph_Effect, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x0002A4, "Member 'Effect_C_ExecuteUbergraph_Effect::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");

// Function Effect.Effect_C.Start
// 0x0020 (0x0020 - 0x0000)
struct Effect_C_Start final
{
public:
	class AActor*                                 Param_Actor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EffectType                                    Param_EffectType;                                  // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EStatType                                     Param_StatType;                                    // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Param_StatValue;                                   // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Param_Duration;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Effect_C_Start) == 0x000008, "Wrong alignment on Effect_C_Start");
static_assert(sizeof(Effect_C_Start) == 0x000020, "Wrong size on Effect_C_Start");
static_assert(offsetof(Effect_C_Start, Param_Actor) == 0x000000, "Member 'Effect_C_Start::Param_Actor' has a wrong offset!");
static_assert(offsetof(Effect_C_Start, Param_EffectType) == 0x000008, "Member 'Effect_C_Start::Param_EffectType' has a wrong offset!");
static_assert(offsetof(Effect_C_Start, Param_StatType) == 0x000009, "Member 'Effect_C_Start::Param_StatType' has a wrong offset!");
static_assert(offsetof(Effect_C_Start, Param_StatValue) == 0x000010, "Member 'Effect_C_Start::Param_StatValue' has a wrong offset!");
static_assert(offsetof(Effect_C_Start, Param_Duration) == 0x000018, "Member 'Effect_C_Start::Param_Duration' has a wrong offset!");

}

