#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EffectMain

#include "Basic.hpp"

#include "EffectContructor_structs.hpp"
#include "EffectMainContructor_structs.hpp"


namespace SDK::Params
{

// Function EffectMain.EffectMain_C.ExecuteUbergraph_EffectMain
// 0x00D8 (0x00D8 - 0x0000)
struct EffectMain_C_ExecuteUbergraph_EffectMain final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEffect_C*                              K2Node_CustomEvent_Effect;                         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_StatsInterface_C>   K2Node_DynamicCast_AsI_Stats_Interface;            // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StopEffectByRef_Return;                   // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEffectMainContructor                  K2Node_CustomEvent_Constructor;                    // 0x0038(0x0078)(HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_TargetActor;                    // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEffect_C*                              CallFunc_Array_Get_Item;                           // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EffectMain_C_ExecuteUbergraph_EffectMain) == 0x000008, "Wrong alignment on EffectMain_C_ExecuteUbergraph_EffectMain");
static_assert(sizeof(EffectMain_C_ExecuteUbergraph_EffectMain) == 0x0000D8, "Wrong size on EffectMain_C_ExecuteUbergraph_EffectMain");
static_assert(offsetof(EffectMain_C_ExecuteUbergraph_EffectMain, EntryPoint) == 0x000000, "Member 'EffectMain_C_ExecuteUbergraph_EffectMain::EntryPoint' has a wrong offset!");
static_assert(offsetof(EffectMain_C_ExecuteUbergraph_EffectMain, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'EffectMain_C_ExecuteUbergraph_EffectMain::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(EffectMain_C_ExecuteUbergraph_EffectMain, K2Node_CustomEvent_Effect) == 0x000008, "Member 'EffectMain_C_ExecuteUbergraph_EffectMain::K2Node_CustomEvent_Effect' has a wrong offset!");
static_assert(offsetof(EffectMain_C_ExecuteUbergraph_EffectMain, CallFunc_Array_Find_ReturnValue) == 0x000010, "Member 'EffectMain_C_ExecuteUbergraph_EffectMain::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(EffectMain_C_ExecuteUbergraph_EffectMain, CallFunc_Array_RemoveItem_ReturnValue) == 0x000014, "Member 'EffectMain_C_ExecuteUbergraph_EffectMain::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(EffectMain_C_ExecuteUbergraph_EffectMain, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000015, "Member 'EffectMain_C_ExecuteUbergraph_EffectMain::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EffectMain_C_ExecuteUbergraph_EffectMain, CallFunc_Array_Length_ReturnValue_1) == 0x000018, "Member 'EffectMain_C_ExecuteUbergraph_EffectMain::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EffectMain_C_ExecuteUbergraph_EffectMain, CallFunc_Greater_IntInt_ReturnValue) == 0x00001C, "Member 'EffectMain_C_ExecuteUbergraph_EffectMain::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EffectMain_C_ExecuteUbergraph_EffectMain, K2Node_DynamicCast_AsI_Stats_Interface) == 0x000020, "Member 'EffectMain_C_ExecuteUbergraph_EffectMain::K2Node_DynamicCast_AsI_Stats_Interface' has a wrong offset!");
static_assert(offsetof(EffectMain_C_ExecuteUbergraph_EffectMain, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'EffectMain_C_ExecuteUbergraph_EffectMain::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(EffectMain_C_ExecuteUbergraph_EffectMain, CallFunc_StopEffectByRef_Return) == 0x000031, "Member 'EffectMain_C_ExecuteUbergraph_EffectMain::CallFunc_StopEffectByRef_Return' has a wrong offset!");
static_assert(offsetof(EffectMain_C_ExecuteUbergraph_EffectMain, K2Node_CustomEvent_Constructor) == 0x000038, "Member 'EffectMain_C_ExecuteUbergraph_EffectMain::K2Node_CustomEvent_Constructor' has a wrong offset!");
static_assert(offsetof(EffectMain_C_ExecuteUbergraph_EffectMain, K2Node_CustomEvent_TargetActor) == 0x0000B0, "Member 'EffectMain_C_ExecuteUbergraph_EffectMain::K2Node_CustomEvent_TargetActor' has a wrong offset!");
static_assert(offsetof(EffectMain_C_ExecuteUbergraph_EffectMain, Temp_int_Loop_Counter_Variable) == 0x0000B8, "Member 'EffectMain_C_ExecuteUbergraph_EffectMain::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(EffectMain_C_ExecuteUbergraph_EffectMain, Temp_int_Array_Index_Variable) == 0x0000BC, "Member 'EffectMain_C_ExecuteUbergraph_EffectMain::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(EffectMain_C_ExecuteUbergraph_EffectMain, CallFunc_Less_IntInt_ReturnValue) == 0x0000C0, "Member 'EffectMain_C_ExecuteUbergraph_EffectMain::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EffectMain_C_ExecuteUbergraph_EffectMain, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'EffectMain_C_ExecuteUbergraph_EffectMain::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(EffectMain_C_ExecuteUbergraph_EffectMain, CallFunc_Add_IntInt_ReturnValue) == 0x0000D0, "Member 'EffectMain_C_ExecuteUbergraph_EffectMain::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function EffectMain.EffectMain_C.GetEffectStatus
// 0x0038 (0x0038 - 0x0000)
struct EffectMain_C_GetEffectStatus final
{
public:
	class FText                                   Param_Name;                                        // 0x0000(0x0018)(Parm, OutParm)
	double                                        Param_Duration;                                    // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEffect_C*                              CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EffectMain_C_GetEffectStatus) == 0x000008, "Wrong alignment on EffectMain_C_GetEffectStatus");
static_assert(sizeof(EffectMain_C_GetEffectStatus) == 0x000038, "Wrong size on EffectMain_C_GetEffectStatus");
static_assert(offsetof(EffectMain_C_GetEffectStatus, Param_Name) == 0x000000, "Member 'EffectMain_C_GetEffectStatus::Param_Name' has a wrong offset!");
static_assert(offsetof(EffectMain_C_GetEffectStatus, Param_Duration) == 0x000018, "Member 'EffectMain_C_GetEffectStatus::Param_Duration' has a wrong offset!");
static_assert(offsetof(EffectMain_C_GetEffectStatus, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000020, "Member 'EffectMain_C_GetEffectStatus::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(EffectMain_C_GetEffectStatus, CallFunc_Array_Get_Item) == 0x000028, "Member 'EffectMain_C_GetEffectStatus::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(EffectMain_C_GetEffectStatus, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000030, "Member 'EffectMain_C_GetEffectStatus::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");

// Function EffectMain.EffectMain_C.Init
// 0x0080 (0x0080 - 0x0000)
struct EffectMain_C_Init final
{
public:
	struct FEffectMainContructor                  Param_Constructor;                                 // 0x0000(0x0078)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class AActor*                                 TargetActor;                                       // 0x0078(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EffectMain_C_Init) == 0x000008, "Wrong alignment on EffectMain_C_Init");
static_assert(sizeof(EffectMain_C_Init) == 0x000080, "Wrong size on EffectMain_C_Init");
static_assert(offsetof(EffectMain_C_Init, Param_Constructor) == 0x000000, "Member 'EffectMain_C_Init::Param_Constructor' has a wrong offset!");
static_assert(offsetof(EffectMain_C_Init, TargetActor) == 0x000078, "Member 'EffectMain_C_Init::TargetActor' has a wrong offset!");

// Function EffectMain.EffectMain_C.PodEffectEEnded
// 0x0008 (0x0008 - 0x0000)
struct EffectMain_C_PodEffectEEnded final
{
public:
	class UEffect_C*                              Effect;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EffectMain_C_PodEffectEEnded) == 0x000008, "Wrong alignment on EffectMain_C_PodEffectEEnded");
static_assert(sizeof(EffectMain_C_PodEffectEEnded) == 0x000008, "Wrong size on EffectMain_C_PodEffectEEnded");
static_assert(offsetof(EffectMain_C_PodEffectEEnded, Effect) == 0x000000, "Member 'EffectMain_C_PodEffectEEnded::Effect' has a wrong offset!");

// Function EffectMain.EffectMain_C.StartEffect
// 0x0040 (0x0040 - 0x0000)
struct EffectMain_C_StartEffect final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEffectContructor                      CallFunc_Array_Get_Item;                           // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UEffect_C*                              CallFunc_SpawnObject_ReturnValue;                  // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Start_StatValue_ImplicitCast;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Start_Duration_ImplicitCast;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EffectMain_C_StartEffect) == 0x000008, "Wrong alignment on EffectMain_C_StartEffect");
static_assert(sizeof(EffectMain_C_StartEffect) == 0x000040, "Wrong size on EffectMain_C_StartEffect");
static_assert(offsetof(EffectMain_C_StartEffect, Temp_int_Array_Index_Variable) == 0x000000, "Member 'EffectMain_C_StartEffect::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(EffectMain_C_StartEffect, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'EffectMain_C_StartEffect::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(EffectMain_C_StartEffect, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'EffectMain_C_StartEffect::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EffectMain_C_StartEffect, CallFunc_Array_Get_Item) == 0x00000C, "Member 'EffectMain_C_StartEffect::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(EffectMain_C_StartEffect, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'EffectMain_C_StartEffect::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(EffectMain_C_StartEffect, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'EffectMain_C_StartEffect::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EffectMain_C_StartEffect, CallFunc_SpawnObject_ReturnValue) == 0x000020, "Member 'EffectMain_C_StartEffect::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(EffectMain_C_StartEffect, CallFunc_Array_Add_ReturnValue) == 0x000028, "Member 'EffectMain_C_StartEffect::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(EffectMain_C_StartEffect, CallFunc_Start_StatValue_ImplicitCast) == 0x000030, "Member 'EffectMain_C_StartEffect::CallFunc_Start_StatValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(EffectMain_C_StartEffect, CallFunc_Start_Duration_ImplicitCast) == 0x000038, "Member 'EffectMain_C_StartEffect::CallFunc_Start_Duration_ImplicitCast' has a wrong offset!");

}

