#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ElectricityBlockerListener

#include "Basic.hpp"


namespace SDK::Params
{

// Function ElectricityBlockerListener.ElectricityBlockerListener_C.AddBlocker
// 0x0008 (0x0008 - 0x0000)
struct ElectricityBlockerListener_C_AddBlocker final
{
public:
	class AElectricityBlocker_C*                  Blocker;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ElectricityBlockerListener_C_AddBlocker) == 0x000008, "Wrong alignment on ElectricityBlockerListener_C_AddBlocker");
static_assert(sizeof(ElectricityBlockerListener_C_AddBlocker) == 0x000008, "Wrong size on ElectricityBlockerListener_C_AddBlocker");
static_assert(offsetof(ElectricityBlockerListener_C_AddBlocker, Blocker) == 0x000000, "Member 'ElectricityBlockerListener_C_AddBlocker::Blocker' has a wrong offset!");

// Function ElectricityBlockerListener.ElectricityBlockerListener_C.OnBreakBlocker
// 0x0008 (0x0008 - 0x0000)
struct ElectricityBlockerListener_C_OnBreakBlocker final
{
public:
	class AElectricityBlocker_C*                  Blocker;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ElectricityBlockerListener_C_OnBreakBlocker) == 0x000008, "Wrong alignment on ElectricityBlockerListener_C_OnBreakBlocker");
static_assert(sizeof(ElectricityBlockerListener_C_OnBreakBlocker) == 0x000008, "Wrong size on ElectricityBlockerListener_C_OnBreakBlocker");
static_assert(offsetof(ElectricityBlockerListener_C_OnBreakBlocker, Blocker) == 0x000000, "Member 'ElectricityBlockerListener_C_OnBreakBlocker::Blocker' has a wrong offset!");

}

