#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ElectricityGenerator

#include "Basic.hpp"


namespace SDK::Params
{

// Function ElectricityGenerator.ElectricityGenerator_C.AddBlocker
// 0x0008 (0x0008 - 0x0000)
struct ElectricityGenerator_C_AddBlocker final
{
public:
	class AElectricityBlocker_C*                  Blocker;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ElectricityGenerator_C_AddBlocker) == 0x000008, "Wrong alignment on ElectricityGenerator_C_AddBlocker");
static_assert(sizeof(ElectricityGenerator_C_AddBlocker) == 0x000008, "Wrong size on ElectricityGenerator_C_AddBlocker");
static_assert(offsetof(ElectricityGenerator_C_AddBlocker, Blocker) == 0x000000, "Member 'ElectricityGenerator_C_AddBlocker::Blocker' has a wrong offset!");

// Function ElectricityGenerator.ElectricityGenerator_C.AddListener
// 0x0018 (0x0018 - 0x0000)
struct ElectricityGenerator_C_AddListener final
{
public:
	TScriptInterface<class IElectricityConsumer_C> Listener;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ElectricityGenerator_C_AddListener) == 0x000008, "Wrong alignment on ElectricityGenerator_C_AddListener");
static_assert(sizeof(ElectricityGenerator_C_AddListener) == 0x000018, "Wrong size on ElectricityGenerator_C_AddListener");
static_assert(offsetof(ElectricityGenerator_C_AddListener, Listener) == 0x000000, "Member 'ElectricityGenerator_C_AddListener::Listener' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_AddListener, CallFunc_Array_Add_ReturnValue) == 0x000010, "Member 'ElectricityGenerator_C_AddListener::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function ElectricityGenerator.ElectricityGenerator_C.ExecuteUbergraph_ElectricityGenerator
// 0x0210 (0x0210 - 0x0000)
struct ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFMODAudioComponent*                    CallFunc_FMODPlayEventAttached_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_5;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_6;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_Player;                               // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsToggled;                            // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ARectLight*>                     CallFunc_GetAllActorsOfClassWithTag_OutActors;     // 0x0060(0x0010)(ReferenceParm)
	TArray<class APointLight*>                    CallFunc_GetAllActorsOfClassWithTag_OutActors_1;   // 0x0070(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ARectLight*                             K2Node_DynamicCast_AsRect_Light;                   // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APointLight*                            K2Node_DynamicCast_AsPoint_Light;                  // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_2;                         // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ARectLight*                             K2Node_DynamicCast_AsRect_Light_1;                 // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2[0x2];                                       // 0x00D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_5;                  // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AElectricityBlocker_C*                  K2Node_Event_Blocker_1;                            // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AElectricityBlocker_C*                  K2Node_Event_Blocker;                              // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_7;                 // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_6;                  // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10E[0x2];                                      // 0x010E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_8;                 // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IElectricityBlockerListener_C> CallFunc_AddListener_Listener_CastInput;           // 0x0118(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_7;                  // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_9;                 // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITogglerListener_C>    CallFunc_SetListener_Listener_CastInput;           // 0x0138(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASimpleDoor_C*                          CallFunc_Array_Get_Item_3;                         // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IElectricityConsumer_C> CallFunc_SubscribeToGenerator_self_CastInput;      // 0x0158(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IElectricityConsumer_C> CallFunc_SubscribeToGenerator_self_CastInput_1;    // 0x0170(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVoiceMessageSpeaker_C*                 CallFunc_Array_Get_Item_4;                         // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IPCTextInteractListener_C> CallFunc_AddListener_Listener_CastInput_1;         // 0x0198(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AElectricityBlocker_C*                  CallFunc_Array_Get_Item_5;                         // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_6;               // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_6;                // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BD[0x3];                                      // 0x01BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IElectricityBlockerListener_C> CallFunc_AddBlocker_self_CastInput;                // 0x01C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AInactiveDoor_C*                        CallFunc_Array_Get_Item_6;                         // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_7;               // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DC[0x4];                                      // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IElectricityConsumer_C> CallFunc_SubscribeToGenerator_self_CastInput_2;    // 0x01E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_7;                // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x3];                                      // 0x01F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_7;                   // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_7;                         // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APointLight*                            K2Node_DynamicCast_AsPoint_Light_1;                // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator) == 0x000008, "Wrong alignment on ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator");
static_assert(sizeof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator) == 0x000210, "Wrong size on ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, EntryPoint) == 0x000000, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::EntryPoint' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, CallFunc_FMODPlayEventAttached_ReturnValue) == 0x000008, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::CallFunc_FMODPlayEventAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, Temp_int_Array_Index_Variable) == 0x000010, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, Temp_int_Array_Index_Variable_1) == 0x00001C, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, Temp_int_Loop_Counter_Variable_1) == 0x000020, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, CallFunc_Add_IntInt_ReturnValue_1) == 0x000024, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, Temp_int_Array_Index_Variable_2) == 0x000028, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, Temp_int_Loop_Counter_Variable_2) == 0x00002C, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, CallFunc_Add_IntInt_ReturnValue_2) == 0x000030, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, Temp_int_Array_Index_Variable_3) == 0x000034, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, Temp_int_Loop_Counter_Variable_3) == 0x000038, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, CallFunc_Add_IntInt_ReturnValue_3) == 0x00003C, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, Temp_int_Array_Index_Variable_4) == 0x000040, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, Temp_int_Array_Index_Variable_5) == 0x000044, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::Temp_int_Array_Index_Variable_5' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, Temp_int_Array_Index_Variable_6) == 0x000048, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::Temp_int_Array_Index_Variable_6' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, K2Node_Event_Player) == 0x000050, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::K2Node_Event_Player' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, K2Node_Event_IsToggled) == 0x000058, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::K2Node_Event_IsToggled' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, CallFunc_GetAllActorsOfClassWithTag_OutActors) == 0x000060, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::CallFunc_GetAllActorsOfClassWithTag_OutActors' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, CallFunc_GetAllActorsOfClassWithTag_OutActors_1) == 0x000070, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::CallFunc_GetAllActorsOfClassWithTag_OutActors_1' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, CallFunc_Array_Get_Item) == 0x000080, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, CallFunc_Array_Get_Item_1) == 0x000088, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, K2Node_DynamicCast_AsRect_Light) == 0x000090, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::K2Node_DynamicCast_AsRect_Light' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, K2Node_DynamicCast_AsPoint_Light) == 0x0000A0, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::K2Node_DynamicCast_AsPoint_Light' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, K2Node_DynamicCast_bSuccess_1) == 0x0000A8, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, CallFunc_Array_Add_ReturnValue) == 0x0000AC, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, CallFunc_Array_Add_ReturnValue_1) == 0x0000B0, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, CallFunc_Array_Length_ReturnValue) == 0x0000B4, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, CallFunc_Array_Length_ReturnValue_1) == 0x0000B8, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, Temp_int_Loop_Counter_Variable_4) == 0x0000BC, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::Temp_int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, CallFunc_Array_Get_Item_2) == 0x0000C0, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, K2Node_DynamicCast_AsRect_Light_1) == 0x0000C8, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::K2Node_DynamicCast_AsRect_Light_1' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, K2Node_DynamicCast_bSuccess_2) == 0x0000D0, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, CallFunc_Less_IntInt_ReturnValue) == 0x0000D1, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, CallFunc_Add_IntInt_ReturnValue_4) == 0x0000D4, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, CallFunc_Array_Length_ReturnValue_2) == 0x0000D8, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000DC, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, CallFunc_Array_Length_ReturnValue_3) == 0x0000E0, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, Temp_int_Loop_Counter_Variable_5) == 0x0000E4, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::Temp_int_Loop_Counter_Variable_5' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, CallFunc_Add_IntInt_ReturnValue_5) == 0x0000E8, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, K2Node_Event_Blocker_1) == 0x0000F0, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::K2Node_Event_Blocker_1' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, K2Node_Event_Blocker) == 0x0000F8, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::K2Node_Event_Blocker' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, CallFunc_Add_IntInt_ReturnValue_6) == 0x000100, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::CallFunc_Add_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, CallFunc_Add_IntInt_ReturnValue_7) == 0x000104, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::CallFunc_Add_IntInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, Temp_int_Loop_Counter_Variable_6) == 0x000108, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::Temp_int_Loop_Counter_Variable_6' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00010C, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, CallFunc_Less_IntInt_ReturnValue_2) == 0x00010D, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, CallFunc_Add_IntInt_ReturnValue_8) == 0x000110, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::CallFunc_Add_IntInt_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, CallFunc_AddListener_Listener_CastInput) == 0x000118, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::CallFunc_AddListener_Listener_CastInput' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, Temp_int_Loop_Counter_Variable_7) == 0x000128, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::Temp_int_Loop_Counter_Variable_7' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, CallFunc_Less_IntInt_ReturnValue_3) == 0x00012C, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, CallFunc_Add_IntInt_ReturnValue_9) == 0x000130, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::CallFunc_Add_IntInt_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, CallFunc_SetListener_Listener_CastInput) == 0x000138, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::CallFunc_SetListener_Listener_CastInput' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, CallFunc_Array_Get_Item_3) == 0x000148, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, CallFunc_Array_Length_ReturnValue_4) == 0x000150, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, CallFunc_SubscribeToGenerator_self_CastInput) == 0x000158, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::CallFunc_SubscribeToGenerator_self_CastInput' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, CallFunc_Less_IntInt_ReturnValue_4) == 0x000168, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::CallFunc_Less_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, CallFunc_SubscribeToGenerator_self_CastInput_1) == 0x000170, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::CallFunc_SubscribeToGenerator_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, CallFunc_IsValid_ReturnValue) == 0x000180, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, CallFunc_Array_Get_Item_4) == 0x000188, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, CallFunc_Array_Length_ReturnValue_5) == 0x000190, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::CallFunc_Array_Length_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, CallFunc_AddListener_Listener_CastInput_1) == 0x000198, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::CallFunc_AddListener_Listener_CastInput_1' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, CallFunc_Less_IntInt_ReturnValue_5) == 0x0001A8, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::CallFunc_Less_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, CallFunc_Array_Get_Item_5) == 0x0001B0, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, CallFunc_Array_Length_ReturnValue_6) == 0x0001B8, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::CallFunc_Array_Length_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, CallFunc_Less_IntInt_ReturnValue_6) == 0x0001BC, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::CallFunc_Less_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, CallFunc_AddBlocker_self_CastInput) == 0x0001C0, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::CallFunc_AddBlocker_self_CastInput' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, CallFunc_Array_Get_Item_6) == 0x0001D0, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::CallFunc_Array_Get_Item_6' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, CallFunc_Array_Length_ReturnValue_7) == 0x0001D8, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::CallFunc_Array_Length_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, CallFunc_SubscribeToGenerator_self_CastInput_2) == 0x0001E0, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::CallFunc_SubscribeToGenerator_self_CastInput_2' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, CallFunc_Less_IntInt_ReturnValue_7) == 0x0001F0, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::CallFunc_Less_IntInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, Temp_int_Array_Index_Variable_7) == 0x0001F4, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::Temp_int_Array_Index_Variable_7' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, CallFunc_Array_Get_Item_7) == 0x0001F8, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::CallFunc_Array_Get_Item_7' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, K2Node_DynamicCast_AsPoint_Light_1) == 0x000200, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::K2Node_DynamicCast_AsPoint_Light_1' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator, K2Node_DynamicCast_bSuccess_3) == 0x000208, "Member 'ElectricityGenerator_C_ExecuteUbergraph_ElectricityGenerator::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");

// Function ElectricityGenerator.ElectricityGenerator_C.OnBreakBlocker
// 0x0008 (0x0008 - 0x0000)
struct ElectricityGenerator_C_OnBreakBlocker final
{
public:
	class AElectricityBlocker_C*                  Blocker;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ElectricityGenerator_C_OnBreakBlocker) == 0x000008, "Wrong alignment on ElectricityGenerator_C_OnBreakBlocker");
static_assert(sizeof(ElectricityGenerator_C_OnBreakBlocker) == 0x000008, "Wrong size on ElectricityGenerator_C_OnBreakBlocker");
static_assert(offsetof(ElectricityGenerator_C_OnBreakBlocker, Blocker) == 0x000000, "Member 'ElectricityGenerator_C_OnBreakBlocker::Blocker' has a wrong offset!");

// Function ElectricityGenerator.ElectricityGenerator_C.OnToggle
// 0x0010 (0x0010 - 0x0000)
struct ElectricityGenerator_C_OnToggle final
{
public:
	class APawn*                                  Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsToggled;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ElectricityGenerator_C_OnToggle) == 0x000008, "Wrong alignment on ElectricityGenerator_C_OnToggle");
static_assert(sizeof(ElectricityGenerator_C_OnToggle) == 0x000010, "Wrong size on ElectricityGenerator_C_OnToggle");
static_assert(offsetof(ElectricityGenerator_C_OnToggle, Player) == 0x000000, "Member 'ElectricityGenerator_C_OnToggle::Player' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_OnToggle, IsToggled) == 0x000008, "Member 'ElectricityGenerator_C_OnToggle::IsToggled' has a wrong offset!");

// Function ElectricityGenerator.ElectricityGenerator_C.SendElectricityToConsumers
// 0x0028 (0x0028 - 0x0000)
struct ElectricityGenerator_C_SendElectricityToConsumers final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IElectricityConsumer_C> CallFunc_Array_Get_Item;                           // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ElectricityGenerator_C_SendElectricityToConsumers) == 0x000008, "Wrong alignment on ElectricityGenerator_C_SendElectricityToConsumers");
static_assert(sizeof(ElectricityGenerator_C_SendElectricityToConsumers) == 0x000028, "Wrong size on ElectricityGenerator_C_SendElectricityToConsumers");
static_assert(offsetof(ElectricityGenerator_C_SendElectricityToConsumers, Temp_int_Array_Index_Variable) == 0x000000, "Member 'ElectricityGenerator_C_SendElectricityToConsumers::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ElectricityGenerator_C_SendElectricityToConsumers, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'ElectricityGenerator_C_SendElectricityToConsumers::Temp_int_Loop_Counter_Variable' has a wrong offset!");
