#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ElectricityConsumer

#include "Basic.hpp"


namespace SDK::Params
{

// Function ElectricityConsumer.ElectricityConsumer_C.OnGeneratorEnabled
// 0x0008 (0x0008 - 0x0000)
struct ElectricityConsumer_C_OnGeneratorEnabled final
{
public:
	class ASurvivalPlayer_C*                      Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ElectricityConsumer_C_OnGeneratorEnabled) == 0x000008, "Wrong alignment on ElectricityConsumer_C_OnGeneratorEnabled");
static_assert(sizeof(ElectricityConsumer_C_OnGeneratorEnabled) == 0x000008, "Wrong size on ElectricityConsumer_C_OnGeneratorEnabled");
static_assert(offsetof(ElectricityConsumer_C_OnGeneratorEnabled, Player) == 0x000000, "Member 'ElectricityConsumer_C_OnGeneratorEnabled::Player' has a wrong offset!");

// Function ElectricityConsumer.ElectricityConsumer_C.SubscribeToGenerator
// 0x0008 (0x0008 - 0x0000)
struct ElectricityConsumer_C_SubscribeToGenerator final
{
public:
	class AElectricityGenerator_C*                Generator;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ElectricityConsumer_C_SubscribeToGenerator) == 0x000008, "Wrong alignment on ElectricityConsumer_C_SubscribeToGenerator");
static_assert(sizeof(ElectricityConsumer_C_SubscribeToGenerator) == 0x000008, "Wrong size on ElectricityConsumer_C_SubscribeToGenerator");
static_assert(offsetof(ElectricityConsumer_C_SubscribeToGenerator, Generator) == 0x000000, "Member 'ElectricityConsumer_C_SubscribeToGenerator::Generator' has a wrong offset!");

}

