#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ElectricityBlocker

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ElectricityBlocker.ElectricityBlocker_C.AddListener
// 0x0018 (0x0018 - 0x0000)
struct ElectricityBlocker_C_AddListener final
{
public:
	TScriptInterface<class IElectricityBlockerListener_C> Listener;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ElectricityBlocker_C_AddListener) == 0x000008, "Wrong alignment on ElectricityBlocker_C_AddListener");
static_assert(sizeof(ElectricityBlocker_C_AddListener) == 0x000018, "Wrong size on ElectricityBlocker_C_AddListener");
static_assert(offsetof(ElectricityBlocker_C_AddListener, Listener) == 0x000000, "Member 'ElectricityBlocker_C_AddListener::Listener' has a wrong offset!");
static_assert(offsetof(ElectricityBlocker_C_AddListener, CallFunc_Array_Add_ReturnValue) == 0x000010, "Member 'ElectricityBlocker_C_AddListener::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function ElectricityBlocker.ElectricityBlocker_C.ExecuteUbergraph_ElectricityBlocker
// 0x00E8 (0x00E8 - 0x0000)
struct ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Damage;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UDamageType*                      K2Node_Event_DamageType;                           // 0x0008(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AController*                            K2Node_Event_InstigatedBy;                         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFMODAudioComponent*                    CallFunc_PlayEventAttached_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IElectricityBlockerListener_C> CallFunc_Array_Get_Item;                           // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue_1;    // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C2[0x2];                                       // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetIntensity_NewIntensity_ImplicitCast;   // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetIntensity_NewIntensity_ImplicitCast_1; // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker) == 0x000008, "Wrong alignment on ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker");
static_assert(sizeof(ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker) == 0x0000E8, "Wrong size on ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker");
static_assert(offsetof(ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker, EntryPoint) == 0x000000, "Member 'ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker::EntryPoint' has a wrong offset!");
static_assert(offsetof(ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker, K2Node_Event_Damage) == 0x000004, "Member 'ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker, K2Node_Event_DamageType) == 0x000008, "Member 'ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker::K2Node_Event_DamageType' has a wrong offset!");
static_assert(offsetof(ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker, K2Node_Event_InstigatedBy) == 0x000010, "Member 'ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker, K2Node_Event_DamageCauser) == 0x000018, "Member 'ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000028, "Member 'ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker, K2Node_DynamicCast_AsSurvival_Player) == 0x000030, "Member 'ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker, CallFunc_PlayEventAttached_ReturnValue) == 0x000040, "Member 'ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker::CallFunc_PlayEventAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker, Temp_int_Array_Index_Variable) == 0x000048, "Member 'ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker, CallFunc_Array_Get_Item) == 0x000050, "Member 'ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000060, "Member 'ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker, CallFunc_HasAuthority_ReturnValue) == 0x000068, "Member 'ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000070, "Member 'ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker, K2Node_Event_DeltaSeconds) == 0x000088, "Member 'ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000090, "Member 'ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000098, "Member 'ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0000A0, "Member 'ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker, CallFunc_FClamp_ReturnValue) == 0x0000A8, "Member 'ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0000B0, "Member 'ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker, CallFunc_FClamp_ReturnValue_1) == 0x0000B8, "Member 'ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x0000C0, "Member 'ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker, CallFunc_EqualEqual_DoubleDouble_ReturnValue_1) == 0x0000C1, "Member 'ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker::CallFunc_EqualEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker, Temp_int_Loop_Counter_Variable) == 0x0000C4, "Member 'ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker, CallFunc_Less_IntInt_ReturnValue) == 0x0000C8, "Member 'ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker, CallFunc_Add_IntInt_ReturnValue) == 0x0000CC, "Member 'ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker, CallFunc_SetIntensity_NewIntensity_ImplicitCast) == 0x0000D0, "Member 'ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker::CallFunc_SetIntensity_NewIntensity_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x0000D8, "Member 'ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker, CallFunc_SetIntensity_NewIntensity_ImplicitCast_1) == 0x0000E0, "Member 'ElectricityBlocker_C_ExecuteUbergraph_ElectricityBlocker::CallFunc_SetIntensity_NewIntensity_ImplicitCast_1' has a wrong offset!");

// Function ElectricityBlocker.ElectricityBlocker_C.ReceiveAnyDamage
// 0x0020 (0x0020 - 0x0000)
struct ElectricityBlocker_C_ReceiveAnyDamage final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UDamageType*                      DamageType;                                        // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AController*                            InstigatedBy;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ElectricityBlocker_C_ReceiveAnyDamage) == 0x000008, "Wrong alignment on ElectricityBlocker_C_ReceiveAnyDamage");
static_assert(sizeof(ElectricityBlocker_C_ReceiveAnyDamage) == 0x000020, "Wrong size on ElectricityBlocker_C_ReceiveAnyDamage");
static_assert(offsetof(ElectricityBlocker_C_ReceiveAnyDamage, Damage) == 0x000000, "Member 'ElectricityBlocker_C_ReceiveAnyDamage::Damage' has a wrong offset!");
static_assert(offsetof(ElectricityBlocker_C_ReceiveAnyDamage, DamageType) == 0x000008, "Member 'ElectricityBlocker_C_ReceiveAnyDamage::DamageType' has a wrong offset!");
static_assert(offsetof(ElectricityBlocker_C_ReceiveAnyDamage, InstigatedBy) == 0x000010, "Member 'ElectricityBlocker_C_ReceiveAnyDamage::InstigatedBy' has a wrong offset!");
static_assert(offsetof(ElectricityBlocker_C_ReceiveAnyDamage, DamageCauser) == 0x000018, "Member 'ElectricityBlocker_C_ReceiveAnyDamage::DamageCauser' has a wrong offset!");

// Function ElectricityBlocker.ElectricityBlocker_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct ElectricityBlocker_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ElectricityBlocker_C_ReceiveTick) == 0x000004, "Wrong alignment on ElectricityBlocker_C_ReceiveTick");
static_assert(sizeof(ElectricityBlocker_C_ReceiveTick) == 0x000004, "Wrong size on ElectricityBlocker_C_ReceiveTick");
static_assert(offsetof(ElectricityBlocker_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'ElectricityBlocker_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

