#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ElevatorTeleportV2

#include "Basic.hpp"

#include "E_InteractType_structs.hpp"
#include "Teleport_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ElevatorTeleportState_structs.hpp"
#include "E_ActorType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass ElevatorTeleportV2.ElevatorTeleportV2_C
// 0x01D8 (0x04E0 - 0x0308)
class AElevatorTeleportV2_C final : public ATeleport_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_ElevatorTeleportV2_C;               // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SDoor1;                                            // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Mesh1;                                             // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   InnerPanel;                                        // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Blocker;                                           // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        AcceptPoint;                                       // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SDoor2;                                            // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          BoxDoorCollision;                                  // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight3;                                        // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight2;                                        // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight1;                                        // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight;                                         // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube3;                                             // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube4;                                             // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube2;                                             // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube1;                                             // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube;                                              // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh2;                                       // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ElevatorTeleportState                         State;                                             // 0x03A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        AutoCloseDoorsTimeout;                             // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SpentTimeSinceDoorsOpened;                         // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TeleportTimeout;                                   // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SpentTimeSincePreparingToTeleport;                 // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RecieveActorsTimeout;                              // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SpentTimeSinceRecieveActors;                       // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WaitUntilActorsLeave;                              // 0x03E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E1[0x7];                                      // 0x03E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AElevatorTeleportPanel_C*               Panel;                                             // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Test;                                              // 0x03F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DontHandleExit;                                    // 0x03F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TeleportOnClose;                                   // 0x03F2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F3[0x5];                                      // 0x03F3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        OpenDoorsPause;                                    // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Accum;                                             // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BeginOpenHandled;                                  // 0x0408(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AutoOpenAndHold;                                   // 0x0409(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40A[0x6];                                      // 0x040A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      TeleportedActor;                                   // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NewLocationTeleportedActor;                        // 0x0418(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsElevatorBusy;                                   // 0x0430(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_431[0x7];                                      // 0x0431(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IElevatorTeleportRecieverV2_C> Reciever;                                          // 0x0438(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 RecieverActor;                                     // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Door1ClosedLocation;                               // 0x0450(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Door2ClosedLocation;                               // 0x0468(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Door1OpenedLocation;                               // 0x0480(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Door2OpenedLocation;                               // 0x0498(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DoorOffset;                                        // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DoorsLerpAlpha;                                    // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DoorsSpeed;                                        // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFMODAudioComponent*                    MoveSound;                                         // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USmoothSync*                            TeleportedActorSmoothSync;                         // 0x04D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           DelayedClose;                                      // 0x04D8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BeginOpeningDoors();
	void BndEvt__ElevatorTeleport_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__ElevatorTeleport_Box_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__ElevatorTeleport_BoxDoorCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void CanRecieveActors(bool* CanRecieve);
	void CloseDoorDelayed();
	void CloseDoors();
	void DestroyInteractable();
	void DisableInnerPanel();
	void EnableInnerPanel();
	void ExecuteUbergraph_ElevatorTeleportV2(int32 EntryPoint);
	void GetActorType(E_ActorType* ActorType);
	void GetDestination(struct FVector* Param_Destination);
	void GetRotation(struct FRotator* Rotation);
	void HasActorsInside(bool* HasActors);
	void HideBlocker();
	void IsLocked_(bool* Result);
	void OnBeginInteract(class APawn* Player);
	void OnClosingDoors();
	void OnDoorsClosed();
	void OnDoorsOpened();
	void OnFocused(class APawn* Player, class AActor* HighlightActor, class UActorComponent* HighlightActorComponent, E_InteractType* InteractType, double* LateTime);
	void OnInteract(class APawn* Player);
	void OnInteract2(class APawn* Player);
	void OnInteract3(class APawn* Player);
	void OnInteractVehicle(class APawn* Player, int32 SitIndex, bool SkipAnimation);
	void OnLocalInteract(class APawn* Player);
	void OnLostFocus(class APawn* Player);
	void OnOpeningDoors();
	void OnPreparingTeleport();
	void OnSeen(class APawn* Player);
	void OnSquadCheckComplete();
	void OnStopInteract(class APawn* Player);
	void OnTeleportTimeout();
	void OpenDoors(bool Param_WaitUntilActorsLeave);
	void PrepareForRecieve();
	void PreRecieve();
	void ProcessClosingDoorsState(double DeltaTime);
	void ProcessOpenedState(double DeltaTime);
	void ProcessOpeningDoorsState(double DeltaTime);
	void ProcessPreparingToTeleportState(double DeltaTime);
	void ProcessRecievingActorsState(double DeltaTime);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void RecieveActors(class ATeleport_C* Sender);
	void RecieverCanAcceptActors(bool* CanRecieve);
	void Run_Lockpicking();
	void Set3DWidgetVisibility(bool Visible);
	void SetDoorCollisionOff();
	void SetDoorCollisionOn();
	void SetElevatorBusy(class AActor* InitialActor);
	void SetElevatorDestination(class AActor* ElevatorDestination);
	void SetElevatorNotBusy(class AActor* InitialActor);
	void SetState(ElevatorTeleportState Param_State);
	void SetTutorial3DWidgetVisibility(bool Visible);
	void ShowBlocker();
	void TeleportActor(class AActor* Actor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ElevatorTeleportV2_C">();
	}
	static class AElevatorTeleportV2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AElevatorTeleportV2_C>();
	}
};
static_assert(alignof(AElevatorTeleportV2_C) == 0x000008, "Wrong alignment on AElevatorTeleportV2_C");
static_assert(sizeof(AElevatorTeleportV2_C) == 0x0004E0, "Wrong size on AElevatorTeleportV2_C");
static_assert(offsetof(AElevatorTeleportV2_C, UberGraphFrame_ElevatorTeleportV2_C) == 0x000308, "Member 'AElevatorTeleportV2_C::UberGraphFrame_ElevatorTeleportV2_C' has a wrong offset!");
static_assert(offsetof(AElevatorTeleportV2_C, StaticMesh) == 0x000310, "Member 'AElevatorTeleportV2_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AElevatorTeleportV2_C, SDoor1) == 0x000318, "Member 'AElevatorTeleportV2_C::SDoor1' has a wrong offset!");
static_assert(offsetof(AElevatorTeleportV2_C, Mesh1) == 0x000320, "Member 'AElevatorTeleportV2_C::Mesh1' has a wrong offset!");
static_assert(offsetof(AElevatorTeleportV2_C, InnerPanel) == 0x000328, "Member 'AElevatorTeleportV2_C::InnerPanel' has a wrong offset!");
static_assert(offsetof(AElevatorTeleportV2_C, Blocker) == 0x000330, "Member 'AElevatorTeleportV2_C::Blocker' has a wrong offset!");
static_assert(offsetof(AElevatorTeleportV2_C, AcceptPoint) == 0x000338, "Member 'AElevatorTeleportV2_C::AcceptPoint' has a wrong offset!");
static_assert(offsetof(AElevatorTeleportV2_C, StaticMesh1) == 0x000340, "Member 'AElevatorTeleportV2_C::StaticMesh1' has a wrong offset!");
static_assert(offsetof(AElevatorTeleportV2_C, SDoor2) == 0x000348, "Member 'AElevatorTeleportV2_C::SDoor2' has a wrong offset!");
static_assert(offsetof(AElevatorTeleportV2_C, BoxDoorCollision) == 0x000350, "Member 'AElevatorTeleportV2_C::BoxDoorCollision' has a wrong offset!");
static_assert(offsetof(AElevatorTeleportV2_C, SpotLight3) == 0x000358, "Member 'AElevatorTeleportV2_C::SpotLight3' has a wrong offset!");
static_assert(offsetof(AElevatorTeleportV2_C, SpotLight2) == 0x000360, "Member 'AElevatorTeleportV2_C::SpotLight2' has a wrong offset!");
static_assert(offsetof(AElevatorTeleportV2_C, SpotLight1) == 0x000368, "Member 'AElevatorTeleportV2_C::SpotLight1' has a wrong offset!");
static_assert(offsetof(AElevatorTeleportV2_C, SpotLight) == 0x000370, "Member 'AElevatorTeleportV2_C::SpotLight' has a wrong offset!");
static_assert(offsetof(AElevatorTeleportV2_C, Cube3) == 0x000378, "Member 'AElevatorTeleportV2_C::Cube3' has a wrong offset!");
static_assert(offsetof(AElevatorTeleportV2_C, Cube4) == 0x000380, "Member 'AElevatorTeleportV2_C::Cube4' has a wrong offset!");
static_assert(offsetof(AElevatorTeleportV2_C, Cube2) == 0x000388, "Member 'AElevatorTeleportV2_C::Cube2' has a wrong offset!");
static_assert(offsetof(AElevatorTeleportV2_C, Cube1) == 0x000390, "Member 'AElevatorTeleportV2_C::Cube1' has a wrong offset!");
static_assert(offsetof(AElevatorTeleportV2_C, Cube) == 0x000398, "Member 'AElevatorTeleportV2_C::Cube' has a wrong offset!");
static_assert(offsetof(AElevatorTeleportV2_C, StaticMesh2) == 0x0003A0, "Member 'AElevatorTeleportV2_C::StaticMesh2' has a wrong offset!");
static_assert(offsetof(AElevatorTeleportV2_C, State) == 0x0003A8, "Member 'AElevatorTeleportV2_C::State' has a wrong offset!");
static_assert(offsetof(AElevatorTeleportV2_C, AutoCloseDoorsTimeout) == 0x0003B0, "Member 'AElevatorTeleportV2_C::AutoCloseDoorsTimeout' has a wrong offset!");
static_assert(offsetof(AElevatorTeleportV2_C, SpentTimeSinceDoorsOpened) == 0x0003B8, "Member 'AElevatorTeleportV2_C::SpentTimeSinceDoorsOpened' has a wrong offset!");
static_assert(offsetof(AElevatorTeleportV2_C, TeleportTimeout) == 0x0003C0, "Member 'AElevatorTeleportV2_C::TeleportTimeout' has a wrong offset!");
static_assert(offsetof(AElevatorTeleportV2_C, SpentTimeSincePreparingToTeleport) == 0x0003C8, "Member 'AElevatorTeleportV2_C::SpentTimeSincePreparingToTeleport' has a wrong offset!");
static_assert(offsetof(AElevatorTeleportV2_C, RecieveActorsTimeout) == 0x0003D0, "Member 'AElevatorTeleportV2_C::RecieveActorsTimeout' has a wrong offset!");
static_assert(offsetof(AElevatorTeleportV2_C, SpentTimeSinceRecieveActors) == 0x0003D8, "Member 'AElevatorTeleportV2_C::SpentTimeSinceRecieveActors' has a wrong offset!");
static_assert(offsetof(AElevatorTeleportV2_C, WaitUntilActorsLeave) == 0x0003E0, "Member 'AElevatorTeleportV2_C::WaitUntilActorsLeave' has a wrong offset!");
static_assert(offsetof(AElevatorTeleportV2_C, Panel) == 0x0003E8, "Member 'AElevatorTeleportV2_C::Panel' has a wrong offset!");
static_assert(offsetof(AElevatorTeleportV2_C, Test) == 0x0003F0, "Member 'AElevatorTeleportV2_C::Test' has a wrong offset!");
static_assert(offsetof(AElevatorTeleportV2_C, DontHandleExit) == 0x0003F1, "Member 'AElevatorTeleportV2_C::DontHandleExit' has a wrong offset!");
static_assert(offsetof(AElevatorTeleportV2_C, TeleportOnClose) == 0x0003F2, "Member 'AElevatorTeleportV2_C::TeleportOnClose' has a wrong offset!");
static_assert(offsetof(AElevatorTeleportV2_C, OpenDoorsPause) == 0x0003F8, "Member 'AElevatorTeleportV2_C::OpenDoorsPause' has a wrong offset!");
static_assert(offsetof(AElevatorTeleportV2_C, Accum) == 0x000400, "Member 'AElevatorTeleportV2_C::Accum' has a wrong offset!");
static_assert(offsetof(AElevatorTeleportV2_C, BeginOpenHandled) == 0x000408, "Member 'AElevatorTeleportV2_C::BeginOpenHandled' has a wrong offset!");
static_assert(offsetof(AElevatorTeleportV2_C, AutoOpenAndHold) == 0x000409, "Member 'AElevatorTeleportV2_C::AutoOpenAndHold' has a wrong offset!");
static_assert(offsetof(AElevatorTeleportV2_C, TeleportedActor) == 0x000410, "Member 'AElevatorTeleportV2_C::TeleportedActor' has a wrong offset!");
static_assert(offsetof(AElevatorTeleportV2_C, NewLocationTeleportedActor) == 0x000418, "Member 'AElevatorTeleportV2_C::NewLocationTeleportedActor' has a wrong offset!");
static_assert(offsetof(AElevatorTeleportV2_C, bIsElevatorBusy) == 0x000430, "Member 'AElevatorTeleportV2_C::bIsElevatorBusy' has a wrong offset!");
static_assert(offsetof(AElevatorTeleportV2_C, Reciever) == 0x000438, "Member 'AElevatorTeleportV2_C::Reciever' has a wrong offset!");
static_assert(offsetof(AElevatorTeleportV2_C, RecieverActor) == 0x000448, "Member 'AElevatorTeleportV2_C::RecieverActor' has a wrong offset!");
static_assert(offsetof(AElevatorTeleportV2_C, Door1ClosedLocation) == 0x000450, "Member 'AElevatorTeleportV2_C::Door1ClosedLocation' has a wrong offset!");
static_assert(offsetof(AElevatorTeleportV2_C, Door2ClosedLocation) == 0x000468, "Member 'AElevatorTeleportV2_C::Door2ClosedLocation' has a wrong offset!");
static_assert(offsetof(AElevatorTeleportV2_C, Door1OpenedLocation) == 0x000480, "Member 'AElevatorTeleportV2_C::Door1OpenedLocation' has a wrong offset!");
static_assert(offsetof(AElevatorTeleportV2_C, Door2OpenedLocation) == 0x000498, "Member 'AElevatorTeleportV2_C::Door2OpenedLocation' has a wrong offset!");
static_assert(offsetof(AElevatorTeleportV2_C, DoorOffset) == 0x0004B0, "Member 'AElevatorTeleportV2_C::DoorOffset' has a wrong offset!");
static_assert(offsetof(AElevatorTeleportV2_C, DoorsLerpAlpha) == 0x0004B8, "Member 'AElevatorTeleportV2_C::DoorsLerpAlpha' has a wrong offset!");
static_assert(offsetof(AElevatorTeleportV2_C, DoorsSpeed) == 0x0004C0, "Member 'AElevatorTeleportV2_C::DoorsSpeed' has a wrong offset!");
static_assert(offsetof(AElevatorTeleportV2_C, MoveSound) == 0x0004C8, "Member 'AElevatorTeleportV2_C::MoveSound' has a wrong offset!");
static_assert(offsetof(AElevatorTeleportV2_C, TeleportedActorSmoothSync) == 0x0004D0, "Member 'AElevatorTeleportV2_C::TeleportedActorSmoothSync' has a wrong offset!");
static_assert(offsetof(AElevatorTeleportV2_C, DelayedClose) == 0x0004D8, "Member 'AElevatorTeleportV2_C::DelayedClose' has a wrong offset!");

}

