#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ElevatorTeleportV2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_InteractType_structs.hpp"
#include "E_ActorType_structs.hpp"
#include "ElevatorTeleportState_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ElevatorTeleportV2.ElevatorTeleportV2_C.BndEvt__ElevatorTeleport_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct ElevatorTeleportV2_C_BndEvt__ElevatorTeleport_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(ElevatorTeleportV2_C_BndEvt__ElevatorTeleport_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on ElevatorTeleportV2_C_BndEvt__ElevatorTeleport_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(ElevatorTeleportV2_C_BndEvt__ElevatorTeleport_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on ElevatorTeleportV2_C_BndEvt__ElevatorTeleport_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(ElevatorTeleportV2_C_BndEvt__ElevatorTeleport_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'ElevatorTeleportV2_C_BndEvt__ElevatorTeleport_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_BndEvt__ElevatorTeleport_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'ElevatorTeleportV2_C_BndEvt__ElevatorTeleport_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_BndEvt__ElevatorTeleport_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'ElevatorTeleportV2_C_BndEvt__ElevatorTeleport_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_BndEvt__ElevatorTeleport_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'ElevatorTeleportV2_C_BndEvt__ElevatorTeleport_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_BndEvt__ElevatorTeleport_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'ElevatorTeleportV2_C_BndEvt__ElevatorTeleport_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_BndEvt__ElevatorTeleport_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'ElevatorTeleportV2_C_BndEvt__ElevatorTeleport_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function ElevatorTeleportV2.ElevatorTeleportV2_C.BndEvt__ElevatorTeleport_Box_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct ElevatorTeleportV2_C_BndEvt__ElevatorTeleport_Box_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ElevatorTeleportV2_C_BndEvt__ElevatorTeleport_Box_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on ElevatorTeleportV2_C_BndEvt__ElevatorTeleport_Box_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(ElevatorTeleportV2_C_BndEvt__ElevatorTeleport_Box_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on ElevatorTeleportV2_C_BndEvt__ElevatorTeleport_Box_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(ElevatorTeleportV2_C_BndEvt__ElevatorTeleport_Box_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'ElevatorTeleportV2_C_BndEvt__ElevatorTeleport_Box_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_BndEvt__ElevatorTeleport_Box_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'ElevatorTeleportV2_C_BndEvt__ElevatorTeleport_Box_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_BndEvt__ElevatorTeleport_Box_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'ElevatorTeleportV2_C_BndEvt__ElevatorTeleport_Box_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_BndEvt__ElevatorTeleport_Box_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'ElevatorTeleportV2_C_BndEvt__ElevatorTeleport_Box_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function ElevatorTeleportV2.ElevatorTeleportV2_C.BndEvt__ElevatorTeleport_BoxDoorCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct ElevatorTeleportV2_C_BndEvt__ElevatorTeleport_BoxDoorCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(ElevatorTeleportV2_C_BndEvt__ElevatorTeleport_BoxDoorCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on ElevatorTeleportV2_C_BndEvt__ElevatorTeleport_BoxDoorCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(ElevatorTeleportV2_C_BndEvt__ElevatorTeleport_BoxDoorCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on ElevatorTeleportV2_C_BndEvt__ElevatorTeleport_BoxDoorCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(ElevatorTeleportV2_C_BndEvt__ElevatorTeleport_BoxDoorCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'ElevatorTeleportV2_C_BndEvt__ElevatorTeleport_BoxDoorCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_BndEvt__ElevatorTeleport_BoxDoorCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'ElevatorTeleportV2_C_BndEvt__ElevatorTeleport_BoxDoorCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_BndEvt__ElevatorTeleport_BoxDoorCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'ElevatorTeleportV2_C_BndEvt__ElevatorTeleport_BoxDoorCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_BndEvt__ElevatorTeleport_BoxDoorCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'ElevatorTeleportV2_C_BndEvt__ElevatorTeleport_BoxDoorCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_BndEvt__ElevatorTeleport_BoxDoorCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'ElevatorTeleportV2_C_BndEvt__ElevatorTeleport_BoxDoorCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_BndEvt__ElevatorTeleport_BoxDoorCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'ElevatorTeleportV2_C_BndEvt__ElevatorTeleport_BoxDoorCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function ElevatorTeleportV2.ElevatorTeleportV2_C.CanRecieveActors
// 0x0002 (0x0002 - 0x0000)
struct ElevatorTeleportV2_C_CanRecieveActors final
{
public:
	bool                                          CanRecieve;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ElevatorTeleportV2_C_CanRecieveActors) == 0x000001, "Wrong alignment on ElevatorTeleportV2_C_CanRecieveActors");
static_assert(sizeof(ElevatorTeleportV2_C_CanRecieveActors) == 0x000002, "Wrong size on ElevatorTeleportV2_C_CanRecieveActors");
static_assert(offsetof(ElevatorTeleportV2_C_CanRecieveActors, CanRecieve) == 0x000000, "Member 'ElevatorTeleportV2_C_CanRecieveActors::CanRecieve' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_CanRecieveActors, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000001, "Member 'ElevatorTeleportV2_C_CanRecieveActors::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function ElevatorTeleportV2.ElevatorTeleportV2_C.CloseDoorDelayed
// 0x0078 (0x0078 - 0x0000)
struct ElevatorTeleportV2_C_CloseDoorDelayed final
{
public:
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0000(0x0010)(ConstParm, ReferenceParm)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_HasActorsInside_HasActors;                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_BoxOverlapActors_OutActors;               // 0x0060(0x0010)(ReferenceParm)
	bool                                          CallFunc_BoxOverlapActors_ReturnValue;             // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ElevatorTeleportV2_C_CloseDoorDelayed) == 0x000008, "Wrong alignment on ElevatorTeleportV2_C_CloseDoorDelayed");
static_assert(sizeof(ElevatorTeleportV2_C_CloseDoorDelayed) == 0x000078, "Wrong size on ElevatorTeleportV2_C_CloseDoorDelayed");
static_assert(offsetof(ElevatorTeleportV2_C_CloseDoorDelayed, Temp_object_Variable) == 0x000000, "Member 'ElevatorTeleportV2_C_CloseDoorDelayed::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_CloseDoorDelayed, CallFunc_K2_SetTimer_ReturnValue) == 0x000010, "Member 'ElevatorTeleportV2_C_CloseDoorDelayed::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_CloseDoorDelayed, K2Node_MakeArray_Array) == 0x000018, "Member 'ElevatorTeleportV2_C_CloseDoorDelayed::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_CloseDoorDelayed, CallFunc_HasActorsInside_HasActors) == 0x000028, "Member 'ElevatorTeleportV2_C_CloseDoorDelayed::CallFunc_HasActorsInside_HasActors' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_CloseDoorDelayed, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000030, "Member 'ElevatorTeleportV2_C_CloseDoorDelayed::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_CloseDoorDelayed, CallFunc_Add_VectorVector_ReturnValue) == 0x000048, "Member 'ElevatorTeleportV2_C_CloseDoorDelayed::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_CloseDoorDelayed, CallFunc_BoxOverlapActors_OutActors) == 0x000060, "Member 'ElevatorTeleportV2_C_CloseDoorDelayed::CallFunc_BoxOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_CloseDoorDelayed, CallFunc_BoxOverlapActors_ReturnValue) == 0x000070, "Member 'ElevatorTeleportV2_C_CloseDoorDelayed::CallFunc_BoxOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_CloseDoorDelayed, CallFunc_Array_IsEmpty_ReturnValue) == 0x000071, "Member 'ElevatorTeleportV2_C_CloseDoorDelayed::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");

// Function ElevatorTeleportV2.ElevatorTeleportV2_C.ExecuteUbergraph_ElevatorTeleportV2
// 0x0738 (0x0738 - 0x0000)
struct ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasActorsInside_HasActors;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_InterfaceToObject_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFMODAudioComponent*                    CallFunc_FMODPlayEventAttached_ReturnValue;        // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UFMODAudioComponent*                    CallFunc_FMODPlayEventAttached_ReturnValue_1;      // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X_2;                          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_2;                          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_2;                          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E3[0x5];                                       // 0x00E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFMODAudioComponent*                    CallFunc_FMODPlayEventAttached_ReturnValue_2;      // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue_1;                  // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue_2;                  // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_InterfaceToObject_ReturnValue_1;     // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFMODAudioComponent*                    CallFunc_FMODPlayEventAttached_ReturnValue_3;      // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UFMODAudioComponent*                    CallFunc_FMODPlayEventAttached_ReturnValue_4;      // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Visible;                              // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0128(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Visible_1;                            // 0x0212(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_213[0x5];                                      // 0x0213(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_Player_1;                             // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_Player_2;                             // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_Player_3;                             // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_Player_4;                             // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_Player_5;                             // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SitIndex;                             // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_SkipAnimation;                        // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_245[0x3];                                      // 0x0245(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_Player_6;                             // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_Player_7;                             // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_Player_8;                             // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0260(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0270(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0280(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0288(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_2;  // 0x0290(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_2;           // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_2;            // 0x02A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_2;       // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep_1;           // 0x02AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AD[0x3];                                      // 0x02AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult_1;          // 0x02B0(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0398(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A1[0x7];                                      // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x03A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x03C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTeleportableActor_IsTeleportable;       // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D9[0x7];                                      // 0x03D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x03E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x03F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FA[0x6];                                      // 0x03FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0400(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0408(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0410(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x041C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41D[0x3];                                      // 0x041D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0420(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0508(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0510(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0518(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0520(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_524[0x4];                                      // 0x0524(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_V2_C*                   K2Node_DynamicCast_AsSurvival_Player_V2;           // 0x0528(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0530(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_531[0x7];                                      // 0x0531(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_V2_C*                   K2Node_DynamicCast_AsSurvival_Player_V2_1;         // 0x0538(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0540(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTeleportableActor_IsTeleportable_1;     // 0x0541(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_542[0x6];                                      // 0x0542(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ATeleport_C*                            K2Node_Event_Sender;                               // 0x0548(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_Player;                               // 0x0550(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Actor;                                // 0x0558(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult_1;     // 0x0560(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue_1;        // 0x0648(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_649[0x7];                                      // 0x0649(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0650(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0658(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_659[0x7];                                      // 0x0659(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0660(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_3;                          // 0x0678(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_3;                          // 0x0680(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_3;                          // 0x0688(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0690(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_691[0x7];                                      // 0x0691(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0698(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_2;      // 0x06A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_3;      // 0x06A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x06B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x06C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x06E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x06F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x0710(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_4;               // 0x0711(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_712[0x6];                                      // 0x0712(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_ProcessOpeningDoorsState_DeltaTime_ImplicitCast; // 0x0718(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_ProcessOpenedState_DeltaTime_ImplicitCast; // 0x0720(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_ProcessClosingDoorsState_DeltaTime_ImplicitCast; // 0x0728(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_ProcessPreparingToTeleportState_DeltaTime_ImplicitCast; // 0x0730(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2) == 0x000008, "Wrong alignment on ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2");
static_assert(sizeof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2) == 0x000738, "Wrong size on ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, EntryPoint) == 0x000000, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::EntryPoint' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, CallFunc_HasActorsInside_HasActors) == 0x000004, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::CallFunc_HasActorsInside_HasActors' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, K2Node_SwitchEnum_CmpSuccess) == 0x000005, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, CallFunc_IsValid_ReturnValue) == 0x000006, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, CallFunc_Conv_InterfaceToObject_ReturnValue) == 0x000008, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::CallFunc_Conv_InterfaceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, CallFunc_IsValid_ReturnValue_1) == 0x000010, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, K2Node_SwitchEnum_CmpSuccess_1) == 0x000011, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, CallFunc_BreakVector_X) == 0x000018, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, CallFunc_BreakVector_Y) == 0x000020, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, CallFunc_BreakVector_Z) == 0x000028, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, CallFunc_IsValid_ReturnValue_2) == 0x000030, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000038, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, CallFunc_MakeVector_ReturnValue) == 0x000040, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000058, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, CallFunc_BreakVector_X_1) == 0x000070, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, CallFunc_BreakVector_Y_1) == 0x000078, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, CallFunc_BreakVector_Z_1) == 0x000080, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, CallFunc_FMODPlayEventAttached_ReturnValue) == 0x000088, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::CallFunc_FMODPlayEventAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, CallFunc_FMODPlayEventAttached_ReturnValue_1) == 0x000090, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::CallFunc_FMODPlayEventAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, CallFunc_IsValid_ReturnValue_3) == 0x000098, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, CallFunc_BreakVector_X_2) == 0x0000A0, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, CallFunc_BreakVector_Y_2) == 0x0000A8, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, CallFunc_BreakVector_Z_2) == 0x0000B0, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0000B8, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, CallFunc_IsPlaying_ReturnValue) == 0x0000C0, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, CallFunc_MakeVector_ReturnValue_1) == 0x0000C8, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, CallFunc_IsValid_ReturnValue_4) == 0x0000E0, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, CallFunc_IsValid_ReturnValue_5) == 0x0000E1, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, CallFunc_IsValid_ReturnValue_6) == 0x0000E2, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, CallFunc_FMODPlayEventAttached_ReturnValue_2) == 0x0000E8, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::CallFunc_FMODPlayEventAttached_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, CallFunc_IsPlaying_ReturnValue_1) == 0x0000F0, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::CallFunc_IsPlaying_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, K2Node_Event_DeltaSeconds) == 0x0000F4, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, CallFunc_IsPlaying_ReturnValue_2) == 0x0000F8, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::CallFunc_IsPlaying_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, CallFunc_Conv_InterfaceToObject_ReturnValue_1) == 0x000100, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::CallFunc_Conv_InterfaceToObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, CallFunc_IsValid_ReturnValue_7) == 0x000108, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, CallFunc_FMODPlayEventAttached_ReturnValue_3) == 0x000110, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::CallFunc_FMODPlayEventAttached_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, CallFunc_FMODPlayEventAttached_ReturnValue_4) == 0x000118, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::CallFunc_FMODPlayEventAttached_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, K2Node_Event_Visible) == 0x000120, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::K2Node_Event_Visible' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000128, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000210, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, CallFunc_IsLocallyControlled_ReturnValue) == 0x000211, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, K2Node_Event_Visible_1) == 0x000212, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::K2Node_Event_Visible_1' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, K2Node_Event_Player_1) == 0x000218, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::K2Node_Event_Player_1' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, K2Node_Event_Player_2) == 0x000220, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::K2Node_Event_Player_2' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, K2Node_Event_Player_3) == 0x000228, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::K2Node_Event_Player_3' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, K2Node_Event_Player_4) == 0x000230, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::K2Node_Event_Player_4' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, K2Node_Event_Player_5) == 0x000238, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::K2Node_Event_Player_5' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, K2Node_Event_SitIndex) == 0x000240, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::K2Node_Event_SitIndex' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, K2Node_Event_SkipAnimation) == 0x000244, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::K2Node_Event_SkipAnimation' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, K2Node_Event_Player_6) == 0x000248, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::K2Node_Event_Player_6' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, K2Node_Event_Player_7) == 0x000250, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::K2Node_Event_Player_7' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, K2Node_Event_Player_8) == 0x000258, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::K2Node_Event_Player_8' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, K2Node_CreateDelegate_OutputDelegate) == 0x000260, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, K2Node_CreateDelegate_OutputDelegate_1) == 0x000270, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000280, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000288, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, K2Node_ComponentBoundEvent_OverlappedComponent_2) == 0x000290, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::K2Node_ComponentBoundEvent_OverlappedComponent_2' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, K2Node_ComponentBoundEvent_OtherActor_2) == 0x000298, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::K2Node_ComponentBoundEvent_OtherActor_2' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, K2Node_ComponentBoundEvent_OtherComp_2) == 0x0002A0, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::K2Node_ComponentBoundEvent_OtherComp_2' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, K2Node_ComponentBoundEvent_OtherBodyIndex_2) == 0x0002A8, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::K2Node_ComponentBoundEvent_OtherBodyIndex_2' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, K2Node_ComponentBoundEvent_bFromSweep_1) == 0x0002AC, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::K2Node_ComponentBoundEvent_bFromSweep_1' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, K2Node_ComponentBoundEvent_SweepResult_1) == 0x0002B0, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::K2Node_ComponentBoundEvent_SweepResult_1' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, K2Node_DynamicCast_AsCharacter) == 0x000398, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, K2Node_DynamicCast_bSuccess) == 0x0003A0, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x0003A8, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0003C0, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, CallFunc_IsTeleportableActor_IsTeleportable) == 0x0003D8, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::CallFunc_IsTeleportableActor_IsTeleportable' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0003E0, "Member 'ElevatorTeleportV2_C_ExecuteUbergraph_ElevatorTeleportV2::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
