#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ElevatorTeleportPanel

#include "Basic.hpp"

#include "E_ActorType_structs.hpp"
#include "E_InteractType_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ElevatorTeleportPanelState_structs.hpp"


namespace SDK::Params
{

// Function ElevatorTeleportPanel.ElevatorTeleportPanel_C.ExecuteUbergraph_ElevatorTeleportPanel
// 0x00B0 (0x00B0 - 0x0000)
struct ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_Player_2;                             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Visible_1;                            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Visible;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_Player_1;                             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GeneralInterface_C> K2Node_DynamicCast_AsBPI_General_Interface;        // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_Player_3;                             // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_Player_4;                             // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_Player_5;                             // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_Player_6;                             // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SitIndex;                             // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_SkipAnimation;                        // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_Player_7;                             // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_Player_8;                             // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_Player;                               // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFMODAudioComponent*                    CallFunc_FMODPlayEventAttached_ReturnValue;        // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UFMODAudioComponent*                    CallFunc_FMODPlayEventAttached_ReturnValue_1;      // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RecieverCanAcceptActors_CanRecieve;       // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_ProcessRequestState_DeltaTime_ImplicitCast; // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_ProcessMovingState_DeltaTime_ImplicitCast; // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel) == 0x000008, "Wrong alignment on ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel");
static_assert(sizeof(ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel) == 0x0000B0, "Wrong size on ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel");
static_assert(offsetof(ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel, EntryPoint) == 0x000000, "Member 'ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel::EntryPoint' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel, K2Node_Event_Player_2) == 0x000008, "Member 'ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel::K2Node_Event_Player_2' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel, K2Node_Event_Visible_1) == 0x000010, "Member 'ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel::K2Node_Event_Visible_1' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel, K2Node_Event_Visible) == 0x000011, "Member 'ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel::K2Node_Event_Visible' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel, K2Node_Event_DeltaSeconds) == 0x000014, "Member 'ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel, K2Node_Event_Player_1) == 0x000018, "Member 'ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel::K2Node_Event_Player_1' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel, K2Node_DynamicCast_AsBPI_General_Interface) == 0x000020, "Member 'ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel::K2Node_DynamicCast_AsBPI_General_Interface' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel, K2Node_SwitchEnum_CmpSuccess) == 0x000031, "Member 'ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel, K2Node_SwitchEnum_CmpSuccess_1) == 0x000032, "Member 'ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel, K2Node_Event_Player_3) == 0x000038, "Member 'ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel::K2Node_Event_Player_3' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel, K2Node_Event_Player_4) == 0x000040, "Member 'ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel::K2Node_Event_Player_4' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel, CallFunc_IsValid_ReturnValue_1) == 0x000049, "Member 'ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel, K2Node_Event_Player_5) == 0x000050, "Member 'ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel::K2Node_Event_Player_5' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel, K2Node_Event_Player_6) == 0x000058, "Member 'ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel::K2Node_Event_Player_6' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel, K2Node_Event_SitIndex) == 0x000060, "Member 'ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel::K2Node_Event_SitIndex' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel, K2Node_Event_SkipAnimation) == 0x000064, "Member 'ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel::K2Node_Event_SkipAnimation' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel, K2Node_Event_Player_7) == 0x000068, "Member 'ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel::K2Node_Event_Player_7' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel, K2Node_Event_Player_8) == 0x000070, "Member 'ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel::K2Node_Event_Player_8' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel, CallFunc_HasAuthority_ReturnValue_1) == 0x000078, "Member 'ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel, K2Node_Event_Player) == 0x000080, "Member 'ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel::K2Node_Event_Player' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel, CallFunc_FMODPlayEventAttached_ReturnValue) == 0x000088, "Member 'ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel::CallFunc_FMODPlayEventAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel, CallFunc_FMODPlayEventAttached_ReturnValue_1) == 0x000090, "Member 'ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel::CallFunc_FMODPlayEventAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel, K2Node_SwitchEnum_CmpSuccess_2) == 0x000098, "Member 'ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel, CallFunc_RecieverCanAcceptActors_CanRecieve) == 0x000099, "Member 'ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel::CallFunc_RecieverCanAcceptActors_CanRecieve' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel, CallFunc_ProcessRequestState_DeltaTime_ImplicitCast) == 0x0000A0, "Member 'ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel::CallFunc_ProcessRequestState_DeltaTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel, CallFunc_ProcessMovingState_DeltaTime_ImplicitCast) == 0x0000A8, "Member 'ElevatorTeleportPanel_C_ExecuteUbergraph_ElevatorTeleportPanel::CallFunc_ProcessMovingState_DeltaTime_ImplicitCast' has a wrong offset!");

// Function ElevatorTeleportPanel.ElevatorTeleportPanel_C.GetActorType
// 0x0001 (0x0001 - 0x0000)
struct ElevatorTeleportPanel_C_GetActorType final
{
public:
	E_ActorType                                   ActorType;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ElevatorTeleportPanel_C_GetActorType) == 0x000001, "Wrong alignment on ElevatorTeleportPanel_C_GetActorType");
static_assert(sizeof(ElevatorTeleportPanel_C_GetActorType) == 0x000001, "Wrong size on ElevatorTeleportPanel_C_GetActorType");
static_assert(offsetof(ElevatorTeleportPanel_C_GetActorType, ActorType) == 0x000000, "Member 'ElevatorTeleportPanel_C_GetActorType::ActorType' has a wrong offset!");

// Function ElevatorTeleportPanel.ElevatorTeleportPanel_C.IsLocked?
// 0x0001 (0x0001 - 0x0000)
struct ElevatorTeleportPanel_C_IsLocked_ final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ElevatorTeleportPanel_C_IsLocked_) == 0x000001, "Wrong alignment on ElevatorTeleportPanel_C_IsLocked_");
static_assert(sizeof(ElevatorTeleportPanel_C_IsLocked_) == 0x000001, "Wrong size on ElevatorTeleportPanel_C_IsLocked_");
static_assert(offsetof(ElevatorTeleportPanel_C_IsLocked_, Result) == 0x000000, "Member 'ElevatorTeleportPanel_C_IsLocked_::Result' has a wrong offset!");

// Function ElevatorTeleportPanel.ElevatorTeleportPanel_C.OnBeginInteract
// 0x0008 (0x0008 - 0x0000)
struct ElevatorTeleportPanel_C_OnBeginInteract final
{
public:
	class APawn*                                  Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ElevatorTeleportPanel_C_OnBeginInteract) == 0x000008, "Wrong alignment on ElevatorTeleportPanel_C_OnBeginInteract");
static_assert(sizeof(ElevatorTeleportPanel_C_OnBeginInteract) == 0x000008, "Wrong size on ElevatorTeleportPanel_C_OnBeginInteract");
static_assert(offsetof(ElevatorTeleportPanel_C_OnBeginInteract, Player) == 0x000000, "Member 'ElevatorTeleportPanel_C_OnBeginInteract::Player' has a wrong offset!");

// Function ElevatorTeleportPanel.ElevatorTeleportPanel_C.OnFocused
// 0x0058 (0x0058 - 0x0000)
struct ElevatorTeleportPanel_C_OnFocused final
{
public:
	class APawn*                                  Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 HighlightActor;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UActorComponent*                        HighlightActorComponent;                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	E_InteractType                                InteractType;                                      // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        LateTime;                                          // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameHUD_C>        K2Node_DynamicCast_AsBPI_Game_HUD;                 // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_PlayerMain_C*                      CallFunc_GetGUI_GUI;                               // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ElevatorTeleportPanel_C_OnFocused) == 0x000008, "Wrong alignment on ElevatorTeleportPanel_C_OnFocused");
static_assert(sizeof(ElevatorTeleportPanel_C_OnFocused) == 0x000058, "Wrong size on ElevatorTeleportPanel_C_OnFocused");
static_assert(offsetof(ElevatorTeleportPanel_C_OnFocused, Player) == 0x000000, "Member 'ElevatorTeleportPanel_C_OnFocused::Player' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportPanel_C_OnFocused, HighlightActor) == 0x000008, "Member 'ElevatorTeleportPanel_C_OnFocused::HighlightActor' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportPanel_C_OnFocused, HighlightActorComponent) == 0x000010, "Member 'ElevatorTeleportPanel_C_OnFocused::HighlightActorComponent' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportPanel_C_OnFocused, InteractType) == 0x000018, "Member 'ElevatorTeleportPanel_C_OnFocused::InteractType' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportPanel_C_OnFocused, LateTime) == 0x000020, "Member 'ElevatorTeleportPanel_C_OnFocused::LateTime' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportPanel_C_OnFocused, CallFunc_GetPlayerController_ReturnValue) == 0x000028, "Member 'ElevatorTeleportPanel_C_OnFocused::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportPanel_C_OnFocused, CallFunc_GetHUD_ReturnValue) == 0x000030, "Member 'ElevatorTeleportPanel_C_OnFocused::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportPanel_C_OnFocused, K2Node_DynamicCast_AsBPI_Game_HUD) == 0x000038, "Member 'ElevatorTeleportPanel_C_OnFocused::K2Node_DynamicCast_AsBPI_Game_HUD' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportPanel_C_OnFocused, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'ElevatorTeleportPanel_C_OnFocused::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportPanel_C_OnFocused, CallFunc_GetGUI_GUI) == 0x000050, "Member 'ElevatorTeleportPanel_C_OnFocused::CallFunc_GetGUI_GUI' has a wrong offset!");

// Function ElevatorTeleportPanel.ElevatorTeleportPanel_C.OnInteract
// 0x0008 (0x0008 - 0x0000)
struct ElevatorTeleportPanel_C_OnInteract final
{
public:
	class APawn*                                  Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ElevatorTeleportPanel_C_OnInteract) == 0x000008, "Wrong alignment on ElevatorTeleportPanel_C_OnInteract");
static_assert(sizeof(ElevatorTeleportPanel_C_OnInteract) == 0x000008, "Wrong size on ElevatorTeleportPanel_C_OnInteract");
static_assert(offsetof(ElevatorTeleportPanel_C_OnInteract, Player) == 0x000000, "Member 'ElevatorTeleportPanel_C_OnInteract::Player' has a wrong offset!");

// Function ElevatorTeleportPanel.ElevatorTeleportPanel_C.OnInteract2
// 0x0008 (0x0008 - 0x0000)
struct ElevatorTeleportPanel_C_OnInteract2 final
{
public:
	class APawn*                                  Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ElevatorTeleportPanel_C_OnInteract2) == 0x000008, "Wrong alignment on ElevatorTeleportPanel_C_OnInteract2");
static_assert(sizeof(ElevatorTeleportPanel_C_OnInteract2) == 0x000008, "Wrong size on ElevatorTeleportPanel_C_OnInteract2");
static_assert(offsetof(ElevatorTeleportPanel_C_OnInteract2, Player) == 0x000000, "Member 'ElevatorTeleportPanel_C_OnInteract2::Player' has a wrong offset!");

// Function ElevatorTeleportPanel.ElevatorTeleportPanel_C.OnInteract3
// 0x0008 (0x0008 - 0x0000)
struct ElevatorTeleportPanel_C_OnInteract3 final
{
public:
	class APawn*                                  Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ElevatorTeleportPanel_C_OnInteract3) == 0x000008, "Wrong alignment on ElevatorTeleportPanel_C_OnInteract3");
static_assert(sizeof(ElevatorTeleportPanel_C_OnInteract3) == 0x000008, "Wrong size on ElevatorTeleportPanel_C_OnInteract3");
static_assert(offsetof(ElevatorTeleportPanel_C_OnInteract3, Player) == 0x000000, "Member 'ElevatorTeleportPanel_C_OnInteract3::Player' has a wrong offset!");

// Function ElevatorTeleportPanel.ElevatorTeleportPanel_C.OnInteractVehicle
// 0x0010 (0x0010 - 0x0000)
struct ElevatorTeleportPanel_C_OnInteractVehicle final
{
public:
	class APawn*                                  Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         SitIndex;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SkipAnimation;                                     // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ElevatorTeleportPanel_C_OnInteractVehicle) == 0x000008, "Wrong alignment on ElevatorTeleportPanel_C_OnInteractVehicle");
static_assert(sizeof(ElevatorTeleportPanel_C_OnInteractVehicle) == 0x000010, "Wrong size on ElevatorTeleportPanel_C_OnInteractVehicle");
static_assert(offsetof(ElevatorTeleportPanel_C_OnInteractVehicle, Player) == 0x000000, "Member 'ElevatorTeleportPanel_C_OnInteractVehicle::Player' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportPanel_C_OnInteractVehicle, SitIndex) == 0x000008, "Member 'ElevatorTeleportPanel_C_OnInteractVehicle::SitIndex' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportPanel_C_OnInteractVehicle, SkipAnimation) == 0x00000C, "Member 'ElevatorTeleportPanel_C_OnInteractVehicle::SkipAnimation' has a wrong offset!");

// Function ElevatorTeleportPanel.ElevatorTeleportPanel_C.OnLocalInteract
// 0x0008 (0x0008 - 0x0000)
struct ElevatorTeleportPanel_C_OnLocalInteract final
{
public:
	class APawn*                                  Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ElevatorTeleportPanel_C_OnLocalInteract) == 0x000008, "Wrong alignment on ElevatorTeleportPanel_C_OnLocalInteract");
static_assert(sizeof(ElevatorTeleportPanel_C_OnLocalInteract) == 0x000008, "Wrong size on ElevatorTeleportPanel_C_OnLocalInteract");
static_assert(offsetof(ElevatorTeleportPanel_C_OnLocalInteract, Player) == 0x000000, "Member 'ElevatorTeleportPanel_C_OnLocalInteract::Player' has a wrong offset!");

// Function ElevatorTeleportPanel.ElevatorTeleportPanel_C.OnLostFocus
// 0x0008 (0x0008 - 0x0000)
struct ElevatorTeleportPanel_C_OnLostFocus final
{
public:
	class APawn*                                  Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ElevatorTeleportPanel_C_OnLostFocus) == 0x000008, "Wrong alignment on ElevatorTeleportPanel_C_OnLostFocus");
static_assert(sizeof(ElevatorTeleportPanel_C_OnLostFocus) == 0x000008, "Wrong size on ElevatorTeleportPanel_C_OnLostFocus");
static_assert(offsetof(ElevatorTeleportPanel_C_OnLostFocus, Player) == 0x000000, "Member 'ElevatorTeleportPanel_C_OnLostFocus::Player' has a wrong offset!");

// Function ElevatorTeleportPanel.ElevatorTeleportPanel_C.OnSeen
// 0x0008 (0x0008 - 0x0000)
struct ElevatorTeleportPanel_C_OnSeen final
{
public:
	class APawn*                                  Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ElevatorTeleportPanel_C_OnSeen) == 0x000008, "Wrong alignment on ElevatorTeleportPanel_C_OnSeen");
static_assert(sizeof(ElevatorTeleportPanel_C_OnSeen) == 0x000008, "Wrong size on ElevatorTeleportPanel_C_OnSeen");
static_assert(offsetof(ElevatorTeleportPanel_C_OnSeen, Player) == 0x000000, "Member 'ElevatorTeleportPanel_C_OnSeen::Player' has a wrong offset!");

// Function ElevatorTeleportPanel.ElevatorTeleportPanel_C.OnStopInteract
// 0x0008 (0x0008 - 0x0000)
struct ElevatorTeleportPanel_C_OnStopInteract final
{
public:
	class APawn*                                  Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ElevatorTeleportPanel_C_OnStopInteract) == 0x000008, "Wrong alignment on ElevatorTeleportPanel_C_OnStopInteract");
static_assert(sizeof(ElevatorTeleportPanel_C_OnStopInteract) == 0x000008, "Wrong size on ElevatorTeleportPanel_C_OnStopInteract");
static_assert(offsetof(ElevatorTeleportPanel_C_OnStopInteract, Player) == 0x000000, "Member 'ElevatorTeleportPanel_C_OnStopInteract::Player' has a wrong offset!");

// Function ElevatorTeleportPanel.ElevatorTeleportPanel_C.ProcessMovingState
// 0x0018 (0x0018 - 0x0000)
struct ElevatorTeleportPanel_C_ProcessMovingState final
{
public:
	double                                        DeltaTime;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ElevatorTeleportPanel_C_ProcessMovingState) == 0x000008, "Wrong alignment on ElevatorTeleportPanel_C_ProcessMovingState");
static_assert(sizeof(ElevatorTeleportPanel_C_ProcessMovingState) == 0x000018, "Wrong size on ElevatorTeleportPanel_C_ProcessMovingState");
static_assert(offsetof(ElevatorTeleportPanel_C_ProcessMovingState, DeltaTime) == 0x000000, "Member 'ElevatorTeleportPanel_C_ProcessMovingState::DeltaTime' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportPanel_C_ProcessMovingState, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000008, "Member 'ElevatorTeleportPanel_C_ProcessMovingState::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportPanel_C_ProcessMovingState, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000010, "Member 'ElevatorTeleportPanel_C_ProcessMovingState::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");

// Function ElevatorTeleportPanel.ElevatorTeleportPanel_C.ProcessRequestState
// 0x0018 (0x0018 - 0x0000)
struct ElevatorTeleportPanel_C_ProcessRequestState final
{
public:
	double                                        DeltaTime;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ElevatorTeleportPanel_C_ProcessRequestState) == 0x000008, "Wrong alignment on ElevatorTeleportPanel_C_ProcessRequestState");
static_assert(sizeof(ElevatorTeleportPanel_C_ProcessRequestState) == 0x000018, "Wrong size on ElevatorTeleportPanel_C_ProcessRequestState");
static_assert(offsetof(ElevatorTeleportPanel_C_ProcessRequestState, DeltaTime) == 0x000000, "Member 'ElevatorTeleportPanel_C_ProcessRequestState::DeltaTime' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportPanel_C_ProcessRequestState, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000008, "Member 'ElevatorTeleportPanel_C_ProcessRequestState::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportPanel_C_ProcessRequestState, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000010, "Member 'ElevatorTeleportPanel_C_ProcessRequestState::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");

// Function ElevatorTeleportPanel.ElevatorTeleportPanel_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct ElevatorTeleportPanel_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ElevatorTeleportPanel_C_ReceiveTick) == 0x000004, "Wrong alignment on ElevatorTeleportPanel_C_ReceiveTick");
static_assert(sizeof(ElevatorTeleportPanel_C_ReceiveTick) == 0x000004, "Wrong size on ElevatorTeleportPanel_C_ReceiveTick");
static_assert(offsetof(ElevatorTeleportPanel_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'ElevatorTeleportPanel_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function ElevatorTeleportPanel.ElevatorTeleportPanel_C.Set3DWidgetVisibility
// 0x0001 (0x0001 - 0x0000)
struct ElevatorTeleportPanel_C_Set3DWidgetVisibility final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ElevatorTeleportPanel_C_Set3DWidgetVisibility) == 0x000001, "Wrong alignment on ElevatorTeleportPanel_C_Set3DWidgetVisibility");
static_assert(sizeof(ElevatorTeleportPanel_C_Set3DWidgetVisibility) == 0x000001, "Wrong size on ElevatorTeleportPanel_C_Set3DWidgetVisibility");
static_assert(offsetof(ElevatorTeleportPanel_C_Set3DWidgetVisibility, Visible) == 0x000000, "Member 'ElevatorTeleportPanel_C_Set3DWidgetVisibility::Visible' has a wrong offset!");

// Function ElevatorTeleportPanel.ElevatorTeleportPanel_C.SetIndicatorColor
// 0x0010 (0x0010 - 0x0000)
struct ElevatorTeleportPanel_C_SetIndicatorColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ElevatorTeleportPanel_C_SetIndicatorColor) == 0x000004, "Wrong alignment on ElevatorTeleportPanel_C_SetIndicatorColor");
static_assert(sizeof(ElevatorTeleportPanel_C_SetIndicatorColor) == 0x000010, "Wrong size on ElevatorTeleportPanel_C_SetIndicatorColor");
static_assert(offsetof(ElevatorTeleportPanel_C_SetIndicatorColor, Color) == 0x000000, "Member 'ElevatorTeleportPanel_C_SetIndicatorColor::Color' has a wrong offset!");

// Function ElevatorTeleportPanel.ElevatorTeleportPanel_C.SetState
// 0x0030 (0x0030 - 0x0000)
struct ElevatorTeleportPanel_C_SetState final
{
public:
	ElevatorTeleportPanelState                    Param_State;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(ElevatorTeleportPanel_C_SetState) == 0x000008, "Wrong alignment on ElevatorTeleportPanel_C_SetState");
static_assert(sizeof(ElevatorTeleportPanel_C_SetState) == 0x000030, "Wrong size on ElevatorTeleportPanel_C_SetState");
static_assert(offsetof(ElevatorTeleportPanel_C_SetState, Param_State) == 0x000000, "Member 'ElevatorTeleportPanel_C_SetState::Param_State' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportPanel_C_SetState, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000008, "Member 'ElevatorTeleportPanel_C_SetState::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportPanel_C_SetState, K2Node_SwitchEnum_CmpSuccess) == 0x000018, "Member 'ElevatorTeleportPanel_C_SetState::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ElevatorTeleportPanel_C_SetState, CallFunc_Concat_StrStr_ReturnValue) == 0x000020, "Member 'ElevatorTeleportPanel_C_SetState::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

// Function ElevatorTeleportPanel.ElevatorTeleportPanel_C.SetTutorial3DWidgetVisibility
// 0x0001 (0x0001 - 0x0000)
struct ElevatorTeleportPanel_C_SetTutorial3DWidgetVisibility final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ElevatorTeleportPanel_C_SetTutorial3DWidgetVisibility) == 0x000001, "Wrong alignment on ElevatorTeleportPanel_C_SetTutorial3DWidgetVisibility");
static_assert(sizeof(ElevatorTeleportPanel_C_SetTutorial3DWidgetVisibility) == 0x000001, "Wrong size on ElevatorTeleportPanel_C_SetTutorial3DWidgetVisibility");
static_assert(offsetof(ElevatorTeleportPanel_C_SetTutorial3DWidgetVisibility, Visible) == 0x000000, "Member 'ElevatorTeleportPanel_C_SetTutorial3DWidgetVisibility::Visible' has a wrong offset!");

}

