#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EMptySkeletal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass EMptySkeletal.EMptySkeletal_C
// 0x0050 (0x02E0 - 0x0290)
class AEMptySkeletal_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          Mesh;                                              // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UAnimSequence*                          Anim;                                              // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        DurationToDrop;                                    // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        AnimDelay;                                         // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        DisappearDelay;                                    // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        VisibilityDelay;                                   // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TArray<class UMaterialInstance*>              CustomMaterials;                                   // 0x02D0(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void ExecuteUbergraph_EMptySkeletal(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EMptySkeletal_C">();
	}
	static class AEMptySkeletal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEMptySkeletal_C>();
	}
};
static_assert(alignof(AEMptySkeletal_C) == 0x000008, "Wrong alignment on AEMptySkeletal_C");
static_assert(sizeof(AEMptySkeletal_C) == 0x0002E0, "Wrong size on AEMptySkeletal_C");
static_assert(offsetof(AEMptySkeletal_C, UberGraphFrame) == 0x000290, "Member 'AEMptySkeletal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AEMptySkeletal_C, SkeletalMesh) == 0x000298, "Member 'AEMptySkeletal_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(AEMptySkeletal_C, Mesh) == 0x0002A0, "Member 'AEMptySkeletal_C::Mesh' has a wrong offset!");
static_assert(offsetof(AEMptySkeletal_C, Anim) == 0x0002A8, "Member 'AEMptySkeletal_C::Anim' has a wrong offset!");
static_assert(offsetof(AEMptySkeletal_C, DurationToDrop) == 0x0002B0, "Member 'AEMptySkeletal_C::DurationToDrop' has a wrong offset!");
static_assert(offsetof(AEMptySkeletal_C, AnimDelay) == 0x0002B8, "Member 'AEMptySkeletal_C::AnimDelay' has a wrong offset!");
static_assert(offsetof(AEMptySkeletal_C, DisappearDelay) == 0x0002C0, "Member 'AEMptySkeletal_C::DisappearDelay' has a wrong offset!");
static_assert(offsetof(AEMptySkeletal_C, VisibilityDelay) == 0x0002C8, "Member 'AEMptySkeletal_C::VisibilityDelay' has a wrong offset!");
static_assert(offsetof(AEMptySkeletal_C, CustomMaterials) == 0x0002D0, "Member 'AEMptySkeletal_C::CustomMaterials' has a wrong offset!");

}

