#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EMptyStatic

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function EMptyStatic.EMptyStatic_C.ExecuteUbergraph_EMptyStatic
// 0x0120 (0x0120 - 0x0000)
struct EMptyStatic_C_ExecuteUbergraph_EMptyStatic final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0xA];                                        // 0x0006(0x000A)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformDirection_ReturnValue;           // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue_1;               // 0x0090(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformDirection_ReturnValue_1;         // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_1;            // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_2;            // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EMptyStatic_C_ExecuteUbergraph_EMptyStatic) == 0x000010, "Wrong alignment on EMptyStatic_C_ExecuteUbergraph_EMptyStatic");
static_assert(sizeof(EMptyStatic_C_ExecuteUbergraph_EMptyStatic) == 0x000120, "Wrong size on EMptyStatic_C_ExecuteUbergraph_EMptyStatic");
static_assert(offsetof(EMptyStatic_C_ExecuteUbergraph_EMptyStatic, EntryPoint) == 0x000000, "Member 'EMptyStatic_C_ExecuteUbergraph_EMptyStatic::EntryPoint' has a wrong offset!");
static_assert(offsetof(EMptyStatic_C_ExecuteUbergraph_EMptyStatic, CallFunc_NotEqual_DoubleDouble_ReturnValue) == 0x000004, "Member 'EMptyStatic_C_ExecuteUbergraph_EMptyStatic::CallFunc_NotEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(EMptyStatic_C_ExecuteUbergraph_EMptyStatic, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000005, "Member 'EMptyStatic_C_ExecuteUbergraph_EMptyStatic::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(EMptyStatic_C_ExecuteUbergraph_EMptyStatic, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'EMptyStatic_C_ExecuteUbergraph_EMptyStatic::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(EMptyStatic_C_ExecuteUbergraph_EMptyStatic, CallFunc_TransformDirection_ReturnValue) == 0x000070, "Member 'EMptyStatic_C_ExecuteUbergraph_EMptyStatic::CallFunc_TransformDirection_ReturnValue' has a wrong offset!");
static_assert(offsetof(EMptyStatic_C_ExecuteUbergraph_EMptyStatic, CallFunc_GetTransform_ReturnValue_1) == 0x000090, "Member 'EMptyStatic_C_ExecuteUbergraph_EMptyStatic::CallFunc_GetTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EMptyStatic_C_ExecuteUbergraph_EMptyStatic, CallFunc_TransformDirection_ReturnValue_1) == 0x0000F0, "Member 'EMptyStatic_C_ExecuteUbergraph_EMptyStatic::CallFunc_TransformDirection_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EMptyStatic_C_ExecuteUbergraph_EMptyStatic, CallFunc_Delay_Duration_ImplicitCast) == 0x000108, "Member 'EMptyStatic_C_ExecuteUbergraph_EMptyStatic::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");
static_assert(offsetof(EMptyStatic_C_ExecuteUbergraph_EMptyStatic, CallFunc_Delay_Duration_ImplicitCast_1) == 0x00010C, "Member 'EMptyStatic_C_ExecuteUbergraph_EMptyStatic::CallFunc_Delay_Duration_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(EMptyStatic_C_ExecuteUbergraph_EMptyStatic, CallFunc_Delay_Duration_ImplicitCast_2) == 0x000110, "Member 'EMptyStatic_C_ExecuteUbergraph_EMptyStatic::CallFunc_Delay_Duration_ImplicitCast_2' has a wrong offset!");

// Function EMptyStatic.EMptyStatic_C.UserConstructionScript
// 0x0028 (0x0028 - 0x0000)
struct EMptyStatic_C_UserConstructionScript final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EMptyStatic_C_UserConstructionScript) == 0x000008, "Wrong alignment on EMptyStatic_C_UserConstructionScript");
static_assert(sizeof(EMptyStatic_C_UserConstructionScript) == 0x000028, "Wrong size on EMptyStatic_C_UserConstructionScript");
static_assert(offsetof(EMptyStatic_C_UserConstructionScript, Temp_int_Array_Index_Variable) == 0x000000, "Member 'EMptyStatic_C_UserConstructionScript::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(EMptyStatic_C_UserConstructionScript, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'EMptyStatic_C_UserConstructionScript::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(EMptyStatic_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'EMptyStatic_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EMptyStatic_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000010, "Member 'EMptyStatic_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(EMptyStatic_C_UserConstructionScript, CallFunc_NotEqual_DoubleDouble_ReturnValue) == 0x000018, "Member 'EMptyStatic_C_UserConstructionScript::CallFunc_NotEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(EMptyStatic_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'EMptyStatic_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(EMptyStatic_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue_1) == 0x000020, "Member 'EMptyStatic_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EMptyStatic_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue) == 0x000024, "Member 'EMptyStatic_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EMptyStatic_C_UserConstructionScript, CallFunc_Greater_IntInt_ReturnValue) == 0x000025, "Member 'EMptyStatic_C_UserConstructionScript::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EMptyStatic_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000026, "Member 'EMptyStatic_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

}

