#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EndTutor

#include "Basic.hpp"

#include "QuestFramework_structs.hpp"


namespace SDK::Params
{

// Function EndTutor.EndTutor_C.ExecuteEvent
// 0x0028 (0x0028 - 0x0000)
struct EndTutor_C_ExecuteEvent final
{
public:
	class UQuestContext*                          Param_Context;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FQuestEventPayload                     Payload;                                           // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(EndTutor_C_ExecuteEvent) == 0x000008, "Wrong alignment on EndTutor_C_ExecuteEvent");
static_assert(sizeof(EndTutor_C_ExecuteEvent) == 0x000028, "Wrong size on EndTutor_C_ExecuteEvent");
static_assert(offsetof(EndTutor_C_ExecuteEvent, Param_Context) == 0x000000, "Member 'EndTutor_C_ExecuteEvent::Param_Context' has a wrong offset!");
static_assert(offsetof(EndTutor_C_ExecuteEvent, Payload) == 0x000008, "Member 'EndTutor_C_ExecuteEvent::Payload' has a wrong offset!");

// Function EndTutor.EndTutor_C.ExecuteUbergraph_EndTutor
// 0x0090 (0x0090 - 0x0000)
struct EndTutor_C_ExecuteUbergraph_EndTutor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UQuest*                                 CallFunc_GetQuestAsset_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UQuestCustomData*                 CallFunc_GetCustomData_ReturnValue;                // 0x0010(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UQuestData_C*                     K2Node_DynamicCast_AsQuest_Data;                   // 0x0018(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UQuestNode*                             CallFunc_GetActiveNode_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UQuest*                                 CallFunc_GetQuestAsset_ReturnValue_1;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetDisplayName_ReturnValue;               // 0x0038(0x0018)()
	class UQuestContext*                          K2Node_Event_Context;                              // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FQuestEventPayload                     K2Node_Event_Payload;                              // 0x0058(0x0020)(ConstParm, NoDestructor)
	class AController*                            CallFunc_GetOwnerController_ReturnValue;           // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvPC_C*                              K2Node_DynamicCast_AsSurv_PC;                      // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EndTutor_C_ExecuteUbergraph_EndTutor) == 0x000008, "Wrong alignment on EndTutor_C_ExecuteUbergraph_EndTutor");
static_assert(sizeof(EndTutor_C_ExecuteUbergraph_EndTutor) == 0x000090, "Wrong size on EndTutor_C_ExecuteUbergraph_EndTutor");
static_assert(offsetof(EndTutor_C_ExecuteUbergraph_EndTutor, EntryPoint) == 0x000000, "Member 'EndTutor_C_ExecuteUbergraph_EndTutor::EntryPoint' has a wrong offset!");
static_assert(offsetof(EndTutor_C_ExecuteUbergraph_EndTutor, CallFunc_GetQuestAsset_ReturnValue) == 0x000008, "Member 'EndTutor_C_ExecuteUbergraph_EndTutor::CallFunc_GetQuestAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(EndTutor_C_ExecuteUbergraph_EndTutor, CallFunc_GetCustomData_ReturnValue) == 0x000010, "Member 'EndTutor_C_ExecuteUbergraph_EndTutor::CallFunc_GetCustomData_ReturnValue' has a wrong offset!");
static_assert(offsetof(EndTutor_C_ExecuteUbergraph_EndTutor, K2Node_DynamicCast_AsQuest_Data) == 0x000018, "Member 'EndTutor_C_ExecuteUbergraph_EndTutor::K2Node_DynamicCast_AsQuest_Data' has a wrong offset!");
static_assert(offsetof(EndTutor_C_ExecuteUbergraph_EndTutor, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'EndTutor_C_ExecuteUbergraph_EndTutor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(EndTutor_C_ExecuteUbergraph_EndTutor, CallFunc_GetActiveNode_ReturnValue) == 0x000028, "Member 'EndTutor_C_ExecuteUbergraph_EndTutor::CallFunc_GetActiveNode_ReturnValue' has a wrong offset!");
static_assert(offsetof(EndTutor_C_ExecuteUbergraph_EndTutor, CallFunc_GetQuestAsset_ReturnValue_1) == 0x000030, "Member 'EndTutor_C_ExecuteUbergraph_EndTutor::CallFunc_GetQuestAsset_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EndTutor_C_ExecuteUbergraph_EndTutor, CallFunc_GetDisplayName_ReturnValue) == 0x000038, "Member 'EndTutor_C_ExecuteUbergraph_EndTutor::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(EndTutor_C_ExecuteUbergraph_EndTutor, K2Node_Event_Context) == 0x000050, "Member 'EndTutor_C_ExecuteUbergraph_EndTutor::K2Node_Event_Context' has a wrong offset!");
static_assert(offsetof(EndTutor_C_ExecuteUbergraph_EndTutor, K2Node_Event_Payload) == 0x000058, "Member 'EndTutor_C_ExecuteUbergraph_EndTutor::K2Node_Event_Payload' has a wrong offset!");
static_assert(offsetof(EndTutor_C_ExecuteUbergraph_EndTutor, CallFunc_GetOwnerController_ReturnValue) == 0x000078, "Member 'EndTutor_C_ExecuteUbergraph_EndTutor::CallFunc_GetOwnerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(EndTutor_C_ExecuteUbergraph_EndTutor, K2Node_DynamicCast_AsSurv_PC) == 0x000080, "Member 'EndTutor_C_ExecuteUbergraph_EndTutor::K2Node_DynamicCast_AsSurv_PC' has a wrong offset!");
static_assert(offsetof(EndTutor_C_ExecuteUbergraph_EndTutor, K2Node_DynamicCast_bSuccess_1) == 0x000088, "Member 'EndTutor_C_ExecuteUbergraph_EndTutor::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

