#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EquipmentData

#include "Basic.hpp"

#include "NameArray_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct EquipmentData.EquipmentData
// 0x0180 (0x0180 - 0x0000)
struct FEquipmentData final
{
public:
	class FName                                   Id_3_1799B7E74DBEE3498AB2D2B1E0CD6772;             // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class USkeletalMesh>           SkeletalMesh_37_9AEFA88C445DCF0308392CACA54A8FC7;  // 0x0008(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class USkeletalMesh>           SkeletalMeshFemale_38_1F845FD64254047C7782C0AFA1C31C31; // 0x0038(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TMap<class FName, struct FNameArray>          Armor_15_E745A7D846AC529C111173ADDFCED7C5;         // 0x0068(0x0050)(Edit, BlueprintVisible)
	TMap<class FName, struct FNameArray>          Backpack_17_825CFB944D46ACAE6B5D3197146C196C;      // 0x00B8(0x0050)(Edit, BlueprintVisible)
	TMap<class FName, struct FNameArray>          Outerwear_22_F3423D3F4361474613F56F919CE34E1E;     // 0x0108(0x0050)(Edit, BlueprintVisible)
	double                                        DistanceToCameraWorkbench_25_F356C6F44184EC483619799B3CBE938E; // 0x0158(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocationArmorWorkbench_29_33D813204502D8334A6124ADE1449AA4; // 0x0160(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ActiveMorphName_32_8D8DCF564851D8BC7E4F3F809C5235FA; // 0x0178(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FEquipmentData) == 0x000008, "Wrong alignment on FEquipmentData");
static_assert(sizeof(FEquipmentData) == 0x000180, "Wrong size on FEquipmentData");
static_assert(offsetof(FEquipmentData, Id_3_1799B7E74DBEE3498AB2D2B1E0CD6772) == 0x000000, "Member 'FEquipmentData::Id_3_1799B7E74DBEE3498AB2D2B1E0CD6772' has a wrong offset!");
static_assert(offsetof(FEquipmentData, SkeletalMesh_37_9AEFA88C445DCF0308392CACA54A8FC7) == 0x000008, "Member 'FEquipmentData::SkeletalMesh_37_9AEFA88C445DCF0308392CACA54A8FC7' has a wrong offset!");
static_assert(offsetof(FEquipmentData, SkeletalMeshFemale_38_1F845FD64254047C7782C0AFA1C31C31) == 0x000038, "Member 'FEquipmentData::SkeletalMeshFemale_38_1F845FD64254047C7782C0AFA1C31C31' has a wrong offset!");
static_assert(offsetof(FEquipmentData, Armor_15_E745A7D846AC529C111173ADDFCED7C5) == 0x000068, "Member 'FEquipmentData::Armor_15_E745A7D846AC529C111173ADDFCED7C5' has a wrong offset!");
static_assert(offsetof(FEquipmentData, Backpack_17_825CFB944D46ACAE6B5D3197146C196C) == 0x0000B8, "Member 'FEquipmentData::Backpack_17_825CFB944D46ACAE6B5D3197146C196C' has a wrong offset!");
static_assert(offsetof(FEquipmentData, Outerwear_22_F3423D3F4361474613F56F919CE34E1E) == 0x000108, "Member 'FEquipmentData::Outerwear_22_F3423D3F4361474613F56F919CE34E1E' has a wrong offset!");
static_assert(offsetof(FEquipmentData, DistanceToCameraWorkbench_25_F356C6F44184EC483619799B3CBE938E) == 0x000158, "Member 'FEquipmentData::DistanceToCameraWorkbench_25_F356C6F44184EC483619799B3CBE938E' has a wrong offset!");
static_assert(offsetof(FEquipmentData, LocationArmorWorkbench_29_33D813204502D8334A6124ADE1449AA4) == 0x000160, "Member 'FEquipmentData::LocationArmorWorkbench_29_33D813204502D8334A6124ADE1449AA4' has a wrong offset!");
static_assert(offsetof(FEquipmentData, ActiveMorphName_32_8D8DCF564851D8BC7E4F3F809C5235FA) == 0x000178, "Member 'FEquipmentData::ActiveMorphName_32_8D8DCF564851D8BC7E4F3F809C5235FA' has a wrong offset!");

}

