#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EquipmentStatus

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct EquipmentStatus.EquipmentStatus
// 0x000B (0x000B - 0x0000)
struct FEquipmentStatus final
{
public:
	bool                                          HasBackpack_1_9A6C741A44A3CBFB89106F9A236F9074;    // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasHelmet_3_6750FDB044B3B516AE64E0AF3B91761E;      // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasArmor_5_573D108C42110E015B40D290A40A9453;       // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasPants_7_A42A7D8D4B25CC7678DD2A95A0E191B3;       // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasGloves_9_AE99AB6C4F55E5694F680DB0B67046A6;      // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasShoes_19_84057DC844E4AF021EEDED8E1E293388;      // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasPrimary_11_3289233A43F4D7D9473A55B33E93DA11;    // 0x0006(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasSecondary_13_EFDAA4E54AF0574CD581F2BD05B67FC3;  // 0x0007(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasPistol_15_02CC2A1D493DCCC4324ABD8F2DCF48DC;     // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasMelee_17_5E9DCAA34560AAF3416CBDBEBD23B9C0;      // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasTactRig_21_E860BCBC4B371274F7335D9C0A560559;    // 0x000A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FEquipmentStatus) == 0x000001, "Wrong alignment on FEquipmentStatus");
static_assert(sizeof(FEquipmentStatus) == 0x00000B, "Wrong size on FEquipmentStatus");
static_assert(offsetof(FEquipmentStatus, HasBackpack_1_9A6C741A44A3CBFB89106F9A236F9074) == 0x000000, "Member 'FEquipmentStatus::HasBackpack_1_9A6C741A44A3CBFB89106F9A236F9074' has a wrong offset!");
static_assert(offsetof(FEquipmentStatus, HasHelmet_3_6750FDB044B3B516AE64E0AF3B91761E) == 0x000001, "Member 'FEquipmentStatus::HasHelmet_3_6750FDB044B3B516AE64E0AF3B91761E' has a wrong offset!");
static_assert(offsetof(FEquipmentStatus, HasArmor_5_573D108C42110E015B40D290A40A9453) == 0x000002, "Member 'FEquipmentStatus::HasArmor_5_573D108C42110E015B40D290A40A9453' has a wrong offset!");
static_assert(offsetof(FEquipmentStatus, HasPants_7_A42A7D8D4B25CC7678DD2A95A0E191B3) == 0x000003, "Member 'FEquipmentStatus::HasPants_7_A42A7D8D4B25CC7678DD2A95A0E191B3' has a wrong offset!");
static_assert(offsetof(FEquipmentStatus, HasGloves_9_AE99AB6C4F55E5694F680DB0B67046A6) == 0x000004, "Member 'FEquipmentStatus::HasGloves_9_AE99AB6C4F55E5694F680DB0B67046A6' has a wrong offset!");
static_assert(offsetof(FEquipmentStatus, HasShoes_19_84057DC844E4AF021EEDED8E1E293388) == 0x000005, "Member 'FEquipmentStatus::HasShoes_19_84057DC844E4AF021EEDED8E1E293388' has a wrong offset!");
static_assert(offsetof(FEquipmentStatus, HasPrimary_11_3289233A43F4D7D9473A55B33E93DA11) == 0x000006, "Member 'FEquipmentStatus::HasPrimary_11_3289233A43F4D7D9473A55B33E93DA11' has a wrong offset!");
static_assert(offsetof(FEquipmentStatus, HasSecondary_13_EFDAA4E54AF0574CD581F2BD05B67FC3) == 0x000007, "Member 'FEquipmentStatus::HasSecondary_13_EFDAA4E54AF0574CD581F2BD05B67FC3' has a wrong offset!");
static_assert(offsetof(FEquipmentStatus, HasPistol_15_02CC2A1D493DCCC4324ABD8F2DCF48DC) == 0x000008, "Member 'FEquipmentStatus::HasPistol_15_02CC2A1D493DCCC4324ABD8F2DCF48DC' has a wrong offset!");
static_assert(offsetof(FEquipmentStatus, HasMelee_17_5E9DCAA34560AAF3416CBDBEBD23B9C0) == 0x000009, "Member 'FEquipmentStatus::HasMelee_17_5E9DCAA34560AAF3416CBDBEBD23B9C0' has a wrong offset!");
static_assert(offsetof(FEquipmentStatus, HasTactRig_21_E860BCBC4B371274F7335D9C0A560559) == 0x00000A, "Member 'FEquipmentStatus::HasTactRig_21_E860BCBC4B371274F7335D9C0A560559' has a wrong offset!");

}

