#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Explosion_Molotov

#include "Basic.hpp"

#include "FGrenadeInfo_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Explosion_Molotov.Explosion_Molotov_C.BndEvt__Explosion_Molotov_Sphere_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct Explosion_Molotov_C_BndEvt__Explosion_Molotov_Sphere_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Explosion_Molotov_C_BndEvt__Explosion_Molotov_Sphere_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Explosion_Molotov_C_BndEvt__Explosion_Molotov_Sphere_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Explosion_Molotov_C_BndEvt__Explosion_Molotov_Sphere_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on Explosion_Molotov_C_BndEvt__Explosion_Molotov_Sphere_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Explosion_Molotov_C_BndEvt__Explosion_Molotov_Sphere_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Explosion_Molotov_C_BndEvt__Explosion_Molotov_Sphere_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_BndEvt__Explosion_Molotov_Sphere_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Explosion_Molotov_C_BndEvt__Explosion_Molotov_Sphere_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_BndEvt__Explosion_Molotov_Sphere_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Explosion_Molotov_C_BndEvt__Explosion_Molotov_Sphere_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_BndEvt__Explosion_Molotov_Sphere_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Explosion_Molotov_C_BndEvt__Explosion_Molotov_Sphere_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_BndEvt__Explosion_Molotov_Sphere_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'Explosion_Molotov_C_BndEvt__Explosion_Molotov_Sphere_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_BndEvt__Explosion_Molotov_Sphere_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'Explosion_Molotov_C_BndEvt__Explosion_Molotov_Sphere_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function Explosion_Molotov.Explosion_Molotov_C.BndEvt__Explosion_Molotov_Sphere_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct Explosion_Molotov_C_BndEvt__Explosion_Molotov_Sphere_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Explosion_Molotov_C_BndEvt__Explosion_Molotov_Sphere_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Explosion_Molotov_C_BndEvt__Explosion_Molotov_Sphere_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(Explosion_Molotov_C_BndEvt__Explosion_Molotov_Sphere_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on Explosion_Molotov_C_BndEvt__Explosion_Molotov_Sphere_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(Explosion_Molotov_C_BndEvt__Explosion_Molotov_Sphere_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Explosion_Molotov_C_BndEvt__Explosion_Molotov_Sphere_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_BndEvt__Explosion_Molotov_Sphere_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Explosion_Molotov_C_BndEvt__Explosion_Molotov_Sphere_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_BndEvt__Explosion_Molotov_Sphere_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Explosion_Molotov_C_BndEvt__Explosion_Molotov_Sphere_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_BndEvt__Explosion_Molotov_Sphere_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Explosion_Molotov_C_BndEvt__Explosion_Molotov_Sphere_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function Explosion_Molotov.Explosion_Molotov_C.CreateDecal
// 0x02D0 (0x02D0 - 0x0000)
struct Explosion_Molotov_C_CreateDecal final
{
public:
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0000(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x0040(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12B[0x1];                                      // 0x012B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionChannel                             CallFunc_GetCollisionObjectType_ReturnValue;       // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0228(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_RebaseLocalOriginOntoZero_ReturnValue;    // 0x0248(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0260(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Explosion_Molotov_C_CreateDecal) == 0x000010, "Wrong alignment on Explosion_Molotov_C_CreateDecal");
static_assert(sizeof(Explosion_Molotov_C_CreateDecal) == 0x0002D0, "Wrong size on Explosion_Molotov_C_CreateDecal");
static_assert(offsetof(Explosion_Molotov_C_CreateDecal, Temp_object_Variable) == 0x000000, "Member 'Explosion_Molotov_C_CreateDecal::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_CreateDecal, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000010, "Member 'Explosion_Molotov_C_CreateDecal::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_CreateDecal, CallFunc_Add_VectorVector_ReturnValue) == 0x000028, "Member 'Explosion_Molotov_C_CreateDecal::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_CreateDecal, CallFunc_LineTraceSingleForObjects_OutHit) == 0x000040, "Member 'Explosion_Molotov_C_CreateDecal::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_CreateDecal, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x000128, "Member 'Explosion_Molotov_C_CreateDecal::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_CreateDecal, CallFunc_BreakHitResult_bBlockingHit) == 0x000129, "Member 'Explosion_Molotov_C_CreateDecal::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_CreateDecal, CallFunc_BreakHitResult_bInitialOverlap) == 0x00012A, "Member 'Explosion_Molotov_C_CreateDecal::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_CreateDecal, CallFunc_BreakHitResult_Time) == 0x00012C, "Member 'Explosion_Molotov_C_CreateDecal::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_CreateDecal, CallFunc_BreakHitResult_Distance) == 0x000130, "Member 'Explosion_Molotov_C_CreateDecal::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_CreateDecal, CallFunc_BreakHitResult_Location) == 0x000138, "Member 'Explosion_Molotov_C_CreateDecal::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_CreateDecal, CallFunc_BreakHitResult_ImpactPoint) == 0x000150, "Member 'Explosion_Molotov_C_CreateDecal::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_CreateDecal, CallFunc_BreakHitResult_Normal) == 0x000168, "Member 'Explosion_Molotov_C_CreateDecal::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_CreateDecal, CallFunc_BreakHitResult_ImpactNormal) == 0x000180, "Member 'Explosion_Molotov_C_CreateDecal::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_CreateDecal, CallFunc_BreakHitResult_PhysMat) == 0x000198, "Member 'Explosion_Molotov_C_CreateDecal::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_CreateDecal, CallFunc_BreakHitResult_HitActor) == 0x0001A0, "Member 'Explosion_Molotov_C_CreateDecal::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_CreateDecal, CallFunc_BreakHitResult_HitComponent) == 0x0001A8, "Member 'Explosion_Molotov_C_CreateDecal::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_CreateDecal, CallFunc_BreakHitResult_HitBoneName) == 0x0001B0, "Member 'Explosion_Molotov_C_CreateDecal::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_CreateDecal, CallFunc_BreakHitResult_BoneName) == 0x0001B8, "Member 'Explosion_Molotov_C_CreateDecal::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_CreateDecal, CallFunc_BreakHitResult_HitItem) == 0x0001C0, "Member 'Explosion_Molotov_C_CreateDecal::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_CreateDecal, CallFunc_BreakHitResult_ElementIndex) == 0x0001C4, "Member 'Explosion_Molotov_C_CreateDecal::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_CreateDecal, CallFunc_BreakHitResult_FaceIndex) == 0x0001C8, "Member 'Explosion_Molotov_C_CreateDecal::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_CreateDecal, CallFunc_BreakHitResult_TraceStart) == 0x0001D0, "Member 'Explosion_Molotov_C_CreateDecal::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_CreateDecal, CallFunc_BreakHitResult_TraceEnd) == 0x0001E8, "Member 'Explosion_Molotov_C_CreateDecal::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_CreateDecal, CallFunc_GetCollisionObjectType_ReturnValue) == 0x000200, "Member 'Explosion_Molotov_C_CreateDecal::CallFunc_GetCollisionObjectType_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_CreateDecal, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000208, "Member 'Explosion_Molotov_C_CreateDecal::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_CreateDecal, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000220, "Member 'Explosion_Molotov_C_CreateDecal::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_CreateDecal, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000228, "Member 'Explosion_Molotov_C_CreateDecal::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_CreateDecal, CallFunc_K2_SetActorRotation_ReturnValue) == 0x000240, "Member 'Explosion_Molotov_C_CreateDecal::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_CreateDecal, CallFunc_RebaseLocalOriginOntoZero_ReturnValue) == 0x000248, "Member 'Explosion_Molotov_C_CreateDecal::CallFunc_RebaseLocalOriginOntoZero_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_CreateDecal, CallFunc_MakeTransform_ReturnValue) == 0x000260, "Member 'Explosion_Molotov_C_CreateDecal::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_CreateDecal, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0002C0, "Member 'Explosion_Molotov_C_CreateDecal::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_CreateDecal, CallFunc_FinishSpawningActor_ReturnValue) == 0x0002C8, "Member 'Explosion_Molotov_C_CreateDecal::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function Explosion_Molotov.Explosion_Molotov_C.DecalMolotov
// 0x0230 (0x0230 - 0x0000)
struct Explosion_Molotov_C_DecalMolotov final
{
public:
	double                                        Radius;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0018(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FHitResult>                     CallFunc_SphereTraceMulti_OutHits;                 // 0x0048(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceMulti_ReturnValue;             // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_Array_Get_Item;                           // 0x0060(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14A[0x2];                                      // 0x014A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionChannel                             CallFunc_GetCollisionObjectType_ReturnValue;       // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0225(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0226(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0227(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_229[0x3];                                      // 0x0229(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SphereTraceMulti_Radius_ImplicitCast;     // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Explosion_Molotov_C_DecalMolotov) == 0x000008, "Wrong alignment on Explosion_Molotov_C_DecalMolotov");
static_assert(sizeof(Explosion_Molotov_C_DecalMolotov) == 0x000230, "Wrong size on Explosion_Molotov_C_DecalMolotov");
static_assert(offsetof(Explosion_Molotov_C_DecalMolotov, Radius) == 0x000000, "Member 'Explosion_Molotov_C_DecalMolotov::Radius' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_DecalMolotov, Temp_bool_True_if_break_was_hit_Variable) == 0x000008, "Member 'Explosion_Molotov_C_DecalMolotov::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_DecalMolotov, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'Explosion_Molotov_C_DecalMolotov::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_DecalMolotov, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'Explosion_Molotov_C_DecalMolotov::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_DecalMolotov, Temp_object_Variable) == 0x000018, "Member 'Explosion_Molotov_C_DecalMolotov::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_DecalMolotov, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'Explosion_Molotov_C_DecalMolotov::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_DecalMolotov, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000030, "Member 'Explosion_Molotov_C_DecalMolotov::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_DecalMolotov, CallFunc_SphereTraceMulti_OutHits) == 0x000048, "Member 'Explosion_Molotov_C_DecalMolotov::CallFunc_SphereTraceMulti_OutHits' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_DecalMolotov, CallFunc_SphereTraceMulti_ReturnValue) == 0x000058, "Member 'Explosion_Molotov_C_DecalMolotov::CallFunc_SphereTraceMulti_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_DecalMolotov, CallFunc_Add_IntInt_ReturnValue) == 0x00005C, "Member 'Explosion_Molotov_C_DecalMolotov::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_DecalMolotov, CallFunc_Array_Get_Item) == 0x000060, "Member 'Explosion_Molotov_C_DecalMolotov::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_DecalMolotov, CallFunc_BreakHitResult_bBlockingHit) == 0x000148, "Member 'Explosion_Molotov_C_DecalMolotov::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_DecalMolotov, CallFunc_BreakHitResult_bInitialOverlap) == 0x000149, "Member 'Explosion_Molotov_C_DecalMolotov::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_DecalMolotov, CallFunc_BreakHitResult_Time) == 0x00014C, "Member 'Explosion_Molotov_C_DecalMolotov::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_DecalMolotov, CallFunc_BreakHitResult_Distance) == 0x000150, "Member 'Explosion_Molotov_C_DecalMolotov::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_DecalMolotov, CallFunc_BreakHitResult_Location) == 0x000158, "Member 'Explosion_Molotov_C_DecalMolotov::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_DecalMolotov, CallFunc_BreakHitResult_ImpactPoint) == 0x000170, "Member 'Explosion_Molotov_C_DecalMolotov::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_DecalMolotov, CallFunc_BreakHitResult_Normal) == 0x000188, "Member 'Explosion_Molotov_C_DecalMolotov::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_DecalMolotov, CallFunc_BreakHitResult_ImpactNormal) == 0x0001A0, "Member 'Explosion_Molotov_C_DecalMolotov::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_DecalMolotov, CallFunc_BreakHitResult_PhysMat) == 0x0001B8, "Member 'Explosion_Molotov_C_DecalMolotov::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_DecalMolotov, CallFunc_BreakHitResult_HitActor) == 0x0001C0, "Member 'Explosion_Molotov_C_DecalMolotov::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_DecalMolotov, CallFunc_BreakHitResult_HitComponent) == 0x0001C8, "Member 'Explosion_Molotov_C_DecalMolotov::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_DecalMolotov, CallFunc_BreakHitResult_HitBoneName) == 0x0001D0, "Member 'Explosion_Molotov_C_DecalMolotov::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_DecalMolotov, CallFunc_BreakHitResult_BoneName) == 0x0001D8, "Member 'Explosion_Molotov_C_DecalMolotov::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_DecalMolotov, CallFunc_BreakHitResult_HitItem) == 0x0001E0, "Member 'Explosion_Molotov_C_DecalMolotov::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_DecalMolotov, CallFunc_BreakHitResult_ElementIndex) == 0x0001E4, "Member 'Explosion_Molotov_C_DecalMolotov::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_DecalMolotov, CallFunc_BreakHitResult_FaceIndex) == 0x0001E8, "Member 'Explosion_Molotov_C_DecalMolotov::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_DecalMolotov, CallFunc_BreakHitResult_TraceStart) == 0x0001F0, "Member 'Explosion_Molotov_C_DecalMolotov::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_DecalMolotov, CallFunc_BreakHitResult_TraceEnd) == 0x000208, "Member 'Explosion_Molotov_C_DecalMolotov::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_DecalMolotov, CallFunc_Array_Length_ReturnValue) == 0x000220, "Member 'Explosion_Molotov_C_DecalMolotov::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_DecalMolotov, CallFunc_GetCollisionObjectType_ReturnValue) == 0x000224, "Member 'Explosion_Molotov_C_DecalMolotov::CallFunc_GetCollisionObjectType_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_DecalMolotov, CallFunc_Less_IntInt_ReturnValue) == 0x000225, "Member 'Explosion_Molotov_C_DecalMolotov::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_DecalMolotov, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000226, "Member 'Explosion_Molotov_C_DecalMolotov::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_DecalMolotov, CallFunc_BooleanAND_ReturnValue) == 0x000227, "Member 'Explosion_Molotov_C_DecalMolotov::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_DecalMolotov, CallFunc_BooleanAND_ReturnValue_1) == 0x000228, "Member 'Explosion_Molotov_C_DecalMolotov::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_DecalMolotov, CallFunc_SphereTraceMulti_Radius_ImplicitCast) == 0x00022C, "Member 'Explosion_Molotov_C_DecalMolotov::CallFunc_SphereTraceMulti_Radius_ImplicitCast' has a wrong offset!");

// Function Explosion_Molotov.Explosion_Molotov_C.DecalMolotovPerSecond
// 0x0010 (0x0010 - 0x0000)
struct Explosion_Molotov_C_DecalMolotovPerSecond final
{
public:
	TArray<struct FHitResult>                     Objects;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(Explosion_Molotov_C_DecalMolotovPerSecond) == 0x000008, "Wrong alignment on Explosion_Molotov_C_DecalMolotovPerSecond");
static_assert(sizeof(Explosion_Molotov_C_DecalMolotovPerSecond) == 0x000010, "Wrong size on Explosion_Molotov_C_DecalMolotovPerSecond");
static_assert(offsetof(Explosion_Molotov_C_DecalMolotovPerSecond, Objects) == 0x000000, "Member 'Explosion_Molotov_C_DecalMolotovPerSecond::Objects' has a wrong offset!");

// Function Explosion_Molotov.Explosion_Molotov_C.EventEndMolotovOverlap
// 0x0038 (0x0038 - 0x0000)
struct Explosion_Molotov_C_EventEndMolotovOverlap final
{
public:
	class ASurvivalPlayer_C*                      Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Param_Damage;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Origin;                                            // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Radius;                                            // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Param_TimeDamage;                                  // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Explosion_Molotov_C_EventEndMolotovOverlap) == 0x000008, "Wrong alignment on Explosion_Molotov_C_EventEndMolotovOverlap");
static_assert(sizeof(Explosion_Molotov_C_EventEndMolotovOverlap) == 0x000038, "Wrong size on Explosion_Molotov_C_EventEndMolotovOverlap");
static_assert(offsetof(Explosion_Molotov_C_EventEndMolotovOverlap, Player) == 0x000000, "Member 'Explosion_Molotov_C_EventEndMolotovOverlap::Player' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_EventEndMolotovOverlap, Param_Damage) == 0x000008, "Member 'Explosion_Molotov_C_EventEndMolotovOverlap::Param_Damage' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_EventEndMolotovOverlap, Origin) == 0x000010, "Member 'Explosion_Molotov_C_EventEndMolotovOverlap::Origin' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_EventEndMolotovOverlap, Radius) == 0x000028, "Member 'Explosion_Molotov_C_EventEndMolotovOverlap::Radius' has a wrong offset!");
static_assert(offsetof(Explosion_Molotov_C_EventEndMolotovOverlap, Param_TimeDamage) == 0x000030, "Member 'Explosion_Molotov_C_EventEndMolotovOverlap::Param_TimeDamage' has a wrong offset!");

// Function Explosion_Molotov.Explosion_Molotov_C.ExecuteUbergraph_Explosion_Molotov
// 0x0D90 (0x0D90 - 0x0000)
struct Explosion_Molotov_C_ExecuteUbergraph_Explosion_Molotov final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	class ASurvivalPlayer_C*                      K2Node_CustomEvent_Player;                         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Damage;                         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Origin;                         // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Radius;                         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_TimeDamage;                     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0070(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16A[0x6];                                      // 0x016A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0170(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0180(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable_1;                            // 0x0190(0x0010)(ConstParm, ReferenceParm)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player_1;            // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AA[0x6];                                      // 0x01AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1;  // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x01DC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x01F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFGrenadeInfo                          CallFunc_GetDataTableRowFromName_OutRow;           // 0x0208(0x0348)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0550(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_551[0x7];                                      // 0x0551(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0558(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_2;  // 0x0560(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_561[0x7];                                      // 0x0561(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable_2;                            // 0x0568(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0578(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0588(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<struct FHitResult>                     K2Node_CustomEvent_Objects;                        // 0x0590(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	struct FHitResult                             CallFunc_Array_Random_OutItem;                     // 0x05A0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x0688(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x068C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0690(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0691(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_692[0x2];                                      // 0x0692(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0694(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0698(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69C[0x4];                                      // 0x069C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x06A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x06B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x06D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x06E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0700(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0708(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0710(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0718(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0720(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0728(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x072C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0730(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_734[0x4];                                      // 0x0734(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0738(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0750(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0768(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_Conv_VectorToTransform_ReturnValue;       // 0x0770(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x07D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x07D8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x07E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x07E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x07F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0808(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0820(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_HasSurface;                     // 0x0838(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_839[0x7];                                      // 0x0839(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_Normal_decal;                   // 0x0840(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0858(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0940(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x0941(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x0942(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_943[0x1];                                      // 0x0943(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x0944(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x0948(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94C[0x4];                                      // 0x094C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x0950(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x0968(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x0980(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x0998(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x09B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x09B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x09C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x09C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName_1;                // 0x09D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x09D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x09DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
