#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Explosion_F1

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FGrenadeInfo_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Explosion_F1.Explosion_F1_C.ExecuteUbergraph_Explosion_F1
// 0x08C0 (0x08C0 - 0x0000)
struct Explosion_F1_C_ExecuteUbergraph_Explosion_F1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_BaseDamage;                     // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_MinimumDamage;                  // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_Origin;                         // 0x0060(0x0018)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_DamageInnerRadius;              // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_DamageOuterRadius;              // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_DamageFalloff;                  // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Radius_1;                       // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_End_1;                          // 0x0088(0x0018)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Start_1;                        // 0x00A0(0x0018)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFMODAudioComponent*                    CallFunc_PlayEventWithOcclusion_FMODAudioComponent; // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_ApplyRadialDamageWithFalloff_ReturnValue; // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable_1;        // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFGrenadeInfo                          CallFunc_GetDataTableRowFromName_OutRow;           // 0x0100(0x0348)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_449[0x7];                                      // 0x0449(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_Radius;                         // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_End;                            // 0x0458(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Start;                          // 0x0470(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0488(0x0010)(ConstParm, ReferenceParm)
	struct FHitResult                             CallFunc_Array_Get_Item;                           // 0x0498(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TArray<struct FHitResult>                     CallFunc_SphereTraceMulti_OutHits;                 // 0x0580(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceMulti_ReturnValue;             // 0x0590(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0591(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0592(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_593[0x1];                                      // 0x0593(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0594(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0598(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59C[0x4];                                      // 0x059C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x05A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x05B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x05D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x05E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0600(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0608(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0610(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0618(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0620(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0628(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x062C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0630(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_634[0x4];                                      // 0x0634(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0638(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0650(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0668(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0670(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_671[0x3];                                      // 0x0671(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0674(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0678(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0679(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67A[0x6];                                      // 0x067A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable_1;                            // 0x0680(0x0010)(ConstParm, ReferenceParm)
	struct FHitResult                             CallFunc_Array_Get_Item_1;                         // 0x0690(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TArray<struct FHitResult>                     CallFunc_SphereTraceMulti_OutHits_1;               // 0x0778(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceMulti_ReturnValue_1;           // 0x0788(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x0789(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x078A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_78B[0x1];                                      // 0x078B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x078C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x0790(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_794[0x4];                                      // 0x0794(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x0798(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x07B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x07C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x07E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x07F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0800(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0808(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0810(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName_1;                // 0x0818(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0820(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x0824(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x0828(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82C[0x4];                                      // 0x082C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x0830(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x0848(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player_1;            // 0x0860(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0868(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_869[0x3];                                      // 0x0869(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x086C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0870(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_871[0x7];                                      // 0x0871(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue_1;        // 0x0878(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0888(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_889[0x3];                                      // 0x0889(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDistanceTo_ReturnValue;                // 0x088C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToString_InDouble_ImplicitCast; // 0x0890(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_StartRadialDamage_BaseDamage_ImplicitCast; // 0x0898(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_StartRadialDamage_MinimumDamage_ImplicitCast; // 0x089C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_StartRadialDamage_DamageInnerRadius_ImplicitCast; // 0x08A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_StartRadialDamage_DamageOuterRadius_ImplicitCast; // 0x08A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_StartRadialDamage_DamageFalloff_ImplicitCast; // 0x08A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_Radius_ImplicitCast;            // 0x08AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetLifeSpan_InLifespan_ImplicitCast;      // 0x08B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SphereTraceMulti_Radius_ImplicitCast;     // 0x08B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_DistanceToExplosion_ImplicitCast; // 0x08B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1) == 0x000008, "Wrong alignment on Explosion_F1_C_ExecuteUbergraph_Explosion_F1");
static_assert(sizeof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1) == 0x0008C0, "Wrong size on Explosion_F1_C_ExecuteUbergraph_Explosion_F1");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, EntryPoint) == 0x000000, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::EntryPoint' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_GetInstigator_ReturnValue) == 0x000008, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_GetController_ReturnValue) == 0x000010, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, Temp_int_Array_Index_Variable) == 0x000018, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000028, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, Temp_bool_True_if_break_was_hit_Variable) == 0x000040, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_Not_PreBool_ReturnValue) == 0x000041, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_GetOwner_ReturnValue) == 0x000048, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_Array_Add_ReturnValue) == 0x000050, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, K2Node_CustomEvent_BaseDamage) == 0x000054, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::K2Node_CustomEvent_BaseDamage' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, K2Node_CustomEvent_MinimumDamage) == 0x000058, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::K2Node_CustomEvent_MinimumDamage' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, K2Node_CustomEvent_Origin) == 0x000060, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::K2Node_CustomEvent_Origin' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, K2Node_CustomEvent_DamageInnerRadius) == 0x000078, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::K2Node_CustomEvent_DamageInnerRadius' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, K2Node_CustomEvent_DamageOuterRadius) == 0x00007C, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::K2Node_CustomEvent_DamageOuterRadius' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, K2Node_CustomEvent_DamageFalloff) == 0x000080, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::K2Node_CustomEvent_DamageFalloff' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, K2Node_CustomEvent_Radius_1) == 0x000084, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::K2Node_CustomEvent_Radius_1' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, K2Node_CustomEvent_End_1) == 0x000088, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::K2Node_CustomEvent_End_1' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, K2Node_CustomEvent_Start_1) == 0x0000A0, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::K2Node_CustomEvent_Start_1' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_PlayEventWithOcclusion_FMODAudioComponent) == 0x0000B8, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_PlayEventWithOcclusion_FMODAudioComponent' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_Conv_DoubleToString_ReturnValue) == 0x0000C0, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_Conv_DoubleToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_ApplyRadialDamageWithFalloff_ReturnValue) == 0x0000D0, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_ApplyRadialDamageWithFalloff_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_Concat_StrStr_ReturnValue) == 0x0000D8, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, Temp_bool_True_if_break_was_hit_Variable_1) == 0x0000E8, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::Temp_bool_True_if_break_was_hit_Variable_1' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, Temp_int_Loop_Counter_Variable_1) == 0x0000EC, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000F0, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000F4, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, Temp_int_Array_Index_Variable_1) == 0x0000F8, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_GetDataTableRowFromName_OutRow) == 0x000100, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000448, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, K2Node_CustomEvent_Radius) == 0x000450, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::K2Node_CustomEvent_Radius' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, K2Node_CustomEvent_End) == 0x000458, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::K2Node_CustomEvent_End' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, K2Node_CustomEvent_Start) == 0x000470, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::K2Node_CustomEvent_Start' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, Temp_object_Variable) == 0x000488, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_Array_Get_Item) == 0x000498, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_SphereTraceMulti_OutHits) == 0x000580, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_SphereTraceMulti_OutHits' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_SphereTraceMulti_ReturnValue) == 0x000590, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_SphereTraceMulti_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_BreakHitResult_bBlockingHit) == 0x000591, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_BreakHitResult_bInitialOverlap) == 0x000592, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_BreakHitResult_Time) == 0x000594, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_BreakHitResult_Distance) == 0x000598, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_BreakHitResult_Location) == 0x0005A0, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_BreakHitResult_ImpactPoint) == 0x0005B8, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_BreakHitResult_Normal) == 0x0005D0, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_BreakHitResult_ImpactNormal) == 0x0005E8, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_BreakHitResult_PhysMat) == 0x000600, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_BreakHitResult_HitActor) == 0x000608, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_BreakHitResult_HitComponent) == 0x000610, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_BreakHitResult_HitBoneName) == 0x000618, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_BreakHitResult_BoneName) == 0x000620, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_BreakHitResult_HitItem) == 0x000628, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_BreakHitResult_ElementIndex) == 0x00062C, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_BreakHitResult_FaceIndex) == 0x000630, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_BreakHitResult_TraceStart) == 0x000638, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_BreakHitResult_TraceEnd) == 0x000650, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, K2Node_DynamicCast_AsSurvival_Player) == 0x000668, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, K2Node_DynamicCast_bSuccess) == 0x000670, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_Array_Length_ReturnValue) == 0x000674, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_Less_IntInt_ReturnValue) == 0x000678, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_BooleanAND_ReturnValue) == 0x000679, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, Temp_object_Variable_1) == 0x000680, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_Array_Get_Item_1) == 0x000690, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_SphereTraceMulti_OutHits_1) == 0x000778, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_SphereTraceMulti_OutHits_1' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_SphereTraceMulti_ReturnValue_1) == 0x000788, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_SphereTraceMulti_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_BreakHitResult_bBlockingHit_1) == 0x000789, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x00078A, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_BreakHitResult_Time_1) == 0x00078C, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_BreakHitResult_Distance_1) == 0x000790, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_BreakHitResult_Location_1) == 0x000798, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_BreakHitResult_ImpactPoint_1) == 0x0007B0, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_BreakHitResult_Normal_1) == 0x0007C8, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_BreakHitResult_ImpactNormal_1) == 0x0007E0, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_BreakHitResult_PhysMat_1) == 0x0007F8, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_BreakHitResult_HitActor_1) == 0x000800, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_BreakHitResult_HitComponent_1) == 0x000808, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_BreakHitResult_HitBoneName_1) == 0x000810, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_BreakHitResult_BoneName_1) == 0x000818, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_BreakHitResult_BoneName_1' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_BreakHitResult_HitItem_1) == 0x000820, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_BreakHitResult_ElementIndex_1) == 0x000824, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_BreakHitResult_ElementIndex_1' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_BreakHitResult_FaceIndex_1) == 0x000828, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_BreakHitResult_TraceStart_1) == 0x000830, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_BreakHitResult_TraceStart_1' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_BreakHitResult_TraceEnd_1) == 0x000848, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_BreakHitResult_TraceEnd_1' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, K2Node_DynamicCast_AsSurvival_Player_1) == 0x000860, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::K2Node_DynamicCast_AsSurvival_Player_1' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, K2Node_DynamicCast_bSuccess_1) == 0x000868, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_Array_Length_ReturnValue_1) == 0x00086C, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_Less_IntInt_ReturnValue_1) == 0x000870, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_Conv_DoubleToString_ReturnValue_1) == 0x000878, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_Conv_DoubleToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_BooleanAND_ReturnValue_1) == 0x000888, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_GetDistanceTo_ReturnValue) == 0x00088C, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_GetDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_Conv_DoubleToString_InDouble_ImplicitCast) == 0x000890, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_Conv_DoubleToString_InDouble_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_StartRadialDamage_BaseDamage_ImplicitCast) == 0x000898, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_StartRadialDamage_BaseDamage_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_StartRadialDamage_MinimumDamage_ImplicitCast) == 0x00089C, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_StartRadialDamage_MinimumDamage_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_StartRadialDamage_DamageInnerRadius_ImplicitCast) == 0x0008A0, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_StartRadialDamage_DamageInnerRadius_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_StartRadialDamage_DamageOuterRadius_ImplicitCast) == 0x0008A4, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_StartRadialDamage_DamageOuterRadius_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_StartRadialDamage_DamageFalloff_ImplicitCast) == 0x0008A8, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_StartRadialDamage_DamageFalloff_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, K2Node_VariableSet_Radius_ImplicitCast) == 0x0008AC, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::K2Node_VariableSet_Radius_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_SetLifeSpan_InLifespan_ImplicitCast) == 0x0008B0, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_SetLifeSpan_InLifespan_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, CallFunc_SphereTraceMulti_Radius_ImplicitCast) == 0x0008B4, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::CallFunc_SphereTraceMulti_Radius_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExecuteUbergraph_Explosion_F1, K2Node_VariableSet_DistanceToExplosion_ImplicitCast) == 0x0008B8, "Member 'Explosion_F1_C_ExecuteUbergraph_Explosion_F1::K2Node_VariableSet_DistanceToExplosion_ImplicitCast' has a wrong offset!");

// Function Explosion_F1.Explosion_F1_C.ExplosionDirty
// 0x0038 (0x0038 - 0x0000)
struct Explosion_F1_C_ExplosionDirty final
{
public:
	double                                        Radius;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                End;                                               // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Start;                                             // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Explosion_F1_C_ExplosionDirty) == 0x000008, "Wrong alignment on Explosion_F1_C_ExplosionDirty");
static_assert(sizeof(Explosion_F1_C_ExplosionDirty) == 0x000038, "Wrong size on Explosion_F1_C_ExplosionDirty");
static_assert(offsetof(Explosion_F1_C_ExplosionDirty, Radius) == 0x000000, "Member 'Explosion_F1_C_ExplosionDirty::Radius' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExplosionDirty, End) == 0x000008, "Member 'Explosion_F1_C_ExplosionDirty::End' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_ExplosionDirty, Start) == 0x000020, "Member 'Explosion_F1_C_ExplosionDirty::Start' has a wrong offset!");

// Function Explosion_F1.Explosion_F1_C.StartRadialDamage
// 0x0060 (0x0060 - 0x0000)
struct Explosion_F1_C_StartRadialDamage final
{
public:
	float                                         BaseDamage;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinimumDamage;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Origin;                                            // 0x0008(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DamageInnerRadius;                                 // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DamageOuterRadius;                                 // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DamageFalloff;                                     // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Radius;                                            // 0x002C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                End;                                               // 0x0030(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Start;                                             // 0x0048(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Explosion_F1_C_StartRadialDamage) == 0x000008, "Wrong alignment on Explosion_F1_C_StartRadialDamage");
static_assert(sizeof(Explosion_F1_C_StartRadialDamage) == 0x000060, "Wrong size on Explosion_F1_C_StartRadialDamage");
static_assert(offsetof(Explosion_F1_C_StartRadialDamage, BaseDamage) == 0x000000, "Member 'Explosion_F1_C_StartRadialDamage::BaseDamage' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_StartRadialDamage, MinimumDamage) == 0x000004, "Member 'Explosion_F1_C_StartRadialDamage::MinimumDamage' has a wrong offset!");
static_assert(offsetof(Explosion_F1_C_StartRadialDamage, Origin) == 0x000008, "Member 'Explosion_F1_C_StartRadialDamage::Origin' has a wrong offset!");
