#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Explosion_CraftF1

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FGrenadeInfo_structs.hpp"


namespace SDK::Params
{

// Function Explosion_CraftF1.Explosion_CraftF1_C.ExecuteUbergraph_Explosion_CraftF1
// 0x05E8 (0x05E8 - 0x0000)
struct Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0018(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFMODAudioComponent*                    CallFunc_PlayEventWithOcclusion_FMODAudioComponent; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable_1;                            // 0x0048(0x0010)(ConstParm, ReferenceParm)
	struct FHitResult                             CallFunc_Array_Get_Item;                           // 0x0058(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TArray<struct FHitResult>                     CallFunc_SphereTraceMulti_OutHits;                 // 0x0140(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceMulti_ReturnValue;             // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0152(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_153[0x1];                                      // 0x0153(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0210(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231[0x3];                                      // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x0240(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x3];                                      // 0x0251(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDistanceTo_ReturnValue;                // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFGrenadeInfo                          CallFunc_GetDataTableRowFromName_OutRow;           // 0x0258(0x0348)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x05A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A1[0x7];                                      // 0x05A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x05A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x05B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ApplyRadialDamageWithFalloff_ReturnValue; // 0x05B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B9[0x7];                                      // 0x05B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_DistanceToExplosion_ImplicitCast; // 0x05C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ApplyRadialDamageWithFalloff_BaseDamage_ImplicitCast; // 0x05C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ApplyRadialDamageWithFalloff_MinimumDamage_ImplicitCast; // 0x05CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ApplyRadialDamageWithFalloff_DamageInnerRadius_ImplicitCast; // 0x05D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ApplyRadialDamageWithFalloff_DamageOuterRadius_ImplicitCast; // 0x05D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ApplyRadialDamageWithFalloff_DamageFalloff_ImplicitCast; // 0x05D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_Radius_ImplicitCast;            // 0x05DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetLifeSpan_InLifespan_ImplicitCast;      // 0x05E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1) == 0x000008, "Wrong alignment on Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1");
static_assert(sizeof(Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1) == 0x0005E8, "Wrong size on Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1");
static_assert(offsetof(Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1, EntryPoint) == 0x000000, "Member 'Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1::EntryPoint' has a wrong offset!");
static_assert(offsetof(Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1, Temp_bool_True_if_break_was_hit_Variable) == 0x000004, "Member 'Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1, Temp_int_Array_Index_Variable) == 0x000008, "Member 'Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1, CallFunc_Not_PreBool_ReturnValue) == 0x00000C, "Member 'Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1, Temp_object_Variable) == 0x000018, "Member 'Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000028, "Member 'Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1, CallFunc_PlayEventWithOcclusion_FMODAudioComponent) == 0x000040, "Member 'Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1::CallFunc_PlayEventWithOcclusion_FMODAudioComponent' has a wrong offset!");
static_assert(offsetof(Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1, Temp_object_Variable_1) == 0x000048, "Member 'Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1, CallFunc_Array_Get_Item) == 0x000058, "Member 'Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1, CallFunc_SphereTraceMulti_OutHits) == 0x000140, "Member 'Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1::CallFunc_SphereTraceMulti_OutHits' has a wrong offset!");
static_assert(offsetof(Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1, CallFunc_SphereTraceMulti_ReturnValue) == 0x000150, "Member 'Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1::CallFunc_SphereTraceMulti_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1, CallFunc_BreakHitResult_bBlockingHit) == 0x000151, "Member 'Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1, CallFunc_BreakHitResult_bInitialOverlap) == 0x000152, "Member 'Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1, CallFunc_BreakHitResult_Time) == 0x000154, "Member 'Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1, CallFunc_BreakHitResult_Distance) == 0x000158, "Member 'Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1, CallFunc_BreakHitResult_Location) == 0x000160, "Member 'Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1, CallFunc_BreakHitResult_ImpactPoint) == 0x000178, "Member 'Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1, CallFunc_BreakHitResult_Normal) == 0x000190, "Member 'Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1, CallFunc_BreakHitResult_ImpactNormal) == 0x0001A8, "Member 'Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1, CallFunc_BreakHitResult_PhysMat) == 0x0001C0, "Member 'Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1, CallFunc_BreakHitResult_HitActor) == 0x0001C8, "Member 'Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1, CallFunc_BreakHitResult_HitComponent) == 0x0001D0, "Member 'Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1, CallFunc_BreakHitResult_HitBoneName) == 0x0001D8, "Member 'Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1, CallFunc_BreakHitResult_BoneName) == 0x0001E0, "Member 'Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1, CallFunc_BreakHitResult_HitItem) == 0x0001E8, "Member 'Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1, CallFunc_BreakHitResult_ElementIndex) == 0x0001EC, "Member 'Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1, CallFunc_BreakHitResult_FaceIndex) == 0x0001F0, "Member 'Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1, CallFunc_BreakHitResult_TraceStart) == 0x0001F8, "Member 'Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1, CallFunc_BreakHitResult_TraceEnd) == 0x000210, "Member 'Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1, K2Node_DynamicCast_AsSurvival_Player) == 0x000228, "Member 'Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1, K2Node_DynamicCast_bSuccess) == 0x000230, "Member 'Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1, CallFunc_Array_Length_ReturnValue) == 0x000234, "Member 'Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1, CallFunc_Less_IntInt_ReturnValue) == 0x000238, "Member 'Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1, CallFunc_Conv_DoubleToString_ReturnValue) == 0x000240, "Member 'Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1::CallFunc_Conv_DoubleToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1, CallFunc_BooleanAND_ReturnValue) == 0x000250, "Member 'Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1, CallFunc_GetDistanceTo_ReturnValue) == 0x000254, "Member 'Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1::CallFunc_GetDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1, CallFunc_GetDataTableRowFromName_OutRow) == 0x000258, "Member 'Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0005A0, "Member 'Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1, CallFunc_GetInstigator_ReturnValue) == 0x0005A8, "Member 'Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1, CallFunc_GetController_ReturnValue) == 0x0005B0, "Member 'Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1, CallFunc_ApplyRadialDamageWithFalloff_ReturnValue) == 0x0005B8, "Member 'Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1::CallFunc_ApplyRadialDamageWithFalloff_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1, K2Node_VariableSet_DistanceToExplosion_ImplicitCast) == 0x0005C0, "Member 'Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1::K2Node_VariableSet_DistanceToExplosion_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1, CallFunc_ApplyRadialDamageWithFalloff_BaseDamage_ImplicitCast) == 0x0005C8, "Member 'Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1::CallFunc_ApplyRadialDamageWithFalloff_BaseDamage_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1, CallFunc_ApplyRadialDamageWithFalloff_MinimumDamage_ImplicitCast) == 0x0005CC, "Member 'Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1::CallFunc_ApplyRadialDamageWithFalloff_MinimumDamage_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1, CallFunc_ApplyRadialDamageWithFalloff_DamageInnerRadius_ImplicitCast) == 0x0005D0, "Member 'Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1::CallFunc_ApplyRadialDamageWithFalloff_DamageInnerRadius_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1, CallFunc_ApplyRadialDamageWithFalloff_DamageOuterRadius_ImplicitCast) == 0x0005D4, "Member 'Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1::CallFunc_ApplyRadialDamageWithFalloff_DamageOuterRadius_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1, CallFunc_ApplyRadialDamageWithFalloff_DamageFalloff_ImplicitCast) == 0x0005D8, "Member 'Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1::CallFunc_ApplyRadialDamageWithFalloff_DamageFalloff_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1, K2Node_VariableSet_Radius_ImplicitCast) == 0x0005DC, "Member 'Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1::K2Node_VariableSet_Radius_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1, CallFunc_SetLifeSpan_InLifespan_ImplicitCast) == 0x0005E0, "Member 'Explosion_CraftF1_C_ExecuteUbergraph_Explosion_CraftF1::CallFunc_SetLifeSpan_InLifespan_ImplicitCast' has a wrong offset!");

}

