#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Explosion

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FGrenadeInfo_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Explosion.Explosion_C.ExecuteUbergraph_Explosion
// 0x06B8 (0x06B8 - 0x0000)
struct Explosion_C_ExecuteUbergraph_Explosion final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFMODAudioComponent*                    CallFunc_PlayEventWithOcclusion_FMODAudioComponent; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFGrenadeInfo                          CallFunc_GetDataTableRowFromName_OutRow;           // 0x0010(0x0348)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFGrenadeInfo                          CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0360(0x0348)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x06A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A9[0x3];                                      // 0x06A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetLifeSpan_InLifespan_ImplicitCast;      // 0x06AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_Radius_ImplicitCast;            // 0x06B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Explosion_C_ExecuteUbergraph_Explosion) == 0x000008, "Wrong alignment on Explosion_C_ExecuteUbergraph_Explosion");
static_assert(sizeof(Explosion_C_ExecuteUbergraph_Explosion) == 0x0006B8, "Wrong size on Explosion_C_ExecuteUbergraph_Explosion");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_Explosion, EntryPoint) == 0x000000, "Member 'Explosion_C_ExecuteUbergraph_Explosion::EntryPoint' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_Explosion, CallFunc_PlayEventWithOcclusion_FMODAudioComponent) == 0x000008, "Member 'Explosion_C_ExecuteUbergraph_Explosion::CallFunc_PlayEventWithOcclusion_FMODAudioComponent' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_Explosion, CallFunc_GetDataTableRowFromName_OutRow) == 0x000010, "Member 'Explosion_C_ExecuteUbergraph_Explosion::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_Explosion, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000358, "Member 'Explosion_C_ExecuteUbergraph_Explosion::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_Explosion, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000360, "Member 'Explosion_C_ExecuteUbergraph_Explosion::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_Explosion, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x0006A8, "Member 'Explosion_C_ExecuteUbergraph_Explosion::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_Explosion, CallFunc_SetLifeSpan_InLifespan_ImplicitCast) == 0x0006AC, "Member 'Explosion_C_ExecuteUbergraph_Explosion::CallFunc_SetLifeSpan_InLifespan_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_Explosion, K2Node_VariableSet_Radius_ImplicitCast) == 0x0006B0, "Member 'Explosion_C_ExecuteUbergraph_Explosion::K2Node_VariableSet_Radius_ImplicitCast' has a wrong offset!");

// Function Explosion.Explosion_C.WallCheckGrenade
// 0x0358 (0x0358 - 0x0000)
struct Explosion_C_WallCheckGrenade final
{
public:
	struct FVector                                Start;                                             // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                End;                                               // 0x0018(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Radius;                                            // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      AsSurvival_Player;                                 // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0058(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FHitResult>                     CallFunc_SphereTraceMulti_OutHits;                 // 0x0068(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceMulti_ReturnValue;             // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_Array_Get_Item;                           // 0x0080(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x016D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16E[0x2];                                      // 0x016E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0210(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0228(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0252(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_253[0x5];                                      // 0x0253(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0258(0x0010)(ConstParm, ReferenceParm)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0268(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351[0x3];                                      // 0x0351(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SphereTraceMulti_Radius_ImplicitCast;     // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Explosion_C_WallCheckGrenade) == 0x000008, "Wrong alignment on Explosion_C_WallCheckGrenade");
static_assert(sizeof(Explosion_C_WallCheckGrenade) == 0x000358, "Wrong size on Explosion_C_WallCheckGrenade");
static_assert(offsetof(Explosion_C_WallCheckGrenade, Start) == 0x000000, "Member 'Explosion_C_WallCheckGrenade::Start' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenade, End) == 0x000018, "Member 'Explosion_C_WallCheckGrenade::End' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenade, Radius) == 0x000030, "Member 'Explosion_C_WallCheckGrenade::Radius' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenade, AsSurvival_Player) == 0x000038, "Member 'Explosion_C_WallCheckGrenade::AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenade, Temp_bool_True_if_break_was_hit_Variable) == 0x000040, "Member 'Explosion_C_WallCheckGrenade::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenade, Temp_int_Array_Index_Variable) == 0x000044, "Member 'Explosion_C_WallCheckGrenade::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenade, CallFunc_Not_PreBool_ReturnValue) == 0x000048, "Member 'Explosion_C_WallCheckGrenade::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenade, Temp_int_Loop_Counter_Variable) == 0x00004C, "Member 'Explosion_C_WallCheckGrenade::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenade, CallFunc_Add_IntInt_ReturnValue) == 0x000050, "Member 'Explosion_C_WallCheckGrenade::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenade, Temp_object_Variable) == 0x000058, "Member 'Explosion_C_WallCheckGrenade::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenade, CallFunc_SphereTraceMulti_OutHits) == 0x000068, "Member 'Explosion_C_WallCheckGrenade::CallFunc_SphereTraceMulti_OutHits' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenade, CallFunc_SphereTraceMulti_ReturnValue) == 0x000078, "Member 'Explosion_C_WallCheckGrenade::CallFunc_SphereTraceMulti_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenade, CallFunc_Array_Get_Item) == 0x000080, "Member 'Explosion_C_WallCheckGrenade::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenade, CallFunc_Array_Length_ReturnValue) == 0x000168, "Member 'Explosion_C_WallCheckGrenade::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenade, CallFunc_BreakHitResult_bBlockingHit) == 0x00016C, "Member 'Explosion_C_WallCheckGrenade::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenade, CallFunc_BreakHitResult_bInitialOverlap) == 0x00016D, "Member 'Explosion_C_WallCheckGrenade::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenade, CallFunc_BreakHitResult_Time) == 0x000170, "Member 'Explosion_C_WallCheckGrenade::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenade, CallFunc_BreakHitResult_Distance) == 0x000174, "Member 'Explosion_C_WallCheckGrenade::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenade, CallFunc_BreakHitResult_Location) == 0x000178, "Member 'Explosion_C_WallCheckGrenade::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenade, CallFunc_BreakHitResult_ImpactPoint) == 0x000190, "Member 'Explosion_C_WallCheckGrenade::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenade, CallFunc_BreakHitResult_Normal) == 0x0001A8, "Member 'Explosion_C_WallCheckGrenade::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenade, CallFunc_BreakHitResult_ImpactNormal) == 0x0001C0, "Member 'Explosion_C_WallCheckGrenade::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenade, CallFunc_BreakHitResult_PhysMat) == 0x0001D8, "Member 'Explosion_C_WallCheckGrenade::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenade, CallFunc_BreakHitResult_HitActor) == 0x0001E0, "Member 'Explosion_C_WallCheckGrenade::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenade, CallFunc_BreakHitResult_HitComponent) == 0x0001E8, "Member 'Explosion_C_WallCheckGrenade::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenade, CallFunc_BreakHitResult_HitBoneName) == 0x0001F0, "Member 'Explosion_C_WallCheckGrenade::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenade, CallFunc_BreakHitResult_BoneName) == 0x0001F8, "Member 'Explosion_C_WallCheckGrenade::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenade, CallFunc_BreakHitResult_HitItem) == 0x000200, "Member 'Explosion_C_WallCheckGrenade::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenade, CallFunc_BreakHitResult_ElementIndex) == 0x000204, "Member 'Explosion_C_WallCheckGrenade::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenade, CallFunc_BreakHitResult_FaceIndex) == 0x000208, "Member 'Explosion_C_WallCheckGrenade::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenade, CallFunc_BreakHitResult_TraceStart) == 0x000210, "Member 'Explosion_C_WallCheckGrenade::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenade, CallFunc_BreakHitResult_TraceEnd) == 0x000228, "Member 'Explosion_C_WallCheckGrenade::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenade, CallFunc_Less_IntInt_ReturnValue) == 0x000240, "Member 'Explosion_C_WallCheckGrenade::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenade, K2Node_DynamicCast_AsSurvival_Player) == 0x000248, "Member 'Explosion_C_WallCheckGrenade::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenade, K2Node_DynamicCast_bSuccess) == 0x000250, "Member 'Explosion_C_WallCheckGrenade::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenade, CallFunc_BooleanAND_ReturnValue) == 0x000251, "Member 'Explosion_C_WallCheckGrenade::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenade, CallFunc_IsLocallyControlled_ReturnValue) == 0x000252, "Member 'Explosion_C_WallCheckGrenade::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenade, K2Node_MakeArray_Array) == 0x000258, "Member 'Explosion_C_WallCheckGrenade::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenade, CallFunc_LineTraceSingle_OutHit) == 0x000268, "Member 'Explosion_C_WallCheckGrenade::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenade, CallFunc_LineTraceSingle_ReturnValue) == 0x000350, "Member 'Explosion_C_WallCheckGrenade::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenade, CallFunc_SphereTraceMulti_Radius_ImplicitCast) == 0x000354, "Member 'Explosion_C_WallCheckGrenade::CallFunc_SphereTraceMulti_Radius_ImplicitCast' has a wrong offset!");

// Function Explosion.Explosion_C.WallCheckGrenadeOnCamera
// 0x0370 (0x0370 - 0x0000)
struct Explosion_C_WallCheckGrenadeOnCamera final
{
public:
	struct FVector                                Start;                                             // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                End;                                               // 0x0018(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Radius;                                            // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      AsSurvival_Player;                                 // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0058(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FHitResult>                     CallFunc_SphereTraceMulti_OutHits;                 // 0x0068(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceMulti_ReturnValue;             // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_Array_Get_Item;                           // 0x0080(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x016D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16E[0x2];                                      // 0x016E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0210(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0228(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0252(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_253[0x5];                                      // 0x0253(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0258(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0270(0x0010)(ConstParm, ReferenceParm)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0280(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_369[0x3];                                      // 0x0369(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SphereTraceMulti_Radius_ImplicitCast;     // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Explosion_C_WallCheckGrenadeOnCamera) == 0x000008, "Wrong alignment on Explosion_C_WallCheckGrenadeOnCamera");
static_assert(sizeof(Explosion_C_WallCheckGrenadeOnCamera) == 0x000370, "Wrong size on Explosion_C_WallCheckGrenadeOnCamera");
static_assert(offsetof(Explosion_C_WallCheckGrenadeOnCamera, Start) == 0x000000, "Member 'Explosion_C_WallCheckGrenadeOnCamera::Start' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenadeOnCamera, End) == 0x000018, "Member 'Explosion_C_WallCheckGrenadeOnCamera::End' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenadeOnCamera, Radius) == 0x000030, "Member 'Explosion_C_WallCheckGrenadeOnCamera::Radius' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenadeOnCamera, AsSurvival_Player) == 0x000038, "Member 'Explosion_C_WallCheckGrenadeOnCamera::AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenadeOnCamera, Temp_bool_True_if_break_was_hit_Variable) == 0x000040, "Member 'Explosion_C_WallCheckGrenadeOnCamera::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenadeOnCamera, Temp_int_Array_Index_Variable) == 0x000044, "Member 'Explosion_C_WallCheckGrenadeOnCamera::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenadeOnCamera, CallFunc_Not_PreBool_ReturnValue) == 0x000048, "Member 'Explosion_C_WallCheckGrenadeOnCamera::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenadeOnCamera, Temp_int_Loop_Counter_Variable) == 0x00004C, "Member 'Explosion_C_WallCheckGrenadeOnCamera::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenadeOnCamera, CallFunc_Add_IntInt_ReturnValue) == 0x000050, "Member 'Explosion_C_WallCheckGrenadeOnCamera::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenadeOnCamera, Temp_object_Variable) == 0x000058, "Member 'Explosion_C_WallCheckGrenadeOnCamera::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenadeOnCamera, CallFunc_SphereTraceMulti_OutHits) == 0x000068, "Member 'Explosion_C_WallCheckGrenadeOnCamera::CallFunc_SphereTraceMulti_OutHits' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenadeOnCamera, CallFunc_SphereTraceMulti_ReturnValue) == 0x000078, "Member 'Explosion_C_WallCheckGrenadeOnCamera::CallFunc_SphereTraceMulti_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenadeOnCamera, CallFunc_Array_Get_Item) == 0x000080, "Member 'Explosion_C_WallCheckGrenadeOnCamera::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenadeOnCamera, CallFunc_Array_Length_ReturnValue) == 0x000168, "Member 'Explosion_C_WallCheckGrenadeOnCamera::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenadeOnCamera, CallFunc_BreakHitResult_bBlockingHit) == 0x00016C, "Member 'Explosion_C_WallCheckGrenadeOnCamera::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenadeOnCamera, CallFunc_BreakHitResult_bInitialOverlap) == 0x00016D, "Member 'Explosion_C_WallCheckGrenadeOnCamera::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenadeOnCamera, CallFunc_BreakHitResult_Time) == 0x000170, "Member 'Explosion_C_WallCheckGrenadeOnCamera::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenadeOnCamera, CallFunc_BreakHitResult_Distance) == 0x000174, "Member 'Explosion_C_WallCheckGrenadeOnCamera::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenadeOnCamera, CallFunc_BreakHitResult_Location) == 0x000178, "Member 'Explosion_C_WallCheckGrenadeOnCamera::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenadeOnCamera, CallFunc_BreakHitResult_ImpactPoint) == 0x000190, "Member 'Explosion_C_WallCheckGrenadeOnCamera::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenadeOnCamera, CallFunc_BreakHitResult_Normal) == 0x0001A8, "Member 'Explosion_C_WallCheckGrenadeOnCamera::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenadeOnCamera, CallFunc_BreakHitResult_ImpactNormal) == 0x0001C0, "Member 'Explosion_C_WallCheckGrenadeOnCamera::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenadeOnCamera, CallFunc_BreakHitResult_PhysMat) == 0x0001D8, "Member 'Explosion_C_WallCheckGrenadeOnCamera::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenadeOnCamera, CallFunc_BreakHitResult_HitActor) == 0x0001E0, "Member 'Explosion_C_WallCheckGrenadeOnCamera::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenadeOnCamera, CallFunc_BreakHitResult_HitComponent) == 0x0001E8, "Member 'Explosion_C_WallCheckGrenadeOnCamera::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenadeOnCamera, CallFunc_BreakHitResult_HitBoneName) == 0x0001F0, "Member 'Explosion_C_WallCheckGrenadeOnCamera::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenadeOnCamera, CallFunc_BreakHitResult_BoneName) == 0x0001F8, "Member 'Explosion_C_WallCheckGrenadeOnCamera::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenadeOnCamera, CallFunc_BreakHitResult_HitItem) == 0x000200, "Member 'Explosion_C_WallCheckGrenadeOnCamera::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenadeOnCamera, CallFunc_BreakHitResult_ElementIndex) == 0x000204, "Member 'Explosion_C_WallCheckGrenadeOnCamera::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenadeOnCamera, CallFunc_BreakHitResult_FaceIndex) == 0x000208, "Member 'Explosion_C_WallCheckGrenadeOnCamera::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenadeOnCamera, CallFunc_BreakHitResult_TraceStart) == 0x000210, "Member 'Explosion_C_WallCheckGrenadeOnCamera::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenadeOnCamera, CallFunc_BreakHitResult_TraceEnd) == 0x000228, "Member 'Explosion_C_WallCheckGrenadeOnCamera::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenadeOnCamera, CallFunc_Less_IntInt_ReturnValue) == 0x000240, "Member 'Explosion_C_WallCheckGrenadeOnCamera::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenadeOnCamera, K2Node_DynamicCast_AsSurvival_Player) == 0x000248, "Member 'Explosion_C_WallCheckGrenadeOnCamera::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenadeOnCamera, K2Node_DynamicCast_bSuccess) == 0x000250, "Member 'Explosion_C_WallCheckGrenadeOnCamera::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenadeOnCamera, CallFunc_BooleanAND_ReturnValue) == 0x000251, "Member 'Explosion_C_WallCheckGrenadeOnCamera::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenadeOnCamera, CallFunc_IsLocallyControlled_ReturnValue) == 0x000252, "Member 'Explosion_C_WallCheckGrenadeOnCamera::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenadeOnCamera, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000258, "Member 'Explosion_C_WallCheckGrenadeOnCamera::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenadeOnCamera, K2Node_MakeArray_Array) == 0x000270, "Member 'Explosion_C_WallCheckGrenadeOnCamera::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenadeOnCamera, CallFunc_LineTraceSingle_OutHit) == 0x000280, "Member 'Explosion_C_WallCheckGrenadeOnCamera::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenadeOnCamera, CallFunc_LineTraceSingle_ReturnValue) == 0x000368, "Member 'Explosion_C_WallCheckGrenadeOnCamera::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenadeOnCamera, CallFunc_SphereTraceMulti_Radius_ImplicitCast) == 0x00036C, "Member 'Explosion_C_WallCheckGrenadeOnCamera::CallFunc_SphereTraceMulti_Radius_ImplicitCast' has a wrong offset!");

// Function Explosion.Explosion_C.WallCheckGrenadeOnCameraFarPlayer
// 0x0378 (0x0378 - 0x0000)
struct Explosion_C_WallCheckGrenadeOnCameraFarPlayer final
{
public:
	struct FVector                                Start;                                             // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                End;                                               // 0x0018(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Radius;                                            // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      AsSurvival_Player;                                 // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0060(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FHitResult>                     CallFunc_SphereTraceMulti_OutHits;                 // 0x0070(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceMulti_ReturnValue;             // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_Array_Get_Item;                           // 0x0088(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0175(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_176[0x2];                                      // 0x0176(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0198(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0218(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0230(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x025A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25B[0x5];                                      // 0x025B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0260(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0278(0x0010)(ConstParm, ReferenceParm)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0288(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_371[0x3];                                      // 0x0371(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SphereTraceMulti_Radius_ImplicitCast;     // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Explosion_C_WallCheckGrenadeOnCameraFarPlayer) == 0x000008, "Wrong alignment on Explosion_C_WallCheckGrenadeOnCameraFarPlayer");
static_assert(sizeof(Explosion_C_WallCheckGrenadeOnCameraFarPlayer) == 0x000378, "Wrong size on Explosion_C_WallCheckGrenadeOnCameraFarPlayer");
static_assert(offsetof(Explosion_C_WallCheckGrenadeOnCameraFarPlayer, Start) == 0x000000, "Member 'Explosion_C_WallCheckGrenadeOnCameraFarPlayer::Start' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenadeOnCameraFarPlayer, End) == 0x000018, "Member 'Explosion_C_WallCheckGrenadeOnCameraFarPlayer::End' has a wrong offset!");
static_assert(offsetof(Explosion_C_WallCheckGrenadeOnCameraFarPlayer, Radius) == 0x000030, "Member 'Explosion_C_WallCheckGrenadeOnCameraFarPlayer::Radius' has a wrong offset!");
