#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Explosion_F1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Explosion_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Explosion_F1.Explosion_F1_C
// 0x0060 (0x0320 - 0x02C0)
class AExplosion_F1_C final : public AExplosion_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Explosion_F1_C;                     // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_F1;                                             // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      Object_Types;                                      // 0x02D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FHitResult>                     Out_Hits;                                          // 0x02E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class APawn*                                  PawnTrace;                                         // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Ignore_Actors;                                     // 0x02F8(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                          FindActor;                                         // 0x0308(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHitResult>                     OutHitsDirty;                                      // 0x0310(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void ExecuteUbergraph_Explosion_F1(int32 EntryPoint);
	void ExplosionDirty(double Radius, const struct FVector& End, const struct FVector& Start);
	void ReceiveBeginPlay();
	void StartRadialDamage(float BaseDamage, float MinimumDamage, const struct FVector& Origin, float DamageInnerRadius, float DamageOuterRadius, float DamageFalloff, float Radius, const struct FVector& End, const struct FVector& Start);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Explosion_F1_C">();
	}
	static class AExplosion_F1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AExplosion_F1_C>();
	}
};
static_assert(alignof(AExplosion_F1_C) == 0x000008, "Wrong alignment on AExplosion_F1_C");
static_assert(sizeof(AExplosion_F1_C) == 0x000320, "Wrong size on AExplosion_F1_C");
static_assert(offsetof(AExplosion_F1_C, UberGraphFrame_Explosion_F1_C) == 0x0002C0, "Member 'AExplosion_F1_C::UberGraphFrame_Explosion_F1_C' has a wrong offset!");
static_assert(offsetof(AExplosion_F1_C, NS_F1) == 0x0002C8, "Member 'AExplosion_F1_C::NS_F1' has a wrong offset!");
static_assert(offsetof(AExplosion_F1_C, Object_Types) == 0x0002D0, "Member 'AExplosion_F1_C::Object_Types' has a wrong offset!");
static_assert(offsetof(AExplosion_F1_C, Out_Hits) == 0x0002E0, "Member 'AExplosion_F1_C::Out_Hits' has a wrong offset!");
static_assert(offsetof(AExplosion_F1_C, PawnTrace) == 0x0002F0, "Member 'AExplosion_F1_C::PawnTrace' has a wrong offset!");
static_assert(offsetof(AExplosion_F1_C, Ignore_Actors) == 0x0002F8, "Member 'AExplosion_F1_C::Ignore_Actors' has a wrong offset!");
static_assert(offsetof(AExplosion_F1_C, FindActor) == 0x000308, "Member 'AExplosion_F1_C::FindActor' has a wrong offset!");
static_assert(offsetof(AExplosion_F1_C, OutHitsDirty) == 0x000310, "Member 'AExplosion_F1_C::OutHitsDirty' has a wrong offset!");

}

