#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_CarShopItem

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct F_CarShopItem.F_CarShopItem
// 0x0058 (0x0058 - 0x0000)
struct FF_CarShopItem final
{
public:
	double                                        Price_26_92C399B34B885E92EA1DD49F55C24942;         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   DisplayName_27_404734664F7CAB0BA632A3AE4B0C6ABF;   // 0x0008(0x0018)(Edit, BlueprintVisible)
	TSoftObjectPtr<class UPaperSprite>            Image_25_985767044BD752F2A5EC23B44711487D;         // 0x0020(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class FName                                   Name_24_384989A54A973F28F4D3359B3C0999A2;          // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FF_CarShopItem) == 0x000008, "Wrong alignment on FF_CarShopItem");
static_assert(sizeof(FF_CarShopItem) == 0x000058, "Wrong size on FF_CarShopItem");
static_assert(offsetof(FF_CarShopItem, Price_26_92C399B34B885E92EA1DD49F55C24942) == 0x000000, "Member 'FF_CarShopItem::Price_26_92C399B34B885E92EA1DD49F55C24942' has a wrong offset!");
static_assert(offsetof(FF_CarShopItem, DisplayName_27_404734664F7CAB0BA632A3AE4B0C6ABF) == 0x000008, "Member 'FF_CarShopItem::DisplayName_27_404734664F7CAB0BA632A3AE4B0C6ABF' has a wrong offset!");
static_assert(offsetof(FF_CarShopItem, Image_25_985767044BD752F2A5EC23B44711487D) == 0x000020, "Member 'FF_CarShopItem::Image_25_985767044BD752F2A5EC23B44711487D' has a wrong offset!");
static_assert(offsetof(FF_CarShopItem, Name_24_384989A54A973F28F4D3359B3C0999A2) == 0x000050, "Member 'FF_CarShopItem::Name_24_384989A54A973F28F4D3359B3C0999A2' has a wrong offset!");

}

