#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_CarShop_DT

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct F_CarShop_DT.F_CarShop_DT
// 0x00A0 (0x00A0 - 0x0000)
struct FF_CarShop_DT final
{
public:
	double                                        Price_16_AC1251B342952A66AB2ADC9F8D8CB8F5;         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Name_8_D73A74C34A936A9BA5FD0AAD9B6A6FB8;           // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   DisplayName_9_7290220C4FB79C941D8F6C929E823B29;    // 0x0010(0x0018)(Edit, BlueprintVisible)
	class FText                                   Description_27_2D995E194D05531F7FF0379227084A4C;   // 0x0028(0x0018)(Edit, BlueprintVisible)
	TSoftObjectPtr<class UPaperSprite>            Image_17_951F5D9F4B5581F2172144858E16654C;         // 0x0040(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   CarClass_24_83C05C274B6EF0D4DF526D83A0A1942E;      // 0x0070(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
static_assert(alignof(FF_CarShop_DT) == 0x000008, "Wrong alignment on FF_CarShop_DT");
static_assert(sizeof(FF_CarShop_DT) == 0x0000A0, "Wrong size on FF_CarShop_DT");
static_assert(offsetof(FF_CarShop_DT, Price_16_AC1251B342952A66AB2ADC9F8D8CB8F5) == 0x000000, "Member 'FF_CarShop_DT::Price_16_AC1251B342952A66AB2ADC9F8D8CB8F5' has a wrong offset!");
static_assert(offsetof(FF_CarShop_DT, Name_8_D73A74C34A936A9BA5FD0AAD9B6A6FB8) == 0x000008, "Member 'FF_CarShop_DT::Name_8_D73A74C34A936A9BA5FD0AAD9B6A6FB8' has a wrong offset!");
static_assert(offsetof(FF_CarShop_DT, DisplayName_9_7290220C4FB79C941D8F6C929E823B29) == 0x000010, "Member 'FF_CarShop_DT::DisplayName_9_7290220C4FB79C941D8F6C929E823B29' has a wrong offset!");
static_assert(offsetof(FF_CarShop_DT, Description_27_2D995E194D05531F7FF0379227084A4C) == 0x000028, "Member 'FF_CarShop_DT::Description_27_2D995E194D05531F7FF0379227084A4C' has a wrong offset!");
static_assert(offsetof(FF_CarShop_DT, Image_17_951F5D9F4B5581F2172144858E16654C) == 0x000040, "Member 'FF_CarShop_DT::Image_17_951F5D9F4B5581F2172144858E16654C' has a wrong offset!");
static_assert(offsetof(FF_CarShop_DT, CarClass_24_83C05C274B6EF0D4DF526D83A0A1942E) == 0x000070, "Member 'FF_CarShop_DT::CarClass_24_83C05C274B6EF0D4DF526D83A0A1942E' has a wrong offset!");

}

