#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_FurnitureUpgradeHouseInfo

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct F_FurnitureUpgradeHouseInfo.F_FurnitureUpgradeHouseInfo
// 0x0060 (0x0060 - 0x0000)
struct FF_FurnitureUpgradeHouseInfo final
{
public:
	class FString                                 HouseName_3_56EA582C4B8CD5E9ABB40B8F578464C1;      // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	double                                        BuyPrice_8_96E91C1141E7F2E1FCB73C88E7B9876F;       // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPaperSprite*                           Image_11_D8336C8F4386501AE895A7B1114EBFA6;         // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Storage_14_80DCDBB14AF9733CF2A36B88B5AFA4EE;       // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DisplayName_17_E2D288674D6D1D6360D8348D658B5949;   // 0x0028(0x0018)(Edit, BlueprintVisible)
	class FText                                   Description_19_FD99D32E47DC18FC934FA9A7CB74E440;   // 0x0040(0x0018)(Edit, BlueprintVisible)
	int32                                         HouseLevel_22_D454D4C74C8E768AAA997483DB04FDCD;    // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FF_FurnitureUpgradeHouseInfo) == 0x000008, "Wrong alignment on FF_FurnitureUpgradeHouseInfo");
static_assert(sizeof(FF_FurnitureUpgradeHouseInfo) == 0x000060, "Wrong size on FF_FurnitureUpgradeHouseInfo");
static_assert(offsetof(FF_FurnitureUpgradeHouseInfo, HouseName_3_56EA582C4B8CD5E9ABB40B8F578464C1) == 0x000000, "Member 'FF_FurnitureUpgradeHouseInfo::HouseName_3_56EA582C4B8CD5E9ABB40B8F578464C1' has a wrong offset!");
static_assert(offsetof(FF_FurnitureUpgradeHouseInfo, BuyPrice_8_96E91C1141E7F2E1FCB73C88E7B9876F) == 0x000010, "Member 'FF_FurnitureUpgradeHouseInfo::BuyPrice_8_96E91C1141E7F2E1FCB73C88E7B9876F' has a wrong offset!");
static_assert(offsetof(FF_FurnitureUpgradeHouseInfo, Image_11_D8336C8F4386501AE895A7B1114EBFA6) == 0x000018, "Member 'FF_FurnitureUpgradeHouseInfo::Image_11_D8336C8F4386501AE895A7B1114EBFA6' has a wrong offset!");
static_assert(offsetof(FF_FurnitureUpgradeHouseInfo, Storage_14_80DCDBB14AF9733CF2A36B88B5AFA4EE) == 0x000020, "Member 'FF_FurnitureUpgradeHouseInfo::Storage_14_80DCDBB14AF9733CF2A36B88B5AFA4EE' has a wrong offset!");
static_assert(offsetof(FF_FurnitureUpgradeHouseInfo, DisplayName_17_E2D288674D6D1D6360D8348D658B5949) == 0x000028, "Member 'FF_FurnitureUpgradeHouseInfo::DisplayName_17_E2D288674D6D1D6360D8348D658B5949' has a wrong offset!");
static_assert(offsetof(FF_FurnitureUpgradeHouseInfo, Description_19_FD99D32E47DC18FC934FA9A7CB74E440) == 0x000040, "Member 'FF_FurnitureUpgradeHouseInfo::Description_19_FD99D32E47DC18FC934FA9A7CB74E440' has a wrong offset!");
static_assert(offsetof(FF_FurnitureUpgradeHouseInfo, HouseLevel_22_D454D4C74C8E768AAA997483DB04FDCD) == 0x000058, "Member 'FF_FurnitureUpgradeHouseInfo::HouseLevel_22_D454D4C74C8E768AAA997483DB04FDCD' has a wrong offset!");

}

