#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MenuBarShopItem

#include "Basic.hpp"

#include "E_MenuBarShopCategory_structs.hpp"


namespace SDK
{

// UserDefinedStruct F_MenuBarShopItem.F_MenuBarShopItem
// 0x0048 (0x0048 - 0x0000)
struct FF_MenuBarShopItem final
{
public:
	class UAnimMontage*                           Montage_21_C775A8B84E91FEA98E8091A0A0C910B5;       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            StaticMesh_22_D0D2FFA34001DD87918D7A97DE606110;    // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeleton*                              Skeleton_23_2183105741A544DF272F97973C8C8702;      // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPaperSprite*                           Image_11_97D9D08A4230ABF92FAC33ABAB87728F;         // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   Name_14_FF80EE80446B13E3BFEC64947BFB5385;          // 0x0020(0x0018)(Edit, BlueprintVisible)
	double                                        BuyPrice_7_7E33B9544058634AC0FEB4A652524B9C;       // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_MenuBarShopCategory                         Type_26_B1A5615B4D11BEF2DD6A80B01E876E98;          // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FF_MenuBarShopItem) == 0x000008, "Wrong alignment on FF_MenuBarShopItem");
static_assert(sizeof(FF_MenuBarShopItem) == 0x000048, "Wrong size on FF_MenuBarShopItem");
static_assert(offsetof(FF_MenuBarShopItem, Montage_21_C775A8B84E91FEA98E8091A0A0C910B5) == 0x000000, "Member 'FF_MenuBarShopItem::Montage_21_C775A8B84E91FEA98E8091A0A0C910B5' has a wrong offset!");
static_assert(offsetof(FF_MenuBarShopItem, StaticMesh_22_D0D2FFA34001DD87918D7A97DE606110) == 0x000008, "Member 'FF_MenuBarShopItem::StaticMesh_22_D0D2FFA34001DD87918D7A97DE606110' has a wrong offset!");
static_assert(offsetof(FF_MenuBarShopItem, Skeleton_23_2183105741A544DF272F97973C8C8702) == 0x000010, "Member 'FF_MenuBarShopItem::Skeleton_23_2183105741A544DF272F97973C8C8702' has a wrong offset!");
static_assert(offsetof(FF_MenuBarShopItem, Image_11_97D9D08A4230ABF92FAC33ABAB87728F) == 0x000018, "Member 'FF_MenuBarShopItem::Image_11_97D9D08A4230ABF92FAC33ABAB87728F' has a wrong offset!");
static_assert(offsetof(FF_MenuBarShopItem, Name_14_FF80EE80446B13E3BFEC64947BFB5385) == 0x000020, "Member 'FF_MenuBarShopItem::Name_14_FF80EE80446B13E3BFEC64947BFB5385' has a wrong offset!");
static_assert(offsetof(FF_MenuBarShopItem, BuyPrice_7_7E33B9544058634AC0FEB4A652524B9C) == 0x000038, "Member 'FF_MenuBarShopItem::BuyPrice_7_7E33B9544058634AC0FEB4A652524B9C' has a wrong offset!");
static_assert(offsetof(FF_MenuBarShopItem, Type_26_B1A5615B4D11BEF2DD6A80B01E876E98) == 0x000040, "Member 'FF_MenuBarShopItem::Type_26_B1A5615B4D11BEF2DD6A80B01E876E98' has a wrong offset!");

}

