#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MovementSettings

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct F_MovementSettings.F_MovementSettings
// 0x0080 (0x0080 - 0x0000)
struct FF_MovementSettings final
{
public:
	double                                        Acceleration_4_E82C91A94F39DD22987809BE4FB44EBB;   // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Deceleration_5_B8EDB0164B7E0861C5493A8FBC002463;   // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MinSpeed_51_9E6EB4A0461D845F984DBFA88B80F7F2;      // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxSpeed_52_F26413844D06F2975C4D25AD97C78494;      // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MinDirInterpSpeed_39_852B85934787CBCC4CFE29903B03A2F3; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxDirInterpSpeed_40_8925E6FE43E1DACE75A12CB584C9BD27; // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SpeedInterpSpeed_31_8703B86F42C1FE914B9BA797E496BDEE; // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DecreaseStateDist_37_5E9C7CF34CE90A6DE189C5876AFD1FC0; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        IncreaseStateDist_36_4A1E1BDA4112EC553303E78274364951; // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HighestAngle_24_D19673934E93912BFFD6CBBF9574AECD;  // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LowestAngle_25_44A175E946753AE9CD3D7BA5D53891C8;   // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ChangePointDist_35_60B329A84E4555F8C40DC9A042B50492; // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CloseToTargetDist_44_A2BF0692470EE7E4011329ACC11E1021; // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CloseDirInterpSpeed_49_ED6AC7124B3B4F15E608C38BD9071784; // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AfterDecreaseAdjustment_47_0B4A14654A91D1E880A9A3AF078AB53A; // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TwistCheckDistance_56_F77339FE4BB493D45358689D97F41161; // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FF_MovementSettings) == 0x000008, "Wrong alignment on FF_MovementSettings");
static_assert(sizeof(FF_MovementSettings) == 0x000080, "Wrong size on FF_MovementSettings");
static_assert(offsetof(FF_MovementSettings, Acceleration_4_E82C91A94F39DD22987809BE4FB44EBB) == 0x000000, "Member 'FF_MovementSettings::Acceleration_4_E82C91A94F39DD22987809BE4FB44EBB' has a wrong offset!");
static_assert(offsetof(FF_MovementSettings, Deceleration_5_B8EDB0164B7E0861C5493A8FBC002463) == 0x000008, "Member 'FF_MovementSettings::Deceleration_5_B8EDB0164B7E0861C5493A8FBC002463' has a wrong offset!");
static_assert(offsetof(FF_MovementSettings, MinSpeed_51_9E6EB4A0461D845F984DBFA88B80F7F2) == 0x000010, "Member 'FF_MovementSettings::MinSpeed_51_9E6EB4A0461D845F984DBFA88B80F7F2' has a wrong offset!");
static_assert(offsetof(FF_MovementSettings, MaxSpeed_52_F26413844D06F2975C4D25AD97C78494) == 0x000018, "Member 'FF_MovementSettings::MaxSpeed_52_F26413844D06F2975C4D25AD97C78494' has a wrong offset!");
static_assert(offsetof(FF_MovementSettings, MinDirInterpSpeed_39_852B85934787CBCC4CFE29903B03A2F3) == 0x000020, "Member 'FF_MovementSettings::MinDirInterpSpeed_39_852B85934787CBCC4CFE29903B03A2F3' has a wrong offset!");
static_assert(offsetof(FF_MovementSettings, MaxDirInterpSpeed_40_8925E6FE43E1DACE75A12CB584C9BD27) == 0x000028, "Member 'FF_MovementSettings::MaxDirInterpSpeed_40_8925E6FE43E1DACE75A12CB584C9BD27' has a wrong offset!");
static_assert(offsetof(FF_MovementSettings, SpeedInterpSpeed_31_8703B86F42C1FE914B9BA797E496BDEE) == 0x000030, "Member 'FF_MovementSettings::SpeedInterpSpeed_31_8703B86F42C1FE914B9BA797E496BDEE' has a wrong offset!");
static_assert(offsetof(FF_MovementSettings, DecreaseStateDist_37_5E9C7CF34CE90A6DE189C5876AFD1FC0) == 0x000038, "Member 'FF_MovementSettings::DecreaseStateDist_37_5E9C7CF34CE90A6DE189C5876AFD1FC0' has a wrong offset!");
static_assert(offsetof(FF_MovementSettings, IncreaseStateDist_36_4A1E1BDA4112EC553303E78274364951) == 0x000040, "Member 'FF_MovementSettings::IncreaseStateDist_36_4A1E1BDA4112EC553303E78274364951' has a wrong offset!");
static_assert(offsetof(FF_MovementSettings, HighestAngle_24_D19673934E93912BFFD6CBBF9574AECD) == 0x000048, "Member 'FF_MovementSettings::HighestAngle_24_D19673934E93912BFFD6CBBF9574AECD' has a wrong offset!");
static_assert(offsetof(FF_MovementSettings, LowestAngle_25_44A175E946753AE9CD3D7BA5D53891C8) == 0x000050, "Member 'FF_MovementSettings::LowestAngle_25_44A175E946753AE9CD3D7BA5D53891C8' has a wrong offset!");
static_assert(offsetof(FF_MovementSettings, ChangePointDist_35_60B329A84E4555F8C40DC9A042B50492) == 0x000058, "Member 'FF_MovementSettings::ChangePointDist_35_60B329A84E4555F8C40DC9A042B50492' has a wrong offset!");
static_assert(offsetof(FF_MovementSettings, CloseToTargetDist_44_A2BF0692470EE7E4011329ACC11E1021) == 0x000060, "Member 'FF_MovementSettings::CloseToTargetDist_44_A2BF0692470EE7E4011329ACC11E1021' has a wrong offset!");
static_assert(offsetof(FF_MovementSettings, CloseDirInterpSpeed_49_ED6AC7124B3B4F15E608C38BD9071784) == 0x000068, "Member 'FF_MovementSettings::CloseDirInterpSpeed_49_ED6AC7124B3B4F15E608C38BD9071784' has a wrong offset!");
static_assert(offsetof(FF_MovementSettings, AfterDecreaseAdjustment_47_0B4A14654A91D1E880A9A3AF078AB53A) == 0x000070, "Member 'FF_MovementSettings::AfterDecreaseAdjustment_47_0B4A14654A91D1E880A9A3AF078AB53A' has a wrong offset!");
static_assert(offsetof(FF_MovementSettings, TwistCheckDistance_56_F77339FE4BB493D45358689D97F41161) == 0x000078, "Member 'FF_MovementSettings::TwistCheckDistance_56_F77339FE4BB493D45358689D97F41161' has a wrong offset!");

}

