#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_ZombieSounds

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct F_ZombieSounds.F_ZombieSounds
// 0x0120 (0x0120 - 0x0000)
struct FF_ZombieSounds final
{
public:
	TArray<TSoftObjectPtr<class UFMODEvent>>      Idles_58_AC865A6442C7C5214273FDA813A29F1F;         // 0x0000(0x0010)(Edit, BlueprintVisible)
	TSoftObjectPtr<class UFMODEvent>              Agressive_57_102C8CED4F23DCB279C39192D597E049;     // 0x0010(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UFMODEvent>              Death_56_1976086F426304B202583CA52024B94B;         // 0x0040(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UFMODEvent>              Attack_55_2A8C79B641B93FD9947EE7AD7F3C6CD2;        // 0x0070(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UFMODEvent>              Scream_54_1B299883419B76EDA864A5A90F6720AE;        // 0x00A0(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UFMODEvent>              Damaged_53_A023EFDD49C453F45F37E684D4A5F109;       // 0x00D0(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class UFMODEvent>>      WalkStep_52_72FC4F9D4A16351A74F572BA3891856A;      // 0x0100(0x0010)(Edit, BlueprintVisible)
	TArray<TSoftObjectPtr<class UFMODEvent>>      SprintStep_51_BE4D492241CB6F31C9BF5DB8883E40DE;    // 0x0110(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(FF_ZombieSounds) == 0x000008, "Wrong alignment on FF_ZombieSounds");
static_assert(sizeof(FF_ZombieSounds) == 0x000120, "Wrong size on FF_ZombieSounds");
static_assert(offsetof(FF_ZombieSounds, Idles_58_AC865A6442C7C5214273FDA813A29F1F) == 0x000000, "Member 'FF_ZombieSounds::Idles_58_AC865A6442C7C5214273FDA813A29F1F' has a wrong offset!");
static_assert(offsetof(FF_ZombieSounds, Agressive_57_102C8CED4F23DCB279C39192D597E049) == 0x000010, "Member 'FF_ZombieSounds::Agressive_57_102C8CED4F23DCB279C39192D597E049' has a wrong offset!");
static_assert(offsetof(FF_ZombieSounds, Death_56_1976086F426304B202583CA52024B94B) == 0x000040, "Member 'FF_ZombieSounds::Death_56_1976086F426304B202583CA52024B94B' has a wrong offset!");
static_assert(offsetof(FF_ZombieSounds, Attack_55_2A8C79B641B93FD9947EE7AD7F3C6CD2) == 0x000070, "Member 'FF_ZombieSounds::Attack_55_2A8C79B641B93FD9947EE7AD7F3C6CD2' has a wrong offset!");
static_assert(offsetof(FF_ZombieSounds, Scream_54_1B299883419B76EDA864A5A90F6720AE) == 0x0000A0, "Member 'FF_ZombieSounds::Scream_54_1B299883419B76EDA864A5A90F6720AE' has a wrong offset!");
static_assert(offsetof(FF_ZombieSounds, Damaged_53_A023EFDD49C453F45F37E684D4A5F109) == 0x0000D0, "Member 'FF_ZombieSounds::Damaged_53_A023EFDD49C453F45F37E684D4A5F109' has a wrong offset!");
static_assert(offsetof(FF_ZombieSounds, WalkStep_52_72FC4F9D4A16351A74F572BA3891856A) == 0x000100, "Member 'FF_ZombieSounds::WalkStep_52_72FC4F9D4A16351A74F572BA3891856A' has a wrong offset!");
static_assert(offsetof(FF_ZombieSounds, SprintStep_51_BE4D492241CB6F31C9BF5DB8883E40DE) == 0x000110, "Member 'FF_ZombieSounds::SprintStep_51_BE4D492241CB6F31C9BF5DB8883E40DE' has a wrong offset!");

}

