#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Fake_Grenade

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Fake_Grenade.Fake_Grenade_C
// 0x0058 (0x02E8 - 0x0290)
class AFake_Grenade_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshLeverFake;                               // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Impulse;                                           // 0x02B0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Torque;                                            // 0x02C8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          HandPose;                                          // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Fake_Grenade(int32 EntryPoint);
	void ImpulseFakeGrenadeMulti();
	void ImpulseFakeGrenadeServer();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Fake_Grenade_C">();
	}
	static class AFake_Grenade_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFake_Grenade_C>();
	}
};
static_assert(alignof(AFake_Grenade_C) == 0x000008, "Wrong alignment on AFake_Grenade_C");
static_assert(sizeof(AFake_Grenade_C) == 0x0002E8, "Wrong size on AFake_Grenade_C");
static_assert(offsetof(AFake_Grenade_C, UberGraphFrame) == 0x000290, "Member 'AFake_Grenade_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AFake_Grenade_C, StaticMesh) == 0x000298, "Member 'AFake_Grenade_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AFake_Grenade_C, Scene) == 0x0002A0, "Member 'AFake_Grenade_C::Scene' has a wrong offset!");
static_assert(offsetof(AFake_Grenade_C, StaticMeshLeverFake) == 0x0002A8, "Member 'AFake_Grenade_C::StaticMeshLeverFake' has a wrong offset!");
static_assert(offsetof(AFake_Grenade_C, Impulse) == 0x0002B0, "Member 'AFake_Grenade_C::Impulse' has a wrong offset!");
static_assert(offsetof(AFake_Grenade_C, Torque) == 0x0002C8, "Member 'AFake_Grenade_C::Torque' has a wrong offset!");
static_assert(offsetof(AFake_Grenade_C, HandPose) == 0x0002E0, "Member 'AFake_Grenade_C::HandPose' has a wrong offset!");

}

