#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FGearPlugin

#include "Basic.hpp"

#include "FGearPlugin_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function FGearPlugin.FGearEffects.getBaseVolume
// 0x0004 (0x0004 - 0x0000)
struct FGearEffects_GetBaseVolume final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearEffects_GetBaseVolume) == 0x000004, "Wrong alignment on FGearEffects_GetBaseVolume");
static_assert(sizeof(FGearEffects_GetBaseVolume) == 0x000004, "Wrong size on FGearEffects_GetBaseVolume");
static_assert(offsetof(FGearEffects_GetBaseVolume, ReturnValue) == 0x000000, "Member 'FGearEffects_GetBaseVolume::ReturnValue' has a wrong offset!");

// Function FGearPlugin.FGearEffects.getEnableSkidmarks
// 0x0001 (0x0001 - 0x0000)
struct FGearEffects_GetEnableSkidmarks final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearEffects_GetEnableSkidmarks) == 0x000001, "Wrong alignment on FGearEffects_GetEnableSkidmarks");
static_assert(sizeof(FGearEffects_GetEnableSkidmarks) == 0x000001, "Wrong size on FGearEffects_GetEnableSkidmarks");
static_assert(offsetof(FGearEffects_GetEnableSkidmarks, ReturnValue) == 0x000000, "Member 'FGearEffects_GetEnableSkidmarks::ReturnValue' has a wrong offset!");

// Function FGearPlugin.FGearEffects.getEngineVolume
// 0x0004 (0x0004 - 0x0000)
struct FGearEffects_GetEngineVolume final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearEffects_GetEngineVolume) == 0x000004, "Wrong alignment on FGearEffects_GetEngineVolume");
static_assert(sizeof(FGearEffects_GetEngineVolume) == 0x000004, "Wrong size on FGearEffects_GetEngineVolume");
static_assert(offsetof(FGearEffects_GetEngineVolume, ReturnValue) == 0x000000, "Member 'FGearEffects_GetEngineVolume::ReturnValue' has a wrong offset!");

// Function FGearPlugin.FGearEffects.getSkidVolume
// 0x0004 (0x0004 - 0x0000)
struct FGearEffects_GetSkidVolume final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearEffects_GetSkidVolume) == 0x000004, "Wrong alignment on FGearEffects_GetSkidVolume");
static_assert(sizeof(FGearEffects_GetSkidVolume) == 0x000004, "Wrong size on FGearEffects_GetSkidVolume");
static_assert(offsetof(FGearEffects_GetSkidVolume, ReturnValue) == 0x000000, "Member 'FGearEffects_GetSkidVolume::ReturnValue' has a wrong offset!");

// Function FGearPlugin.FGearEffects.setBaseVolume
// 0x0004 (0x0004 - 0x0000)
struct FGearEffects_SetBaseVolume final
{
public:
	float                                         V;                                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearEffects_SetBaseVolume) == 0x000004, "Wrong alignment on FGearEffects_SetBaseVolume");
static_assert(sizeof(FGearEffects_SetBaseVolume) == 0x000004, "Wrong size on FGearEffects_SetBaseVolume");
static_assert(offsetof(FGearEffects_SetBaseVolume, V) == 0x000000, "Member 'FGearEffects_SetBaseVolume::V' has a wrong offset!");

// Function FGearPlugin.FGearEffects.setEnableSkidmarks
// 0x0001 (0x0001 - 0x0000)
struct FGearEffects_SetEnableSkidmarks final
{
public:
	bool                                          E;                                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearEffects_SetEnableSkidmarks) == 0x000001, "Wrong alignment on FGearEffects_SetEnableSkidmarks");
static_assert(sizeof(FGearEffects_SetEnableSkidmarks) == 0x000001, "Wrong size on FGearEffects_SetEnableSkidmarks");
static_assert(offsetof(FGearEffects_SetEnableSkidmarks, E) == 0x000000, "Member 'FGearEffects_SetEnableSkidmarks::E' has a wrong offset!");

// Function FGearPlugin.FGearEffects.setEngineVolume
// 0x0004 (0x0004 - 0x0000)
struct FGearEffects_SetEngineVolume final
{
public:
	float                                         V;                                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearEffects_SetEngineVolume) == 0x000004, "Wrong alignment on FGearEffects_SetEngineVolume");
static_assert(sizeof(FGearEffects_SetEngineVolume) == 0x000004, "Wrong size on FGearEffects_SetEngineVolume");
static_assert(offsetof(FGearEffects_SetEngineVolume, V) == 0x000000, "Member 'FGearEffects_SetEngineVolume::V' has a wrong offset!");

// Function FGearPlugin.FGearEffects.setSkidVolume
// 0x0004 (0x0004 - 0x0000)
struct FGearEffects_SetSkidVolume final
{
public:
	float                                         V;                                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearEffects_SetSkidVolume) == 0x000004, "Wrong alignment on FGearEffects_SetSkidVolume");
static_assert(sizeof(FGearEffects_SetSkidVolume) == 0x000004, "Wrong size on FGearEffects_SetSkidVolume");
static_assert(offsetof(FGearEffects_SetSkidVolume, V) == 0x000000, "Member 'FGearEffects_SetSkidVolume::V' has a wrong offset!");

// Function FGearPlugin.FGearAeroDynamics.getDownForceCoefficient
// 0x0004 (0x0004 - 0x0000)
struct FGearAeroDynamics_GetDownForceCoefficient final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearAeroDynamics_GetDownForceCoefficient) == 0x000004, "Wrong alignment on FGearAeroDynamics_GetDownForceCoefficient");
static_assert(sizeof(FGearAeroDynamics_GetDownForceCoefficient) == 0x000004, "Wrong size on FGearAeroDynamics_GetDownForceCoefficient");
static_assert(offsetof(FGearAeroDynamics_GetDownForceCoefficient, ReturnValue) == 0x000000, "Member 'FGearAeroDynamics_GetDownForceCoefficient::ReturnValue' has a wrong offset!");

// Function FGearPlugin.FGearAeroDynamics.getDownForceXOffset
// 0x0004 (0x0004 - 0x0000)
struct FGearAeroDynamics_GetDownForceXOffset final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearAeroDynamics_GetDownForceXOffset) == 0x000004, "Wrong alignment on FGearAeroDynamics_GetDownForceXOffset");
static_assert(sizeof(FGearAeroDynamics_GetDownForceXOffset) == 0x000004, "Wrong size on FGearAeroDynamics_GetDownForceXOffset");
static_assert(offsetof(FGearAeroDynamics_GetDownForceXOffset, ReturnValue) == 0x000000, "Member 'FGearAeroDynamics_GetDownForceXOffset::ReturnValue' has a wrong offset!");

// Function FGearPlugin.FGearAeroDynamics.getDragCoefficient
// 0x0004 (0x0004 - 0x0000)
struct FGearAeroDynamics_GetDragCoefficient final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearAeroDynamics_GetDragCoefficient) == 0x000004, "Wrong alignment on FGearAeroDynamics_GetDragCoefficient");
static_assert(sizeof(FGearAeroDynamics_GetDragCoefficient) == 0x000004, "Wrong size on FGearAeroDynamics_GetDragCoefficient");
static_assert(offsetof(FGearAeroDynamics_GetDragCoefficient, ReturnValue) == 0x000000, "Member 'FGearAeroDynamics_GetDragCoefficient::ReturnValue' has a wrong offset!");

// Function FGearPlugin.FGearAeroDynamics.SetDownforceCoefficient
// 0x0004 (0x0004 - 0x0000)
struct FGearAeroDynamics_SetDownforceCoefficient final
{
public:
	float                                         F;                                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearAeroDynamics_SetDownforceCoefficient) == 0x000004, "Wrong alignment on FGearAeroDynamics_SetDownforceCoefficient");
static_assert(sizeof(FGearAeroDynamics_SetDownforceCoefficient) == 0x000004, "Wrong size on FGearAeroDynamics_SetDownforceCoefficient");
static_assert(offsetof(FGearAeroDynamics_SetDownforceCoefficient, F) == 0x000000, "Member 'FGearAeroDynamics_SetDownforceCoefficient::F' has a wrong offset!");

// Function FGearPlugin.FGearAeroDynamics.setDownForceXOffset
// 0x0004 (0x0004 - 0x0000)
struct FGearAeroDynamics_SetDownForceXOffset final
{
public:
	float                                         F;                                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearAeroDynamics_SetDownForceXOffset) == 0x000004, "Wrong alignment on FGearAeroDynamics_SetDownForceXOffset");
static_assert(sizeof(FGearAeroDynamics_SetDownForceXOffset) == 0x000004, "Wrong size on FGearAeroDynamics_SetDownForceXOffset");
static_assert(offsetof(FGearAeroDynamics_SetDownForceXOffset, F) == 0x000000, "Member 'FGearAeroDynamics_SetDownForceXOffset::F' has a wrong offset!");

// Function FGearPlugin.FGearAeroDynamics.SetDragCoefficient
// 0x0004 (0x0004 - 0x0000)
struct FGearAeroDynamics_SetDragCoefficient final
{
public:
	float                                         F;                                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearAeroDynamics_SetDragCoefficient) == 0x000004, "Wrong alignment on FGearAeroDynamics_SetDragCoefficient");
static_assert(sizeof(FGearAeroDynamics_SetDragCoefficient) == 0x000004, "Wrong size on FGearAeroDynamics_SetDragCoefficient");
static_assert(offsetof(FGearAeroDynamics_SetDragCoefficient, F) == 0x000000, "Member 'FGearAeroDynamics_SetDragCoefficient::F' has a wrong offset!");

// Function FGearPlugin.FGearArcadeAssists.setAntirollBars
// 0x0001 (0x0001 - 0x0000)
struct FGearArcadeAssists_SetAntirollBars final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearArcadeAssists_SetAntirollBars) == 0x000001, "Wrong alignment on FGearArcadeAssists_SetAntirollBars");
static_assert(sizeof(FGearArcadeAssists_SetAntirollBars) == 0x000001, "Wrong size on FGearArcadeAssists_SetAntirollBars");
static_assert(offsetof(FGearArcadeAssists_SetAntirollBars, Enable) == 0x000000, "Member 'FGearArcadeAssists_SetAntirollBars::Enable' has a wrong offset!");

// Function FGearPlugin.FGearArcadeAssists.setAntiRollSpring
// 0x0004 (0x0004 - 0x0000)
struct FGearArcadeAssists_SetAntiRollSpring final
{
public:
	float                                         V;                                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearArcadeAssists_SetAntiRollSpring) == 0x000004, "Wrong alignment on FGearArcadeAssists_SetAntiRollSpring");
static_assert(sizeof(FGearArcadeAssists_SetAntiRollSpring) == 0x000004, "Wrong size on FGearArcadeAssists_SetAntiRollSpring");
static_assert(offsetof(FGearArcadeAssists_SetAntiRollSpring, V) == 0x000000, "Member 'FGearArcadeAssists_SetAntiRollSpring::V' has a wrong offset!");

// Function FGearPlugin.FGearArcadeAssists.setBikeHelper
// 0x0001 (0x0001 - 0x0000)
struct FGearArcadeAssists_SetBikeHelper final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearArcadeAssists_SetBikeHelper) == 0x000001, "Wrong alignment on FGearArcadeAssists_SetBikeHelper");
static_assert(sizeof(FGearArcadeAssists_SetBikeHelper) == 0x000001, "Wrong size on FGearArcadeAssists_SetBikeHelper");
static_assert(offsetof(FGearArcadeAssists_SetBikeHelper, Enable) == 0x000000, "Member 'FGearArcadeAssists_SetBikeHelper::Enable' has a wrong offset!");

// Function FGearPlugin.FGearArcadeAssists.setCruiseSpeed
// 0x0008 (0x0008 - 0x0000)
struct FGearArcadeAssists_SetCruiseSpeed final
{
public:
	float                                         KmhSpeed;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Gear;                                              // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearArcadeAssists_SetCruiseSpeed) == 0x000004, "Wrong alignment on FGearArcadeAssists_SetCruiseSpeed");
static_assert(sizeof(FGearArcadeAssists_SetCruiseSpeed) == 0x000008, "Wrong size on FGearArcadeAssists_SetCruiseSpeed");
static_assert(offsetof(FGearArcadeAssists_SetCruiseSpeed, KmhSpeed) == 0x000000, "Member 'FGearArcadeAssists_SetCruiseSpeed::KmhSpeed' has a wrong offset!");
static_assert(offsetof(FGearArcadeAssists_SetCruiseSpeed, Gear) == 0x000004, "Member 'FGearArcadeAssists_SetCruiseSpeed::Gear' has a wrong offset!");

// Function FGearPlugin.FGearArcadeAssists.setDamperSmooth
// 0x0004 (0x0004 - 0x0000)
struct FGearArcadeAssists_SetDamperSmooth final
{
public:
	float                                         V;                                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearArcadeAssists_SetDamperSmooth) == 0x000004, "Wrong alignment on FGearArcadeAssists_SetDamperSmooth");
static_assert(sizeof(FGearArcadeAssists_SetDamperSmooth) == 0x000004, "Wrong size on FGearArcadeAssists_SetDamperSmooth");
static_assert(offsetof(FGearArcadeAssists_SetDamperSmooth, V) == 0x000000, "Member 'FGearArcadeAssists_SetDamperSmooth::V' has a wrong offset!");

// Function FGearPlugin.FGearArcadeAssists.setDriftAssist
// 0x0001 (0x0001 - 0x0000)
struct FGearArcadeAssists_SetDriftAssist final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearArcadeAssists_SetDriftAssist) == 0x000001, "Wrong alignment on FGearArcadeAssists_SetDriftAssist");
static_assert(sizeof(FGearArcadeAssists_SetDriftAssist) == 0x000001, "Wrong size on FGearArcadeAssists_SetDriftAssist");
static_assert(offsetof(FGearArcadeAssists_SetDriftAssist, Enable) == 0x000000, "Member 'FGearArcadeAssists_SetDriftAssist::Enable' has a wrong offset!");

// Function FGearPlugin.FGearArcadeAssists.setLeanInAir
// 0x0001 (0x0001 - 0x0000)
struct FGearArcadeAssists_SetLeanInAir final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearArcadeAssists_SetLeanInAir) == 0x000001, "Wrong alignment on FGearArcadeAssists_SetLeanInAir");
static_assert(sizeof(FGearArcadeAssists_SetLeanInAir) == 0x000001, "Wrong size on FGearArcadeAssists_SetLeanInAir");
static_assert(offsetof(FGearArcadeAssists_SetLeanInAir, Enable) == 0x000000, "Member 'FGearArcadeAssists_SetLeanInAir::Enable' has a wrong offset!");

// Function FGearPlugin.FGearArcadeAssists.setMaxLeanAngle
// 0x0004 (0x0004 - 0x0000)
struct FGearArcadeAssists_SetMaxLeanAngle final
{
public:
	float                                         V;                                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearArcadeAssists_SetMaxLeanAngle) == 0x000004, "Wrong alignment on FGearArcadeAssists_SetMaxLeanAngle");
static_assert(sizeof(FGearArcadeAssists_SetMaxLeanAngle) == 0x000004, "Wrong size on FGearArcadeAssists_SetMaxLeanAngle");
static_assert(offsetof(FGearArcadeAssists_SetMaxLeanAngle, V) == 0x000000, "Member 'FGearArcadeAssists_SetMaxLeanAngle::V' has a wrong offset!");

// Function FGearPlugin.FGearArcadeAssists.setMaxPitchAngle
// 0x0004 (0x0004 - 0x0000)
struct FGearArcadeAssists_SetMaxPitchAngle final
{
public:
	float                                         V;                                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearArcadeAssists_SetMaxPitchAngle) == 0x000004, "Wrong alignment on FGearArcadeAssists_SetMaxPitchAngle");
static_assert(sizeof(FGearArcadeAssists_SetMaxPitchAngle) == 0x000004, "Wrong size on FGearArcadeAssists_SetMaxPitchAngle");
static_assert(offsetof(FGearArcadeAssists_SetMaxPitchAngle, V) == 0x000000, "Member 'FGearArcadeAssists_SetMaxPitchAngle::V' has a wrong offset!");

// Function FGearPlugin.FGearArcadeAssists.setMinLeanSpeed
// 0x0004 (0x0004 - 0x0000)
struct FGearArcadeAssists_SetMinLeanSpeed final
{
public:
	float                                         V;                                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearArcadeAssists_SetMinLeanSpeed) == 0x000004, "Wrong alignment on FGearArcadeAssists_SetMinLeanSpeed");
static_assert(sizeof(FGearArcadeAssists_SetMinLeanSpeed) == 0x000004, "Wrong size on FGearArcadeAssists_SetMinLeanSpeed");
static_assert(offsetof(FGearArcadeAssists_SetMinLeanSpeed, V) == 0x000000, "Member 'FGearArcadeAssists_SetMinLeanSpeed::V' has a wrong offset!");

// Function FGearPlugin.FGearArcadeAssists.setRecoverAssists
// 0x0001 (0x0001 - 0x0000)
struct FGearArcadeAssists_SetRecoverAssists final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearArcadeAssists_SetRecoverAssists) == 0x000001, "Wrong alignment on FGearArcadeAssists_SetRecoverAssists");
static_assert(sizeof(FGearArcadeAssists_SetRecoverAssists) == 0x000001, "Wrong size on FGearArcadeAssists_SetRecoverAssists");
static_assert(offsetof(FGearArcadeAssists_SetRecoverAssists, Enable) == 0x000000, "Member 'FGearArcadeAssists_SetRecoverAssists::Enable' has a wrong offset!");

// Function FGearPlugin.FGearArcadeAssists.setTorqueSplitter
// 0x0001 (0x0001 - 0x0000)
struct FGearArcadeAssists_SetTorqueSplitter final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearArcadeAssists_SetTorqueSplitter) == 0x000001, "Wrong alignment on FGearArcadeAssists_SetTorqueSplitter");
static_assert(sizeof(FGearArcadeAssists_SetTorqueSplitter) == 0x000001, "Wrong size on FGearArcadeAssists_SetTorqueSplitter");
static_assert(offsetof(FGearArcadeAssists_SetTorqueSplitter, Enable) == 0x000000, "Member 'FGearArcadeAssists_SetTorqueSplitter::Enable' has a wrong offset!");

// Function FGearPlugin.FGearArcadeAssists.setTractionAssist
// 0x0001 (0x0001 - 0x0000)
struct FGearArcadeAssists_SetTractionAssist final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearArcadeAssists_SetTractionAssist) == 0x000001, "Wrong alignment on FGearArcadeAssists_SetTractionAssist");
static_assert(sizeof(FGearArcadeAssists_SetTractionAssist) == 0x000001, "Wrong size on FGearArcadeAssists_SetTractionAssist");
static_assert(offsetof(FGearArcadeAssists_SetTractionAssist, Enable) == 0x000000, "Member 'FGearArcadeAssists_SetTractionAssist::Enable' has a wrong offset!");

// Function FGearPlugin.FGearAutoDrive.getCurrentSplineParam
// 0x0004 (0x0004 - 0x0000)
struct FGearAutoDrive_GetCurrentSplineParam final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearAutoDrive_GetCurrentSplineParam) == 0x000004, "Wrong alignment on FGearAutoDrive_GetCurrentSplineParam");
static_assert(sizeof(FGearAutoDrive_GetCurrentSplineParam) == 0x000004, "Wrong size on FGearAutoDrive_GetCurrentSplineParam");
static_assert(offsetof(FGearAutoDrive_GetCurrentSplineParam, ReturnValue) == 0x000000, "Member 'FGearAutoDrive_GetCurrentSplineParam::ReturnValue' has a wrong offset!");

// Function FGearPlugin.FGearAutoDrive.IsEnabled
// 0x0001 (0x0001 - 0x0000)
struct FGearAutoDrive_IsEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearAutoDrive_IsEnabled) == 0x000001, "Wrong alignment on FGearAutoDrive_IsEnabled");
static_assert(sizeof(FGearAutoDrive_IsEnabled) == 0x000001, "Wrong size on FGearAutoDrive_IsEnabled");
static_assert(offsetof(FGearAutoDrive_IsEnabled, ReturnValue) == 0x000000, "Member 'FGearAutoDrive_IsEnabled::ReturnValue' has a wrong offset!");

// Function FGearPlugin.FGearAutoDrive.SetEnabled
// 0x0001 (0x0001 - 0x0000)
struct FGearAutoDrive_SetEnabled final
{
public:
	bool                                          B;                                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearAutoDrive_SetEnabled) == 0x000001, "Wrong alignment on FGearAutoDrive_SetEnabled");
static_assert(sizeof(FGearAutoDrive_SetEnabled) == 0x000001, "Wrong size on FGearAutoDrive_SetEnabled");
static_assert(offsetof(FGearAutoDrive_SetEnabled, B) == 0x000000, "Member 'FGearAutoDrive_SetEnabled::B' has a wrong offset!");

// Function FGearPlugin.FGearAxle.getAckermanCoeff
// 0x0004 (0x0004 - 0x0000)
struct FGearAxle_GetAckermanCoeff final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearAxle_GetAckermanCoeff) == 0x000004, "Wrong alignment on FGearAxle_GetAckermanCoeff");
static_assert(sizeof(FGearAxle_GetAckermanCoeff) == 0x000004, "Wrong size on FGearAxle_GetAckermanCoeff");
static_assert(offsetof(FGearAxle_GetAckermanCoeff, ReturnValue) == 0x000000, "Member 'FGearAxle_GetAckermanCoeff::ReturnValue' has a wrong offset!");

// Function FGearPlugin.FGearAxle.getAckermanReferenceIndex
// 0x0004 (0x0004 - 0x0000)
struct FGearAxle_GetAckermanReferenceIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearAxle_GetAckermanReferenceIndex) == 0x000004, "Wrong alignment on FGearAxle_GetAckermanReferenceIndex");
static_assert(sizeof(FGearAxle_GetAckermanReferenceIndex) == 0x000004, "Wrong size on FGearAxle_GetAckermanReferenceIndex");
static_assert(offsetof(FGearAxle_GetAckermanReferenceIndex, ReturnValue) == 0x000000, "Member 'FGearAxle_GetAckermanReferenceIndex::ReturnValue' has a wrong offset!");

// Function FGearPlugin.FGearAxle.getCamberAngle
// 0x0004 (0x0004 - 0x0000)
struct FGearAxle_GetCamberAngle final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearAxle_GetCamberAngle) == 0x000004, "Wrong alignment on FGearAxle_GetCamberAngle");
static_assert(sizeof(FGearAxle_GetCamberAngle) == 0x000004, "Wrong size on FGearAxle_GetCamberAngle");
static_assert(offsetof(FGearAxle_GetCamberAngle, ReturnValue) == 0x000000, "Member 'FGearAxle_GetCamberAngle::ReturnValue' has a wrong offset!");

// Function FGearPlugin.FGearAxle.getCurRpm
// 0x0004 (0x0004 - 0x0000)
struct FGearAxle_GetCurRpm final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearAxle_GetCurRpm) == 0x000004, "Wrong alignment on FGearAxle_GetCurRpm");
static_assert(sizeof(FGearAxle_GetCurRpm) == 0x000004, "Wrong size on FGearAxle_GetCurRpm");
static_assert(offsetof(FGearAxle_GetCurRpm, ReturnValue) == 0x000000, "Member 'FGearAxle_GetCurRpm::ReturnValue' has a wrong offset!");

// Function FGearPlugin.FGearAxle.getDifferentialType
// 0x0001 (0x0001 - 0x0000)
struct FGearAxle_GetDifferentialType final
{
public:
	EFGearDifferentialType                        ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearAxle_GetDifferentialType) == 0x000001, "Wrong alignment on FGearAxle_GetDifferentialType");
static_assert(sizeof(FGearAxle_GetDifferentialType) == 0x000001, "Wrong size on FGearAxle_GetDifferentialType");
static_assert(offsetof(FGearAxle_GetDifferentialType, ReturnValue) == 0x000000, "Member 'FGearAxle_GetDifferentialType::ReturnValue' has a wrong offset!");

// Function FGearPlugin.FGearAxle.getDiffStrength
// 0x0004 (0x0004 - 0x0000)
struct FGearAxle_GetDiffStrength final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearAxle_GetDiffStrength) == 0x000004, "Wrong alignment on FGearAxle_GetDiffStrength");
static_assert(sizeof(FGearAxle_GetDiffStrength) == 0x000004, "Wrong size on FGearAxle_GetDiffStrength");
static_assert(offsetof(FGearAxle_GetDiffStrength, ReturnValue) == 0x000000, "Member 'FGearAxle_GetDiffStrength::ReturnValue' has a wrong offset!");

// Function FGearPlugin.FGearAxle.getFeedbackTorque
// 0x0004 (0x0004 - 0x0000)
struct FGearAxle_GetFeedbackTorque final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearAxle_GetFeedbackTorque) == 0x000004, "Wrong alignment on FGearAxle_GetFeedbackTorque");
static_assert(sizeof(FGearAxle_GetFeedbackTorque) == 0x000004, "Wrong size on FGearAxle_GetFeedbackTorque");
static_assert(offsetof(FGearAxle_GetFeedbackTorque, ReturnValue) == 0x000000, "Member 'FGearAxle_GetFeedbackTorque::ReturnValue' has a wrong offset!");

// Function FGearPlugin.FGearAxle.getGlobalCenter
// 0x0018 (0x0018 - 0x0000)
struct FGearAxle_GetGlobalCenter final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearAxle_GetGlobalCenter) == 0x000008, "Wrong alignment on FGearAxle_GetGlobalCenter");
static_assert(sizeof(FGearAxle_GetGlobalCenter) == 0x000018, "Wrong size on FGearAxle_GetGlobalCenter");
static_assert(offsetof(FGearAxle_GetGlobalCenter, ReturnValue) == 0x000000, "Member 'FGearAxle_GetGlobalCenter::ReturnValue' has a wrong offset!");

// Function FGearPlugin.FGearAxle.getIndex
// 0x0004 (0x0004 - 0x0000)
struct FGearAxle_GetIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearAxle_GetIndex) == 0x000004, "Wrong alignment on FGearAxle_GetIndex");
static_assert(sizeof(FGearAxle_GetIndex) == 0x000004, "Wrong size on FGearAxle_GetIndex");
static_assert(offsetof(FGearAxle_GetIndex, ReturnValue) == 0x000000, "Member 'FGearAxle_GetIndex::ReturnValue' has a wrong offset!");

// Function FGearPlugin.FGearAxle.getLeftWheel
// 0x0008 (0x0008 - 0x0000)
struct FGearAxle_GetLeftWheel final
{
public:
	class UFGearWheel*                            ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearAxle_GetLeftWheel) == 0x000008, "Wrong alignment on FGearAxle_GetLeftWheel");
static_assert(sizeof(FGearAxle_GetLeftWheel) == 0x000008, "Wrong size on FGearAxle_GetLeftWheel");
static_assert(offsetof(FGearAxle_GetLeftWheel, ReturnValue) == 0x000000, "Member 'FGearAxle_GetLeftWheel::ReturnValue' has a wrong offset!");

// Function FGearPlugin.FGearAxle.getLocalCenter
// 0x0018 (0x0018 - 0x0000)
struct FGearAxle_GetLocalCenter final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearAxle_GetLocalCenter) == 0x000008, "Wrong alignment on FGearAxle_GetLocalCenter");
static_assert(sizeof(FGearAxle_GetLocalCenter) == 0x000018, "Wrong size on FGearAxle_GetLocalCenter");
static_assert(offsetof(FGearAxle_GetLocalCenter, ReturnValue) == 0x000000, "Member 'FGearAxle_GetLocalCenter::ReturnValue' has a wrong offset!");

// Function FGearPlugin.FGearAxle.getMaxRpm
// 0x0004 (0x0004 - 0x0000)
struct FGearAxle_GetMaxRpm final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearAxle_GetMaxRpm) == 0x000004, "Wrong alignment on FGearAxle_GetMaxRpm");
static_assert(sizeof(FGearAxle_GetMaxRpm) == 0x000004, "Wrong size on FGearAxle_GetMaxRpm");
static_assert(offsetof(FGearAxle_GetMaxRpm, ReturnValue) == 0x000000, "Member 'FGearAxle_GetMaxRpm::ReturnValue' has a wrong offset!");

// Function FGearPlugin.FGearAxle.getMaxSteerAngle
// 0x0004 (0x0004 - 0x0000)
struct FGearAxle_GetMaxSteerAngle final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearAxle_GetMaxSteerAngle) == 0x000004, "Wrong alignment on FGearAxle_GetMaxSteerAngle");
static_assert(sizeof(FGearAxle_GetMaxSteerAngle) == 0x000004, "Wrong size on FGearAxle_GetMaxSteerAngle");
static_assert(offsetof(FGearAxle_GetMaxSteerAngle, ReturnValue) == 0x000000, "Member 'FGearAxle_GetMaxSteerAngle::ReturnValue' has a wrong offset!");

// Function FGearPlugin.FGearAxle.getNormalizedSteering
// 0x0004 (0x0004 - 0x0000)
struct FGearAxle_GetNormalizedSteering final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearAxle_GetNormalizedSteering) == 0x000004, "Wrong alignment on FGearAxle_GetNormalizedSteering");
static_assert(sizeof(FGearAxle_GetNormalizedSteering) == 0x000004, "Wrong size on FGearAxle_GetNormalizedSteering");
static_assert(offsetof(FGearAxle_GetNormalizedSteering, ReturnValue) == 0x000000, "Member 'FGearAxle_GetNormalizedSteering::ReturnValue' has a wrong offset!");

// Function FGearPlugin.FGearAxle.getRightWheel
// 0x0008 (0x0008 - 0x0000)
struct FGearAxle_GetRightWheel final
{
public:
	class UFGearWheel*                            ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearAxle_GetRightWheel) == 0x000008, "Wrong alignment on FGearAxle_GetRightWheel");
static_assert(sizeof(FGearAxle_GetRightWheel) == 0x000008, "Wrong size on FGearAxle_GetRightWheel");
static_assert(offsetof(FGearAxle_GetRightWheel, ReturnValue) == 0x000000, "Member 'FGearAxle_GetRightWheel::ReturnValue' has a wrong offset!");

// Function FGearPlugin.FGearAxle.getRPM
// 0x0004 (0x0004 - 0x0000)
struct FGearAxle_GetRPM final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearAxle_GetRPM) == 0x000004, "Wrong alignment on FGearAxle_GetRPM");
static_assert(sizeof(FGearAxle_GetRPM) == 0x000004, "Wrong size on FGearAxle_GetRPM");
static_assert(offsetof(FGearAxle_GetRPM, ReturnValue) == 0x000000, "Member 'FGearAxle_GetRPM::ReturnValue' has a wrong offset!");

// Function FGearPlugin.FGearAxle.getToeAngle
// 0x0004 (0x0004 - 0x0000)
struct FGearAxle_GetToeAngle final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearAxle_GetToeAngle) == 0x000004, "Wrong alignment on FGearAxle_GetToeAngle");
static_assert(sizeof(FGearAxle_GetToeAngle) == 0x000004, "Wrong size on FGearAxle_GetToeAngle");
static_assert(offsetof(FGearAxle_GetToeAngle, ReturnValue) == 0x000000, "Member 'FGearAxle_GetToeAngle::ReturnValue' has a wrong offset!");

// Function FGearPlugin.FGearAxle.getTorqueShare
// 0x0004 (0x0004 - 0x0000)
struct FGearAxle_GetTorqueShare final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearAxle_GetTorqueShare) == 0x000004, "Wrong alignment on FGearAxle_GetTorqueShare");
static_assert(sizeof(FGearAxle_GetTorqueShare) == 0x000004, "Wrong size on FGearAxle_GetTorqueShare");
static_assert(offsetof(FGearAxle_GetTorqueShare, ReturnValue) == 0x000000, "Member 'FGearAxle_GetTorqueShare::ReturnValue' has a wrong offset!");

// Function FGearPlugin.FGearAxle.getTrackWidth
// 0x0004 (0x0004 - 0x0000)
struct FGearAxle_GetTrackWidth final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearAxle_GetTrackWidth) == 0x000004, "Wrong alignment on FGearAxle_GetTrackWidth");
static_assert(sizeof(FGearAxle_GetTrackWidth) == 0x000004, "Wrong size on FGearAxle_GetTrackWidth");
static_assert(offsetof(FGearAxle_GetTrackWidth, ReturnValue) == 0x000000, "Member 'FGearAxle_GetTrackWidth::ReturnValue' has a wrong offset!");

// Function FGearPlugin.FGearAxle.getWheelOptions
// 0x0008 (0x0008 - 0x0000)
struct FGearAxle_GetWheelOptions final
{
public:
	class UFGearWheelOptions*                     ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearAxle_GetWheelOptions) == 0x000008, "Wrong alignment on FGearAxle_GetWheelOptions");
static_assert(sizeof(FGearAxle_GetWheelOptions) == 0x000008, "Wrong size on FGearAxle_GetWheelOptions");
static_assert(offsetof(FGearAxle_GetWheelOptions, ReturnValue) == 0x000000, "Member 'FGearAxle_GetWheelOptions::ReturnValue' has a wrong offset!");

// Function FGearPlugin.FGearAxle.getWheelRPMToKMH
// 0x0004 (0x0004 - 0x0000)
struct FGearAxle_GetWheelRPMToKMH final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearAxle_GetWheelRPMToKMH) == 0x000004, "Wrong alignment on FGearAxle_GetWheelRPMToKMH");
static_assert(sizeof(FGearAxle_GetWheelRPMToKMH) == 0x000004, "Wrong size on FGearAxle_GetWheelRPMToKMH");
static_assert(offsetof(FGearAxle_GetWheelRPMToKMH, ReturnValue) == 0x000000, "Member 'FGearAxle_GetWheelRPMToKMH::ReturnValue' has a wrong offset!");

// Function FGearPlugin.FGearAxle.hasHandBrake
// 0x0001 (0x0001 - 0x0000)
struct FGearAxle_HasHandBrake final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearAxle_HasHandBrake) == 0x000001, "Wrong alignment on FGearAxle_HasHandBrake");
static_assert(sizeof(FGearAxle_HasHandBrake) == 0x000001, "Wrong size on FGearAxle_HasHandBrake");
static_assert(offsetof(FGearAxle_HasHandBrake, ReturnValue) == 0x000000, "Member 'FGearAxle_HasHandBrake::ReturnValue' has a wrong offset!");

// Function FGearPlugin.FGearAxle.hasSteering
// 0x0001 (0x0001 - 0x0000)
struct FGearAxle_HasSteering final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearAxle_HasSteering) == 0x000001, "Wrong alignment on FGearAxle_HasSteering");
static_assert(sizeof(FGearAxle_HasSteering) == 0x000001, "Wrong size on FGearAxle_HasSteering");
static_assert(offsetof(FGearAxle_HasSteering, ReturnValue) == 0x000000, "Member 'FGearAxle_HasSteering::ReturnValue' has a wrong offset!");

// Function FGearPlugin.FGearAxle.setAckermanCoeff
// 0x0004 (0x0004 - 0x0000)
struct FGearAxle_SetAckermanCoeff final
{
public:
	float                                         F;                                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearAxle_SetAckermanCoeff) == 0x000004, "Wrong alignment on FGearAxle_SetAckermanCoeff");
static_assert(sizeof(FGearAxle_SetAckermanCoeff) == 0x000004, "Wrong size on FGearAxle_SetAckermanCoeff");
static_assert(offsetof(FGearAxle_SetAckermanCoeff, F) == 0x000000, "Member 'FGearAxle_SetAckermanCoeff::F' has a wrong offset!");

// Function FGearPlugin.FGearAxle.setAckermanReferenceIndex
// 0x0004 (0x0004 - 0x0000)
struct FGearAxle_SetAckermanReferenceIndex final
{
public:
	int32                                         I;                                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearAxle_SetAckermanReferenceIndex) == 0x000004, "Wrong alignment on FGearAxle_SetAckermanReferenceIndex");
static_assert(sizeof(FGearAxle_SetAckermanReferenceIndex) == 0x000004, "Wrong size on FGearAxle_SetAckermanReferenceIndex");
static_assert(offsetof(FGearAxle_SetAckermanReferenceIndex, I) == 0x000000, "Member 'FGearAxle_SetAckermanReferenceIndex::I' has a wrong offset!");

// Function FGearPlugin.FGearAxle.setCamberAngle
// 0x0004 (0x0004 - 0x0000)
struct FGearAxle_SetCamberAngle final
{
public:
	float                                         F;                                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearAxle_SetCamberAngle) == 0x000004, "Wrong alignment on FGearAxle_SetCamberAngle");
static_assert(sizeof(FGearAxle_SetCamberAngle) == 0x000004, "Wrong size on FGearAxle_SetCamberAngle");
static_assert(offsetof(FGearAxle_SetCamberAngle, F) == 0x000000, "Member 'FGearAxle_SetCamberAngle::F' has a wrong offset!");

// Function FGearPlugin.FGearAxle.setDifferentialType
// 0x0001 (0x0001 - 0x0000)
struct FGearAxle_SetDifferentialType final
{
public:
	EFGearDifferentialType                        Dt;                                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearAxle_SetDifferentialType) == 0x000001, "Wrong alignment on FGearAxle_SetDifferentialType");
static_assert(sizeof(FGearAxle_SetDifferentialType) == 0x000001, "Wrong size on FGearAxle_SetDifferentialType");
static_assert(offsetof(FGearAxle_SetDifferentialType, Dt) == 0x000000, "Member 'FGearAxle_SetDifferentialType::Dt' has a wrong offset!");

// Function FGearPlugin.FGearAxle.setDiffStrength
// 0x0004 (0x0004 - 0x0000)
struct FGearAxle_SetDiffStrength final
{
public:
	float                                         F;                                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearAxle_SetDiffStrength) == 0x000004, "Wrong alignment on FGearAxle_SetDiffStrength");
static_assert(sizeof(FGearAxle_SetDiffStrength) == 0x000004, "Wrong size on FGearAxle_SetDiffStrength");
static_assert(offsetof(FGearAxle_SetDiffStrength, F) == 0x000000, "Member 'FGearAxle_SetDiffStrength::F' has a wrong offset!");

// Function FGearPlugin.FGearAxle.setHasHandBrake
// 0x0001 (0x0001 - 0x0000)
struct FGearAxle_SetHasHandBrake final
{
public:
	bool                                          B;                                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearAxle_SetHasHandBrake) == 0x000001, "Wrong alignment on FGearAxle_SetHasHandBrake");
static_assert(sizeof(FGearAxle_SetHasHandBrake) == 0x000001, "Wrong size on FGearAxle_SetHasHandBrake");
static_assert(offsetof(FGearAxle_SetHasHandBrake, B) == 0x000000, "Member 'FGearAxle_SetHasHandBrake::B' has a wrong offset!");

// Function FGearPlugin.FGearAxle.setLeftWheel
// 0x0008 (0x0008 - 0x0000)
struct FGearAxle_SetLeftWheel final
{
public:
	class UFGearWheel*                            W;                                                 // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearAxle_SetLeftWheel) == 0x000008, "Wrong alignment on FGearAxle_SetLeftWheel");
static_assert(sizeof(FGearAxle_SetLeftWheel) == 0x000008, "Wrong size on FGearAxle_SetLeftWheel");
static_assert(offsetof(FGearAxle_SetLeftWheel, W) == 0x000000, "Member 'FGearAxle_SetLeftWheel::W' has a wrong offset!");

// Function FGearPlugin.FGearAxle.setMaxSteerAngle
// 0x0004 (0x0004 - 0x0000)
struct FGearAxle_SetMaxSteerAngle final
{
public:
	float                                         F;                                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearAxle_SetMaxSteerAngle) == 0x000004, "Wrong alignment on FGearAxle_SetMaxSteerAngle");
static_assert(sizeof(FGearAxle_SetMaxSteerAngle) == 0x000004, "Wrong size on FGearAxle_SetMaxSteerAngle");
static_assert(offsetof(FGearAxle_SetMaxSteerAngle, F) == 0x000000, "Member 'FGearAxle_SetMaxSteerAngle::F' has a wrong offset!");

// Function FGearPlugin.FGearAxle.setRightWheel
// 0x0008 (0x0008 - 0x0000)
struct FGearAxle_SetRightWheel final
{
public:
	class UFGearWheel*                            W;                                                 // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearAxle_SetRightWheel) == 0x000008, "Wrong alignment on FGearAxle_SetRightWheel");
static_assert(sizeof(FGearAxle_SetRightWheel) == 0x000008, "Wrong size on FGearAxle_SetRightWheel");
static_assert(offsetof(FGearAxle_SetRightWheel, W) == 0x000000, "Member 'FGearAxle_SetRightWheel::W' has a wrong offset!");

// Function FGearPlugin.FGearAxle.setTargetSteer
// 0x0004 (0x0004 - 0x0000)
struct FGearAxle_SetTargetSteer final
{
public:
	float                                         S;                                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearAxle_SetTargetSteer) == 0x000004, "Wrong alignment on FGearAxle_SetTargetSteer");
static_assert(sizeof(FGearAxle_SetTargetSteer) == 0x000004, "Wrong size on FGearAxle_SetTargetSteer");
static_assert(offsetof(FGearAxle_SetTargetSteer, S) == 0x000000, "Member 'FGearAxle_SetTargetSteer::S' has a wrong offset!");

// Function FGearPlugin.FGearAxle.setToeAngle
// 0x0004 (0x0004 - 0x0000)
struct FGearAxle_SetToeAngle final
{
public:
	float                                         F;                                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearAxle_SetToeAngle) == 0x000004, "Wrong alignment on FGearAxle_SetToeAngle");
static_assert(sizeof(FGearAxle_SetToeAngle) == 0x000004, "Wrong size on FGearAxle_SetToeAngle");
static_assert(offsetof(FGearAxle_SetToeAngle, F) == 0x000000, "Member 'FGearAxle_SetToeAngle::F' has a wrong offset!");

// Function FGearPlugin.FGearAxle.setTorqueShare
// 0x0004 (0x0004 - 0x0000)
struct FGearAxle_SetTorqueShare final
{
public:
	float                                         F;                                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearAxle_SetTorqueShare) == 0x000004, "Wrong alignment on FGearAxle_SetTorqueShare");
static_assert(sizeof(FGearAxle_SetTorqueShare) == 0x000004, "Wrong size on FGearAxle_SetTorqueShare");
static_assert(offsetof(FGearAxle_SetTorqueShare, F) == 0x000000, "Member 'FGearAxle_SetTorqueShare::F' has a wrong offset!");

// Function FGearPlugin.FGearAxle.setWheelOptions
// 0x0008 (0x0008 - 0x0000)
struct FGearAxle_SetWheelOptions final
{
public:
	class UFGearWheelOptions*                     Wo;                                                // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearAxle_SetWheelOptions) == 0x000008, "Wrong alignment on FGearAxle_SetWheelOptions");
static_assert(sizeof(FGearAxle_SetWheelOptions) == 0x000008, "Wrong size on FGearAxle_SetWheelOptions");
static_assert(offsetof(FGearAxle_SetWheelOptions, Wo) == 0x000000, "Member 'FGearAxle_SetWheelOptions::Wo' has a wrong offset!");

// Function FGearPlugin.FGearEngine.calculateMaxPower
// 0x0008 (0x0008 - 0x0000)
struct FGearEngine_CalculateMaxPower final
{
public:
	float                                         MaxPower;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxPowerRpm;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearEngine_CalculateMaxPower) == 0x000004, "Wrong alignment on FGearEngine_CalculateMaxPower");
static_assert(sizeof(FGearEngine_CalculateMaxPower) == 0x000008, "Wrong size on FGearEngine_CalculateMaxPower");
static_assert(offsetof(FGearEngine_CalculateMaxPower, MaxPower) == 0x000000, "Member 'FGearEngine_CalculateMaxPower::MaxPower' has a wrong offset!");
static_assert(offsetof(FGearEngine_CalculateMaxPower, MaxPowerRpm) == 0x000004, "Member 'FGearEngine_CalculateMaxPower::MaxPowerRpm' has a wrong offset!");

// Function FGearPlugin.FGearEngine.getEngineInertia
// 0x0004 (0x0004 - 0x0000)
struct FGearEngine_GetEngineInertia final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearEngine_GetEngineInertia) == 0x000004, "Wrong alignment on FGearEngine_GetEngineInertia");
static_assert(sizeof(FGearEngine_GetEngineInertia) == 0x000004, "Wrong size on FGearEngine_GetEngineInertia");
static_assert(offsetof(FGearEngine_GetEngineInertia, ReturnValue) == 0x000000, "Member 'FGearEngine_GetEngineInertia::ReturnValue' has a wrong offset!");

// Function FGearPlugin.FGearEngine.getFrictionTorque
// 0x0004 (0x0004 - 0x0000)
struct FGearEngine_GetFrictionTorque final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearEngine_GetFrictionTorque) == 0x000004, "Wrong alignment on FGearEngine_GetFrictionTorque");
static_assert(sizeof(FGearEngine_GetFrictionTorque) == 0x000004, "Wrong size on FGearEngine_GetFrictionTorque");
static_assert(offsetof(FGearEngine_GetFrictionTorque, ReturnValue) == 0x000000, "Member 'FGearEngine_GetFrictionTorque::ReturnValue' has a wrong offset!");

// Function FGearPlugin.FGearEngine.getIdleRpm
// 0x0004 (0x0004 - 0x0000)
struct FGearEngine_GetIdleRpm final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearEngine_GetIdleRpm) == 0x000004, "Wrong alignment on FGearEngine_GetIdleRpm");
static_assert(sizeof(FGearEngine_GetIdleRpm) == 0x000004, "Wrong size on FGearEngine_GetIdleRpm");
static_assert(offsetof(FGearEngine_GetIdleRpm, ReturnValue) == 0x000000, "Member 'FGearEngine_GetIdleRpm::ReturnValue' has a wrong offset!");

// Function FGearPlugin.FGearEngine.getLimiterTime
// 0x0004 (0x0004 - 0x0000)
struct FGearEngine_GetLimiterTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearEngine_GetLimiterTime) == 0x000004, "Wrong alignment on FGearEngine_GetLimiterTime");
static_assert(sizeof(FGearEngine_GetLimiterTime) == 0x000004, "Wrong size on FGearEngine_GetLimiterTime");
static_assert(offsetof(FGearEngine_GetLimiterTime, ReturnValue) == 0x000000, "Member 'FGearEngine_GetLimiterTime::ReturnValue' has a wrong offset!");

// Function FGearPlugin.FGearEngine.getLimitRpm
// 0x0004 (0x0004 - 0x0000)
struct FGearEngine_GetLimitRpm final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearEngine_GetLimitRpm) == 0x000004, "Wrong alignment on FGearEngine_GetLimitRpm");
static_assert(sizeof(FGearEngine_GetLimitRpm) == 0x000004, "Wrong size on FGearEngine_GetLimitRpm");
static_assert(offsetof(FGearEngine_GetLimitRpm, ReturnValue) == 0x000000, "Member 'FGearEngine_GetLimitRpm::ReturnValue' has a wrong offset!");

// Function FGearPlugin.FGearEngine.getRPM
// 0x0004 (0x0004 - 0x0000)
struct FGearEngine_GetRPM final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearEngine_GetRPM) == 0x000004, "Wrong alignment on FGearEngine_GetRPM");
static_assert(sizeof(FGearEngine_GetRPM) == 0x000004, "Wrong size on FGearEngine_GetRPM");
static_assert(offsetof(FGearEngine_GetRPM, ReturnValue) == 0x000000, "Member 'FGearEngine_GetRPM::ReturnValue' has a wrong offset!");

// Function FGearPlugin.FGearEngine.getRpmRatio
// 0x0004 (0x0004 - 0x0000)
struct FGearEngine_GetRpmRatio final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearEngine_GetRpmRatio) == 0x000004, "Wrong alignment on FGearEngine_GetRpmRatio");
static_assert(sizeof(FGearEngine_GetRpmRatio) == 0x000004, "Wrong size on FGearEngine_GetRpmRatio");
static_assert(offsetof(FGearEngine_GetRpmRatio, ReturnValue) == 0x000000, "Member 'FGearEngine_GetRpmRatio::ReturnValue' has a wrong offset!");

// Function FGearPlugin.FGearEngine.getThrottle
// 0x0004 (0x0004 - 0x0000)
struct FGearEngine_GetThrottle final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearEngine_GetThrottle) == 0x000004, "Wrong alignment on FGearEngine_GetThrottle");
static_assert(sizeof(FGearEngine_GetThrottle) == 0x000004, "Wrong size on FGearEngine_GetThrottle");
static_assert(offsetof(FGearEngine_GetThrottle, ReturnValue) == 0x000000, "Member 'FGearEngine_GetThrottle::ReturnValue' has a wrong offset!");

// Function FGearPlugin.FGearEngine.getTorque
// 0x0004 (0x0004 - 0x0000)
struct FGearEngine_GetTorque final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearEngine_GetTorque) == 0x000004, "Wrong alignment on FGearEngine_GetTorque");
static_assert(sizeof(FGearEngine_GetTorque) == 0x000004, "Wrong size on FGearEngine_GetTorque");
static_assert(offsetof(FGearEngine_GetTorque, ReturnValue) == 0x000000, "Member 'FGearEngine_GetTorque::ReturnValue' has a wrong offset!");

// Function FGearPlugin.FGearEngine.getTorqueCurve
// 0x0008 (0x0008 - 0x0000)
struct FGearEngine_GetTorqueCurve final
{
public:
	class UCurveFloat*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearEngine_GetTorqueCurve) == 0x000008, "Wrong alignment on FGearEngine_GetTorqueCurve");
static_assert(sizeof(FGearEngine_GetTorqueCurve) == 0x000008, "Wrong size on FGearEngine_GetTorqueCurve");
static_assert(offsetof(FGearEngine_GetTorqueCurve, ReturnValue) == 0x000000, "Member 'FGearEngine_GetTorqueCurve::ReturnValue' has a wrong offset!");

// Function FGearPlugin.FGearEngine.getTorqueScale
// 0x0004 (0x0004 - 0x0000)
struct FGearEngine_GetTorqueScale final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearEngine_GetTorqueScale) == 0x000004, "Wrong alignment on FGearEngine_GetTorqueScale");
static_assert(sizeof(FGearEngine_GetTorqueScale) == 0x000004, "Wrong size on FGearEngine_GetTorqueScale");
static_assert(offsetof(FGearEngine_GetTorqueScale, ReturnValue) == 0x000000, "Member 'FGearEngine_GetTorqueScale::ReturnValue' has a wrong offset!");

// Function FGearPlugin.FGearEngine.isLimiterOn
// 0x0001 (0x0001 - 0x0000)
struct FGearEngine_IsLimiterOn final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearEngine_IsLimiterOn) == 0x000001, "Wrong alignment on FGearEngine_IsLimiterOn");
static_assert(sizeof(FGearEngine_IsLimiterOn) == 0x000001, "Wrong size on FGearEngine_IsLimiterOn");
static_assert(offsetof(FGearEngine_IsLimiterOn, ReturnValue) == 0x000000, "Member 'FGearEngine_IsLimiterOn::ReturnValue' has a wrong offset!");

// Function FGearPlugin.FGearEngine.isRunning
// 0x0001 (0x0001 - 0x0000)
struct FGearEngine_IsRunning final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGearEngine_IsRunning) == 0x000001, "Wrong alignment on FGearEngine_IsRunning");
static_assert(sizeof(FGearEngine_IsRunning) == 0x000001, "Wrong size on FGearEngine_IsRunning");
