#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FGearPlugin

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "FGearPlugin_structs.hpp"
#include "PhysicsCore_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class FGearPlugin.FGearTelemetryDrawer
// 0x0010 (0x02B0 - 0x02A0)
#pragma pack(push, 0x1)
class alignas(0x10) UFGearTelemetryDrawer : public USceneComponent
{
public:
	uint8                                         Pad_2A0[0x8];                                      // 0x02A0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FGearTelemetryDrawer">();
	}
	static class UFGearTelemetryDrawer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFGearTelemetryDrawer>();
	}
};
#pragma pack(pop)
static_assert(alignof(UFGearTelemetryDrawer) == 0x000010, "Wrong alignment on UFGearTelemetryDrawer");
static_assert(sizeof(UFGearTelemetryDrawer) == 0x0002B0, "Wrong size on UFGearTelemetryDrawer");

// Class FGearPlugin.FGearEffects
// 0x0120 (0x03D0 - 0x02B0)
class UFGearEffects final : public UFGearTelemetryDrawer
{
public:
	FMulticastInlineDelegateProperty_             OnBrakeStateChanged;                               // 0x02A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnBackFire;                                        // 0x02B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	float                                         MLongSlipThreshold;                                // 0x02C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MLatSlipThreshold;                                 // 0x02CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          MEnableTireSmoke;                                  // 0x02D0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          MEnableSkidmarks;                                  // 0x02D1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2D2[0x6];                                      // 0x02D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     MSkidmarkMaterial;                                 // 0x02D8(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         MMaxMarks;                                         // 0x02E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MMarkWidth;                                        // 0x02E4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MGroundOffset;                                     // 0x02E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MMinDistance;                                      // 0x02EC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class AFGearSkidmark*>                 MSmarks;                                           // 0x02F0(0x0010)(ZeroConstructor, NoClear, NativeAccessSpecifierPrivate)
	uint8                                         Pad_300[0x10];                                     // 0x0300(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MBaseVolume;                                       // 0x0310(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MEngineVolume;                                     // 0x0314(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MSkidVolume;                                       // 0x0318(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_31C[0x4];                                      // 0x031C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundWave*                             MEngineHigh;                                       // 0x0320(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MEngineHighBasePitch;                              // 0x0328(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MEngineHighPitchScale;                             // 0x032C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MEngineHighInnerRadius;                            // 0x0330(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MEngineHighFalloffDistance;                        // 0x0334(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAudioComponent*                        MEngineHighComponent;                              // 0x0338(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoClear, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USoundWave*                             MEngineLow;                                        // 0x0340(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MEngineLowBasePitch;                               // 0x0348(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MEngineLowPitchScale;                              // 0x034C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MEngineLowInnerRadius;                             // 0x0350(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MEngineLowFalloffDistance;                         // 0x0354(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAudioComponent*                        MEngineLowComponent;                               // 0x0358(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoClear, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          MEnableSkidclip;                                   // 0x0360(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_361[0x3];                                      // 0x0361(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MSkidclipInnerRadius;                              // 0x0364(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MSkidclipFalloffDistance;                          // 0x0368(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_36C[0x4];                                      // 0x036C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        MSkidSoundComponent;                               // 0x0370(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoClear, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MBackfireInterval;                                 // 0x0378(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MBackfireLimit;                                    // 0x037C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MFireRpmRatio;                                     // 0x0380(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MFireGearChange;                                   // 0x0384(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MFireLimiter;                                      // 0x0388(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_38C[0x4];                                      // 0x038C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFGearPhysicalMaterial*                 MDefaultPhysicalMaterial;                          // 0x0390(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UParticleSystemComponent*>       MSmokes;                                           // 0x0398(0x0010)(ExportObject, ZeroConstructor, NoClear, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3A8[0x28];                                     // 0x03A8(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float GetBaseVolume();
	bool GetEnableSkidmarks();
	float GetEngineVolume();
	float GetSkidVolume();
	void SetBaseVolume(float V);
	void SetEnableSkidmarks(bool E);
	void SetEngineVolume(float V);
	void SetSkidVolume(float V);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FGearEffects">();
	}
	static class UFGearEffects* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFGearEffects>();
	}
};
static_assert(alignof(UFGearEffects) == 0x000010, "Wrong alignment on UFGearEffects");
static_assert(sizeof(UFGearEffects) == 0x0003D0, "Wrong size on UFGearEffects");
static_assert(offsetof(UFGearEffects, OnBrakeStateChanged) == 0x0002A8, "Member 'UFGearEffects::OnBrakeStateChanged' has a wrong offset!");
static_assert(offsetof(UFGearEffects, OnBackFire) == 0x0002B8, "Member 'UFGearEffects::OnBackFire' has a wrong offset!");
static_assert(offsetof(UFGearEffects, MLongSlipThreshold) == 0x0002C8, "Member 'UFGearEffects::MLongSlipThreshold' has a wrong offset!");
static_assert(offsetof(UFGearEffects, MLatSlipThreshold) == 0x0002CC, "Member 'UFGearEffects::MLatSlipThreshold' has a wrong offset!");
static_assert(offsetof(UFGearEffects, MEnableTireSmoke) == 0x0002D0, "Member 'UFGearEffects::MEnableTireSmoke' has a wrong offset!");
static_assert(offsetof(UFGearEffects, MEnableSkidmarks) == 0x0002D1, "Member 'UFGearEffects::MEnableSkidmarks' has a wrong offset!");
static_assert(offsetof(UFGearEffects, MSkidmarkMaterial) == 0x0002D8, "Member 'UFGearEffects::MSkidmarkMaterial' has a wrong offset!");
static_assert(offsetof(UFGearEffects, MMaxMarks) == 0x0002E0, "Member 'UFGearEffects::MMaxMarks' has a wrong offset!");
static_assert(offsetof(UFGearEffects, MMarkWidth) == 0x0002E4, "Member 'UFGearEffects::MMarkWidth' has a wrong offset!");
static_assert(offsetof(UFGearEffects, MGroundOffset) == 0x0002E8, "Member 'UFGearEffects::MGroundOffset' has a wrong offset!");
static_assert(offsetof(UFGearEffects, MMinDistance) == 0x0002EC, "Member 'UFGearEffects::MMinDistance' has a wrong offset!");
static_assert(offsetof(UFGearEffects, MSmarks) == 0x0002F0, "Member 'UFGearEffects::MSmarks' has a wrong offset!");
static_assert(offsetof(UFGearEffects, MBaseVolume) == 0x000310, "Member 'UFGearEffects::MBaseVolume' has a wrong offset!");
static_assert(offsetof(UFGearEffects, MEngineVolume) == 0x000314, "Member 'UFGearEffects::MEngineVolume' has a wrong offset!");
static_assert(offsetof(UFGearEffects, MSkidVolume) == 0x000318, "Member 'UFGearEffects::MSkidVolume' has a wrong offset!");
static_assert(offsetof(UFGearEffects, MEngineHigh) == 0x000320, "Member 'UFGearEffects::MEngineHigh' has a wrong offset!");
static_assert(offsetof(UFGearEffects, MEngineHighBasePitch) == 0x000328, "Member 'UFGearEffects::MEngineHighBasePitch' has a wrong offset!");
static_assert(offsetof(UFGearEffects, MEngineHighPitchScale) == 0x00032C, "Member 'UFGearEffects::MEngineHighPitchScale' has a wrong offset!");
static_assert(offsetof(UFGearEffects, MEngineHighInnerRadius) == 0x000330, "Member 'UFGearEffects::MEngineHighInnerRadius' has a wrong offset!");
static_assert(offsetof(UFGearEffects, MEngineHighFalloffDistance) == 0x000334, "Member 'UFGearEffects::MEngineHighFalloffDistance' has a wrong offset!");
static_assert(offsetof(UFGearEffects, MEngineHighComponent) == 0x000338, "Member 'UFGearEffects::MEngineHighComponent' has a wrong offset!");
static_assert(offsetof(UFGearEffects, MEngineLow) == 0x000340, "Member 'UFGearEffects::MEngineLow' has a wrong offset!");
static_assert(offsetof(UFGearEffects, MEngineLowBasePitch) == 0x000348, "Member 'UFGearEffects::MEngineLowBasePitch' has a wrong offset!");
static_assert(offsetof(UFGearEffects, MEngineLowPitchScale) == 0x00034C, "Member 'UFGearEffects::MEngineLowPitchScale' has a wrong offset!");
static_assert(offsetof(UFGearEffects, MEngineLowInnerRadius) == 0x000350, "Member 'UFGearEffects::MEngineLowInnerRadius' has a wrong offset!");
static_assert(offsetof(UFGearEffects, MEngineLowFalloffDistance) == 0x000354, "Member 'UFGearEffects::MEngineLowFalloffDistance' has a wrong offset!");
static_assert(offsetof(UFGearEffects, MEngineLowComponent) == 0x000358, "Member 'UFGearEffects::MEngineLowComponent' has a wrong offset!");
static_assert(offsetof(UFGearEffects, MEnableSkidclip) == 0x000360, "Member 'UFGearEffects::MEnableSkidclip' has a wrong offset!");
static_assert(offsetof(UFGearEffects, MSkidclipInnerRadius) == 0x000364, "Member 'UFGearEffects::MSkidclipInnerRadius' has a wrong offset!");
static_assert(offsetof(UFGearEffects, MSkidclipFalloffDistance) == 0x000368, "Member 'UFGearEffects::MSkidclipFalloffDistance' has a wrong offset!");
static_assert(offsetof(UFGearEffects, MSkidSoundComponent) == 0x000370, "Member 'UFGearEffects::MSkidSoundComponent' has a wrong offset!");
static_assert(offsetof(UFGearEffects, MBackfireInterval) == 0x000378, "Member 'UFGearEffects::MBackfireInterval' has a wrong offset!");
static_assert(offsetof(UFGearEffects, MBackfireLimit) == 0x00037C, "Member 'UFGearEffects::MBackfireLimit' has a wrong offset!");
static_assert(offsetof(UFGearEffects, MFireRpmRatio) == 0x000380, "Member 'UFGearEffects::MFireRpmRatio' has a wrong offset!");
static_assert(offsetof(UFGearEffects, MFireGearChange) == 0x000384, "Member 'UFGearEffects::MFireGearChange' has a wrong offset!");
static_assert(offsetof(UFGearEffects, MFireLimiter) == 0x000388, "Member 'UFGearEffects::MFireLimiter' has a wrong offset!");
static_assert(offsetof(UFGearEffects, MDefaultPhysicalMaterial) == 0x000390, "Member 'UFGearEffects::MDefaultPhysicalMaterial' has a wrong offset!");
static_assert(offsetof(UFGearEffects, MSmokes) == 0x000398, "Member 'UFGearEffects::MSmokes' has a wrong offset!");

// Class FGearPlugin.FGearAeroDynamics
// 0x0030 (0x02E0 - 0x02B0)
class UFGearAeroDynamics final : public UFGearTelemetryDrawer
{
public:
	float                                         MDragCoefficient;                                  // 0x02A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MDownForceCoefficient;                             // 0x02AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MDownForceXOffset;                                 // 0x02B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2B4[0x2C];                                     // 0x02B4(0x002C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float GetDownForceCoefficient();
	float GetDownForceXOffset();
	float GetDragCoefficient();
	void SetDownforceCoefficient(float F);
	void SetDownForceXOffset(float F);
	void SetDragCoefficient(float F);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FGearAeroDynamics">();
	}
	static class UFGearAeroDynamics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFGearAeroDynamics>();
	}
};
static_assert(alignof(UFGearAeroDynamics) == 0x000010, "Wrong alignment on UFGearAeroDynamics");
static_assert(sizeof(UFGearAeroDynamics) == 0x0002E0, "Wrong size on UFGearAeroDynamics");
static_assert(offsetof(UFGearAeroDynamics, MDragCoefficient) == 0x0002A8, "Member 'UFGearAeroDynamics::MDragCoefficient' has a wrong offset!");
static_assert(offsetof(UFGearAeroDynamics, MDownForceCoefficient) == 0x0002AC, "Member 'UFGearAeroDynamics::MDownForceCoefficient' has a wrong offset!");
static_assert(offsetof(UFGearAeroDynamics, MDownForceXOffset) == 0x0002B0, "Member 'UFGearAeroDynamics::MDownForceXOffset' has a wrong offset!");

// Class FGearPlugin.FGearAnimInstance
// 0x0010 (0x0360 - 0x0350)
class UFGearAnimInstance : public UAnimInstance
{
public:
	TArray<struct FGearBoneAxle>                  Axles;                                             // 0x0348(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FGearAnimInstance">();
	}
	static class UFGearAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFGearAnimInstance>();
	}
};
static_assert(alignof(UFGearAnimInstance) == 0x000010, "Wrong alignment on UFGearAnimInstance");
static_assert(sizeof(UFGearAnimInstance) == 0x000360, "Wrong size on UFGearAnimInstance");
static_assert(offsetof(UFGearAnimInstance, Axles) == 0x000348, "Member 'UFGearAnimInstance::Axles' has a wrong offset!");

// Class FGearPlugin.FGearArcadeAssists
// 0x00A0 (0x0350 - 0x02B0)
class UFGearArcadeAssists final : public UFGearTelemetryDrawer
{
public:
	bool                                          MRecoverAssists;                                   // 0x02A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2A9[0x3];                                      // 0x02A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MUnderSteerRecoverPower;                           // 0x02AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MOverSteerRecoverPower;                            // 0x02B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MMinRecoverAssistSpeed;                            // 0x02B4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MFullRecoverAssistSpeed;                           // 0x02B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          MAntirollBars;                                     // 0x02BC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2BD[0x3];                                      // 0x02BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MFrontAntiRollPower;                               // 0x02C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MRearAntiRollPower;                                // 0x02C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          MTractionAssist;                                   // 0x02C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C9[0x3];                                      // 0x02C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MTractionAssistRatio;                              // 0x02CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MTractionAssistMaxSpeed;                           // 0x02D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          MDriftAssist;                                      // 0x02D4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2D5[0x3];                                      // 0x02D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MDriftAssistFrontRatio;                            // 0x02D8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MDriftAssistRearRatio;                             // 0x02DC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          MTorqueSplitter;                                   // 0x02E0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2E1[0x3];                                      // 0x02E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MTorqueSplitterRatio;                              // 0x02E4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MTorqueSplitterResponseTime;                       // 0x02E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          MBikeHelper;                                       // 0x02EC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2ED[0x3];                                      // 0x02ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MAntiRollSpring;                                   // 0x02F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MDamperSmooth;                                     // 0x02F4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MMinLeanSpeed;                                     // 0x02F8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MMaxLeanAngle;                                     // 0x02FC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MMaxPitchAngle;                                    // 0x0300(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          MLeanInAir;                                        // 0x0308(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_309[0x47];                                     // 0x0309(0x0047)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetAntirollBars(bool Enable);
	void SetAntiRollSpring(float V);
	void SetBikeHelper(bool Enable);
	void SetCruiseSpeed(float KmhSpeed, int32 Gear);
	void SetDamperSmooth(float V);
	void SetDriftAssist(bool Enable);
	void SetLeanInAir(bool Enable);
	void SetMaxLeanAngle(float V);
	void SetMaxPitchAngle(float V);
	void SetMinLeanSpeed(float V);
	void SetRecoverAssists(bool Enable);
	void SetTorqueSplitter(bool Enable);
	void SetTractionAssist(bool Enable);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FGearArcadeAssists">();
	}
	static class UFGearArcadeAssists* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFGearArcadeAssists>();
	}
};
static_assert(alignof(UFGearArcadeAssists) == 0x000010, "Wrong alignment on UFGearArcadeAssists");
static_assert(sizeof(UFGearArcadeAssists) == 0x000350, "Wrong size on UFGearArcadeAssists");
static_assert(offsetof(UFGearArcadeAssists, MRecoverAssists) == 0x0002A8, "Member 'UFGearArcadeAssists::MRecoverAssists' has a wrong offset!");
static_assert(offsetof(UFGearArcadeAssists, MUnderSteerRecoverPower) == 0x0002AC, "Member 'UFGearArcadeAssists::MUnderSteerRecoverPower' has a wrong offset!");
static_assert(offsetof(UFGearArcadeAssists, MOverSteerRecoverPower) == 0x0002B0, "Member 'UFGearArcadeAssists::MOverSteerRecoverPower' has a wrong offset!");
static_assert(offsetof(UFGearArcadeAssists, MMinRecoverAssistSpeed) == 0x0002B4, "Member 'UFGearArcadeAssists::MMinRecoverAssistSpeed' has a wrong offset!");
static_assert(offsetof(UFGearArcadeAssists, MFullRecoverAssistSpeed) == 0x0002B8, "Member 'UFGearArcadeAssists::MFullRecoverAssistSpeed' has a wrong offset!");
static_assert(offsetof(UFGearArcadeAssists, MAntirollBars) == 0x0002BC, "Member 'UFGearArcadeAssists::MAntirollBars' has a wrong offset!");
static_assert(offsetof(UFGearArcadeAssists, MFrontAntiRollPower) == 0x0002C0, "Member 'UFGearArcadeAssists::MFrontAntiRollPower' has a wrong offset!");
static_assert(offsetof(UFGearArcadeAssists, MRearAntiRollPower) == 0x0002C4, "Member 'UFGearArcadeAssists::MRearAntiRollPower' has a wrong offset!");
static_assert(offsetof(UFGearArcadeAssists, MTractionAssist) == 0x0002C8, "Member 'UFGearArcadeAssists::MTractionAssist' has a wrong offset!");
static_assert(offsetof(UFGearArcadeAssists, MTractionAssistRatio) == 0x0002CC, "Member 'UFGearArcadeAssists::MTractionAssistRatio' has a wrong offset!");
static_assert(offsetof(UFGearArcadeAssists, MTractionAssistMaxSpeed) == 0x0002D0, "Member 'UFGearArcadeAssists::MTractionAssistMaxSpeed' has a wrong offset!");
static_assert(offsetof(UFGearArcadeAssists, MDriftAssist) == 0x0002D4, "Member 'UFGearArcadeAssists::MDriftAssist' has a wrong offset!");
static_assert(offsetof(UFGearArcadeAssists, MDriftAssistFrontRatio) == 0x0002D8, "Member 'UFGearArcadeAssists::MDriftAssistFrontRatio' has a wrong offset!");
static_assert(offsetof(UFGearArcadeAssists, MDriftAssistRearRatio) == 0x0002DC, "Member 'UFGearArcadeAssists::MDriftAssistRearRatio' has a wrong offset!");
static_assert(offsetof(UFGearArcadeAssists, MTorqueSplitter) == 0x0002E0, "Member 'UFGearArcadeAssists::MTorqueSplitter' has a wrong offset!");
static_assert(offsetof(UFGearArcadeAssists, MTorqueSplitterRatio) == 0x0002E4, "Member 'UFGearArcadeAssists::MTorqueSplitterRatio' has a wrong offset!");
static_assert(offsetof(UFGearArcadeAssists, MTorqueSplitterResponseTime) == 0x0002E8, "Member 'UFGearArcadeAssists::MTorqueSplitterResponseTime' has a wrong offset!");
static_assert(offsetof(UFGearArcadeAssists, MBikeHelper) == 0x0002EC, "Member 'UFGearArcadeAssists::MBikeHelper' has a wrong offset!");
static_assert(offsetof(UFGearArcadeAssists, MAntiRollSpring) == 0x0002F0, "Member 'UFGearArcadeAssists::MAntiRollSpring' has a wrong offset!");
static_assert(offsetof(UFGearArcadeAssists, MDamperSmooth) == 0x0002F4, "Member 'UFGearArcadeAssists::MDamperSmooth' has a wrong offset!");
static_assert(offsetof(UFGearArcadeAssists, MMinLeanSpeed) == 0x0002F8, "Member 'UFGearArcadeAssists::MMinLeanSpeed' has a wrong offset!");
static_assert(offsetof(UFGearArcadeAssists, MMaxLeanAngle) == 0x0002FC, "Member 'UFGearArcadeAssists::MMaxLeanAngle' has a wrong offset!");
static_assert(offsetof(UFGearArcadeAssists, MMaxPitchAngle) == 0x000300, "Member 'UFGearArcadeAssists::MMaxPitchAngle' has a wrong offset!");
static_assert(offsetof(UFGearArcadeAssists, MLeanInAir) == 0x000308, "Member 'UFGearArcadeAssists::MLeanInAir' has a wrong offset!");

// Class FGearPlugin.FGearAutoDrive
// 0x00F0 (0x03A0 - 0x02B0)
class UFGearAutoDrive final : public UFGearTelemetryDrawer
{
public:
	uint8                                         Pad_2A8[0x78];                                     // 0x02A8(0x0078)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          MActive;                                           // 0x0320(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFGearSpline*                           MSpline;                                           // 0x0328(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MStuckResetTime;                                   // 0x0330(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MResetZOffset;                                     // 0x0334(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCurveFloat*                            MSpeedByAngleCurve;                                // 0x0338(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCurveFloat*                            MSpeedCoeffCurve;                                  // 0x0340(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MSteeringDistance;                                 // 0x0348(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MBrakingDistance;                                  // 0x034C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MSteeringLimit;                                    // 0x0350(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MForwardCheckDistance;                             // 0x0354(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MSideCheckDistance;                                // 0x0358(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MCrossCheckDistance;                               // 0x035C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MAvoidanceDistance;                                // 0x0360(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          MDebug;                                            // 0x0364(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_365[0x3];                                      // 0x0365(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MDebugThickness;                                   // 0x0368(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FColor                                 MSteeringDebugColor;                               // 0x036C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FColor                                 MBrakingDebugColor;                                // 0x0370(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FColor                                 MAvoidanceDebugColor;                              // 0x0374(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_378[0x28];                                     // 0x0378(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float GetCurrentSplineParam();
	bool IsEnabled();
	void SetEnabled(bool B);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FGearAutoDrive">();
	}
	static class UFGearAutoDrive* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFGearAutoDrive>();
	}
};
static_assert(alignof(UFGearAutoDrive) == 0x000010, "Wrong alignment on UFGearAutoDrive");
static_assert(sizeof(UFGearAutoDrive) == 0x0003A0, "Wrong size on UFGearAutoDrive");
static_assert(offsetof(UFGearAutoDrive, MActive) == 0x000320, "Member 'UFGearAutoDrive::MActive' has a wrong offset!");
static_assert(offsetof(UFGearAutoDrive, MSpline) == 0x000328, "Member 'UFGearAutoDrive::MSpline' has a wrong offset!");
static_assert(offsetof(UFGearAutoDrive, MStuckResetTime) == 0x000330, "Member 'UFGearAutoDrive::MStuckResetTime' has a wrong offset!");
static_assert(offsetof(UFGearAutoDrive, MResetZOffset) == 0x000334, "Member 'UFGearAutoDrive::MResetZOffset' has a wrong offset!");
static_assert(offsetof(UFGearAutoDrive, MSpeedByAngleCurve) == 0x000338, "Member 'UFGearAutoDrive::MSpeedByAngleCurve' has a wrong offset!");
static_assert(offsetof(UFGearAutoDrive, MSpeedCoeffCurve) == 0x000340, "Member 'UFGearAutoDrive::MSpeedCoeffCurve' has a wrong offset!");
static_assert(offsetof(UFGearAutoDrive, MSteeringDistance) == 0x000348, "Member 'UFGearAutoDrive::MSteeringDistance' has a wrong offset!");
static_assert(offsetof(UFGearAutoDrive, MBrakingDistance) == 0x00034C, "Member 'UFGearAutoDrive::MBrakingDistance' has a wrong offset!");
static_assert(offsetof(UFGearAutoDrive, MSteeringLimit) == 0x000350, "Member 'UFGearAutoDrive::MSteeringLimit' has a wrong offset!");
static_assert(offsetof(UFGearAutoDrive, MForwardCheckDistance) == 0x000354, "Member 'UFGearAutoDrive::MForwardCheckDistance' has a wrong offset!");
static_assert(offsetof(UFGearAutoDrive, MSideCheckDistance) == 0x000358, "Member 'UFGearAutoDrive::MSideCheckDistance' has a wrong offset!");
static_assert(offsetof(UFGearAutoDrive, MCrossCheckDistance) == 0x00035C, "Member 'UFGearAutoDrive::MCrossCheckDistance' has a wrong offset!");
static_assert(offsetof(UFGearAutoDrive, MAvoidanceDistance) == 0x000360, "Member 'UFGearAutoDrive::MAvoidanceDistance' has a wrong offset!");
static_assert(offsetof(UFGearAutoDrive, MDebug) == 0x000364, "Member 'UFGearAutoDrive::MDebug' has a wrong offset!");
static_assert(offsetof(UFGearAutoDrive, MDebugThickness) == 0x000368, "Member 'UFGearAutoDrive::MDebugThickness' has a wrong offset!");
static_assert(offsetof(UFGearAutoDrive, MSteeringDebugColor) == 0x00036C, "Member 'UFGearAutoDrive::MSteeringDebugColor' has a wrong offset!");
static_assert(offsetof(UFGearAutoDrive, MBrakingDebugColor) == 0x000370, "Member 'UFGearAutoDrive::MBrakingDebugColor' has a wrong offset!");
static_assert(offsetof(UFGearAutoDrive, MAvoidanceDebugColor) == 0x000374, "Member 'UFGearAutoDrive::MAvoidanceDebugColor' has a wrong offset!");

// Class FGearPlugin.FGearAxle
// 0x0070 (0x0320 - 0x02B0)
class UFGearAxle final : public UFGearTelemetryDrawer
{
public:
	EFGearDifferentialType                        MDifferentialType;                                 // 0x02A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2A9[0x1F];                                     // 0x02A9(0x001F)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MDiffStrength;                                     // 0x02C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MTorqueShare;                                      // 0x02CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MMaxSteerAngle;                                    // 0x02D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MAckermanCoeff;                                    // 0x02D4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         MAckermanReferenceIndex;                           // 0x02D8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          MHasHandbrake;                                     // 0x02DC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2DD[0x3];                                      // 0x02DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MCamberAngle;                                      // 0x02E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MToeAngle;                                         // 0x02E4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2E8[0x38];                                     // 0x02E8(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ApplyWheelOptions();
	float GetAckermanCoeff();
	int32 GetAckermanReferenceIndex();
	float GetCamberAngle();
	float GetCurRpm();
	EFGearDifferentialType GetDifferentialType();
	float GetDiffStrength();
	float GetFeedbackTorque();
	struct FVector GetGlobalCenter();
	int32 GetIndex();
	class UFGearWheel* GetLeftWheel();
	struct FVector GetLocalCenter();
	float GetMaxRpm();
	float GetMaxSteerAngle();
	float GetNormalizedSteering();
	class UFGearWheel* GetRightWheel();
	float GetRPM();
	float GetToeAngle();
	float GetTorqueShare();
	float GetTrackWidth();
	class UFGearWheelOptions* GetWheelOptions();
	float GetWheelRPMToKMH();
	bool HasHandBrake();
	bool HasSteering();
	void SetAckermanCoeff(float F);
	void SetAckermanReferenceIndex(int32 I);
	void SetCamberAngle(float F);
	void SetDifferentialType(EFGearDifferentialType Dt);
	void SetDiffStrength(float F);
	void SetHasHandBrake(bool B);
	void SetLeftWheel(class UFGearWheel* W);
	void SetMaxSteerAngle(float F);
	void SetRightWheel(class UFGearWheel* W);
	void SetTargetSteer(float S);
	void SetToeAngle(float F);
	void SetTorqueShare(float F);
	void SetWheelOptions(class UFGearWheelOptions* Wo);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FGearAxle">();
	}
	static class UFGearAxle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFGearAxle>();
	}
};
static_assert(alignof(UFGearAxle) == 0x000010, "Wrong alignment on UFGearAxle");
static_assert(sizeof(UFGearAxle) == 0x000320, "Wrong size on UFGearAxle");
static_assert(offsetof(UFGearAxle, MDifferentialType) == 0x0002A8, "Member 'UFGearAxle::MDifferentialType' has a wrong offset!");
static_assert(offsetof(UFGearAxle, MDiffStrength) == 0x0002C8, "Member 'UFGearAxle::MDiffStrength' has a wrong offset!");
static_assert(offsetof(UFGearAxle, MTorqueShare) == 0x0002CC, "Member 'UFGearAxle::MTorqueShare' has a wrong offset!");
static_assert(offsetof(UFGearAxle, MMaxSteerAngle) == 0x0002D0, "Member 'UFGearAxle::MMaxSteerAngle' has a wrong offset!");
static_assert(offsetof(UFGearAxle, MAckermanCoeff) == 0x0002D4, "Member 'UFGearAxle::MAckermanCoeff' has a wrong offset!");
static_assert(offsetof(UFGearAxle, MAckermanReferenceIndex) == 0x0002D8, "Member 'UFGearAxle::MAckermanReferenceIndex' has a wrong offset!");
static_assert(offsetof(UFGearAxle, MHasHandbrake) == 0x0002DC, "Member 'UFGearAxle::MHasHandbrake' has a wrong offset!");
static_assert(offsetof(UFGearAxle, MCamberAngle) == 0x0002E0, "Member 'UFGearAxle::MCamberAngle' has a wrong offset!");
static_assert(offsetof(UFGearAxle, MToeAngle) == 0x0002E4, "Member 'UFGearAxle::MToeAngle' has a wrong offset!");

// Class FGearPlugin.FGearCustomCollision
// 0x0010 (0x0630 - 0x0620)
class UFGearCustomCollision final : public UStaticMeshComponent
{
public:
	bool                                          MOverrideChannel;                                  // 0x0620(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ECollisionChannel                             MChannel;                                          // 0x0621(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_622[0xE];                                      // 0x0622(0x000E)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FGearCustomCollision">();
	}
	static class UFGearCustomCollision* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFGearCustomCollision>();
	}
};
static_assert(alignof(UFGearCustomCollision) == 0x000010, "Wrong alignment on UFGearCustomCollision");
static_assert(sizeof(UFGearCustomCollision) == 0x000630, "Wrong size on UFGearCustomCollision");
static_assert(offsetof(UFGearCustomCollision, MOverrideChannel) == 0x000620, "Member 'UFGearCustomCollision::MOverrideChannel' has a wrong offset!");
static_assert(offsetof(UFGearCustomCollision, MChannel) == 0x000621, "Member 'UFGearCustomCollision::MChannel' has a wrong offset!");

// Class FGearPlugin.FGearEngine
// 0x0040 (0x02F0 - 0x02B0)
class UFGearEngine final : public UFGearTelemetryDrawer
{
public:
	class UCurveFloat*                            MTorqueCurve;                                      // 0x02A8(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MTorqueScale;                                      // 0x02B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MFrictionTorque;                                   // 0x02B4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MIdleRpm;                                          // 0x02B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MLimitRpm;                                         // 0x02BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MLimiterTime;                                      // 0x02C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MEngineInertia;                                    // 0x02C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C8[0x28];                                     // 0x02C8(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CalculateMaxPower(float* MaxPower, float* MaxPowerRpm);
	float GetEngineInertia();
	float GetFrictionTorque();
	float GetIdleRpm();
	float GetLimiterTime();
	float GetLimitRpm();
	float GetRPM();
	float GetRpmRatio();
	float GetThrottle();
	float GetTorque();
	class UCurveFloat* GetTorqueCurve();
	float GetTorqueScale();
	bool IsLimiterOn();
	bool IsRunning();
	void ResetRpm();
	void SetEngineInertia(float F);
	void SetFrictionTorque(float F);
	void SetIdleRpm(float F);
	void SetLimiter(float L);
	void SetLimiterTime(float F);
	void SetLimitRpm(float F);
	void SetRpm(float F);
	void SetRunning(bool B);
	void SetThrottle(float Pedal);
	void SetTorqueCurve(class UCurveFloat* Curve);
	void SetTorqueScale(float F);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FGearEngine">();
	}
	static class UFGearEngine* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFGearEngine>();
	}
};
static_assert(alignof(UFGearEngine) == 0x000010, "Wrong alignment on UFGearEngine");
static_assert(sizeof(UFGearEngine) == 0x0002F0, "Wrong size on UFGearEngine");
static_assert(offsetof(UFGearEngine, MTorqueCurve) == 0x0002A8, "Member 'UFGearEngine::MTorqueCurve' has a wrong offset!");
static_assert(offsetof(UFGearEngine, MTorqueScale) == 0x0002B0, "Member 'UFGearEngine::MTorqueScale' has a wrong offset!");
static_assert(offsetof(UFGearEngine, MFrictionTorque) == 0x0002B4, "Member 'UFGearEngine::MFrictionTorque' has a wrong offset!");
static_assert(offsetof(UFGearEngine, MIdleRpm) == 0x0002B8, "Member 'UFGearEngine::MIdleRpm' has a wrong offset!");
static_assert(offsetof(UFGearEngine, MLimitRpm) == 0x0002BC, "Member 'UFGearEngine::MLimitRpm' has a wrong offset!");
static_assert(offsetof(UFGearEngine, MLimiterTime) == 0x0002C0, "Member 'UFGearEngine::MLimiterTime' has a wrong offset!");
static_assert(offsetof(UFGearEngine, MEngineInertia) == 0x0002C4, "Member 'UFGearEngine::MEngineInertia' has a wrong offset!");

// Class FGearPlugin.FGearOrbitCamera
// 0x0040 (0x02F0 - 0x02B0)
class UFGearOrbitCamera final : public UFGearTelemetryDrawer
{
public:
	uint8                                         Pad_2A8[0x8];                                      // 0x02A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          MDriftMode;                                        // 0x02B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          MFreeze;                                           // 0x02B1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2B2[0x2];                                      // 0x02B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MSpring;                                           // 0x02B4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MDistance;                                         // 0x02B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MTargetZOffset;                                    // 0x02BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MTiltAngle;                                        // 0x02C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C4[0x2C];                                     // 0x02C4(0x002C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void InjectMouseDX(float Mx);
	void InjectMouseDY(float My);
	void InjectMouseDZ(float Mz);
	void SetDistance(float D);
	void SetDriftMode(bool Dm);
	void SetFreeze(bool F);
	void SetOrbitMode(bool Orbit);
	void SetRotationOffset(float Angle);
	void SetSpring(float S);
	void SetTargetZOffset(float Z);
	void SetTiltAngle(float T);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FGearOrbitCamera">();
	}
	static class UFGearOrbitCamera* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFGearOrbitCamera>();
	}
};
static_assert(alignof(UFGearOrbitCamera) == 0x000010, "Wrong alignment on UFGearOrbitCamera");
static_assert(sizeof(UFGearOrbitCamera) == 0x0002F0, "Wrong size on UFGearOrbitCamera");
static_assert(offsetof(UFGearOrbitCamera, MDriftMode) == 0x0002B0, "Member 'UFGearOrbitCamera::MDriftMode' has a wrong offset!");
static_assert(offsetof(UFGearOrbitCamera, MFreeze) == 0x0002B1, "Member 'UFGearOrbitCamera::MFreeze' has a wrong offset!");
static_assert(offsetof(UFGearOrbitCamera, MSpring) == 0x0002B4, "Member 'UFGearOrbitCamera::MSpring' has a wrong offset!");
static_assert(offsetof(UFGearOrbitCamera, MDistance) == 0x0002B8, "Member 'UFGearOrbitCamera::MDistance' has a wrong offset!");
static_assert(offsetof(UFGearOrbitCamera, MTargetZOffset) == 0x0002BC, "Member 'UFGearOrbitCamera::MTargetZOffset' has a wrong offset!");
static_assert(offsetof(UFGearOrbitCamera, MTiltAngle) == 0x0002C0, "Member 'UFGearOrbitCamera::MTiltAngle' has a wrong offset!");

// Class FGearPlugin.FGearPhysicalMaterial
// 0x0020 (0x00A0 - 0x0080)
class UFGearPhysicalMaterial final : public UPhysicalMaterial
{
public:
	bool                                          MReceiveSkidmark;                                  // 0x0080(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MFriction;                                         // 0x0084(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MRoughness;                                        // 0x0088(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        MSmokeParticle;                                    // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundWave*                             MSkidClip;                                         // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FGearPhysicalMaterial">();
	}
	static class UFGearPhysicalMaterial* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFGearPhysicalMaterial>();
	}
};
static_assert(alignof(UFGearPhysicalMaterial) == 0x000008, "Wrong alignment on UFGearPhysicalMaterial");
static_assert(sizeof(UFGearPhysicalMaterial) == 0x0000A0, "Wrong size on UFGearPhysicalMaterial");
static_assert(offsetof(UFGearPhysicalMaterial, MReceiveSkidmark) == 0x000080, "Member 'UFGearPhysicalMaterial::MReceiveSkidmark' has a wrong offset!");
static_assert(offsetof(UFGearPhysicalMaterial, MFriction) == 0x000084, "Member 'UFGearPhysicalMaterial::MFriction' has a wrong offset!");
static_assert(offsetof(UFGearPhysicalMaterial, MRoughness) == 0x000088, "Member 'UFGearPhysicalMaterial::MRoughness' has a wrong offset!");
static_assert(offsetof(UFGearPhysicalMaterial, MSmokeParticle) == 0x000090, "Member 'UFGearPhysicalMaterial::MSmokeParticle' has a wrong offset!");
static_assert(offsetof(UFGearPhysicalMaterial, MSkidClip) == 0x000098, "Member 'UFGearPhysicalMaterial::MSkidClip' has a wrong offset!");

// Class FGearPlugin.FGearReplication
// 0x0270 (0x0520 - 0x02B0)
class UFGearReplication final : public UFGearTelemetryDrawer
{
public:
	bool                                          MEnabled;                                          // 0x02A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          MClientAuthority;                                  // 0x02A9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         MInputSendRate;                                    // 0x02AA(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         MInputBufferSize;                                  // 0x02AB(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          MStateReplication;                                 // 0x02AC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          MClientPrediction;                                 // 0x02AD(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         MStateSendRate;                                    // 0x02AE(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2AF[0x1];                                      // 0x02AF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MServerTime;                                       // 0x02B0(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2B4[0x1C];                                     // 0x02B4(0x001C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFGearInputState                       MLastInput;                                        // 0x02D0(0x001C)(Net, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MServerGear;                                       // 0x02F0(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2F4[0x22C];                                    // 0x02F4(0x022C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClientReceiveState(float Time, const struct FVector& Pos, const struct FQuat& Rot, const struct FVector& Vel, const struct FVector& Avel);
	bool IsEnabled();
	void OnPossessed_Client();
	void OnUnPossessed_Client();
	void ServerReceiveInputs(const struct FGearInputStateBuffer& Inputs);
	void ServerReceiveState(float Time, const struct FVector& Pos, const struct FQuat& Rot, const struct FVector& Vel, const struct FVector& Avel);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FGearReplication">();
	}
	static class UFGearReplication* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFGearReplication>();
	}
};
static_assert(alignof(UFGearReplication) == 0x000010, "Wrong alignment on UFGearReplication");
static_assert(sizeof(UFGearReplication) == 0x000520, "Wrong size on UFGearReplication");
static_assert(offsetof(UFGearReplication, MEnabled) == 0x0002A8, "Member 'UFGearReplication::MEnabled' has a wrong offset!");
static_assert(offsetof(UFGearReplication, MClientAuthority) == 0x0002A9, "Member 'UFGearReplication::MClientAuthority' has a wrong offset!");
static_assert(offsetof(UFGearReplication, MInputSendRate) == 0x0002AA, "Member 'UFGearReplication::MInputSendRate' has a wrong offset!");
static_assert(offsetof(UFGearReplication, MInputBufferSize) == 0x0002AB, "Member 'UFGearReplication::MInputBufferSize' has a wrong offset!");
static_assert(offsetof(UFGearReplication, MStateReplication) == 0x0002AC, "Member 'UFGearReplication::MStateReplication' has a wrong offset!");
static_assert(offsetof(UFGearReplication, MClientPrediction) == 0x0002AD, "Member 'UFGearReplication::MClientPrediction' has a wrong offset!");
static_assert(offsetof(UFGearReplication, MStateSendRate) == 0x0002AE, "Member 'UFGearReplication::MStateSendRate' has a wrong offset!");
static_assert(offsetof(UFGearReplication, MServerTime) == 0x0002B0, "Member 'UFGearReplication::MServerTime' has a wrong offset!");
static_assert(offsetof(UFGearReplication, MLastInput) == 0x0002D0, "Member 'UFGearReplication::MLastInput' has a wrong offset!");
