#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FgSedan_AnimBP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "FGearPlugin_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass fgSedan_AnimBP.fgSedan_AnimBP_C
// 0x0510 (0x0870 - 0x0360)
class UFgSedan_AnimBP_C final : public UFGearAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0368(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0370(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0378(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x0398(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x04C0(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x05E8(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0710(0x0128)()
	struct FAnimNode_MeshSpaceRefPose             AnimGraphNode_MeshRefPose;                         // 0x0838(0x0010)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0848(0x0020)()

public:
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_fgSedan_AnimBP_AnimGraphNode_ModifyBone_35EEF19B473860CB291E43AC375313F3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_fgSedan_AnimBP_AnimGraphNode_ModifyBone_80E010954D7FBAB8426956B7C14663C3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_fgSedan_AnimBP_AnimGraphNode_ModifyBone_EC077BB84B01871E5EFA129C884A2987();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_fgSedan_AnimBP_AnimGraphNode_ModifyBone_EE30AB6E4406CEB2AA2327A362472CD2();
	void ExecuteUbergraph_fgSedan_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"fgSedan_AnimBP_C">();
	}
	static class UFgSedan_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFgSedan_AnimBP_C>();
	}
};
static_assert(alignof(UFgSedan_AnimBP_C) == 0x000010, "Wrong alignment on UFgSedan_AnimBP_C");
static_assert(sizeof(UFgSedan_AnimBP_C) == 0x000870, "Wrong size on UFgSedan_AnimBP_C");
static_assert(offsetof(UFgSedan_AnimBP_C, UberGraphFrame) == 0x000360, "Member 'UFgSedan_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFgSedan_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000368, "Member 'UFgSedan_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UFgSedan_AnimBP_C, AnimBlueprintExtension_Base) == 0x000370, "Member 'UFgSedan_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UFgSedan_AnimBP_C, AnimGraphNode_Root) == 0x000378, "Member 'UFgSedan_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UFgSedan_AnimBP_C, AnimGraphNode_ModifyBone_3) == 0x000398, "Member 'UFgSedan_AnimBP_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(UFgSedan_AnimBP_C, AnimGraphNode_ModifyBone_2) == 0x0004C0, "Member 'UFgSedan_AnimBP_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UFgSedan_AnimBP_C, AnimGraphNode_ModifyBone_1) == 0x0005E8, "Member 'UFgSedan_AnimBP_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UFgSedan_AnimBP_C, AnimGraphNode_ModifyBone) == 0x000710, "Member 'UFgSedan_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UFgSedan_AnimBP_C, AnimGraphNode_MeshRefPose) == 0x000838, "Member 'UFgSedan_AnimBP_C::AnimGraphNode_MeshRefPose' has a wrong offset!");
static_assert(offsetof(UFgSedan_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x000848, "Member 'UFgSedan_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");

}

