#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FirebaseFeatures

#include "Basic.hpp"

#include "FirebaseFeatures_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function FirebaseFeatures.AuthMiscLibrary.CreateOAuthProvider
// 0x0080 (0x0080 - 0x0000)
struct AuthMiscLibrary_CreateOAuthProvider final
{
public:
	struct FFederatedOAuthProviderData            ProviderData;                                      // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FFederatedAuthProvider                 ReturnValue;                                       // 0x0070(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AuthMiscLibrary_CreateOAuthProvider) == 0x000008, "Wrong alignment on AuthMiscLibrary_CreateOAuthProvider");
static_assert(sizeof(AuthMiscLibrary_CreateOAuthProvider) == 0x000080, "Wrong size on AuthMiscLibrary_CreateOAuthProvider");
static_assert(offsetof(AuthMiscLibrary_CreateOAuthProvider, ProviderData) == 0x000000, "Member 'AuthMiscLibrary_CreateOAuthProvider::ProviderData' has a wrong offset!");
static_assert(offsetof(AuthMiscLibrary_CreateOAuthProvider, ReturnValue) == 0x000070, "Member 'AuthMiscLibrary_CreateOAuthProvider::ReturnValue' has a wrong offset!");

// Function FirebaseFeatures.AuthMiscLibrary.CurrentUser
// 0x0008 (0x0008 - 0x0000)
struct AuthMiscLibrary_CurrentUser final
{
public:
	class UUser*                                  ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AuthMiscLibrary_CurrentUser) == 0x000008, "Wrong alignment on AuthMiscLibrary_CurrentUser");
static_assert(sizeof(AuthMiscLibrary_CurrentUser) == 0x000008, "Wrong size on AuthMiscLibrary_CurrentUser");
static_assert(offsetof(AuthMiscLibrary_CurrentUser, ReturnValue) == 0x000000, "Member 'AuthMiscLibrary_CurrentUser::ReturnValue' has a wrong offset!");

// Function FirebaseFeatures.AuthMiscLibrary.FromAppleSignCredential
// 0x0088 (0x0088 - 0x0000)
struct AuthMiscLibrary_FromAppleSignCredential final
{
public:
	struct FAppleSignInCredential                 Credential;                                        // 0x0000(0x0080)(Parm, NativeAccessSpecifierPublic)
	struct FCredential                            ReturnValue;                                       // 0x0080(0x0008)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AuthMiscLibrary_FromAppleSignCredential) == 0x000008, "Wrong alignment on AuthMiscLibrary_FromAppleSignCredential");
static_assert(sizeof(AuthMiscLibrary_FromAppleSignCredential) == 0x000088, "Wrong size on AuthMiscLibrary_FromAppleSignCredential");
static_assert(offsetof(AuthMiscLibrary_FromAppleSignCredential, Credential) == 0x000000, "Member 'AuthMiscLibrary_FromAppleSignCredential::Credential' has a wrong offset!");
static_assert(offsetof(AuthMiscLibrary_FromAppleSignCredential, ReturnValue) == 0x000080, "Member 'AuthMiscLibrary_FromAppleSignCredential::ReturnValue' has a wrong offset!");

// Function FirebaseFeatures.AuthMiscLibrary.IsValid
// 0x0010 (0x0010 - 0x0000)
struct AuthMiscLibrary_IsValid final
{
public:
	struct FCredential                            Credential;                                        // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AuthMiscLibrary_IsValid) == 0x000008, "Wrong alignment on AuthMiscLibrary_IsValid");
static_assert(sizeof(AuthMiscLibrary_IsValid) == 0x000010, "Wrong size on AuthMiscLibrary_IsValid");
static_assert(offsetof(AuthMiscLibrary_IsValid, Credential) == 0x000000, "Member 'AuthMiscLibrary_IsValid::Credential' has a wrong offset!");
static_assert(offsetof(AuthMiscLibrary_IsValid, ReturnValue) == 0x000008, "Member 'AuthMiscLibrary_IsValid::ReturnValue' has a wrong offset!");

// Function FirebaseFeatures.AuthMiscLibrary.Provider
// 0x0018 (0x0018 - 0x0000)
struct AuthMiscLibrary_Provider final
{
public:
	struct FCredential                            Credential;                                        // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AuthMiscLibrary_Provider) == 0x000008, "Wrong alignment on AuthMiscLibrary_Provider");
static_assert(sizeof(AuthMiscLibrary_Provider) == 0x000018, "Wrong size on AuthMiscLibrary_Provider");
static_assert(offsetof(AuthMiscLibrary_Provider, Credential) == 0x000000, "Member 'AuthMiscLibrary_Provider::Credential' has a wrong offset!");
static_assert(offsetof(AuthMiscLibrary_Provider, ReturnValue) == 0x000008, "Member 'AuthMiscLibrary_Provider::ReturnValue' has a wrong offset!");

// Function FirebaseFeatures.ReauthenticateAndRetrieveDataProxy.ReauthenticateAndRetrieveData
// 0x0018 (0x0018 - 0x0000)
struct ReauthenticateAndRetrieveDataProxy_ReauthenticateAndRetrieveData final
{
public:
	const class UUser*                            User;                                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCredential                            Credential;                                        // 0x0008(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UReauthenticateAndRetrieveDataProxy*    ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ReauthenticateAndRetrieveDataProxy_ReauthenticateAndRetrieveData) == 0x000008, "Wrong alignment on ReauthenticateAndRetrieveDataProxy_ReauthenticateAndRetrieveData");
static_assert(sizeof(ReauthenticateAndRetrieveDataProxy_ReauthenticateAndRetrieveData) == 0x000018, "Wrong size on ReauthenticateAndRetrieveDataProxy_ReauthenticateAndRetrieveData");
static_assert(offsetof(ReauthenticateAndRetrieveDataProxy_ReauthenticateAndRetrieveData, User) == 0x000000, "Member 'ReauthenticateAndRetrieveDataProxy_ReauthenticateAndRetrieveData::User' has a wrong offset!");
static_assert(offsetof(ReauthenticateAndRetrieveDataProxy_ReauthenticateAndRetrieveData, Credential) == 0x000008, "Member 'ReauthenticateAndRetrieveDataProxy_ReauthenticateAndRetrieveData::Credential' has a wrong offset!");
static_assert(offsetof(ReauthenticateAndRetrieveDataProxy_ReauthenticateAndRetrieveData, ReturnValue) == 0x000010, "Member 'ReauthenticateAndRetrieveDataProxy_ReauthenticateAndRetrieveData::ReturnValue' has a wrong offset!");

// Function FirebaseFeatures.FetchProvidersForEmailProxy.FetchProvidersForEmail
// 0x0018 (0x0018 - 0x0000)
struct FetchProvidersForEmailProxy_FetchProvidersForEmail final
{
public:
	class FString                                 Email;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFetchProvidersForEmailProxy*           ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FetchProvidersForEmailProxy_FetchProvidersForEmail) == 0x000008, "Wrong alignment on FetchProvidersForEmailProxy_FetchProvidersForEmail");
static_assert(sizeof(FetchProvidersForEmailProxy_FetchProvidersForEmail) == 0x000018, "Wrong size on FetchProvidersForEmailProxy_FetchProvidersForEmail");
static_assert(offsetof(FetchProvidersForEmailProxy_FetchProvidersForEmail, Email) == 0x000000, "Member 'FetchProvidersForEmailProxy_FetchProvidersForEmail::Email' has a wrong offset!");
static_assert(offsetof(FetchProvidersForEmailProxy_FetchProvidersForEmail, ReturnValue) == 0x000010, "Member 'FetchProvidersForEmailProxy_FetchProvidersForEmail::ReturnValue' has a wrong offset!");

// Function FirebaseFeatures.SignInWithCustomTokenProxy.SignInWithCustomToken
// 0x0018 (0x0018 - 0x0000)
struct SignInWithCustomTokenProxy_SignInWithCustomToken final
{
public:
	class FString                                 Token;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USignInWithCustomTokenProxy*            ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SignInWithCustomTokenProxy_SignInWithCustomToken) == 0x000008, "Wrong alignment on SignInWithCustomTokenProxy_SignInWithCustomToken");
static_assert(sizeof(SignInWithCustomTokenProxy_SignInWithCustomToken) == 0x000018, "Wrong size on SignInWithCustomTokenProxy_SignInWithCustomToken");
static_assert(offsetof(SignInWithCustomTokenProxy_SignInWithCustomToken, Token) == 0x000000, "Member 'SignInWithCustomTokenProxy_SignInWithCustomToken::Token' has a wrong offset!");
static_assert(offsetof(SignInWithCustomTokenProxy_SignInWithCustomToken, ReturnValue) == 0x000010, "Member 'SignInWithCustomTokenProxy_SignInWithCustomToken::ReturnValue' has a wrong offset!");

// Function FirebaseFeatures.GetAnalyticsInstanceIdProxy.GetAnalyticsInstanceId
// 0x0008 (0x0008 - 0x0000)
struct GetAnalyticsInstanceIdProxy_GetAnalyticsInstanceId final
{
public:
	class UGetAnalyticsInstanceIdProxy*           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GetAnalyticsInstanceIdProxy_GetAnalyticsInstanceId) == 0x000008, "Wrong alignment on GetAnalyticsInstanceIdProxy_GetAnalyticsInstanceId");
static_assert(sizeof(GetAnalyticsInstanceIdProxy_GetAnalyticsInstanceId) == 0x000008, "Wrong size on GetAnalyticsInstanceIdProxy_GetAnalyticsInstanceId");
static_assert(offsetof(GetAnalyticsInstanceIdProxy_GetAnalyticsInstanceId, ReturnValue) == 0x000000, "Member 'GetAnalyticsInstanceIdProxy_GetAnalyticsInstanceId::ReturnValue' has a wrong offset!");

// Function FirebaseFeatures.User.ProviderData
// 0x0010 (0x0010 - 0x0000)
struct User_ProviderData final
{
public:
	TArray<struct FUserInfoInterface>             ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(User_ProviderData) == 0x000008, "Wrong alignment on User_ProviderData");
static_assert(sizeof(User_ProviderData) == 0x000010, "Wrong size on User_ProviderData");
static_assert(offsetof(User_ProviderData, ReturnValue) == 0x000000, "Member 'User_ProviderData::ReturnValue' has a wrong offset!");

// Function FirebaseFeatures.User.DisplayName
// 0x0010 (0x0010 - 0x0000)
struct User_DisplayName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(User_DisplayName) == 0x000008, "Wrong alignment on User_DisplayName");
static_assert(sizeof(User_DisplayName) == 0x000010, "Wrong size on User_DisplayName");
static_assert(offsetof(User_DisplayName, ReturnValue) == 0x000000, "Member 'User_DisplayName::ReturnValue' has a wrong offset!");

// Function FirebaseFeatures.User.Email
// 0x0010 (0x0010 - 0x0000)
struct User_Email final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(User_Email) == 0x000008, "Wrong alignment on User_Email");
static_assert(sizeof(User_Email) == 0x000010, "Wrong size on User_Email");
static_assert(offsetof(User_Email, ReturnValue) == 0x000000, "Member 'User_Email::ReturnValue' has a wrong offset!");

// Function FirebaseFeatures.User.IsAnonymous
// 0x0001 (0x0001 - 0x0000)
struct User_IsAnonymous final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(User_IsAnonymous) == 0x000001, "Wrong alignment on User_IsAnonymous");
static_assert(sizeof(User_IsAnonymous) == 0x000001, "Wrong size on User_IsAnonymous");
static_assert(offsetof(User_IsAnonymous, ReturnValue) == 0x000000, "Member 'User_IsAnonymous::ReturnValue' has a wrong offset!");

// Function FirebaseFeatures.User.IsEmailVerified
// 0x0001 (0x0001 - 0x0000)
struct User_IsEmailVerified final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(User_IsEmailVerified) == 0x000001, "Wrong alignment on User_IsEmailVerified");
static_assert(sizeof(User_IsEmailVerified) == 0x000001, "Wrong size on User_IsEmailVerified");
static_assert(offsetof(User_IsEmailVerified, ReturnValue) == 0x000000, "Member 'User_IsEmailVerified::ReturnValue' has a wrong offset!");

// Function FirebaseFeatures.User.Metadata
// 0x0010 (0x0010 - 0x0000)
struct User_Metadata final
{
public:
	struct FUserMetadata                          ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(User_Metadata) == 0x000008, "Wrong alignment on User_Metadata");
static_assert(sizeof(User_Metadata) == 0x000010, "Wrong size on User_Metadata");
static_assert(offsetof(User_Metadata, ReturnValue) == 0x000000, "Member 'User_Metadata::ReturnValue' has a wrong offset!");

// Function FirebaseFeatures.User.PhoneNumber
// 0x0010 (0x0010 - 0x0000)
struct User_PhoneNumber final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(User_PhoneNumber) == 0x000008, "Wrong alignment on User_PhoneNumber");
static_assert(sizeof(User_PhoneNumber) == 0x000010, "Wrong size on User_PhoneNumber");
static_assert(offsetof(User_PhoneNumber, ReturnValue) == 0x000000, "Member 'User_PhoneNumber::ReturnValue' has a wrong offset!");

// Function FirebaseFeatures.User.PhotoUrl
// 0x0010 (0x0010 - 0x0000)
struct User_PhotoUrl final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(User_PhotoUrl) == 0x000008, "Wrong alignment on User_PhotoUrl");
static_assert(sizeof(User_PhotoUrl) == 0x000010, "Wrong size on User_PhotoUrl");
static_assert(offsetof(User_PhotoUrl, ReturnValue) == 0x000000, "Member 'User_PhotoUrl::ReturnValue' has a wrong offset!");

// Function FirebaseFeatures.User.ProviderId
// 0x0010 (0x0010 - 0x0000)
struct User_ProviderId final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(User_ProviderId) == 0x000008, "Wrong alignment on User_ProviderId");
static_assert(sizeof(User_ProviderId) == 0x000010, "Wrong size on User_ProviderId");
static_assert(offsetof(User_ProviderId, ReturnValue) == 0x000000, "Member 'User_ProviderId::ReturnValue' has a wrong offset!");

// Function FirebaseFeatures.User.Uid
// 0x0010 (0x0010 - 0x0000)
struct User_Uid final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(User_Uid) == 0x000008, "Wrong alignment on User_Uid");
static_assert(sizeof(User_Uid) == 0x000010, "Wrong size on User_Uid");
static_assert(offsetof(User_Uid, ReturnValue) == 0x000000, "Member 'User_Uid::ReturnValue' has a wrong offset!");

// Function FirebaseFeatures.SignInWithCredentialProxy.SignInWithCredential
// 0x0010 (0x0010 - 0x0000)
struct SignInWithCredentialProxy_SignInWithCredential final
{
public:
	struct FCredential                            Credential;                                        // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class USignInWithCredentialProxy*             ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SignInWithCredentialProxy_SignInWithCredential) == 0x000008, "Wrong alignment on SignInWithCredentialProxy_SignInWithCredential");
static_assert(sizeof(SignInWithCredentialProxy_SignInWithCredential) == 0x000010, "Wrong size on SignInWithCredentialProxy_SignInWithCredential");
static_assert(offsetof(SignInWithCredentialProxy_SignInWithCredential, Credential) == 0x000000, "Member 'SignInWithCredentialProxy_SignInWithCredential::Credential' has a wrong offset!");
static_assert(offsetof(SignInWithCredentialProxy_SignInWithCredential, ReturnValue) == 0x000008, "Member 'SignInWithCredentialProxy_SignInWithCredential::ReturnValue' has a wrong offset!");

// Function FirebaseFeatures.SignInWithProviderProxy.SignInWithProvider
// 0x0018 (0x0018 - 0x0000)
struct SignInWithProviderProxy_SignInWithProvider final
{
public:
	struct FFederatedAuthProvider                 AuthProvider;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class USignInWithProviderProxy*               ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SignInWithProviderProxy_SignInWithProvider) == 0x000008, "Wrong alignment on SignInWithProviderProxy_SignInWithProvider");
static_assert(sizeof(SignInWithProviderProxy_SignInWithProvider) == 0x000018, "Wrong size on SignInWithProviderProxy_SignInWithProvider");
static_assert(offsetof(SignInWithProviderProxy_SignInWithProvider, AuthProvider) == 0x000000, "Member 'SignInWithProviderProxy_SignInWithProvider::AuthProvider' has a wrong offset!");
static_assert(offsetof(SignInWithProviderProxy_SignInWithProvider, ReturnValue) == 0x000010, "Member 'SignInWithProviderProxy_SignInWithProvider::ReturnValue' has a wrong offset!");

// Function FirebaseFeatures.CreateInterstitialAd.CreateInterstitialAd
// 0x0018 (0x0018 - 0x0000)
struct CreateInterstitialAd_CreateInterstitialAd final
{
public:
	class FString                                 AdUnitId;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCreateInterstitialAd*                  ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CreateInterstitialAd_CreateInterstitialAd) == 0x000008, "Wrong alignment on CreateInterstitialAd_CreateInterstitialAd");
static_assert(sizeof(CreateInterstitialAd_CreateInterstitialAd) == 0x000018, "Wrong size on CreateInterstitialAd_CreateInterstitialAd");
static_assert(offsetof(CreateInterstitialAd_CreateInterstitialAd, AdUnitId) == 0x000000, "Member 'CreateInterstitialAd_CreateInterstitialAd::AdUnitId' has a wrong offset!");
static_assert(offsetof(CreateInterstitialAd_CreateInterstitialAd, ReturnValue) == 0x000010, "Member 'CreateInterstitialAd_CreateInterstitialAd::ReturnValue' has a wrong offset!");

// Function FirebaseFeatures.StorageUpdateMetadataProxy.UpdateMetadata
// 0x0018 (0x0018 - 0x0000)
struct StorageUpdateMetadataProxy_UpdateMetadata final
{
public:
	class UFirebaseStorageReference*              StorageReference;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFirebaseStorageMetadata               Metadata;                                          // 0x0008(0x0001)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStorageUpdateMetadataProxy*            ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(StorageUpdateMetadataProxy_UpdateMetadata) == 0x000008, "Wrong alignment on StorageUpdateMetadataProxy_UpdateMetadata");
static_assert(sizeof(StorageUpdateMetadataProxy_UpdateMetadata) == 0x000018, "Wrong size on StorageUpdateMetadataProxy_UpdateMetadata");
static_assert(offsetof(StorageUpdateMetadataProxy_UpdateMetadata, StorageReference) == 0x000000, "Member 'StorageUpdateMetadataProxy_UpdateMetadata::StorageReference' has a wrong offset!");
static_assert(offsetof(StorageUpdateMetadataProxy_UpdateMetadata, Metadata) == 0x000008, "Member 'StorageUpdateMetadataProxy_UpdateMetadata::Metadata' has a wrong offset!");
static_assert(offsetof(StorageUpdateMetadataProxy_UpdateMetadata, ReturnValue) == 0x000010, "Member 'StorageUpdateMetadataProxy_UpdateMetadata::ReturnValue' has a wrong offset!");

// Function FirebaseFeatures.SignInAndRetrieveDataWithCredentialProxy.SignInAndRetrieveDataWithCredential
// 0x0010 (0x0010 - 0x0000)
struct SignInAndRetrieveDataWithCredentialProxy_SignInAndRetrieveDataWithCredential final
{
public:
	struct FCredential                            Credential;                                        // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class USignInAndRetrieveDataWithCredentialProxy* ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SignInAndRetrieveDataWithCredentialProxy_SignInAndRetrieveDataWithCredential) == 0x000008, "Wrong alignment on SignInAndRetrieveDataWithCredentialProxy_SignInAndRetrieveDataWithCredential");
static_assert(sizeof(SignInAndRetrieveDataWithCredentialProxy_SignInAndRetrieveDataWithCredential) == 0x000010, "Wrong size on SignInAndRetrieveDataWithCredentialProxy_SignInAndRetrieveDataWithCredential");
static_assert(offsetof(SignInAndRetrieveDataWithCredentialProxy_SignInAndRetrieveDataWithCredential, Credential) == 0x000000, "Member 'SignInAndRetrieveDataWithCredentialProxy_SignInAndRetrieveDataWithCredential::Credential' has a wrong offset!");
static_assert(offsetof(SignInAndRetrieveDataWithCredentialProxy_SignInAndRetrieveDataWithCredential, ReturnValue) == 0x000008, "Member 'SignInAndRetrieveDataWithCredentialProxy_SignInAndRetrieveDataWithCredential::ReturnValue' has a wrong offset!");

// Function FirebaseFeatures.SignInAnonymouslyProxy.SignInAnonymously
// 0x0008 (0x0008 - 0x0000)
struct SignInAnonymouslyProxy_SignInAnonymously final
{
public:
	class USignInAnonymouslyProxy*                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SignInAnonymouslyProxy_SignInAnonymously) == 0x000008, "Wrong alignment on SignInAnonymouslyProxy_SignInAnonymously");
static_assert(sizeof(SignInAnonymouslyProxy_SignInAnonymously) == 0x000008, "Wrong size on SignInAnonymouslyProxy_SignInAnonymously");
static_assert(offsetof(SignInAnonymouslyProxy_SignInAnonymously, ReturnValue) == 0x000000, "Member 'SignInAnonymouslyProxy_SignInAnonymously::ReturnValue' has a wrong offset!");

// Function FirebaseFeatures.UpdatePasswordProxy.UpdatePassword
// 0x0020 (0x0020 - 0x0000)
struct UpdatePasswordProxy_UpdatePassword final
{
public:
	const class UUser*                            User;                                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Password;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUpdatePasswordProxy*                   ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UpdatePasswordProxy_UpdatePassword) == 0x000008, "Wrong alignment on UpdatePasswordProxy_UpdatePassword");
static_assert(sizeof(UpdatePasswordProxy_UpdatePassword) == 0x000020, "Wrong size on UpdatePasswordProxy_UpdatePassword");
static_assert(offsetof(UpdatePasswordProxy_UpdatePassword, User) == 0x000000, "Member 'UpdatePasswordProxy_UpdatePassword::User' has a wrong offset!");
static_assert(offsetof(UpdatePasswordProxy_UpdatePassword, Password) == 0x000008, "Member 'UpdatePasswordProxy_UpdatePassword::Password' has a wrong offset!");
static_assert(offsetof(UpdatePasswordProxy_UpdatePassword, ReturnValue) == 0x000018, "Member 'UpdatePasswordProxy_UpdatePassword::ReturnValue' has a wrong offset!");

// Function FirebaseFeatures.SignInWithEmailAndPasswordProxy.SignInWithEmailAndPassword
// 0x0028 (0x0028 - 0x0000)
struct SignInWithEmailAndPasswordProxy_SignInWithEmailAndPassword final
{
public:
	class FString                                 Email;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Password;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USignInWithEmailAndPasswordProxy*       ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SignInWithEmailAndPasswordProxy_SignInWithEmailAndPassword) == 0x000008, "Wrong alignment on SignInWithEmailAndPasswordProxy_SignInWithEmailAndPassword");
static_assert(sizeof(SignInWithEmailAndPasswordProxy_SignInWithEmailAndPassword) == 0x000028, "Wrong size on SignInWithEmailAndPasswordProxy_SignInWithEmailAndPassword");
static_assert(offsetof(SignInWithEmailAndPasswordProxy_SignInWithEmailAndPassword, Email) == 0x000000, "Member 'SignInWithEmailAndPasswordProxy_SignInWithEmailAndPassword::Email' has a wrong offset!");
static_assert(offsetof(SignInWithEmailAndPasswordProxy_SignInWithEmailAndPassword, Password) == 0x000010, "Member 'SignInWithEmailAndPasswordProxy_SignInWithEmailAndPassword::Password' has a wrong offset!");
static_assert(offsetof(SignInWithEmailAndPasswordProxy_SignInWithEmailAndPassword, ReturnValue) == 0x000020, "Member 'SignInWithEmailAndPasswordProxy_SignInWithEmailAndPassword::ReturnValue' has a wrong offset!");

// Function FirebaseFeatures.CrashlyticsLibrary.DidCrashDuringPreviousExecution
// 0x0001 (0x0001 - 0x0000)
struct CrashlyticsLibrary_DidCrashDuringPreviousExecution final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CrashlyticsLibrary_DidCrashDuringPreviousExecution) == 0x000001, "Wrong alignment on CrashlyticsLibrary_DidCrashDuringPreviousExecution");
static_assert(sizeof(CrashlyticsLibrary_DidCrashDuringPreviousExecution) == 0x000001, "Wrong size on CrashlyticsLibrary_DidCrashDuringPreviousExecution");
static_assert(offsetof(CrashlyticsLibrary_DidCrashDuringPreviousExecution, ReturnValue) == 0x000000, "Member 'CrashlyticsLibrary_DidCrashDuringPreviousExecution::ReturnValue' has a wrong offset!");

// Function FirebaseFeatures.CrashlyticsLibrary.IsCrashlyticsCollectionEnabled
// 0x0001 (0x0001 - 0x0000)
struct CrashlyticsLibrary_IsCrashlyticsCollectionEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CrashlyticsLibrary_IsCrashlyticsCollectionEnabled) == 0x000001, "Wrong alignment on CrashlyticsLibrary_IsCrashlyticsCollectionEnabled");
static_assert(sizeof(CrashlyticsLibrary_IsCrashlyticsCollectionEnabled) == 0x000001, "Wrong size on CrashlyticsLibrary_IsCrashlyticsCollectionEnabled");
static_assert(offsetof(CrashlyticsLibrary_IsCrashlyticsCollectionEnabled, ReturnValue) == 0x000000, "Member 'CrashlyticsLibrary_IsCrashlyticsCollectionEnabled::ReturnValue' has a wrong offset!");

// Function FirebaseFeatures.CrashlyticsLibrary.Log
// 0x0010 (0x0010 - 0x0000)
struct CrashlyticsLibrary_Log final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CrashlyticsLibrary_Log) == 0x000008, "Wrong alignment on CrashlyticsLibrary_Log");
static_assert(sizeof(CrashlyticsLibrary_Log) == 0x000010, "Wrong size on CrashlyticsLibrary_Log");
static_assert(offsetof(CrashlyticsLibrary_Log, Message) == 0x000000, "Member 'CrashlyticsLibrary_Log::Message' has a wrong offset!");

// Function FirebaseFeatures.CrashlyticsLibrary.RecordError
// 0x0028 (0x0028 - 0x0000)
struct CrashlyticsLibrary_RecordError final
{
public:
	class FString                                 Domain;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Message;                                           // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         Code;                                              // 0x0020(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CrashlyticsLibrary_RecordError) == 0x000008, "Wrong alignment on CrashlyticsLibrary_RecordError");
static_assert(sizeof(CrashlyticsLibrary_RecordError) == 0x000028, "Wrong size on CrashlyticsLibrary_RecordError");
static_assert(offsetof(CrashlyticsLibrary_RecordError, Domain) == 0x000000, "Member 'CrashlyticsLibrary_RecordError::Domain' has a wrong offset!");
static_assert(offsetof(CrashlyticsLibrary_RecordError, Message) == 0x000010, "Member 'CrashlyticsLibrary_RecordError::Message' has a wrong offset!");
static_assert(offsetof(CrashlyticsLibrary_RecordError, Code) == 0x000020, "Member 'CrashlyticsLibrary_RecordError::Code' has a wrong offset!");

// Function FirebaseFeatures.CrashlyticsLibrary.SetCrashlyticsCollectionEnabled
// 0x0001 (0x0001 - 0x0000)
struct CrashlyticsLibrary_SetCrashlyticsCollectionEnabled final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CrashlyticsLibrary_SetCrashlyticsCollectionEnabled) == 0x000001, "Wrong alignment on CrashlyticsLibrary_SetCrashlyticsCollectionEnabled");
static_assert(sizeof(CrashlyticsLibrary_SetCrashlyticsCollectionEnabled) == 0x000001, "Wrong size on CrashlyticsLibrary_SetCrashlyticsCollectionEnabled");
static_assert(offsetof(CrashlyticsLibrary_SetCrashlyticsCollectionEnabled, bEnabled) == 0x000000, "Member 'CrashlyticsLibrary_SetCrashlyticsCollectionEnabled::bEnabled' has a wrong offset!");

// Function FirebaseFeatures.CrashlyticsLibrary.SetCustomBoolValue
// 0x0018 (0x0018 - 0x0000)
struct CrashlyticsLibrary_SetCustomBoolValue final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Value;                                             // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CrashlyticsLibrary_SetCustomBoolValue) == 0x000008, "Wrong alignment on CrashlyticsLibrary_SetCustomBoolValue");
static_assert(sizeof(CrashlyticsLibrary_SetCustomBoolValue) == 0x000018, "Wrong size on CrashlyticsLibrary_SetCustomBoolValue");
static_assert(offsetof(CrashlyticsLibrary_SetCustomBoolValue, Key) == 0x000000, "Member 'CrashlyticsLibrary_SetCustomBoolValue::Key' has a wrong offset!");
static_assert(offsetof(CrashlyticsLibrary_SetCustomBoolValue, Value) == 0x000010, "Member 'CrashlyticsLibrary_SetCustomBoolValue::Value' has a wrong offset!");

// Function FirebaseFeatures.CrashlyticsLibrary.SetCustomFloatValue
// 0x0018 (0x0018 - 0x0000)
struct CrashlyticsLibrary_SetCustomFloatValue final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CrashlyticsLibrary_SetCustomFloatValue) == 0x000008, "Wrong alignment on CrashlyticsLibrary_SetCustomFloatValue");
static_assert(sizeof(CrashlyticsLibrary_SetCustomFloatValue) == 0x000018, "Wrong size on CrashlyticsLibrary_SetCustomFloatValue");
static_assert(offsetof(CrashlyticsLibrary_SetCustomFloatValue, Key) == 0x000000, "Member 'CrashlyticsLibrary_SetCustomFloatValue::Key' has a wrong offset!");
static_assert(offsetof(CrashlyticsLibrary_SetCustomFloatValue, Value) == 0x000010, "Member 'CrashlyticsLibrary_SetCustomFloatValue::Value' has a wrong offset!");

// Function FirebaseFeatures.CrashlyticsLibrary.SetCustomInt32Value
// 0x0018 (0x0018 - 0x0000)
struct CrashlyticsLibrary_SetCustomInt32Value final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Value;                                             // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CrashlyticsLibrary_SetCustomInt32Value) == 0x000008, "Wrong alignment on CrashlyticsLibrary_SetCustomInt32Value");
static_assert(sizeof(CrashlyticsLibrary_SetCustomInt32Value) == 0x000018, "Wrong size on CrashlyticsLibrary_SetCustomInt32Value");
static_assert(offsetof(CrashlyticsLibrary_SetCustomInt32Value, Key) == 0x000000, "Member 'CrashlyticsLibrary_SetCustomInt32Value::Key' has a wrong offset!");
static_assert(offsetof(CrashlyticsLibrary_SetCustomInt32Value, Value) == 0x000010, "Member 'CrashlyticsLibrary_SetCustomInt32Value::Value' has a wrong offset!");

// Function FirebaseFeatures.CrashlyticsLibrary.SetCustomInt64Value
// 0x0018 (0x0018 - 0x0000)
struct CrashlyticsLibrary_SetCustomInt64Value final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         Value;                                             // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CrashlyticsLibrary_SetCustomInt64Value) == 0x000008, "Wrong alignment on CrashlyticsLibrary_SetCustomInt64Value");
static_assert(sizeof(CrashlyticsLibrary_SetCustomInt64Value) == 0x000018, "Wrong size on CrashlyticsLibrary_SetCustomInt64Value");
static_assert(offsetof(CrashlyticsLibrary_SetCustomInt64Value, Key) == 0x000000, "Member 'CrashlyticsLibrary_SetCustomInt64Value::Key' has a wrong offset!");
static_assert(offsetof(CrashlyticsLibrary_SetCustomInt64Value, Value) == 0x000010, "Member 'CrashlyticsLibrary_SetCustomInt64Value::Value' has a wrong offset!");

// Function FirebaseFeatures.CrashlyticsLibrary.SetCustomStringValue
// 0x0020 (0x0020 - 0x0000)
struct CrashlyticsLibrary_SetCustomStringValue final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CrashlyticsLibrary_SetCustomStringValue) == 0x000008, "Wrong alignment on CrashlyticsLibrary_SetCustomStringValue");
static_assert(sizeof(CrashlyticsLibrary_SetCustomStringValue) == 0x000020, "Wrong size on CrashlyticsLibrary_SetCustomStringValue");
static_assert(offsetof(CrashlyticsLibrary_SetCustomStringValue, Key) == 0x000000, "Member 'CrashlyticsLibrary_SetCustomStringValue::Key' has a wrong offset!");
static_assert(offsetof(CrashlyticsLibrary_SetCustomStringValue, Value) == 0x000010, "Member 'CrashlyticsLibrary_SetCustomStringValue::Value' has a wrong offset!");

// Function FirebaseFeatures.CrashlyticsLibrary.SetCustomVectorValue
// 0x0028 (0x0028 - 0x0000)
struct CrashlyticsLibrary_SetCustomVectorValue final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Value;                                             // 0x0010(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CrashlyticsLibrary_SetCustomVectorValue) == 0x000008, "Wrong alignment on CrashlyticsLibrary_SetCustomVectorValue");
static_assert(sizeof(CrashlyticsLibrary_SetCustomVectorValue) == 0x000028, "Wrong size on CrashlyticsLibrary_SetCustomVectorValue");
static_assert(offsetof(CrashlyticsLibrary_SetCustomVectorValue, Key) == 0x000000, "Member 'CrashlyticsLibrary_SetCustomVectorValue::Key' has a wrong offset!");
static_assert(offsetof(CrashlyticsLibrary_SetCustomVectorValue, Value) == 0x000010, "Member 'CrashlyticsLibrary_SetCustomVectorValue::Value' has a wrong offset!");

// Function FirebaseFeatures.CrashlyticsLibrary.SetUserID
// 0x0010 (0x0010 - 0x0000)
struct CrashlyticsLibrary_SetUserID final
{
public:
	class FString                                 UserId;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CrashlyticsLibrary_SetUserID) == 0x000008, "Wrong alignment on CrashlyticsLibrary_SetUserID");
static_assert(sizeof(CrashlyticsLibrary_SetUserID) == 0x000010, "Wrong size on CrashlyticsLibrary_SetUserID");
static_assert(offsetof(CrashlyticsLibrary_SetUserID, UserId) == 0x000000, "Member 'CrashlyticsLibrary_SetUserID::UserId' has a wrong offset!");

// Function FirebaseFeatures.CreateUserWithEmailAndPasswordProxy.CreateUserWithEmailAndPassword
// 0x0028 (0x0028 - 0x0000)
struct CreateUserWithEmailAndPasswordProxy_CreateUserWithEmailAndPassword final
{
public:
	class FString                                 Email;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Password;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCreateUserWithEmailAndPasswordProxy*   ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CreateUserWithEmailAndPasswordProxy_CreateUserWithEmailAndPassword) == 0x000008, "Wrong alignment on CreateUserWithEmailAndPasswordProxy_CreateUserWithEmailAndPassword");
static_assert(sizeof(CreateUserWithEmailAndPasswordProxy_CreateUserWithEmailAndPassword) == 0x000028, "Wrong size on CreateUserWithEmailAndPasswordProxy_CreateUserWithEmailAndPassword");
static_assert(offsetof(CreateUserWithEmailAndPasswordProxy_CreateUserWithEmailAndPassword, Email) == 0x000000, "Member 'CreateUserWithEmailAndPasswordProxy_CreateUserWithEmailAndPassword::Email' has a wrong offset!");
static_assert(offsetof(CreateUserWithEmailAndPasswordProxy_CreateUserWithEmailAndPassword, Password) == 0x000010, "Member 'CreateUserWithEmailAndPasswordProxy_CreateUserWithEmailAndPassword::Password' has a wrong offset!");
static_assert(offsetof(CreateUserWithEmailAndPasswordProxy_CreateUserWithEmailAndPassword, ReturnValue) == 0x000020, "Member 'CreateUserWithEmailAndPasswordProxy_CreateUserWithEmailAndPassword::ReturnValue' has a wrong offset!");

// Function FirebaseFeatures.UpdatePhoneNumberCredentialProxy.UpdatePhoneNumberCredential
// 0x0018 (0x0018 - 0x0000)
struct UpdatePhoneNumberCredentialProxy_UpdatePhoneNumberCredential final
{
public:
	const class UUser*                            User;                                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCredential                            Credential;                                        // 0x0008(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UUpdatePhoneNumberCredentialProxy*      ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UpdatePhoneNumberCredentialProxy_UpdatePhoneNumberCredential) == 0x000008, "Wrong alignment on UpdatePhoneNumberCredentialProxy_UpdatePhoneNumberCredential");
static_assert(sizeof(UpdatePhoneNumberCredentialProxy_UpdatePhoneNumberCredential) == 0x000018, "Wrong size on UpdatePhoneNumberCredentialProxy_UpdatePhoneNumberCredential");
static_assert(offsetof(UpdatePhoneNumberCredentialProxy_UpdatePhoneNumberCredential, User) == 0x000000, "Member 'UpdatePhoneNumberCredentialProxy_UpdatePhoneNumberCredential::User' has a wrong offset!");
static_assert(offsetof(UpdatePhoneNumberCredentialProxy_UpdatePhoneNumberCredential, Credential) == 0x000008, "Member 'UpdatePhoneNumberCredentialProxy_UpdatePhoneNumberCredential::Credential' has a wrong offset!");
static_assert(offsetof(UpdatePhoneNumberCredentialProxy_UpdatePhoneNumberCredential, ReturnValue) == 0x000010, "Member 'UpdatePhoneNumberCredentialProxy_UpdatePhoneNumberCredential::ReturnValue' has a wrong offset!");

// Function FirebaseFeatures.SendPasswordResetEmailProxy.SendPasswordResetEmail
// 0x0018 (0x0018 - 0x0000)
struct SendPasswordResetEmailProxy_SendPasswordResetEmail final
{
public:
	class FString                                 Email;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USendPasswordResetEmailProxy*           ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SendPasswordResetEmailProxy_SendPasswordResetEmail) == 0x000008, "Wrong alignment on SendPasswordResetEmailProxy_SendPasswordResetEmail");
static_assert(sizeof(SendPasswordResetEmailProxy_SendPasswordResetEmail) == 0x000018, "Wrong size on SendPasswordResetEmailProxy_SendPasswordResetEmail");
static_assert(offsetof(SendPasswordResetEmailProxy_SendPasswordResetEmail, Email) == 0x000000, "Member 'SendPasswordResetEmailProxy_SendPasswordResetEmail::Email' has a wrong offset!");
static_assert(offsetof(SendPasswordResetEmailProxy_SendPasswordResetEmail, ReturnValue) == 0x000010, "Member 'SendPasswordResetEmailProxy_SendPasswordResetEmail::ReturnValue' has a wrong offset!");

// Function FirebaseFeatures.ListenAuthEventsProxy.ListenAuthEvents
// 0x0008 (0x0008 - 0x0000)
struct ListenAuthEventsProxy_ListenAuthEvents final
{
public:
	class UListenAuthEventsProxy*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ListenAuthEventsProxy_ListenAuthEvents) == 0x000008, "Wrong alignment on ListenAuthEventsProxy_ListenAuthEvents");
static_assert(sizeof(ListenAuthEventsProxy_ListenAuthEvents) == 0x000008, "Wrong size on ListenAuthEventsProxy_ListenAuthEvents");
static_assert(offsetof(ListenAuthEventsProxy_ListenAuthEvents, ReturnValue) == 0x000000, "Member 'ListenAuthEventsProxy_ListenAuthEvents::ReturnValue' has a wrong offset!");

// Function FirebaseFeatures.SendEmailVerificationProxy.SendEmailVerification
// 0x0010 (0x0010 - 0x0000)
struct SendEmailVerificationProxy_SendEmailVerification final
{
public:
	const class UUser*                            User;                                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USendEmailVerificationProxy*            ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SendEmailVerificationProxy_SendEmailVerification) == 0x000008, "Wrong alignment on SendEmailVerificationProxy_SendEmailVerification");
static_assert(sizeof(SendEmailVerificationProxy_SendEmailVerification) == 0x000010, "Wrong size on SendEmailVerificationProxy_SendEmailVerification");
static_assert(offsetof(SendEmailVerificationProxy_SendEmailVerification, User) == 0x000000, "Member 'SendEmailVerificationProxy_SendEmailVerification::User' has a wrong offset!");
static_assert(offsetof(SendEmailVerificationProxy_SendEmailVerification, ReturnValue) == 0x000008, "Member 'SendEmailVerificationProxy_SendEmailVerification::ReturnValue' has a wrong offset!");

// Function FirebaseFeatures.AppleSignInGetCred.GetCredential
// 0x0018 (0x0018 - 0x0000)
struct AppleSignInGetCred_GetCredential final
{
public:
	class FString                                 Nonce;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAppleSignInGetCred*                    ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppleSignInGetCred_GetCredential) == 0x000008, "Wrong alignment on AppleSignInGetCred_GetCredential");
static_assert(sizeof(AppleSignInGetCred_GetCredential) == 0x000018, "Wrong size on AppleSignInGetCred_GetCredential");
static_assert(offsetof(AppleSignInGetCred_GetCredential, Nonce) == 0x000000, "Member 'AppleSignInGetCred_GetCredential::Nonce' has a wrong offset!");
static_assert(offsetof(AppleSignInGetCred_GetCredential, ReturnValue) == 0x000010, "Member 'AppleSignInGetCred_GetCredential::ReturnValue' has a wrong offset!");

// Function FirebaseFeatures.Database.GetInstance
// 0x0008 (0x0008 - 0x0000)
struct Database_GetInstance final
{
public:
	class UDatabase*                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Database_GetInstance) == 0x000008, "Wrong alignment on Database_GetInstance");
static_assert(sizeof(Database_GetInstance) == 0x000008, "Wrong size on Database_GetInstance");
static_assert(offsetof(Database_GetInstance, ReturnValue) == 0x000000, "Member 'Database_GetInstance::ReturnValue' has a wrong offset!");

// Function FirebaseFeatures.Database.GetInstanceFromUrl
// 0x0018 (0x0018 - 0x0000)
struct Database_GetInstanceFromUrl final
{
public:
	class FString                                 URL;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDatabase*                              ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Database_GetInstanceFromUrl) == 0x000008, "Wrong alignment on Database_GetInstanceFromUrl");
static_assert(sizeof(Database_GetInstanceFromUrl) == 0x000018, "Wrong size on Database_GetInstanceFromUrl");
static_assert(offsetof(Database_GetInstanceFromUrl, URL) == 0x000000, "Member 'Database_GetInstanceFromUrl::URL' has a wrong offset!");
static_assert(offsetof(Database_GetInstanceFromUrl, ReturnValue) == 0x000010, "Member 'Database_GetInstanceFromUrl::ReturnValue' has a wrong offset!");

// Function FirebaseFeatures.Database.GetInstanceReference
// 0x0008 (0x0008 - 0x0000)
struct Database_GetInstanceReference final
{
public:
	class UDatabaseReference*                     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Database_GetInstanceReference) == 0x000008, "Wrong alignment on Database_GetInstanceReference");
static_assert(sizeof(Database_GetInstanceReference) == 0x000008, "Wrong size on Database_GetInstanceReference");
static_assert(offsetof(Database_GetInstanceReference, ReturnValue) == 0x000000, "Member 'Database_GetInstanceReference::ReturnValue' has a wrong offset!");

// Function FirebaseFeatures.Database.GetUrl
// 0x0010 (0x0010 - 0x0000)
struct Database_GetUrl final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Database_GetUrl) == 0x000008, "Wrong alignment on Database_GetUrl");
static_assert(sizeof(Database_GetUrl) == 0x000010, "Wrong size on Database_GetUrl");
static_assert(offsetof(Database_GetUrl, ReturnValue) == 0x000000, "Member 'Database_GetUrl::ReturnValue' has a wrong offset!");

// Function FirebaseFeatures.Database.SetLogLevel
// 0x0001 (0x0001 - 0x0000)
struct Database_SetLogLevel final
{
public:
	EDatabaseLogLevel                             DatabaseLogLevel;                                  // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Database_SetLogLevel) == 0x000001, "Wrong alignment on Database_SetLogLevel");
static_assert(sizeof(Database_SetLogLevel) == 0x000001, "Wrong size on Database_SetLogLevel");
static_assert(offsetof(Database_SetLogLevel, DatabaseLogLevel) == 0x000000, "Member 'Database_SetLogLevel::DatabaseLogLevel' has a wrong offset!");

// Function FirebaseFeatures.Database.SetPersistenceEnabled
// 0x0001 (0x0001 - 0x0000)
struct Database_SetPersistenceEnabled final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Database_SetPersistenceEnabled) == 0x000001, "Wrong alignment on Database_SetPersistenceEnabled");
static_assert(sizeof(Database_SetPersistenceEnabled) == 0x000001, "Wrong size on Database_SetPersistenceEnabled");
static_assert(offsetof(Database_SetPersistenceEnabled, bEnabled) == 0x000000, "Member 'Database_SetPersistenceEnabled::bEnabled' has a wrong offset!");

// Function FirebaseFeatures.Database.GetReference
// 0x0008 (0x0008 - 0x0000)
struct Database_GetReference final
{
public:
	class UDatabaseReference*                     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Database_GetReference) == 0x000008, "Wrong alignment on Database_GetReference");
static_assert(sizeof(Database_GetReference) == 0x000008, "Wrong size on Database_GetReference");
static_assert(offsetof(Database_GetReference, ReturnValue) == 0x000000, "Member 'Database_GetReference::ReturnValue' has a wrong offset!");

// Function FirebaseFeatures.Database.GetReferenceFromPath
// 0x0018 (0x0018 - 0x0000)
struct Database_GetReferenceFromPath final
{
public:
	class FString                                 Path;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDatabaseReference*                     ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Database_GetReferenceFromPath) == 0x000008, "Wrong alignment on Database_GetReferenceFromPath");
static_assert(sizeof(Database_GetReferenceFromPath) == 0x000018, "Wrong size on Database_GetReferenceFromPath");
static_assert(offsetof(Database_GetReferenceFromPath, Path) == 0x000000, "Member 'Database_GetReferenceFromPath::Path' has a wrong offset!");
static_assert(offsetof(Database_GetReferenceFromPath, ReturnValue) == 0x000010, "Member 'Database_GetReferenceFromPath::ReturnValue' has a wrong offset!");

// Function FirebaseFeatures.Database.GetReferenceFromUrl
// 0x0018 (0x0018 - 0x0000)
struct Database_GetReferenceFromUrl final
{
public:
	class FString                                 URL;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDatabaseReference*                     ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Database_GetReferenceFromUrl) == 0x000008, "Wrong alignment on Database_GetReferenceFromUrl");
static_assert(sizeof(Database_GetReferenceFromUrl) == 0x000018, "Wrong size on Database_GetReferenceFromUrl");
static_assert(offsetof(Database_GetReferenceFromUrl, URL) == 0x000000, "Member 'Database_GetReferenceFromUrl::URL' has a wrong offset!");
static_assert(offsetof(Database_GetReferenceFromUrl, ReturnValue) == 0x000010, "Member 'Database_GetReferenceFromUrl::ReturnValue' has a wrong offset!");

// Function FirebaseFeatures.AppleSignInGetNativeCred.GetCredential
// 0x0018 (0x0018 - 0x0000)
struct AppleSignInGetNativeCred_GetCredential final
{
public:
	class FString                                 Nonce;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAppleSignInGetNativeCred*              ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppleSignInGetNativeCred_GetCredential) == 0x000008, "Wrong alignment on AppleSignInGetNativeCred_GetCredential");
static_assert(sizeof(AppleSignInGetNativeCred_GetCredential) == 0x000018, "Wrong size on AppleSignInGetNativeCred_GetCredential");
static_assert(offsetof(AppleSignInGetNativeCred_GetCredential, Nonce) == 0x000000, "Member 'AppleSignInGetNativeCred_GetCredential::Nonce' has a wrong offset!");
static_assert(offsetof(AppleSignInGetNativeCred_GetCredential, ReturnValue) == 0x000010, "Member 'AppleSignInGetNativeCred_GetCredential::ReturnValue' has a wrong offset!");

// Function FirebaseFeatures.GetTokenProxy.GetToken
// 0x0018 (0x0018 - 0x0000)
struct GetTokenProxy_GetToken final
{
public:
	const class UUser*                            User;                                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceRefresh;                                     // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGetTokenProxy*                         ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GetTokenProxy_GetToken) == 0x000008, "Wrong alignment on GetTokenProxy_GetToken");
static_assert(sizeof(GetTokenProxy_GetToken) == 0x000018, "Wrong size on GetTokenProxy_GetToken");
static_assert(offsetof(GetTokenProxy_GetToken, User) == 0x000000, "Member 'GetTokenProxy_GetToken::User' has a wrong offset!");
static_assert(offsetof(GetTokenProxy_GetToken, bForceRefresh) == 0x000008, "Member 'GetTokenProxy_GetToken::bForceRefresh' has a wrong offset!");
static_assert(offsetof(GetTokenProxy_GetToken, ReturnValue) == 0x000010, "Member 'GetTokenProxy_GetToken::ReturnValue' has a wrong offset!");

// Function FirebaseFeatures.FirestoreQuery.AddSnapshotListener
// 0x0028 (0x0028 - 0x0000)
struct FirestoreQuery_AddSnapshotListener final
{
public:
