#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FirebaseFeatures

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "FirebaseFeatures_structs.hpp"


namespace SDK
{

// Class FirebaseFeatures.AuthMiscLibrary
// 0x0000 (0x0028 - 0x0028)
class UAuthMiscLibrary final : public UBlueprintFunctionLibrary
{
public:
	static struct FFederatedAuthProvider CreateOAuthProvider(const struct FFederatedOAuthProviderData& ProviderData);
	static class UUser* CurrentUser();
	static struct FCredential FromAppleSignCredential(const struct FAppleSignInCredential& Credential);
	static bool IsValid(const struct FCredential& Credential);
	static class FString Provider(const struct FCredential& Credential);
	static void SignOut();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AuthMiscLibrary">();
	}
	static class UAuthMiscLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuthMiscLibrary>();
	}
};
static_assert(alignof(UAuthMiscLibrary) == 0x000008, "Wrong alignment on UAuthMiscLibrary");
static_assert(sizeof(UAuthMiscLibrary) == 0x000028, "Wrong size on UAuthMiscLibrary");

// Class FirebaseFeatures.UserNodeBase
// 0x0008 (0x0038 - 0x0030)
class UUserNodeBase : public UBlueprintAsyncActionBase
{
public:
	class UUser*                                  _User;                                             // 0x0030(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UserNodeBase">();
	}
	static class UUserNodeBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUserNodeBase>();
	}
};
static_assert(alignof(UUserNodeBase) == 0x000008, "Wrong alignment on UUserNodeBase");
static_assert(sizeof(UUserNodeBase) == 0x000038, "Wrong size on UUserNodeBase");
static_assert(offsetof(UUserNodeBase, _User) == 0x000030, "Member 'UUserNodeBase::_User' has a wrong offset!");

// Class FirebaseFeatures.ReauthenticateAndRetrieveDataProxy
// 0x0028 (0x0060 - 0x0038)
class UReauthenticateAndRetrieveDataProxy final : public UUserNodeBase
{
public:
	FMulticastInlineDelegateProperty_             OnReauthenticated;                                 // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnError;                                           // 0x0048(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UReauthenticateAndRetrieveDataProxy* ReauthenticateAndRetrieveData(const class UUser* User, const struct FCredential& Credential);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ReauthenticateAndRetrieveDataProxy">();
	}
	static class UReauthenticateAndRetrieveDataProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UReauthenticateAndRetrieveDataProxy>();
	}
};
static_assert(alignof(UReauthenticateAndRetrieveDataProxy) == 0x000008, "Wrong alignment on UReauthenticateAndRetrieveDataProxy");
static_assert(sizeof(UReauthenticateAndRetrieveDataProxy) == 0x000060, "Wrong size on UReauthenticateAndRetrieveDataProxy");
static_assert(offsetof(UReauthenticateAndRetrieveDataProxy, OnReauthenticated) == 0x000038, "Member 'UReauthenticateAndRetrieveDataProxy::OnReauthenticated' has a wrong offset!");
static_assert(offsetof(UReauthenticateAndRetrieveDataProxy, OnError) == 0x000048, "Member 'UReauthenticateAndRetrieveDataProxy::OnError' has a wrong offset!");

// Class FirebaseFeatures.FetchProvidersForEmailProxy
// 0x0030 (0x0060 - 0x0030)
class UFetchProvidersForEmailProxy final : public UBlueprintAsyncActionBase
{
public:
	FMulticastInlineDelegateProperty_             OnProvidersFetched;                                // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnError;                                           // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x10];                                      // 0x0050(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UFetchProvidersForEmailProxy* FetchProvidersForEmail(const class FString& Email);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FetchProvidersForEmailProxy">();
	}
	static class UFetchProvidersForEmailProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFetchProvidersForEmailProxy>();
	}
};
static_assert(alignof(UFetchProvidersForEmailProxy) == 0x000008, "Wrong alignment on UFetchProvidersForEmailProxy");
static_assert(sizeof(UFetchProvidersForEmailProxy) == 0x000060, "Wrong size on UFetchProvidersForEmailProxy");
static_assert(offsetof(UFetchProvidersForEmailProxy, OnProvidersFetched) == 0x000030, "Member 'UFetchProvidersForEmailProxy::OnProvidersFetched' has a wrong offset!");
static_assert(offsetof(UFetchProvidersForEmailProxy, OnError) == 0x000040, "Member 'UFetchProvidersForEmailProxy::OnError' has a wrong offset!");

// Class FirebaseFeatures.SignInWithCustomTokenProxy
// 0x0030 (0x0060 - 0x0030)
class USignInWithCustomTokenProxy final : public UBlueprintAsyncActionBase
{
public:
	FMulticastInlineDelegateProperty_             OnSignedIn;                                        // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnError;                                           // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x10];                                      // 0x0050(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class USignInWithCustomTokenProxy* SignInWithCustomToken(const class FString& Token);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SignInWithCustomTokenProxy">();
	}
	static class USignInWithCustomTokenProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<USignInWithCustomTokenProxy>();
	}
};
static_assert(alignof(USignInWithCustomTokenProxy) == 0x000008, "Wrong alignment on USignInWithCustomTokenProxy");
static_assert(sizeof(USignInWithCustomTokenProxy) == 0x000060, "Wrong size on USignInWithCustomTokenProxy");
static_assert(offsetof(USignInWithCustomTokenProxy, OnSignedIn) == 0x000030, "Member 'USignInWithCustomTokenProxy::OnSignedIn' has a wrong offset!");
static_assert(offsetof(USignInWithCustomTokenProxy, OnError) == 0x000040, "Member 'USignInWithCustomTokenProxy::OnError' has a wrong offset!");

// Class FirebaseFeatures.GetAnalyticsInstanceIdProxy
// 0x0010 (0x0040 - 0x0030)
class UGetAnalyticsInstanceIdProxy final : public UBlueprintAsyncActionBase
{
public:
	FMulticastInlineDelegateProperty_             OnInstanceIdReceived;                              // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class UGetAnalyticsInstanceIdProxy* GetAnalyticsInstanceId();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GetAnalyticsInstanceIdProxy">();
	}
	static class UGetAnalyticsInstanceIdProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGetAnalyticsInstanceIdProxy>();
	}
};
static_assert(alignof(UGetAnalyticsInstanceIdProxy) == 0x000008, "Wrong alignment on UGetAnalyticsInstanceIdProxy");
static_assert(sizeof(UGetAnalyticsInstanceIdProxy) == 0x000040, "Wrong size on UGetAnalyticsInstanceIdProxy");
static_assert(offsetof(UGetAnalyticsInstanceIdProxy, OnInstanceIdReceived) == 0x000030, "Member 'UGetAnalyticsInstanceIdProxy::OnInstanceIdReceived' has a wrong offset!");

// Class FirebaseFeatures.User
// 0x0008 (0x0030 - 0x0028)
class UUser final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	TArray<struct FUserInfoInterface> ProviderData();

	class FString DisplayName() const;
	class FString Email() const;
	bool IsAnonymous() const;
	bool IsEmailVerified() const;
	struct FUserMetadata Metadata() const;
	class FString PhoneNumber() const;
	class FString PhotoUrl() const;
	class FString ProviderId() const;
	class FString Uid() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"User">();
	}
	static class UUser* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUser>();
	}
};
static_assert(alignof(UUser) == 0x000008, "Wrong alignment on UUser");
static_assert(sizeof(UUser) == 0x000030, "Wrong size on UUser");

// Class FirebaseFeatures.SignInWithCredentialProxy
// 0x0028 (0x0058 - 0x0030)
class USignInWithCredentialProxy final : public UBlueprintAsyncActionBase
{
public:
	FMulticastInlineDelegateProperty_             OnSignedIn;                                        // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnError;                                           // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x8];                                       // 0x0050(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class USignInWithCredentialProxy* SignInWithCredential(const struct FCredential& Credential);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SignInWithCredentialProxy">();
	}
	static class USignInWithCredentialProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<USignInWithCredentialProxy>();
	}
};
static_assert(alignof(USignInWithCredentialProxy) == 0x000008, "Wrong alignment on USignInWithCredentialProxy");
static_assert(sizeof(USignInWithCredentialProxy) == 0x000058, "Wrong size on USignInWithCredentialProxy");
static_assert(offsetof(USignInWithCredentialProxy, OnSignedIn) == 0x000030, "Member 'USignInWithCredentialProxy::OnSignedIn' has a wrong offset!");
static_assert(offsetof(USignInWithCredentialProxy, OnError) == 0x000040, "Member 'USignInWithCredentialProxy::OnError' has a wrong offset!");

// Class FirebaseFeatures.SignInWithProviderProxy
// 0x0030 (0x0060 - 0x0030)
class USignInWithProviderProxy final : public UBlueprintAsyncActionBase
{
public:
	FMulticastInlineDelegateProperty_             OnSignedIn;                                        // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnError;                                           // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x10];                                      // 0x0050(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class USignInWithProviderProxy* SignInWithProvider(const struct FFederatedAuthProvider& AuthProvider);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SignInWithProviderProxy">();
	}
	static class USignInWithProviderProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<USignInWithProviderProxy>();
	}
};
static_assert(alignof(USignInWithProviderProxy) == 0x000008, "Wrong alignment on USignInWithProviderProxy");
static_assert(sizeof(USignInWithProviderProxy) == 0x000060, "Wrong size on USignInWithProviderProxy");
static_assert(offsetof(USignInWithProviderProxy, OnSignedIn) == 0x000030, "Member 'USignInWithProviderProxy::OnSignedIn' has a wrong offset!");
static_assert(offsetof(USignInWithProviderProxy, OnError) == 0x000040, "Member 'USignInWithProviderProxy::OnError' has a wrong offset!");

// Class FirebaseFeatures.CreateInterstitialAd
// 0x0038 (0x0068 - 0x0030)
class UCreateInterstitialAd final : public UBlueprintAsyncActionBase
{
public:
	FMulticastInlineDelegateProperty_             OnInterstitialAdCreated;                           // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnError;                                           // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UInterstitialAd*                        Interstitial;                                      // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UCreateInterstitialAd* CreateInterstitialAd(const class FString& AdUnitId);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CreateInterstitialAd">();
	}
	static class UCreateInterstitialAd* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreateInterstitialAd>();
	}
};
static_assert(alignof(UCreateInterstitialAd) == 0x000008, "Wrong alignment on UCreateInterstitialAd");
static_assert(sizeof(UCreateInterstitialAd) == 0x000068, "Wrong size on UCreateInterstitialAd");
static_assert(offsetof(UCreateInterstitialAd, OnInterstitialAdCreated) == 0x000030, "Member 'UCreateInterstitialAd::OnInterstitialAdCreated' has a wrong offset!");
static_assert(offsetof(UCreateInterstitialAd, OnError) == 0x000040, "Member 'UCreateInterstitialAd::OnError' has a wrong offset!");
static_assert(offsetof(UCreateInterstitialAd, Interstitial) == 0x000050, "Member 'UCreateInterstitialAd::Interstitial' has a wrong offset!");

// Class FirebaseFeatures.FirebaseStorageNodeProxyBase
// 0x0008 (0x0038 - 0x0030)
class UFirebaseStorageNodeProxyBase : public UBlueprintAsyncActionBase
{
public:
	class UFirebaseStorageReference*              _Reference;                                        // 0x0030(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FirebaseStorageNodeProxyBase">();
	}
	static class UFirebaseStorageNodeProxyBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFirebaseStorageNodeProxyBase>();
	}
};
static_assert(alignof(UFirebaseStorageNodeProxyBase) == 0x000008, "Wrong alignment on UFirebaseStorageNodeProxyBase");
static_assert(sizeof(UFirebaseStorageNodeProxyBase) == 0x000038, "Wrong size on UFirebaseStorageNodeProxyBase");
static_assert(offsetof(UFirebaseStorageNodeProxyBase, _Reference) == 0x000030, "Member 'UFirebaseStorageNodeProxyBase::_Reference' has a wrong offset!");

// Class FirebaseFeatures.StorageUpdateMetadataProxy
// 0x0028 (0x0060 - 0x0038)
class UStorageUpdateMetadataProxy final : public UFirebaseStorageNodeProxyBase
{
public:
	FMulticastInlineDelegateProperty_             OnMetadataUpdated;                                 // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnError;                                           // 0x0048(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UStorageUpdateMetadataProxy* UpdateMetadata(class UFirebaseStorageReference* StorageReference, const struct FFirebaseStorageMetadata& Metadata);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StorageUpdateMetadataProxy">();
	}
	static class UStorageUpdateMetadataProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStorageUpdateMetadataProxy>();
	}
};
static_assert(alignof(UStorageUpdateMetadataProxy) == 0x000008, "Wrong alignment on UStorageUpdateMetadataProxy");
static_assert(sizeof(UStorageUpdateMetadataProxy) == 0x000060, "Wrong size on UStorageUpdateMetadataProxy");
static_assert(offsetof(UStorageUpdateMetadataProxy, OnMetadataUpdated) == 0x000038, "Member 'UStorageUpdateMetadataProxy::OnMetadataUpdated' has a wrong offset!");
static_assert(offsetof(UStorageUpdateMetadataProxy, OnError) == 0x000048, "Member 'UStorageUpdateMetadataProxy::OnError' has a wrong offset!");

// Class FirebaseFeatures.SignInAndRetrieveDataWithCredentialProxy
// 0x0028 (0x0058 - 0x0030)
class USignInAndRetrieveDataWithCredentialProxy final : public UBlueprintAsyncActionBase
{
public:
	FMulticastInlineDelegateProperty_             OnSignedIn;                                        // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnError;                                           // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x8];                                       // 0x0050(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class USignInAndRetrieveDataWithCredentialProxy* SignInAndRetrieveDataWithCredential(const struct FCredential& Credential);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SignInAndRetrieveDataWithCredentialProxy">();
	}
	static class USignInAndRetrieveDataWithCredentialProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<USignInAndRetrieveDataWithCredentialProxy>();
	}
};
static_assert(alignof(USignInAndRetrieveDataWithCredentialProxy) == 0x000008, "Wrong alignment on USignInAndRetrieveDataWithCredentialProxy");
static_assert(sizeof(USignInAndRetrieveDataWithCredentialProxy) == 0x000058, "Wrong size on USignInAndRetrieveDataWithCredentialProxy");
static_assert(offsetof(USignInAndRetrieveDataWithCredentialProxy, OnSignedIn) == 0x000030, "Member 'USignInAndRetrieveDataWithCredentialProxy::OnSignedIn' has a wrong offset!");
static_assert(offsetof(USignInAndRetrieveDataWithCredentialProxy, OnError) == 0x000040, "Member 'USignInAndRetrieveDataWithCredentialProxy::OnError' has a wrong offset!");

// Class FirebaseFeatures.DisconnectionHandlerProxybase
// 0x0008 (0x0038 - 0x0030)
class UDisconnectionHandlerProxybase : public UBlueprintAsyncActionBase
{
public:
	class UDisconnectionHandler*                  Handler;                                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DisconnectionHandlerProxybase">();
	}
	static class UDisconnectionHandlerProxybase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDisconnectionHandlerProxybase>();
	}
};
static_assert(alignof(UDisconnectionHandlerProxybase) == 0x000008, "Wrong alignment on UDisconnectionHandlerProxybase");
static_assert(sizeof(UDisconnectionHandlerProxybase) == 0x000038, "Wrong size on UDisconnectionHandlerProxybase");
static_assert(offsetof(UDisconnectionHandlerProxybase, Handler) == 0x000030, "Member 'UDisconnectionHandlerProxybase::Handler' has a wrong offset!");

// Class FirebaseFeatures.SignInAnonymouslyProxy
// 0x0020 (0x0050 - 0x0030)
class USignInAnonymouslyProxy final : public UBlueprintAsyncActionBase
{
public:
	FMulticastInlineDelegateProperty_             OnSignedIn;                                        // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnError;                                           // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class USignInAnonymouslyProxy* SignInAnonymously();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SignInAnonymouslyProxy">();
	}
	static class USignInAnonymouslyProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<USignInAnonymouslyProxy>();
	}
};
static_assert(alignof(USignInAnonymouslyProxy) == 0x000008, "Wrong alignment on USignInAnonymouslyProxy");
static_assert(sizeof(USignInAnonymouslyProxy) == 0x000050, "Wrong size on USignInAnonymouslyProxy");
static_assert(offsetof(USignInAnonymouslyProxy, OnSignedIn) == 0x000030, "Member 'USignInAnonymouslyProxy::OnSignedIn' has a wrong offset!");
static_assert(offsetof(USignInAnonymouslyProxy, OnError) == 0x000040, "Member 'USignInAnonymouslyProxy::OnError' has a wrong offset!");

// Class FirebaseFeatures.UpdatePasswordProxy
// 0x0030 (0x0068 - 0x0038)
class UUpdatePasswordProxy final : public UUserNodeBase
{
public:
	FMulticastInlineDelegateProperty_             OnPasswordUpdated;                                 // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnError;                                           // 0x0048(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UUpdatePasswordProxy* UpdatePassword(const class UUser* User, const class FString& Password);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UpdatePasswordProxy">();
	}
	static class UUpdatePasswordProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUpdatePasswordProxy>();
	}
};
static_assert(alignof(UUpdatePasswordProxy) == 0x000008, "Wrong alignment on UUpdatePasswordProxy");
static_assert(sizeof(UUpdatePasswordProxy) == 0x000068, "Wrong size on UUpdatePasswordProxy");
static_assert(offsetof(UUpdatePasswordProxy, OnPasswordUpdated) == 0x000038, "Member 'UUpdatePasswordProxy::OnPasswordUpdated' has a wrong offset!");
static_assert(offsetof(UUpdatePasswordProxy, OnError) == 0x000048, "Member 'UUpdatePasswordProxy::OnError' has a wrong offset!");

// Class FirebaseFeatures.SignInWithEmailAndPasswordProxy
// 0x0040 (0x0070 - 0x0030)
class USignInWithEmailAndPasswordProxy final : public UBlueprintAsyncActionBase
{
public:
	FMulticastInlineDelegateProperty_             OnSignedIn;                                        // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnError;                                           // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x20];                                      // 0x0050(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class USignInWithEmailAndPasswordProxy* SignInWithEmailAndPassword(const class FString& Email, const class FString& Password);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SignInWithEmailAndPasswordProxy">();
	}
	static class USignInWithEmailAndPasswordProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<USignInWithEmailAndPasswordProxy>();
	}
};
static_assert(alignof(USignInWithEmailAndPasswordProxy) == 0x000008, "Wrong alignment on USignInWithEmailAndPasswordProxy");
static_assert(sizeof(USignInWithEmailAndPasswordProxy) == 0x000070, "Wrong size on USignInWithEmailAndPasswordProxy");
static_assert(offsetof(USignInWithEmailAndPasswordProxy, OnSignedIn) == 0x000030, "Member 'USignInWithEmailAndPasswordProxy::OnSignedIn' has a wrong offset!");
static_assert(offsetof(USignInWithEmailAndPasswordProxy, OnError) == 0x000040, "Member 'USignInWithEmailAndPasswordProxy::OnError' has a wrong offset!");

// Class FirebaseFeatures.CrashlyticsLibrary
// 0x0000 (0x0028 - 0x0028)
class UCrashlyticsLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void CrashApplication();
	static void DeleteUnsentReports();
	static bool DidCrashDuringPreviousExecution();
	static bool IsCrashlyticsCollectionEnabled();
	static void Log(const class FString& Message);
	static void RecordError(const class FString& Domain, const class FString& Message, const int64 Code);
	static void SendUnsentReports();
	static void SetCrashlyticsCollectionEnabled(bool bEnabled);
	static void SetCustomBoolValue(const class FString& Key, const bool Value);
	static void SetCustomFloatValue(const class FString& Key, const float Value);
	static void SetCustomInt32Value(const class FString& Key, const int32 Value);
	static void SetCustomInt64Value(const class FString& Key, const int64 Value);
	static void SetCustomStringValue(const class FString& Key, const class FString& Value);
	static void SetCustomVectorValue(const class FString& Key, const struct FVector& Value);
	static void SetUserID(const class FString& UserId);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CrashlyticsLibrary">();
	}
	static class UCrashlyticsLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrashlyticsLibrary>();
	}
};
static_assert(alignof(UCrashlyticsLibrary) == 0x000008, "Wrong alignment on UCrashlyticsLibrary");
static_assert(sizeof(UCrashlyticsLibrary) == 0x000028, "Wrong size on UCrashlyticsLibrary");

// Class FirebaseFeatures.CreateUserWithEmailAndPasswordProxy
// 0x0040 (0x0070 - 0x0030)
class UCreateUserWithEmailAndPasswordProxy final : public UBlueprintAsyncActionBase
{
public:
	FMulticastInlineDelegateProperty_             OnUserCreated;                                     // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnError;                                           // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x20];                                      // 0x0050(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UCreateUserWithEmailAndPasswordProxy* CreateUserWithEmailAndPassword(const class FString& Email, const class FString& Password);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CreateUserWithEmailAndPasswordProxy">();
	}
	static class UCreateUserWithEmailAndPasswordProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreateUserWithEmailAndPasswordProxy>();
	}
};
static_assert(alignof(UCreateUserWithEmailAndPasswordProxy) == 0x000008, "Wrong alignment on UCreateUserWithEmailAndPasswordProxy");
static_assert(sizeof(UCreateUserWithEmailAndPasswordProxy) == 0x000070, "Wrong size on UCreateUserWithEmailAndPasswordProxy");
static_assert(offsetof(UCreateUserWithEmailAndPasswordProxy, OnUserCreated) == 0x000030, "Member 'UCreateUserWithEmailAndPasswordProxy::OnUserCreated' has a wrong offset!");
static_assert(offsetof(UCreateUserWithEmailAndPasswordProxy, OnError) == 0x000040, "Member 'UCreateUserWithEmailAndPasswordProxy::OnError' has a wrong offset!");

// Class FirebaseFeatures.UpdatePhoneNumberCredentialProxy
// 0x0028 (0x0060 - 0x0038)
class UUpdatePhoneNumberCredentialProxy final : public UUserNodeBase
{
public:
	FMulticastInlineDelegateProperty_             OnUpdated;                                         // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnError;                                           // 0x0048(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UUpdatePhoneNumberCredentialProxy* UpdatePhoneNumberCredential(const class UUser* User, const struct FCredential& Credential);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UpdatePhoneNumberCredentialProxy">();
	}
	static class UUpdatePhoneNumberCredentialProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUpdatePhoneNumberCredentialProxy>();
	}
};
static_assert(alignof(UUpdatePhoneNumberCredentialProxy) == 0x000008, "Wrong alignment on UUpdatePhoneNumberCredentialProxy");
static_assert(sizeof(UUpdatePhoneNumberCredentialProxy) == 0x000060, "Wrong size on UUpdatePhoneNumberCredentialProxy");
static_assert(offsetof(UUpdatePhoneNumberCredentialProxy, OnUpdated) == 0x000038, "Member 'UUpdatePhoneNumberCredentialProxy::OnUpdated' has a wrong offset!");
static_assert(offsetof(UUpdatePhoneNumberCredentialProxy, OnError) == 0x000048, "Member 'UUpdatePhoneNumberCredentialProxy::OnError' has a wrong offset!");

// Class FirebaseFeatures.SendPasswordResetEmailProxy
// 0x0030 (0x0060 - 0x0030)
class USendPasswordResetEmailProxy final : public UBlueprintAsyncActionBase
{
public:
	FMulticastInlineDelegateProperty_             OnEmailSent;                                       // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnError;                                           // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x10];                                      // 0x0050(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class USendPasswordResetEmailProxy* SendPasswordResetEmail(const class FString& Email);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SendPasswordResetEmailProxy">();
	}
	static class USendPasswordResetEmailProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<USendPasswordResetEmailProxy>();
	}
};
static_assert(alignof(USendPasswordResetEmailProxy) == 0x000008, "Wrong alignment on USendPasswordResetEmailProxy");
static_assert(sizeof(USendPasswordResetEmailProxy) == 0x000060, "Wrong size on USendPasswordResetEmailProxy");
static_assert(offsetof(USendPasswordResetEmailProxy, OnEmailSent) == 0x000030, "Member 'USendPasswordResetEmailProxy::OnEmailSent' has a wrong offset!");
static_assert(offsetof(USendPasswordResetEmailProxy, OnError) == 0x000040, "Member 'USendPasswordResetEmailProxy::OnError' has a wrong offset!");

// Class FirebaseFeatures.ListenAuthEventsProxy
// 0x0020 (0x0050 - 0x0030)
class UListenAuthEventsProxy final : public UBlueprintAsyncActionBase
{
public:
	FMulticastInlineDelegateProperty_             OnAuthChanged;                                     // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnIdTokenChanged;                                  // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class UListenAuthEventsProxy* ListenAuthEvents();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ListenAuthEventsProxy">();
	}
	static class UListenAuthEventsProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UListenAuthEventsProxy>();
	}
};
static_assert(alignof(UListenAuthEventsProxy) == 0x000008, "Wrong alignment on UListenAuthEventsProxy");
static_assert(sizeof(UListenAuthEventsProxy) == 0x000050, "Wrong size on UListenAuthEventsProxy");
static_assert(offsetof(UListenAuthEventsProxy, OnAuthChanged) == 0x000030, "Member 'UListenAuthEventsProxy::OnAuthChanged' has a wrong offset!");
static_assert(offsetof(UListenAuthEventsProxy, OnIdTokenChanged) == 0x000040, "Member 'UListenAuthEventsProxy::OnIdTokenChanged' has a wrong offset!");

// Class FirebaseFeatures.SendEmailVerificationProxy
// 0x0020 (0x0058 - 0x0038)
class USendEmailVerificationProxy final : public UUserNodeBase
{
public:
	FMulticastInlineDelegateProperty_             OnEmailSent;                                       // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnError;                                           // 0x0048(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class USendEmailVerificationProxy* SendEmailVerification(const class UUser* User);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SendEmailVerificationProxy">();
	}
	static class USendEmailVerificationProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<USendEmailVerificationProxy>();
	}
};
static_assert(alignof(USendEmailVerificationProxy) == 0x000008, "Wrong alignment on USendEmailVerificationProxy");
static_assert(sizeof(USendEmailVerificationProxy) == 0x000058, "Wrong size on USendEmailVerificationProxy");
static_assert(offsetof(USendEmailVerificationProxy, OnEmailSent) == 0x000038, "Member 'USendEmailVerificationProxy::OnEmailSent' has a wrong offset!");
static_assert(offsetof(USendEmailVerificationProxy, OnError) == 0x000048, "Member 'USendEmailVerificationProxy::OnError' has a wrong offset!");

// Class FirebaseFeatures.AppleSignInGetCred
// 0x0030 (0x0060 - 0x0030)
class UAppleSignInGetCred final : public UBlueprintAsyncActionBase
{
public:
	FMulticastInlineDelegateProperty_             OnSuccess;                                         // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnError;                                           // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x10];                                      // 0x0050(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAppleSignInGetCred* GetCredential(const class FString& Nonce);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AppleSignInGetCred">();
	}
	static class UAppleSignInGetCred* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAppleSignInGetCred>();
	}
};
static_assert(alignof(UAppleSignInGetCred) == 0x000008, "Wrong alignment on UAppleSignInGetCred");
static_assert(sizeof(UAppleSignInGetCred) == 0x000060, "Wrong size on UAppleSignInGetCred");
static_assert(offsetof(UAppleSignInGetCred, OnSuccess) == 0x000030, "Member 'UAppleSignInGetCred::OnSuccess' has a wrong offset!");
static_assert(offsetof(UAppleSignInGetCred, OnError) == 0x000040, "Member 'UAppleSignInGetCred::OnError' has a wrong offset!");

// Class FirebaseFeatures.Database
// 0x0010 (0x0038 - 0x0028)
class UDatabase final : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UDatabase* GetInstance();
	static class UDatabase* GetInstanceFromUrl(const class FString& URL);
	static class UDatabaseReference* GetInstanceReference();

	class FString GetUrl();
	void GoOffline();
	void GoOnline();
	void PurgeOutstandingWrites();
	void SetLogLevel(const EDatabaseLogLevel DatabaseLogLevel);
	void SetPersistenceEnabled(const bool bEnabled);

	class UDatabaseReference* GetReference() const;
	class UDatabaseReference* GetReferenceFromPath(const class FString& Path) const;
	class UDatabaseReference* GetReferenceFromUrl(const class FString& URL) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Database">();
	}
	static class UDatabase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDatabase>();
	}
};
static_assert(alignof(UDatabase) == 0x000008, "Wrong alignment on UDatabase");
static_assert(sizeof(UDatabase) == 0x000038, "Wrong size on UDatabase");

// Class FirebaseFeatures.AppleSignInGetNativeCred
// 0x0030 (0x0060 - 0x0030)
class UAppleSignInGetNativeCred final : public UBlueprintAsyncActionBase
{
public:
	FMulticastInlineDelegateProperty_             OnSuccess;                                         // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnError;                                           // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x10];                                      // 0x0050(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAppleSignInGetNativeCred* GetCredential(const class FString& Nonce);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AppleSignInGetNativeCred">();
	}
	static class UAppleSignInGetNativeCred* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAppleSignInGetNativeCred>();
	}
};
static_assert(alignof(UAppleSignInGetNativeCred) == 0x000008, "Wrong alignment on UAppleSignInGetNativeCred");
static_assert(sizeof(UAppleSignInGetNativeCred) == 0x000060, "Wrong size on UAppleSignInGetNativeCred");
static_assert(offsetof(UAppleSignInGetNativeCred, OnSuccess) == 0x000030, "Member 'UAppleSignInGetNativeCred::OnSuccess' has a wrong offset!");
static_assert(offsetof(UAppleSignInGetNativeCred, OnError) == 0x000040, "Member 'UAppleSignInGetNativeCred::OnError' has a wrong offset!");

// Class FirebaseFeatures.FirebaseAppCheckLibrary
// 0x0000 (0x0028 - 0x0028)
class UFirebaseAppCheckLibrary final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FirebaseAppCheckLibrary">();
	}
	static class UFirebaseAppCheckLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFirebaseAppCheckLibrary>();
	}
};
static_assert(alignof(UFirebaseAppCheckLibrary) == 0x000008, "Wrong alignment on UFirebaseAppCheckLibrary");
static_assert(sizeof(UFirebaseAppCheckLibrary) == 0x000028, "Wrong size on UFirebaseAppCheckLibrary");

// Class FirebaseFeatures.GetTokenProxy
// 0x0028 (0x0060 - 0x0038)
class UGetTokenProxy final : public UUserNodeBase
{
public:
	FMulticastInlineDelegateProperty_             OnTokenReceived;                                   // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnError;                                           // 0x0048(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UGetTokenProxy* GetToken(const class UUser* User, const bool bForceRefresh);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GetTokenProxy">();
	}
	static class UGetTokenProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGetTokenProxy>();
	}
};
static_assert(alignof(UGetTokenProxy) == 0x000008, "Wrong alignment on UGetTokenProxy");
static_assert(sizeof(UGetTokenProxy) == 0x000060, "Wrong size on UGetTokenProxy");
static_assert(offsetof(UGetTokenProxy, OnTokenReceived) == 0x000038, "Member 'UGetTokenProxy::OnTokenReceived' has a wrong offset!");
static_assert(offsetof(UGetTokenProxy, OnError) == 0x000048, "Member 'UGetTokenProxy::OnError' has a wrong offset!");

// Class FirebaseFeatures.FirestoreQuery
// 0x0008 (0x0030 - 0x0028)
class UFirestoreQuery : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FQuerySnapshotListenerHandle AddSnapshotListener(TDelegate<void(EFirestoreError Error, TArray<struct FFirestoreDocumentSnapshot>& DocumentSnapshots, TArray<class UFirestoreDocumentChange*>& DocumentChanges)> Listener);
	class UFirestoreQuery* EndAt(const struct FFirestoreDocumentSnapshot& Snapshot);
	class UFirestoreQuery* EndAtValues(const TArray<struct FFirestoreFieldValue>& Values);
	class UFirestoreQuery* EndBefore(const struct FFirestoreDocumentSnapshot& Snapshot);
	class UFirestoreQuery* EndBeforeFieldValue(const TArray<struct FFirestoreFieldValue>& Values);
	class UFirestoreQuery* Limit(int32 Param_Limit);
	class UFirestoreQuery* LimitToLast(int32 Limit);
	class UFirestoreQuery* OrderBy(const class FString& Field, EFirestoreQueryDirection Direction);
	class UFirestoreQuery* OrderByFieldPath(const struct FFirestoreFieldPath& Field, EFirestoreQueryDirection Direction);
	class UFirestoreQuery* StartAfter(const struct FFirestoreDocumentSnapshot& Snapshot);
	class UFirestoreQuery* StartAfterFieldValue(const TArray<struct FFirestoreFieldValue>& Values);
	class UFirestoreQuery* StartAt(const struct FFirestoreDocumentSnapshot& Snapshot);
	class UFirestoreQuery* StartAtFieldValue(const TArray<struct FFirestoreFieldValue>& Values);
	class UFirestoreQuery* WhereArrayContains(const class FString& Field, const struct FFirestoreFieldValue& Value);
	class UFirestoreQuery* WhereArrayContainsAny(const class FString& Field, const TArray<struct FFirestoreFieldValue>& Values);
	class UFirestoreQuery* WhereArrayContainsAnyFielPath(const struct FFirestoreFieldPath& Field, const TArray<struct FFirestoreFieldValue>& Values);
	class UFirestoreQuery* WhereArrayContainsFieldPath(const struct FFirestoreFieldPath& Field, const struct FFirestoreFieldValue& Value);
	class UFirestoreQuery* WhereEqualTo(const class FString& Field, const struct FFirestoreFieldValue& Value);
	class UFirestoreQuery* WhereEqualToFieldPath(const struct FFirestoreFieldPath& Field, const struct FFirestoreFieldValue& Value);
	class UFirestoreQuery* WhereGreaterThan(const class FString& Field, const struct FFirestoreFieldValue& Value);
	class UFirestoreQuery* WhereGreaterThanFieldPath(const struct FFirestoreFieldPath& Field, const struct FFirestoreFieldValue& Value);
	class UFirestoreQuery* WhereGreaterThanOrEqualTo(const class FString& Field, const struct FFirestoreFieldValue& Value);
	class UFirestoreQuery* WhereGreaterThanOrEqualToFielPath(const struct FFirestoreFieldPath& Field, const struct FFirestoreFieldValue& Value);
	class UFirestoreQuery* WhereIn(const class FString& Field, const TArray<struct FFirestoreFieldValue>& Values);
	class UFirestoreQuery* WhereInFieldPath(const struct FFirestoreFieldPath& Field, const TArray<struct FFirestoreFieldValue>& Values);
	class UFirestoreQuery* WhereLessThan(const class FString& Field, const struct FFirestoreFieldValue& Value);
	class UFirestoreQuery* WhereLessThanFieldPath(const struct FFirestoreFieldPath& Field, const struct FFirestoreFieldValue& Value);
	class UFirestoreQuery* WhereLessThanOrEqualTo(const class FString& Field, const struct FFirestoreFieldValue& Value);
	class UFirestoreQuery* WhereLessThanOrEqualToFieldPath(const struct FFirestoreFieldPath& Field, const struct FFirestoreFieldValue& Value);

	bool IsValid() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FirestoreQuery">();
	}
	static class UFirestoreQuery* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFirestoreQuery>();
	}
};
static_assert(alignof(UFirestoreQuery) == 0x000008, "Wrong alignment on UFirestoreQuery");
static_assert(sizeof(UFirestoreQuery) == 0x000030, "Wrong size on UFirestoreQuery");

// Class FirebaseFeatures.FirestoreCollectionReference
// 0x0000 (0x0030 - 0x0030)
class UFirestoreCollectionReference final : public UFirestoreQuery
{
public:
	class UFirestoreDocumentReference* GetDocument() const;
	class UFirestoreDocumentReference* GetDocumentFromPath(const class FString& DocumentPath) const;
	class FString GetId() const;
	class UFirestoreDocumentReference* GetParent() const;
	class FString GetPath() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FirestoreCollectionReference">();
	}
	static class UFirestoreCollectionReference* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFirestoreCollectionReference>();
	}
};
static_assert(alignof(UFirestoreCollectionReference) == 0x000008, "Wrong alignment on UFirestoreCollectionReference");
static_assert(sizeof(UFirestoreCollectionReference) == 0x000030, "Wrong size on UFirestoreCollectionReference");

// Class FirebaseFeatures.CredentialLibrary
// 0x0000 (0x0028 - 0x0028)
class UCredentialLibrary final : public UBlueprintFunctionLibrary
{
public:
	static struct FCredential GetCredential(const class FString& VerificationId, const class FString& VerificationCode);
	static struct FCredential GetCredentialFromEmail(const class FString& Email, const class FString& Password);
	static struct FCredential GetCredentialFromFacebook(const class FString& AccessToken);
	static struct FCredential GetCredentialFromGitHub(const class FString& Token);
	static struct FCredential GetCredentialFromGoogle(const class FString& Token, const class FString& AccessToken);
	static struct FCredential GetCredentialFromOAuth(const class FString& ProviderId, const class FString& IdToken, const class FString& AccessToken);
	static struct FCredential GetCredentialFromOAuthWithOnce(const class FString& ProviderId, const class FString& IdToken, const class FString& Nonce, const class FString& AccessToken);
	static struct FCredential GetCredentialFromPlayGames(const class FString& ServerAuthCode);
	static struct FCredential GetCredentialFromTwitter(const class FString& Token, const class FString& Secret);
	static bool IsAuthenticatedWithGameCenter();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CredentialLibrary">();
	}
	static class UCredentialLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCredentialLibrary>();
	}
};
static_assert(alignof(UCredentialLibrary) == 0x000008, "Wrong alignment on UCredentialLibrary");
static_assert(sizeof(UCredentialLibrary) == 0x000028, "Wrong size on UCredentialLibrary");

// Class FirebaseFeatures.GetCredentialFromGameCenterProxy
// 0x0020 (0x0050 - 0x0030)
class UGetCredentialFromGameCenterProxy final : public UBlueprintAsyncActionBase
{
public:
	FMulticastInlineDelegateProperty_             OnSuccess;                                         // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnError;                                           // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class UGetCredentialFromGameCenterProxy* GetCredentialFromGameCenter();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GetCredentialFromGameCenterProxy">();
	}
	static class UGetCredentialFromGameCenterProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGetCredentialFromGameCenterProxy>();
	}
};
static_assert(alignof(UGetCredentialFromGameCenterProxy) == 0x000008, "Wrong alignment on UGetCredentialFromGameCenterProxy");
static_assert(sizeof(UGetCredentialFromGameCenterProxy) == 0x000050, "Wrong size on UGetCredentialFromGameCenterProxy");
static_assert(offsetof(UGetCredentialFromGameCenterProxy, OnSuccess) == 0x000030, "Member 'UGetCredentialFromGameCenterProxy::OnSuccess' has a wrong offset!");
static_assert(offsetof(UGetCredentialFromGameCenterProxy, OnError) == 0x000040, "Member 'UGetCredentialFromGameCenterProxy::OnError' has a wrong offset!");

// Class FirebaseFeatures.VerifyPhoneNumberProxy
// 0x0060 (0x0090 - 0x0030)
class UVerifyPhoneNumberProxy final : public UBlueprintAsyncActionBase
{
public:
	FMulticastInlineDelegateProperty_             OnVerificationCompleted;                           // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnVerificationFailed;                              // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnCodeSent;                                        // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnCodeRetrievalTimeout;                            // 0x0060(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_70[0x20];                                      // 0x0070(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UVerifyPhoneNumberProxy* VerifyPhoneNumber(const class FString& PhoneNumber, const int64 AutoVerifyTimeoutInMilliseconds, const struct FForceResendingToken& ForceResendingToken);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerifyPhoneNumberProxy">();
	}
	static class UVerifyPhoneNumberProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerifyPhoneNumberProxy>();
	}
};
static_assert(alignof(UVerifyPhoneNumberProxy) == 0x000008, "Wrong alignment on UVerifyPhoneNumberProxy");
static_assert(sizeof(UVerifyPhoneNumberProxy) == 0x000090, "Wrong size on UVerifyPhoneNumberProxy");
static_assert(offsetof(UVerifyPhoneNumberProxy, OnVerificationCompleted) == 0x000030, "Member 'UVerifyPhoneNumberProxy::OnVerificationCompleted' has a wrong offset!");
static_assert(offsetof(UVerifyPhoneNumberProxy, OnVerificationFailed) == 0x000040, "Member 'UVerifyPhoneNumberProxy::OnVerificationFailed' has a wrong offset!");
static_assert(offsetof(UVerifyPhoneNumberProxy, OnCodeSent) == 0x000050, "Member 'UVerifyPhoneNumberProxy::OnCodeSent' has a wrong offset!");
static_assert(offsetof(UVerifyPhoneNumberProxy, OnCodeRetrievalTimeout) == 0x000060, "Member 'UVerifyPhoneNumberProxy::OnCodeRetrievalTimeout' has a wrong offset!");

// Class FirebaseFeatures.FirebaseDatabaseLibrary
// 0x0000 (0x0028 - 0x0028)
class UFirebaseDatabaseLibrary final : public UBlueprintFunctionLibrary
{
public:
	static struct FMutableData Mutable_GetChild(struct FMutableData& MutableData, const class FString& Path);
	static TArray<struct FMutableData> Mutable_GetChildren(struct FMutableData& MutableData);
	static int64 Mutable_GetChildrenCount(struct FMutableData& MutableData);
	static class FString Mutable_GetKey(const struct FMutableData& MutableData);
	static struct FFirebaseVariant Mutable_GetPriority(struct FMutableData& MutableData);
	static struct FFirebaseVariant Mutable_GetValue(const struct FMutableData& MutableData);
	static bool Mutable_HasChild(const struct FMutableData& MutableData, const class FString& Path);
	static void Mutable_SetPriority(struct FMutableData& MutableData, const struct FFirebaseVariant& Priority);
	static void Mutable_SetValue(struct FMutableData& MutableData, const struct FFirebaseVariant& Value);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FirebaseDatabaseLibrary">();
	}
	static class UFirebaseDatabaseLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFirebaseDatabaseLibrary>();
	}
};
static_assert(alignof(UFirebaseDatabaseLibrary) == 0x000008, "Wrong alignment on UFirebaseDatabaseLibrary");
static_assert(sizeof(UFirebaseDatabaseLibrary) == 0x000028, "Wrong size on UFirebaseDatabaseLibrary");

// Class FirebaseFeatures.DisconnectionCancelProxy
// 0x0020 (0x0058 - 0x0038)
class UDisconnectionCancelProxy final : public UDisconnectionHandlerProxybase
{
public:
	FMulticastInlineDelegateProperty_             OnCanceled;                                        // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnError;                                           // 0x0048(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class UDisconnectionCancelProxy* Cancel(const class UDisconnectionHandler* DisconnectionHandler);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DisconnectionCancelProxy">();
	}
	static class UDisconnectionCancelProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDisconnectionCancelProxy>();
	}
};
static_assert(alignof(UDisconnectionCancelProxy) == 0x000008, "Wrong alignment on UDisconnectionCancelProxy");
static_assert(sizeof(UDisconnectionCancelProxy) == 0x000058, "Wrong size on UDisconnectionCancelProxy");
static_assert(offsetof(UDisconnectionCancelProxy, OnCanceled) == 0x000038, "Member 'UDisconnectionCancelProxy::OnCanceled' has a wrong offset!");
static_assert(offsetof(UDisconnectionCancelProxy, OnError) == 0x000048, "Member 'UDisconnectionCancelProxy::OnError' has a wrong offset!");

// Class FirebaseFeatures.DisconnectionRemoveValueProxy
// 0x0020 (0x0058 - 0x0038)
class UDisconnectionRemoveValueProxy final : public UDisconnectionHandlerProxybase
{
public:
	FMulticastInlineDelegateProperty_             OnRemoved;                                         // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnError;                                           // 0x0048(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class UDisconnectionRemoveValueProxy* RemoveValue(const class UDisconnectionHandler* DisconnectionHandler);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DisconnectionRemoveValueProxy">();
	}
	static class UDisconnectionRemoveValueProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDisconnectionRemoveValueProxy>();
	}
};
static_assert(alignof(UDisconnectionRemoveValueProxy) == 0x000008, "Wrong alignment on UDisconnectionRemoveValueProxy");
static_assert(sizeof(UDisconnectionRemoveValueProxy) == 0x000058, "Wrong size on UDisconnectionRemoveValueProxy");
static_assert(offsetof(UDisconnectionRemoveValueProxy, OnRemoved) == 0x000038, "Member 'UDisconnectionRemoveValueProxy::OnRemoved' has a wrong offset!");
static_assert(offsetof(UDisconnectionRemoveValueProxy, OnError) == 0x000048, "Member 'UDisconnectionRemoveValueProxy::OnError' has a wrong offset!");

// Class FirebaseFeatures.DisconnectionSetValueProxy
// 0x0038 (0x0070 - 0x0038)
class UDisconnectionSetValueProxy final : public UDisconnectionHandlerProxybase
{
public:
	FMulticastInlineDelegateProperty_             OnSet;                                             // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnError;                                           // 0x0048(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_58[0x18];                                      // 0x0058(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UDisconnectionSetValueProxy* SetValue(const class UDisconnectionHandler* DisconnectionHandler, const struct FFirebaseVariant& Value);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DisconnectionSetValueProxy">();
	}
	static class UDisconnectionSetValueProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDisconnectionSetValueProxy>();
	}
};
static_assert(alignof(UDisconnectionSetValueProxy) == 0x000008, "Wrong alignment on UDisconnectionSetValueProxy");
static_assert(sizeof(UDisconnectionSetValueProxy) == 0x000070, "Wrong size on UDisconnectionSetValueProxy");
static_assert(offsetof(UDisconnectionSetValueProxy, OnSet) == 0x000038, "Member 'UDisconnectionSetValueProxy::OnSet' has a wrong offset!");
static_assert(offsetof(UDisconnectionSetValueProxy, OnError) == 0x000048, "Member 'UDisconnectionSetValueProxy::OnError' has a wrong offset!");

// Class FirebaseFeatures.DisconnectionSetValueAndPriorityProxy
// 0x0050 (0x0088 - 0x0038)
class UDisconnectionSetValueAndPriorityProxy final : public UDisconnectionHandlerProxybase
{
public:
	FMulticastInlineDelegateProperty_             OnSet;                                             // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnError;                                           // 0x0048(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_58[0x30];                                      // 0x0058(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UDisconnectionSetValueAndPriorityProxy* SetValueAndPriority(const class UDisconnectionHandler* DisconnectionHandler, const struct FFirebaseVariant& Value, const struct FFirebaseVariant& Priority);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DisconnectionSetValueAndPriorityProxy">();
	}
	static class UDisconnectionSetValueAndPriorityProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDisconnectionSetValueAndPriorityProxy>();
	}
};
static_assert(alignof(UDisconnectionSetValueAndPriorityProxy) == 0x000008, "Wrong alignment on UDisconnectionSetValueAndPriorityProxy");
static_assert(sizeof(UDisconnectionSetValueAndPriorityProxy) == 0x000088, "Wrong size on UDisconnectionSetValueAndPriorityProxy");
static_assert(offsetof(UDisconnectionSetValueAndPriorityProxy, OnSet) == 0x000038, "Member 'UDisconnectionSetValueAndPriorityProxy::OnSet' has a wrong offset!");
static_assert(offsetof(UDisconnectionSetValueAndPriorityProxy, OnError) == 0x000048, "Member 'UDisconnectionSetValueAndPriorityProxy::OnError' has a wrong offset!");

// Class FirebaseFeatures.DisconnectionUpdateChildrenProxy
// 0x0038 (0x0070 - 0x0038)
class UDisconnectionUpdateChildrenProxy final : public UDisconnectionHandlerProxybase
{
public:
	FMulticastInlineDelegateProperty_             OnUpdated;                                         // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnError;                                           // 0x0048(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_58[0x18];                                      // 0x0058(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UDisconnectionUpdateChildrenProxy* UpdateChildren(const class UDisconnectionHandler* DisconnectionHandler, const struct FFirebaseVariant& Value);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DisconnectionUpdateChildrenProxy">();
	}
	static class UDisconnectionUpdateChildrenProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDisconnectionUpdateChildrenProxy>();
	}
};
static_assert(alignof(UDisconnectionUpdateChildrenProxy) == 0x000008, "Wrong alignment on UDisconnectionUpdateChildrenProxy");
static_assert(sizeof(UDisconnectionUpdateChildrenProxy) == 0x000070, "Wrong size on UDisconnectionUpdateChildrenProxy");
static_assert(offsetof(UDisconnectionUpdateChildrenProxy, OnUpdated) == 0x000038, "Member 'UDisconnectionUpdateChildrenProxy::OnUpdated' has a wrong offset!");
static_assert(offsetof(UDisconnectionUpdateChildrenProxy, OnError) == 0x000048, "Member 'UDisconnectionUpdateChildrenProxy::OnError' has a wrong offset!");

// Class FirebaseFeatures.DatabaseQueryGetValue
// 0x0028 (0x0058 - 0x0030)
class UDatabaseQueryGetValue final : public UBlueprintAsyncActionBase
{
public:
