#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: First_Launch_Tutorial

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "F_DialogueNodeInfo_structs.hpp"
#include "FMODStudio_structs.hpp"
#include "NPC_Structure_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function First_Launch_Tutorial.First_Launch_Tutorial_DirectorBP_C.Cine_Camera_Actor2_Event
// 0x0008 (0x0008 - 0x0000)
struct First_Launch_Tutorial_DirectorBP_C_Cine_Camera_Actor2_Event final
{
public:
	class ACineCameraActor*                       Cine_Camera_Actor2;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(First_Launch_Tutorial_DirectorBP_C_Cine_Camera_Actor2_Event) == 0x000008, "Wrong alignment on First_Launch_Tutorial_DirectorBP_C_Cine_Camera_Actor2_Event");
static_assert(sizeof(First_Launch_Tutorial_DirectorBP_C_Cine_Camera_Actor2_Event) == 0x000008, "Wrong size on First_Launch_Tutorial_DirectorBP_C_Cine_Camera_Actor2_Event");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_Cine_Camera_Actor2_Event, Cine_Camera_Actor2) == 0x000000, "Member 'First_Launch_Tutorial_DirectorBP_C_Cine_Camera_Actor2_Event::Cine_Camera_Actor2' has a wrong offset!");

// Function First_Launch_Tutorial.First_Launch_Tutorial_DirectorBP_C.CineCameraActor1_Event
// 0x0008 (0x0008 - 0x0000)
struct First_Launch_Tutorial_DirectorBP_C_CineCameraActor1_Event final
{
public:
	class ACineCameraActor*                       CineCameraActor1;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(First_Launch_Tutorial_DirectorBP_C_CineCameraActor1_Event) == 0x000008, "Wrong alignment on First_Launch_Tutorial_DirectorBP_C_CineCameraActor1_Event");
static_assert(sizeof(First_Launch_Tutorial_DirectorBP_C_CineCameraActor1_Event) == 0x000008, "Wrong size on First_Launch_Tutorial_DirectorBP_C_CineCameraActor1_Event");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_CineCameraActor1_Event, CineCameraActor1) == 0x000000, "Member 'First_Launch_Tutorial_DirectorBP_C_CineCameraActor1_Event::CineCameraActor1' has a wrong offset!");

// Function First_Launch_Tutorial.First_Launch_Tutorial_DirectorBP_C.CineCameraActor1_Event_0
// 0x0008 (0x0008 - 0x0000)
struct First_Launch_Tutorial_DirectorBP_C_CineCameraActor1_Event_0 final
{
public:
	class ACineCameraActor*                       CineCameraActor1;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(First_Launch_Tutorial_DirectorBP_C_CineCameraActor1_Event_0) == 0x000008, "Wrong alignment on First_Launch_Tutorial_DirectorBP_C_CineCameraActor1_Event_0");
static_assert(sizeof(First_Launch_Tutorial_DirectorBP_C_CineCameraActor1_Event_0) == 0x000008, "Wrong size on First_Launch_Tutorial_DirectorBP_C_CineCameraActor1_Event_0");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_CineCameraActor1_Event_0, CineCameraActor1) == 0x000000, "Member 'First_Launch_Tutorial_DirectorBP_C_CineCameraActor1_Event_0::CineCameraActor1' has a wrong offset!");

// Function First_Launch_Tutorial.First_Launch_Tutorial_DirectorBP_C.ExecuteUbergraph_First_Launch_Tutorial_DirectorBP
// 0x08A8 (0x08A8 - 0x0000)
struct First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC;                  // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      CallFunc_GetPlayerRef_SurvivalPlayer;              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayerCutsceneComponent_C*             CallFunc_GetComponentByClass_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC_1;                // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      CallFunc_GetPlayerRef_SurvivalPlayer_1;            // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayerCutsceneComponent_C*             CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC_2;                // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      CallFunc_GetPlayerRef_SurvivalPlayer_2;            // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayerCutsceneComponent_C*             CallFunc_GetComponentByClass_ReturnValue_2;        // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_InputHints_C*                      CallFunc_Create_ReturnValue;                       // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC_3;                // 0x00F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC_4;                // 0x0110(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      CallFunc_GetPlayerRef_SurvivalPlayer_3;            // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      CallFunc_GetPlayerRef_SurvivalPlayer_4;            // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayerCutsceneComponent_C*             CallFunc_GetComponentByClass_ReturnValue_3;        // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14A[0x6];                                      // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayerCutsceneComponent_C*             CallFunc_GetComponentByClass_ReturnValue_4;        // 0x0150(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_5;        // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC_5;                // 0x0160(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_172[0x6];                                      // 0x0172(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      CallFunc_GetPlayerRef_SurvivalPlayer_5;            // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayerCutsceneComponent_C*             CallFunc_GetComponentByClass_ReturnValue_5;        // 0x0188(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_6;        // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_7;        // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC_6;                // 0x01A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC_7;                // 0x01C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      CallFunc_GetPlayerRef_SurvivalPlayer_6;            // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      CallFunc_GetPlayerRef_SurvivalPlayer_7;            // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_13;                   // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_14;                   // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EA[0x6];                                      // 0x01EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayerCutsceneComponent_C*             CallFunc_GetComponentByClass_ReturnValue_6;        // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ACineCameraActor*                       K2Node_CustomEvent_Cine_Camera_Actor2;             // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_15;                   // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_8;        // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_V2_C*                   K2Node_DynamicCast_AsSurvival_Player_V2;           // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_Select_Default;                             // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Montage_Play_ReturnValue;                 // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_1;                // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_2;                // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_3;                // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_4;                // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_5;                // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_9;        // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue;           // 0x0280(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_NormalizedDeltaRotator_ReturnValue;       // 0x02A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ACineCameraActor*                       K2Node_CustomEvent_CineCameraActor1_1;             // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_RotatorRotator_ReturnValue;      // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x02C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x02F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_2;                      // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_2;                     // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_2;                       // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_10;       // 0x0330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0338(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue_1;         // 0x0350(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_RInterpTo_ReturnValue;                    // 0x0368(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_3;                      // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_3;                     // 0x0384(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_3;                       // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38C[0x4];                                      // 0x038C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_11;       // 0x0390(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue_2;         // 0x03A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_4;                      // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_4;                     // 0x03C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_4;                       // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CC[0x4];                                      // 0x03CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_2;                // 0x03D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_FClamp_ReturnValue_2;                     // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x03F0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_FClamp_ReturnValue_3;                     // 0x04D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_4;                     // 0x04E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_12;       // 0x04E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_3;                // 0x04F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_1;         // 0x0508(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_1;        // 0x0510(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_13;       // 0x0528(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue_3;         // 0x0530(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x0548(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RInterpTo_ReturnValue_1;                  // 0x0550(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ACineCameraActor*                       K2Node_CustomEvent_CineCameraActor1;               // 0x0568(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_1;  // 0x0570(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_14;       // 0x0658(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_2;         // 0x0660(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0668(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x0669(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66A[0x6];                                      // 0x066A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_6;                // 0x0670(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0678(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0690(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_2;            // 0x06A8(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_3;            // 0x06C0(0x0018)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_15;       // 0x06D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC_8;                // 0x06E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x06F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F1[0x7];                                      // 0x06F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      CallFunc_GetPlayerRef_SurvivalPlayer_8;            // 0x06F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_7;                // 0x0700(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_16;                   // 0x0708(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_709[0x7];                                      // 0x0709(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayerCutsceneComponent_C*             CallFunc_GetComponentByClass_ReturnValue_7;        // 0x0710(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_16;       // 0x0718(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_17;                   // 0x0720(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_721[0x7];                                      // 0x0721(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue_4;         // 0x0728(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_17;       // 0x0740(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_8;                // 0x0748(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_18;       // 0x0750(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_19;       // 0x0758(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC_9;                // 0x0760(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x0770(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_771[0x7];                                      // 0x0771(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC_10;               // 0x0778(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x0788(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_789[0x7];                                      // 0x0789(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      CallFunc_GetPlayerRef_SurvivalPlayer_9;            // 0x0790(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      CallFunc_GetPlayerRef_SurvivalPlayer_10;           // 0x0798(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_4;            // 0x07A0(0x0018)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_20;       // 0x07B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC_11;               // 0x07C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x07D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D1[0x7];                                      // 0x07D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_5;            // 0x07D8(0x0018)()
	class ASurvivalPlayer_C*                      CallFunc_GetPlayerRef_SurvivalPlayer_11;           // 0x07F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_21;       // 0x07F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_6;            // 0x0800(0x0018)()
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC_12;               // 0x0818(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_13;                    // 0x0828(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_829[0x7];                                      // 0x0829(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      CallFunc_GetPlayerRef_SurvivalPlayer_12;           // 0x0830(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RInterpTo_DeltaTime_ImplicitCast;         // 0x0838(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_83C[0x4];                                      // 0x083C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0840(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast_1;        // 0x0848(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0850(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast_1;        // 0x0858(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x0860(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Pitch_ImplicitCast;           // 0x0864(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_Value_ImplicitCast;                // 0x0868(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_Value_ImplicitCast_1;              // 0x0870(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast_1;           // 0x0878(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Pitch_ImplicitCast_1;         // 0x087C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_Value_ImplicitCast_2;              // 0x0880(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_Value_ImplicitCast_3;              // 0x0888(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_Value_ImplicitCast_4;              // 0x0890(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast_2;           // 0x0898(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Pitch_ImplicitCast_2;         // 0x089C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast;            // 0x08A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RInterpTo_DeltaTime_ImplicitCast_1;       // 0x08A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP) == 0x000008, "Wrong alignment on First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP");
static_assert(sizeof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP) == 0x0008A8, "Wrong size on First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP, EntryPoint) == 0x000000, "Member 'First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP, Temp_bool_Variable) == 0x000004, "Member 'First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP, Temp_object_Variable) == 0x000008, "Member 'First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP, Temp_object_Variable_1) == 0x000010, "Member 'First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP, CallFunc_GetPlayerController_ReturnValue) == 0x000018, "Member 'First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP, K2Node_DynamicCast_AsBPI_Surv_PC) == 0x000028, "Member 'First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP::K2Node_DynamicCast_AsBPI_Surv_PC' has a wrong offset!");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP, CallFunc_GetPlayerRef_SurvivalPlayer) == 0x000040, "Member 'First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP::CallFunc_GetPlayerRef_SurvivalPlayer' has a wrong offset!");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP, CallFunc_IsValid_ReturnValue_1) == 0x000048, "Member 'First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP, CallFunc_GetComponentByClass_ReturnValue) == 0x000050, "Member 'First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP, CallFunc_IsValid_ReturnValue_2) == 0x000058, "Member 'First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP, CallFunc_GetEndTime_ReturnValue) == 0x00005C, "Member 'First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP, CallFunc_GetPlayerController_ReturnValue_1) == 0x000060, "Member 'First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP, K2Node_DynamicCast_AsBPI_Surv_PC_1) == 0x000068, "Member 'First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP::K2Node_DynamicCast_AsBPI_Surv_PC_1' has a wrong offset!");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP, K2Node_DynamicCast_bSuccess_1) == 0x000078, "Member 'First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP, CallFunc_GetPlayerRef_SurvivalPlayer_1) == 0x000080, "Member 'First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP::CallFunc_GetPlayerRef_SurvivalPlayer_1' has a wrong offset!");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP, CallFunc_IsValid_ReturnValue_3) == 0x000088, "Member 'First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000090, "Member 'First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP, CallFunc_GetPlayerController_ReturnValue_2) == 0x000098, "Member 'First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP, CallFunc_IsValid_ReturnValue_4) == 0x0000A0, "Member 'First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP, K2Node_DynamicCast_AsBPI_Surv_PC_2) == 0x0000A8, "Member 'First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP::K2Node_DynamicCast_AsBPI_Surv_PC_2' has a wrong offset!");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP, K2Node_DynamicCast_bSuccess_2) == 0x0000B8, "Member 'First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP, CallFunc_GetPlayerRef_SurvivalPlayer_2) == 0x0000C0, "Member 'First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP::CallFunc_GetPlayerRef_SurvivalPlayer_2' has a wrong offset!");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP, CallFunc_IsValid_ReturnValue_5) == 0x0000C8, "Member 'First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP, CallFunc_GetComponentByClass_ReturnValue_2) == 0x0000D0, "Member 'First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP::CallFunc_GetComponentByClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP, CallFunc_Create_ReturnValue) == 0x0000D8, "Member 'First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP, CallFunc_IsValid_ReturnValue_6) == 0x0000E0, "Member 'First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP, CallFunc_GetPlayerController_ReturnValue_3) == 0x0000E8, "Member 'First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP, CallFunc_GetPlayerController_ReturnValue_4) == 0x0000F0, "Member 'First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP::CallFunc_GetPlayerController_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP, K2Node_DynamicCast_AsBPI_Surv_PC_3) == 0x0000F8, "Member 'First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP::K2Node_DynamicCast_AsBPI_Surv_PC_3' has a wrong offset!");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP, K2Node_DynamicCast_bSuccess_3) == 0x000108, "Member 'First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP, K2Node_DynamicCast_AsBPI_Surv_PC_4) == 0x000110, "Member 'First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP::K2Node_DynamicCast_AsBPI_Surv_PC_4' has a wrong offset!");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP, K2Node_DynamicCast_bSuccess_4) == 0x000120, "Member 'First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP, CallFunc_GetPlayerRef_SurvivalPlayer_3) == 0x000128, "Member 'First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP::CallFunc_GetPlayerRef_SurvivalPlayer_3' has a wrong offset!");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP, CallFunc_GetPlayerRef_SurvivalPlayer_4) == 0x000130, "Member 'First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP::CallFunc_GetPlayerRef_SurvivalPlayer_4' has a wrong offset!");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP, CallFunc_IsValid_ReturnValue_7) == 0x000138, "Member 'First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP, CallFunc_GetComponentByClass_ReturnValue_3) == 0x000140, "Member 'First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP::CallFunc_GetComponentByClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP, CallFunc_IsValid_ReturnValue_8) == 0x000148, "Member 'First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP, CallFunc_IsValid_ReturnValue_9) == 0x000149, "Member 'First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP, CallFunc_GetComponentByClass_ReturnValue_4) == 0x000150, "Member 'First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP::CallFunc_GetComponentByClass_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP, CallFunc_GetPlayerController_ReturnValue_5) == 0x000158, "Member 'First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP::CallFunc_GetPlayerController_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP, K2Node_DynamicCast_AsBPI_Surv_PC_5) == 0x000160, "Member 'First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP::K2Node_DynamicCast_AsBPI_Surv_PC_5' has a wrong offset!");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP, K2Node_DynamicCast_bSuccess_5) == 0x000170, "Member 'First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP, CallFunc_IsValid_ReturnValue_10) == 0x000171, "Member 'First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP, CallFunc_GetPlayerRef_SurvivalPlayer_5) == 0x000178, "Member 'First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP::CallFunc_GetPlayerRef_SurvivalPlayer_5' has a wrong offset!");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP, CallFunc_IsValid_ReturnValue_11) == 0x000180, "Member 'First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP::CallFunc_IsValid_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP, CallFunc_GetComponentByClass_ReturnValue_5) == 0x000188, "Member 'First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP::CallFunc_GetComponentByClass_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP, CallFunc_IsValid_ReturnValue_12) == 0x000190, "Member 'First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP::CallFunc_IsValid_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP, CallFunc_GetPlayerController_ReturnValue_6) == 0x000198, "Member 'First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP::CallFunc_GetPlayerController_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP, CallFunc_GetPlayerController_ReturnValue_7) == 0x0001A0, "Member 'First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP::CallFunc_GetPlayerController_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP, K2Node_DynamicCast_AsBPI_Surv_PC_6) == 0x0001A8, "Member 'First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP::K2Node_DynamicCast_AsBPI_Surv_PC_6' has a wrong offset!");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP, K2Node_DynamicCast_bSuccess_6) == 0x0001B8, "Member 'First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP, K2Node_DynamicCast_AsBPI_Surv_PC_7) == 0x0001C0, "Member 'First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP::K2Node_DynamicCast_AsBPI_Surv_PC_7' has a wrong offset!");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP, K2Node_DynamicCast_bSuccess_7) == 0x0001D0, "Member 'First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP, CallFunc_GetPlayerRef_SurvivalPlayer_6) == 0x0001D8, "Member 'First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP::CallFunc_GetPlayerRef_SurvivalPlayer_6' has a wrong offset!");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP, CallFunc_GetPlayerRef_SurvivalPlayer_7) == 0x0001E0, "Member 'First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP::CallFunc_GetPlayerRef_SurvivalPlayer_7' has a wrong offset!");
static_assert(offsetof(First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP, CallFunc_IsValid_ReturnValue_13) == 0x0001E8, "Member 'First_Launch_Tutorial_DirectorBP_C_ExecuteUbergraph_First_Launch_Tutorial_DirectorBP::CallFunc_IsValid_ReturnValue_13' has a wrong offset!");
