#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FItemInfo

#include "Basic.hpp"

#include "JSItemType_structs.hpp"
#include "SlotRarity_structs.hpp"
#include "EffectContructor_structs.hpp"
#include "InfoType_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "PickupAttachments_structs.hpp"
#include "BPE_AmmoClass_structs.hpp"
#include "BPE_FireMode_structs.hpp"
#include "Survival_structs.hpp"
#include "DisassembleSettings_structs.hpp"
#include "ELootTypes_structs.hpp"
#include "EDismantleType_structs.hpp"
#include "E_ItemColorTypes_structs.hpp"


namespace SDK
{

// UserDefinedStruct FItemInfo.FItemInfo
// 0x0220 (0x0220 - 0x0000)
struct FFItemInfo final
{
public:
	int32                                         ItemID_35_1737366145EEBA44086DB6ACE0E9C90F;        // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         UniqueServerID_83_19E6C8FE42B778BAE918F79F1D85AE2A; // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJSItemType                                   Type_12_E22AD1CB453807664569C7949C6F4AB9;          // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlotRarity                                   Rarity_38_07F066D7469AAC458F4C5EAE38A3404D;        // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanStack_5_C8C8CA994713D5823B06DDB479DDA7A1;       // 0x000A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxStack_8_4ABF8FB44B55528999A71A9403501AF2;       // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UPaperSprite>            Image_218_E628F1D64A229DE1FEB2E4A836A2A062;        // 0x0010(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FVector2D                              SlotDimension_19_F030B0224A638DF8046DFBA1A9F61992; // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Count_22_BFF3027A4FD5D984887F16B0B821DF3E;         // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Weight_30_E433C36F456EFAB514CBEDAADFB5327D;        // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AddingMaximumWeight_172_D5908E0D40A332B68964169B6DF33445; // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Price_57_4C5179914BEF1256A839BC82633708AA;         // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SellPrice_169_AC84F6EB4E9792F817A4D981CC889826;    // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Name_148_93E2656145FAF7132466958620A18F32;         // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   DisplayName_86_2237A1B6401F88D046C1FFB42F1AE9E1;   // 0x0080(0x0018)(Edit, BlueprintVisible)
	class FText                                   Description_27_45B737B141296650099E5D8976095DA0;   // 0x0098(0x0018)(Edit, BlueprintVisible)
	class UFMODEvent*                             DropSound_140_F650CD1C4D08B863C42B87A31E1B6B21;    // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsContainer__63_3AD174BB4850528B424E14A0C4C8572B;  // 0x00B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Container_Dimension_65_6D47220C4F2046154883BABEAB9FD1E8; // 0x00C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EJSItemType>                           ContainerSupportedItems_62_F265E89F42E4E8297D366D9210B5C2C7; // 0x00D0(0x0010)(Edit, BlueprintVisible)
	bool                                          OpenContainerOnDoubleClick__67_68B91ADA4ECCFD7451C90F9CC7FC8C88; // 0x00E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Rotated__59_F26C07E6426F46EEC5E69AA45599BE1A;      // 0x00E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 ActorClass_223_77A75A04464A96A5A5D68DB6F2799286;   // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           SupportedAttachmentIDs_147_6C43851D43640AF0030953920C18596C; // 0x00F0(0x0010)(Edit, BlueprintVisible)
	struct FPickupAttachments                     AttachmentsInfo_91_2F6158F24439C5DBAD74F798FE8DB22B; // 0x0100(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   SpecialContainerWidget_219_5352E1BC43874D84D3B55FA48815DAA5; // 0x0110(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UUserWidget*                            SpecialContainerRef_221_7EA1683D4FDD0D5BA6B8758A430EC4BE; // 0x0140(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          OpenSpecialWidgetOnDoubleClick__106_186A542A44E7D3835F3CD8B912CED612; // 0x0148(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UStaticMesh>             Mesh_224_36CB7DF24AD9484779C91382C5DBEBCE;         // 0x0150(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<struct FEffectContructor>              Effects_115_6036120A4D6F9C48D33CD283D3929C38;      // 0x0180(0x0010)(Edit, BlueprintVisible)
	bool                                          IsUsable_119_BDDCE2504EE8CCBC9138509B1D7E9A8E;     // 0x0190(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemType                                     LootType_123_ACA3E5444DAB48150571839C35C09ADD;     // 0x0191(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_192[0x2];                                      // 0x0192(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         WeaponAmmoCount_127_B1B113B84D74B28D56B83EB337E5D027; // 0x0194(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBPE_FireMode                                 FireMode_207_5BA61B7947DB36053B7BEF847E822460;     // 0x0198(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBPE_AmmoClass                                AmmoClass_217_539A229A463EDEC3B7623AB5E8E51D22;    // 0x0199(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19A[0x6];                                      // 0x019A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MaxDurability_133_DE24AAEF43903D46F72E97B1D30A9A08; // 0x01A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Durability_134_8F07298842FAE8804B3788B5ECCCFEE6;   // 0x01A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPaperSprite*                           BW_Image_137_70FD5D2E455DC578D18735A6D26C2ABD;     // 0x01B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Resource__139_8A2869614526546E1F9B268CC5D359A8;    // 0x01B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFMODEvent*                             DragSound_143_FD6BDEC549347AEA8302EA8F0B7D7658;    // 0x01C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDisassembleSettings                   DiassembleSettings_146_8D85F60B4B24D88BFFC00FA6A450203B; // 0x01C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELootTypes                                    LootTypes_154_CB5777FA46CF748F997685AB6F6B632C;    // 0x01D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDismantleType                                DismantleType_162_12C170BF43D8AC3318BA418D4708309D; // 0x01D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DA[0x6];                                      // 0x01DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UPaperSprite>            ImageWorkbench_225_31A417854B56FC92FF438092D7477CF6; // 0x01E0(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	E_ItemColorTypes                              ColorType_199_CBE31A644367F5485A2B43AFB63E9922;    // 0x0210(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInfoType                                     InfoType_204_6D7171524FDF4BC2F474AB90E0078F89;     // 0x0211(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_212[0x2];                                      // 0x0212(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ArmorLevel_211_FFDAB12E4A8ED3FA0E55D0A4C52BF504;   // 0x0214(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                             EquipSound_214_D3A194F04AFEAA7B29A28EA106473219;   // 0x0218(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FFItemInfo) == 0x000008, "Wrong alignment on FFItemInfo");
static_assert(sizeof(FFItemInfo) == 0x000220, "Wrong size on FFItemInfo");
static_assert(offsetof(FFItemInfo, ItemID_35_1737366145EEBA44086DB6ACE0E9C90F) == 0x000000, "Member 'FFItemInfo::ItemID_35_1737366145EEBA44086DB6ACE0E9C90F' has a wrong offset!");
static_assert(offsetof(FFItemInfo, UniqueServerID_83_19E6C8FE42B778BAE918F79F1D85AE2A) == 0x000004, "Member 'FFItemInfo::UniqueServerID_83_19E6C8FE42B778BAE918F79F1D85AE2A' has a wrong offset!");
static_assert(offsetof(FFItemInfo, Type_12_E22AD1CB453807664569C7949C6F4AB9) == 0x000008, "Member 'FFItemInfo::Type_12_E22AD1CB453807664569C7949C6F4AB9' has a wrong offset!");
static_assert(offsetof(FFItemInfo, Rarity_38_07F066D7469AAC458F4C5EAE38A3404D) == 0x000009, "Member 'FFItemInfo::Rarity_38_07F066D7469AAC458F4C5EAE38A3404D' has a wrong offset!");
static_assert(offsetof(FFItemInfo, CanStack_5_C8C8CA994713D5823B06DDB479DDA7A1) == 0x00000A, "Member 'FFItemInfo::CanStack_5_C8C8CA994713D5823B06DDB479DDA7A1' has a wrong offset!");
static_assert(offsetof(FFItemInfo, MaxStack_8_4ABF8FB44B55528999A71A9403501AF2) == 0x00000C, "Member 'FFItemInfo::MaxStack_8_4ABF8FB44B55528999A71A9403501AF2' has a wrong offset!");
static_assert(offsetof(FFItemInfo, Image_218_E628F1D64A229DE1FEB2E4A836A2A062) == 0x000010, "Member 'FFItemInfo::Image_218_E628F1D64A229DE1FEB2E4A836A2A062' has a wrong offset!");
static_assert(offsetof(FFItemInfo, SlotDimension_19_F030B0224A638DF8046DFBA1A9F61992) == 0x000040, "Member 'FFItemInfo::SlotDimension_19_F030B0224A638DF8046DFBA1A9F61992' has a wrong offset!");
static_assert(offsetof(FFItemInfo, Count_22_BFF3027A4FD5D984887F16B0B821DF3E) == 0x000050, "Member 'FFItemInfo::Count_22_BFF3027A4FD5D984887F16B0B821DF3E' has a wrong offset!");
static_assert(offsetof(FFItemInfo, Weight_30_E433C36F456EFAB514CBEDAADFB5327D) == 0x000058, "Member 'FFItemInfo::Weight_30_E433C36F456EFAB514CBEDAADFB5327D' has a wrong offset!");
static_assert(offsetof(FFItemInfo, AddingMaximumWeight_172_D5908E0D40A332B68964169B6DF33445) == 0x000060, "Member 'FFItemInfo::AddingMaximumWeight_172_D5908E0D40A332B68964169B6DF33445' has a wrong offset!");
static_assert(offsetof(FFItemInfo, Price_57_4C5179914BEF1256A839BC82633708AA) == 0x000068, "Member 'FFItemInfo::Price_57_4C5179914BEF1256A839BC82633708AA' has a wrong offset!");
static_assert(offsetof(FFItemInfo, SellPrice_169_AC84F6EB4E9792F817A4D981CC889826) == 0x000070, "Member 'FFItemInfo::SellPrice_169_AC84F6EB4E9792F817A4D981CC889826' has a wrong offset!");
static_assert(offsetof(FFItemInfo, Name_148_93E2656145FAF7132466958620A18F32) == 0x000078, "Member 'FFItemInfo::Name_148_93E2656145FAF7132466958620A18F32' has a wrong offset!");
static_assert(offsetof(FFItemInfo, DisplayName_86_2237A1B6401F88D046C1FFB42F1AE9E1) == 0x000080, "Member 'FFItemInfo::DisplayName_86_2237A1B6401F88D046C1FFB42F1AE9E1' has a wrong offset!");
static_assert(offsetof(FFItemInfo, Description_27_45B737B141296650099E5D8976095DA0) == 0x000098, "Member 'FFItemInfo::Description_27_45B737B141296650099E5D8976095DA0' has a wrong offset!");
static_assert(offsetof(FFItemInfo, DropSound_140_F650CD1C4D08B863C42B87A31E1B6B21) == 0x0000B0, "Member 'FFItemInfo::DropSound_140_F650CD1C4D08B863C42B87A31E1B6B21' has a wrong offset!");
static_assert(offsetof(FFItemInfo, IsContainer__63_3AD174BB4850528B424E14A0C4C8572B) == 0x0000B8, "Member 'FFItemInfo::IsContainer__63_3AD174BB4850528B424E14A0C4C8572B' has a wrong offset!");
static_assert(offsetof(FFItemInfo, Container_Dimension_65_6D47220C4F2046154883BABEAB9FD1E8) == 0x0000C0, "Member 'FFItemInfo::Container_Dimension_65_6D47220C4F2046154883BABEAB9FD1E8' has a wrong offset!");
static_assert(offsetof(FFItemInfo, ContainerSupportedItems_62_F265E89F42E4E8297D366D9210B5C2C7) == 0x0000D0, "Member 'FFItemInfo::ContainerSupportedItems_62_F265E89F42E4E8297D366D9210B5C2C7' has a wrong offset!");
static_assert(offsetof(FFItemInfo, OpenContainerOnDoubleClick__67_68B91ADA4ECCFD7451C90F9CC7FC8C88) == 0x0000E0, "Member 'FFItemInfo::OpenContainerOnDoubleClick__67_68B91ADA4ECCFD7451C90F9CC7FC8C88' has a wrong offset!");
static_assert(offsetof(FFItemInfo, Rotated__59_F26C07E6426F46EEC5E69AA45599BE1A) == 0x0000E1, "Member 'FFItemInfo::Rotated__59_F26C07E6426F46EEC5E69AA45599BE1A' has a wrong offset!");
static_assert(offsetof(FFItemInfo, ActorClass_223_77A75A04464A96A5A5D68DB6F2799286) == 0x0000E8, "Member 'FFItemInfo::ActorClass_223_77A75A04464A96A5A5D68DB6F2799286' has a wrong offset!");
static_assert(offsetof(FFItemInfo, SupportedAttachmentIDs_147_6C43851D43640AF0030953920C18596C) == 0x0000F0, "Member 'FFItemInfo::SupportedAttachmentIDs_147_6C43851D43640AF0030953920C18596C' has a wrong offset!");
static_assert(offsetof(FFItemInfo, AttachmentsInfo_91_2F6158F24439C5DBAD74F798FE8DB22B) == 0x000100, "Member 'FFItemInfo::AttachmentsInfo_91_2F6158F24439C5DBAD74F798FE8DB22B' has a wrong offset!");
static_assert(offsetof(FFItemInfo, SpecialContainerWidget_219_5352E1BC43874D84D3B55FA48815DAA5) == 0x000110, "Member 'FFItemInfo::SpecialContainerWidget_219_5352E1BC43874D84D3B55FA48815DAA5' has a wrong offset!");
static_assert(offsetof(FFItemInfo, SpecialContainerRef_221_7EA1683D4FDD0D5BA6B8758A430EC4BE) == 0x000140, "Member 'FFItemInfo::SpecialContainerRef_221_7EA1683D4FDD0D5BA6B8758A430EC4BE' has a wrong offset!");
static_assert(offsetof(FFItemInfo, OpenSpecialWidgetOnDoubleClick__106_186A542A44E7D3835F3CD8B912CED612) == 0x000148, "Member 'FFItemInfo::OpenSpecialWidgetOnDoubleClick__106_186A542A44E7D3835F3CD8B912CED612' has a wrong offset!");
static_assert(offsetof(FFItemInfo, Mesh_224_36CB7DF24AD9484779C91382C5DBEBCE) == 0x000150, "Member 'FFItemInfo::Mesh_224_36CB7DF24AD9484779C91382C5DBEBCE' has a wrong offset!");
static_assert(offsetof(FFItemInfo, Effects_115_6036120A4D6F9C48D33CD283D3929C38) == 0x000180, "Member 'FFItemInfo::Effects_115_6036120A4D6F9C48D33CD283D3929C38' has a wrong offset!");
static_assert(offsetof(FFItemInfo, IsUsable_119_BDDCE2504EE8CCBC9138509B1D7E9A8E) == 0x000190, "Member 'FFItemInfo::IsUsable_119_BDDCE2504EE8CCBC9138509B1D7E9A8E' has a wrong offset!");
static_assert(offsetof(FFItemInfo, LootType_123_ACA3E5444DAB48150571839C35C09ADD) == 0x000191, "Member 'FFItemInfo::LootType_123_ACA3E5444DAB48150571839C35C09ADD' has a wrong offset!");
static_assert(offsetof(FFItemInfo, WeaponAmmoCount_127_B1B113B84D74B28D56B83EB337E5D027) == 0x000194, "Member 'FFItemInfo::WeaponAmmoCount_127_B1B113B84D74B28D56B83EB337E5D027' has a wrong offset!");
static_assert(offsetof(FFItemInfo, FireMode_207_5BA61B7947DB36053B7BEF847E822460) == 0x000198, "Member 'FFItemInfo::FireMode_207_5BA61B7947DB36053B7BEF847E822460' has a wrong offset!");
static_assert(offsetof(FFItemInfo, AmmoClass_217_539A229A463EDEC3B7623AB5E8E51D22) == 0x000199, "Member 'FFItemInfo::AmmoClass_217_539A229A463EDEC3B7623AB5E8E51D22' has a wrong offset!");
static_assert(offsetof(FFItemInfo, MaxDurability_133_DE24AAEF43903D46F72E97B1D30A9A08) == 0x0001A0, "Member 'FFItemInfo::MaxDurability_133_DE24AAEF43903D46F72E97B1D30A9A08' has a wrong offset!");
static_assert(offsetof(FFItemInfo, Durability_134_8F07298842FAE8804B3788B5ECCCFEE6) == 0x0001A8, "Member 'FFItemInfo::Durability_134_8F07298842FAE8804B3788B5ECCCFEE6' has a wrong offset!");
static_assert(offsetof(FFItemInfo, BW_Image_137_70FD5D2E455DC578D18735A6D26C2ABD) == 0x0001B0, "Member 'FFItemInfo::BW_Image_137_70FD5D2E455DC578D18735A6D26C2ABD' has a wrong offset!");
static_assert(offsetof(FFItemInfo, Resource__139_8A2869614526546E1F9B268CC5D359A8) == 0x0001B8, "Member 'FFItemInfo::Resource__139_8A2869614526546E1F9B268CC5D359A8' has a wrong offset!");
static_assert(offsetof(FFItemInfo, DragSound_143_FD6BDEC549347AEA8302EA8F0B7D7658) == 0x0001C0, "Member 'FFItemInfo::DragSound_143_FD6BDEC549347AEA8302EA8F0B7D7658' has a wrong offset!");
static_assert(offsetof(FFItemInfo, DiassembleSettings_146_8D85F60B4B24D88BFFC00FA6A450203B) == 0x0001C8, "Member 'FFItemInfo::DiassembleSettings_146_8D85F60B4B24D88BFFC00FA6A450203B' has a wrong offset!");
static_assert(offsetof(FFItemInfo, LootTypes_154_CB5777FA46CF748F997685AB6F6B632C) == 0x0001D8, "Member 'FFItemInfo::LootTypes_154_CB5777FA46CF748F997685AB6F6B632C' has a wrong offset!");
static_assert(offsetof(FFItemInfo, DismantleType_162_12C170BF43D8AC3318BA418D4708309D) == 0x0001D9, "Member 'FFItemInfo::DismantleType_162_12C170BF43D8AC3318BA418D4708309D' has a wrong offset!");
static_assert(offsetof(FFItemInfo, ImageWorkbench_225_31A417854B56FC92FF438092D7477CF6) == 0x0001E0, "Member 'FFItemInfo::ImageWorkbench_225_31A417854B56FC92FF438092D7477CF6' has a wrong offset!");
static_assert(offsetof(FFItemInfo, ColorType_199_CBE31A644367F5485A2B43AFB63E9922) == 0x000210, "Member 'FFItemInfo::ColorType_199_CBE31A644367F5485A2B43AFB63E9922' has a wrong offset!");
static_assert(offsetof(FFItemInfo, InfoType_204_6D7171524FDF4BC2F474AB90E0078F89) == 0x000211, "Member 'FFItemInfo::InfoType_204_6D7171524FDF4BC2F474AB90E0078F89' has a wrong offset!");
static_assert(offsetof(FFItemInfo, ArmorLevel_211_FFDAB12E4A8ED3FA0E55D0A4C52BF504) == 0x000214, "Member 'FFItemInfo::ArmorLevel_211_FFDAB12E4A8ED3FA0E55D0A4C52BF504' has a wrong offset!");
static_assert(offsetof(FFItemInfo, EquipSound_214_D3A194F04AFEAA7B29A28EA106473219) == 0x000218, "Member 'FFItemInfo::EquipSound_214_D3A194F04AFEAA7B29A28EA106473219' has a wrong offset!");

}

