#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FlashlightDummy

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass FlashlightDummy.FlashlightDummy_C
// 0x0028 (0x02B8 - 0x0290)
class AFlashlightDummy_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USpotLightComponent*                    SpotLight;                                         // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube;                                              // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_FlashlightDummy(int32 EntryPoint);
	void FlashlightEnable(bool New_Enable);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FlashlightDummy_C">();
	}
	static class AFlashlightDummy_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFlashlightDummy_C>();
	}
};
static_assert(alignof(AFlashlightDummy_C) == 0x000008, "Wrong alignment on AFlashlightDummy_C");
static_assert(sizeof(AFlashlightDummy_C) == 0x0002B8, "Wrong size on AFlashlightDummy_C");
static_assert(offsetof(AFlashlightDummy_C, UberGraphFrame) == 0x000290, "Member 'AFlashlightDummy_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AFlashlightDummy_C, SpotLight) == 0x000298, "Member 'AFlashlightDummy_C::SpotLight' has a wrong offset!");
static_assert(offsetof(AFlashlightDummy_C, Arrow) == 0x0002A0, "Member 'AFlashlightDummy_C::Arrow' has a wrong offset!");
static_assert(offsetof(AFlashlightDummy_C, Cube) == 0x0002A8, "Member 'AFlashlightDummy_C::Cube' has a wrong offset!");
static_assert(offsetof(AFlashlightDummy_C, DefaultSceneRoot) == 0x0002B0, "Member 'AFlashlightDummy_C::DefaultSceneRoot' has a wrong offset!");

}

