#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FMODParamTask

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass FMODParamTask.FMODParamTask_C
// 0x0050 (0x0078 - 0x0028)
class UFMODParamTask_C final : public UObject
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0028(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFMODAudioComponent*                    Comp;                                              // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FName                                   ParamName;                                         // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        ToValue;                                           // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        LerpTime;                                          // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        InitParamValue;                                    // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            Curve;                                             // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        CurrentTime;                                       // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Timer;                                             // 0x0068(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Stopped;                                           // 0x0070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_FMODParamTask(int32 EntryPoint);
	void StartTask();
	void StopTask();
	void Tick();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FMODParamTask_C">();
	}
	static class UFMODParamTask_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFMODParamTask_C>();
	}
};
static_assert(alignof(UFMODParamTask_C) == 0x000008, "Wrong alignment on UFMODParamTask_C");
static_assert(sizeof(UFMODParamTask_C) == 0x000078, "Wrong size on UFMODParamTask_C");
static_assert(offsetof(UFMODParamTask_C, UberGraphFrame) == 0x000028, "Member 'UFMODParamTask_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFMODParamTask_C, Comp) == 0x000030, "Member 'UFMODParamTask_C::Comp' has a wrong offset!");
static_assert(offsetof(UFMODParamTask_C, ParamName) == 0x000038, "Member 'UFMODParamTask_C::ParamName' has a wrong offset!");
static_assert(offsetof(UFMODParamTask_C, ToValue) == 0x000040, "Member 'UFMODParamTask_C::ToValue' has a wrong offset!");
static_assert(offsetof(UFMODParamTask_C, LerpTime) == 0x000048, "Member 'UFMODParamTask_C::LerpTime' has a wrong offset!");
static_assert(offsetof(UFMODParamTask_C, InitParamValue) == 0x000050, "Member 'UFMODParamTask_C::InitParamValue' has a wrong offset!");
static_assert(offsetof(UFMODParamTask_C, Curve) == 0x000058, "Member 'UFMODParamTask_C::Curve' has a wrong offset!");
static_assert(offsetof(UFMODParamTask_C, CurrentTime) == 0x000060, "Member 'UFMODParamTask_C::CurrentTime' has a wrong offset!");
static_assert(offsetof(UFMODParamTask_C, Timer) == 0x000068, "Member 'UFMODParamTask_C::Timer' has a wrong offset!");
static_assert(offsetof(UFMODParamTask_C, Stopped) == 0x000070, "Member 'UFMODParamTask_C::Stopped' has a wrong offset!");

}

