#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FMODParamTask

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function FMODParamTask.FMODParamTask_C.ExecuteUbergraph_FMODParamTask
// 0x0080 (0x0080 - 0x0000)
struct FMODParamTask_C_ExecuteUbergraph_FMODParamTask final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_2;        // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetParameter_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_InitParamValue_ImplicitCast;    // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_InTime_ImplicitCast;        // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeClamped_Value_ImplicitCast;       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetParameter_Value_ImplicitCast;          // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetParameter_Value_ImplicitCast_1;        // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FMODParamTask_C_ExecuteUbergraph_FMODParamTask) == 0x000008, "Wrong alignment on FMODParamTask_C_ExecuteUbergraph_FMODParamTask");
static_assert(sizeof(FMODParamTask_C_ExecuteUbergraph_FMODParamTask) == 0x000080, "Wrong size on FMODParamTask_C_ExecuteUbergraph_FMODParamTask");
static_assert(offsetof(FMODParamTask_C_ExecuteUbergraph_FMODParamTask, EntryPoint) == 0x000000, "Member 'FMODParamTask_C_ExecuteUbergraph_FMODParamTask::EntryPoint' has a wrong offset!");
static_assert(offsetof(FMODParamTask_C_ExecuteUbergraph_FMODParamTask, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'FMODParamTask_C_ExecuteUbergraph_FMODParamTask::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(FMODParamTask_C_ExecuteUbergraph_FMODParamTask, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'FMODParamTask_C_ExecuteUbergraph_FMODParamTask::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(FMODParamTask_C_ExecuteUbergraph_FMODParamTask, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'FMODParamTask_C_ExecuteUbergraph_FMODParamTask::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(FMODParamTask_C_ExecuteUbergraph_FMODParamTask, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000020, "Member 'FMODParamTask_C_ExecuteUbergraph_FMODParamTask::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FMODParamTask_C_ExecuteUbergraph_FMODParamTask, CallFunc_K2_SetTimerDelegate_ReturnValue_2) == 0x000028, "Member 'FMODParamTask_C_ExecuteUbergraph_FMODParamTask::CallFunc_K2_SetTimerDelegate_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FMODParamTask_C_ExecuteUbergraph_FMODParamTask, CallFunc_GetParameter_ReturnValue) == 0x000030, "Member 'FMODParamTask_C_ExecuteUbergraph_FMODParamTask::CallFunc_GetParameter_ReturnValue' has a wrong offset!");
static_assert(offsetof(FMODParamTask_C_ExecuteUbergraph_FMODParamTask, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000038, "Member 'FMODParamTask_C_ExecuteUbergraph_FMODParamTask::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(FMODParamTask_C_ExecuteUbergraph_FMODParamTask, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000040, "Member 'FMODParamTask_C_ExecuteUbergraph_FMODParamTask::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(FMODParamTask_C_ExecuteUbergraph_FMODParamTask, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000048, "Member 'FMODParamTask_C_ExecuteUbergraph_FMODParamTask::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(FMODParamTask_C_ExecuteUbergraph_FMODParamTask, CallFunc_GetFloatValue_ReturnValue) == 0x000050, "Member 'FMODParamTask_C_ExecuteUbergraph_FMODParamTask::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(FMODParamTask_C_ExecuteUbergraph_FMODParamTask, CallFunc_MapRangeClamped_ReturnValue) == 0x000058, "Member 'FMODParamTask_C_ExecuteUbergraph_FMODParamTask::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(FMODParamTask_C_ExecuteUbergraph_FMODParamTask, K2Node_VariableSet_InitParamValue_ImplicitCast) == 0x000060, "Member 'FMODParamTask_C_ExecuteUbergraph_FMODParamTask::K2Node_VariableSet_InitParamValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(FMODParamTask_C_ExecuteUbergraph_FMODParamTask, CallFunc_GetFloatValue_InTime_ImplicitCast) == 0x000068, "Member 'FMODParamTask_C_ExecuteUbergraph_FMODParamTask::CallFunc_GetFloatValue_InTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(FMODParamTask_C_ExecuteUbergraph_FMODParamTask, CallFunc_MapRangeClamped_Value_ImplicitCast) == 0x000070, "Member 'FMODParamTask_C_ExecuteUbergraph_FMODParamTask::CallFunc_MapRangeClamped_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(FMODParamTask_C_ExecuteUbergraph_FMODParamTask, CallFunc_SetParameter_Value_ImplicitCast) == 0x000078, "Member 'FMODParamTask_C_ExecuteUbergraph_FMODParamTask::CallFunc_SetParameter_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(FMODParamTask_C_ExecuteUbergraph_FMODParamTask, CallFunc_SetParameter_Value_ImplicitCast_1) == 0x00007C, "Member 'FMODParamTask_C_ExecuteUbergraph_FMODParamTask::CallFunc_SetParameter_Value_ImplicitCast_1' has a wrong offset!");

}

