#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FogCSLStruct

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct FogCSLStruct.FogCSLStruct
// 0x0038 (0x0038 - 0x0000)
struct FFogCSLStruct final
{
public:
	bool                                          UseVolumetric_13_6B0F389E48AD76E392AE4E91BE3BC2DD; // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Density_2_94DB8E7D4794F5ECA18305A4EACB910D;        // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HeightFalloff_8_F6379E424DF989CBC283A5A02B964742;  // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        VFExtinctionScale_10_FD6E0F4D4F45AA302A5B76A451319531; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FogInscatteringColor_5_4C8EA8AE4FE5ED9317BE34820952F9D6; // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 VolumetricFogAlbedo_18_7C421E25415917EB4ABEA48B71F7034A; // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FFogCSLStruct) == 0x000008, "Wrong alignment on FFogCSLStruct");
static_assert(sizeof(FFogCSLStruct) == 0x000038, "Wrong size on FFogCSLStruct");
static_assert(offsetof(FFogCSLStruct, UseVolumetric_13_6B0F389E48AD76E392AE4E91BE3BC2DD) == 0x000000, "Member 'FFogCSLStruct::UseVolumetric_13_6B0F389E48AD76E392AE4E91BE3BC2DD' has a wrong offset!");
static_assert(offsetof(FFogCSLStruct, Density_2_94DB8E7D4794F5ECA18305A4EACB910D) == 0x000008, "Member 'FFogCSLStruct::Density_2_94DB8E7D4794F5ECA18305A4EACB910D' has a wrong offset!");
static_assert(offsetof(FFogCSLStruct, HeightFalloff_8_F6379E424DF989CBC283A5A02B964742) == 0x000010, "Member 'FFogCSLStruct::HeightFalloff_8_F6379E424DF989CBC283A5A02B964742' has a wrong offset!");
static_assert(offsetof(FFogCSLStruct, VFExtinctionScale_10_FD6E0F4D4F45AA302A5B76A451319531) == 0x000018, "Member 'FFogCSLStruct::VFExtinctionScale_10_FD6E0F4D4F45AA302A5B76A451319531' has a wrong offset!");
static_assert(offsetof(FFogCSLStruct, FogInscatteringColor_5_4C8EA8AE4FE5ED9317BE34820952F9D6) == 0x000020, "Member 'FFogCSLStruct::FogInscatteringColor_5_4C8EA8AE4FE5ED9317BE34820952F9D6' has a wrong offset!");
static_assert(offsetof(FFogCSLStruct, VolumetricFogAlbedo_18_7C421E25415917EB4ABEA48B71F7034A) == 0x000030, "Member 'FFogCSLStruct::VolumetricFogAlbedo_18_7C421E25415917EB4ABEA48B71F7034A' has a wrong offset!");

}

