#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Foliage_Interaction_BPI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Foliage_Interaction_BPI.Foliage_Interaction_BPI_C.Foliage_Interaction_Function
// 0x0100 (0x0100 - 0x0000)
struct Foliage_Interaction_BPI_C_Foliage_Interaction_Function final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x00E8)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                Player_Velocity;                                   // 0x00E8(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Foliage_Interaction_BPI_C_Foliage_Interaction_Function) == 0x000008, "Wrong alignment on Foliage_Interaction_BPI_C_Foliage_Interaction_Function");
static_assert(sizeof(Foliage_Interaction_BPI_C_Foliage_Interaction_Function) == 0x000100, "Wrong size on Foliage_Interaction_BPI_C_Foliage_Interaction_Function");
static_assert(offsetof(Foliage_Interaction_BPI_C_Foliage_Interaction_Function, Hit) == 0x000000, "Member 'Foliage_Interaction_BPI_C_Foliage_Interaction_Function::Hit' has a wrong offset!");
static_assert(offsetof(Foliage_Interaction_BPI_C_Foliage_Interaction_Function, Player_Velocity) == 0x0000E8, "Member 'Foliage_Interaction_BPI_C_Foliage_Interaction_Function::Player_Velocity' has a wrong offset!");

// Function Foliage_Interaction_BPI.Foliage_Interaction_BPI_C.Foliage_Interaction_Function_END
// 0x00E8 (0x00E8 - 0x0000)
struct Foliage_Interaction_BPI_C_Foliage_Interaction_Function_END final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x00E8)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Foliage_Interaction_BPI_C_Foliage_Interaction_Function_END) == 0x000008, "Wrong alignment on Foliage_Interaction_BPI_C_Foliage_Interaction_Function_END");
static_assert(sizeof(Foliage_Interaction_BPI_C_Foliage_Interaction_Function_END) == 0x0000E8, "Wrong size on Foliage_Interaction_BPI_C_Foliage_Interaction_Function_END");
static_assert(offsetof(Foliage_Interaction_BPI_C_Foliage_Interaction_Function_END, Hit) == 0x000000, "Member 'Foliage_Interaction_BPI_C_Foliage_Interaction_Function_END::Hit' has a wrong offset!");

}

