#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FootprintInterface

#include "Basic.hpp"

#include "EFootState_structs.hpp"


namespace SDK::Params
{

// Function FootprintInterface.FootprintInterface_C.ChangeFootState
// 0x0001 (0x0001 - 0x0000)
struct FootprintInterface_C_ChangeFootState final
{
public:
	EFootState                                    New_Style;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FootprintInterface_C_ChangeFootState) == 0x000001, "Wrong alignment on FootprintInterface_C_ChangeFootState");
static_assert(sizeof(FootprintInterface_C_ChangeFootState) == 0x000001, "Wrong size on FootprintInterface_C_ChangeFootState");
static_assert(offsetof(FootprintInterface_C_ChangeFootState, New_Style) == 0x000000, "Member 'FootprintInterface_C_ChangeFootState::New_Style' has a wrong offset!");

// Function FootprintInterface.FootprintInterface_C.SpawnFootprintDecal
// 0x000C (0x000C - 0x0000)
struct FootprintInterface_C_SpawnFootprintDecal final
{
public:
	class FName                                   SocketName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Right;                                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Left;                                              // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FootprintInterface_C_SpawnFootprintDecal) == 0x000004, "Wrong alignment on FootprintInterface_C_SpawnFootprintDecal");
static_assert(sizeof(FootprintInterface_C_SpawnFootprintDecal) == 0x00000C, "Wrong size on FootprintInterface_C_SpawnFootprintDecal");
static_assert(offsetof(FootprintInterface_C_SpawnFootprintDecal, SocketName) == 0x000000, "Member 'FootprintInterface_C_SpawnFootprintDecal::SocketName' has a wrong offset!");
static_assert(offsetof(FootprintInterface_C_SpawnFootprintDecal, Right) == 0x000008, "Member 'FootprintInterface_C_SpawnFootprintDecal::Right' has a wrong offset!");
static_assert(offsetof(FootprintInterface_C_SpawnFootprintDecal, Left) == 0x000009, "Member 'FootprintInterface_C_SpawnFootprintDecal::Left' has a wrong offset!");

}

