#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Footprint_Actor

#include "Basic.hpp"


namespace SDK::Params
{

// Function Footprint_Actor.Footprint_Actor_C.ExecuteUbergraph_Footprint_Actor
// 0x000C (0x000C - 0x0000)
struct Footprint_Actor_C_ExecuteUbergraph_Footprint_Actor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Footprint_Actor_C_ExecuteUbergraph_Footprint_Actor) == 0x000004, "Wrong alignment on Footprint_Actor_C_ExecuteUbergraph_Footprint_Actor");
static_assert(sizeof(Footprint_Actor_C_ExecuteUbergraph_Footprint_Actor) == 0x00000C, "Wrong size on Footprint_Actor_C_ExecuteUbergraph_Footprint_Actor");
static_assert(offsetof(Footprint_Actor_C_ExecuteUbergraph_Footprint_Actor, EntryPoint) == 0x000000, "Member 'Footprint_Actor_C_ExecuteUbergraph_Footprint_Actor::EntryPoint' has a wrong offset!");
static_assert(offsetof(Footprint_Actor_C_ExecuteUbergraph_Footprint_Actor, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000004, "Member 'Footprint_Actor_C_ExecuteUbergraph_Footprint_Actor::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Footprint_Actor_C_ExecuteUbergraph_Footprint_Actor, CallFunc_Delay_Duration_ImplicitCast) == 0x000008, "Member 'Footprint_Actor_C_ExecuteUbergraph_Footprint_Actor::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");

}

