#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GiveRewards

#include "Basic.hpp"

#include "ContainerPickupsInfo_structs.hpp"
#include "FItemInfo_structs.hpp"
#include "QuestFramework_structs.hpp"


namespace SDK::Params
{

// Function GiveRewards.GiveRewards_C.ExecuteEvent
// 0x0028 (0x0028 - 0x0000)
struct GiveRewards_C_ExecuteEvent final
{
public:
	class UQuestContext*                          Context;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FQuestEventPayload                     Payload;                                           // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(GiveRewards_C_ExecuteEvent) == 0x000008, "Wrong alignment on GiveRewards_C_ExecuteEvent");
static_assert(sizeof(GiveRewards_C_ExecuteEvent) == 0x000028, "Wrong size on GiveRewards_C_ExecuteEvent");
static_assert(offsetof(GiveRewards_C_ExecuteEvent, Context) == 0x000000, "Member 'GiveRewards_C_ExecuteEvent::Context' has a wrong offset!");
static_assert(offsetof(GiveRewards_C_ExecuteEvent, Payload) == 0x000008, "Member 'GiveRewards_C_ExecuteEvent::Payload' has a wrong offset!");

// Function GiveRewards.GiveRewards_C.ExecuteUbergraph_GiveRewards
// 0x0070 (0x0070 - 0x0000)
struct GiveRewards_C_ExecuteUbergraph_GiveRewards final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UQuestContext*                          K2Node_Event_Context;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FQuestEventPayload                     K2Node_Event_Payload;                              // 0x0010(0x0020)(ConstParm, NoDestructor)
	class AController*                            CallFunc_GetOwnerController_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UQuest*                                 CallFunc_GetQuestAsset_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UQuestCustomData*                 CallFunc_GetCustomData_ReturnValue;                // 0x0048(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UQuestData_C*                     K2Node_DynamicCast_AsQuest_Data;                   // 0x0060(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GiveRewards_Success;                      // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GiveRewards_C_ExecuteUbergraph_GiveRewards) == 0x000008, "Wrong alignment on GiveRewards_C_ExecuteUbergraph_GiveRewards");
static_assert(sizeof(GiveRewards_C_ExecuteUbergraph_GiveRewards) == 0x000070, "Wrong size on GiveRewards_C_ExecuteUbergraph_GiveRewards");
static_assert(offsetof(GiveRewards_C_ExecuteUbergraph_GiveRewards, EntryPoint) == 0x000000, "Member 'GiveRewards_C_ExecuteUbergraph_GiveRewards::EntryPoint' has a wrong offset!");
static_assert(offsetof(GiveRewards_C_ExecuteUbergraph_GiveRewards, K2Node_Event_Context) == 0x000008, "Member 'GiveRewards_C_ExecuteUbergraph_GiveRewards::K2Node_Event_Context' has a wrong offset!");
static_assert(offsetof(GiveRewards_C_ExecuteUbergraph_GiveRewards, K2Node_Event_Payload) == 0x000010, "Member 'GiveRewards_C_ExecuteUbergraph_GiveRewards::K2Node_Event_Payload' has a wrong offset!");
static_assert(offsetof(GiveRewards_C_ExecuteUbergraph_GiveRewards, CallFunc_GetOwnerController_ReturnValue) == 0x000030, "Member 'GiveRewards_C_ExecuteUbergraph_GiveRewards::CallFunc_GetOwnerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GiveRewards_C_ExecuteUbergraph_GiveRewards, CallFunc_GetQuestAsset_ReturnValue) == 0x000038, "Member 'GiveRewards_C_ExecuteUbergraph_GiveRewards::CallFunc_GetQuestAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(GiveRewards_C_ExecuteUbergraph_GiveRewards, CallFunc_K2_GetPawn_ReturnValue) == 0x000040, "Member 'GiveRewards_C_ExecuteUbergraph_GiveRewards::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GiveRewards_C_ExecuteUbergraph_GiveRewards, CallFunc_GetCustomData_ReturnValue) == 0x000048, "Member 'GiveRewards_C_ExecuteUbergraph_GiveRewards::CallFunc_GetCustomData_ReturnValue' has a wrong offset!");
static_assert(offsetof(GiveRewards_C_ExecuteUbergraph_GiveRewards, K2Node_DynamicCast_AsSurvival_Player) == 0x000050, "Member 'GiveRewards_C_ExecuteUbergraph_GiveRewards::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(GiveRewards_C_ExecuteUbergraph_GiveRewards, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'GiveRewards_C_ExecuteUbergraph_GiveRewards::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GiveRewards_C_ExecuteUbergraph_GiveRewards, K2Node_DynamicCast_AsQuest_Data) == 0x000060, "Member 'GiveRewards_C_ExecuteUbergraph_GiveRewards::K2Node_DynamicCast_AsQuest_Data' has a wrong offset!");
static_assert(offsetof(GiveRewards_C_ExecuteUbergraph_GiveRewards, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'GiveRewards_C_ExecuteUbergraph_GiveRewards::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GiveRewards_C_ExecuteUbergraph_GiveRewards, CallFunc_GiveRewards_Success) == 0x000069, "Member 'GiveRewards_C_ExecuteUbergraph_GiveRewards::CallFunc_GiveRewards_Success' has a wrong offset!");

// Function GiveRewards.GiveRewards_C.GiveRewards
// 0x06F0 (0x06F0 - 0x0000)
struct GiveRewards_C_GiveRewards final
{
public:
	const class UQuestData_C*                     QuestData;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      SurvPlayer;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             NewLocalVar;                                       // 0x0018(0x0220)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_Map_Keys_Keys;                            // 0x0238(0x0010)(ReferenceParm)
	TArray<int32>                                 CallFunc_Map_Values_Values;                        // 0x0248(0x0010)(ReferenceParm)
	int32                                         CallFunc_Map_Length_ReturnValue;                   // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_264[0x4];                                      // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0268(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_1;                         // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x027C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0284(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_285[0x3];                                      // 0x0285(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             CallFunc_GetDataTableRowFromName_OutRow;           // 0x0288(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A9[0x7];                                      // 0x04A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             K2Node_SetFieldsInStruct_StructOut;                // 0x04B0(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x06D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D4[0x4];                                      // 0x06D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FContainerPickupsInfo>          K2Node_MakeArray_Array;                            // 0x06D8(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_JSAddItem_Ad;                             // 0x06E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GiveRewards_C_GiveRewards) == 0x000008, "Wrong alignment on GiveRewards_C_GiveRewards");
static_assert(sizeof(GiveRewards_C_GiveRewards) == 0x0006F0, "Wrong size on GiveRewards_C_GiveRewards");
static_assert(offsetof(GiveRewards_C_GiveRewards, QuestData) == 0x000000, "Member 'GiveRewards_C_GiveRewards::QuestData' has a wrong offset!");
static_assert(offsetof(GiveRewards_C_GiveRewards, SurvPlayer) == 0x000008, "Member 'GiveRewards_C_GiveRewards::SurvPlayer' has a wrong offset!");
static_assert(offsetof(GiveRewards_C_GiveRewards, Success) == 0x000010, "Member 'GiveRewards_C_GiveRewards::Success' has a wrong offset!");
static_assert(offsetof(GiveRewards_C_GiveRewards, NewLocalVar) == 0x000018, "Member 'GiveRewards_C_GiveRewards::NewLocalVar' has a wrong offset!");
static_assert(offsetof(GiveRewards_C_GiveRewards, CallFunc_Map_Keys_Keys) == 0x000238, "Member 'GiveRewards_C_GiveRewards::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(GiveRewards_C_GiveRewards, CallFunc_Map_Values_Values) == 0x000248, "Member 'GiveRewards_C_GiveRewards::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(GiveRewards_C_GiveRewards, CallFunc_Map_Length_ReturnValue) == 0x000258, "Member 'GiveRewards_C_GiveRewards::CallFunc_Map_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GiveRewards_C_GiveRewards, Temp_int_Variable) == 0x00025C, "Member 'GiveRewards_C_GiveRewards::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GiveRewards_C_GiveRewards, CallFunc_Subtract_IntInt_ReturnValue) == 0x000260, "Member 'GiveRewards_C_GiveRewards::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GiveRewards_C_GiveRewards, CallFunc_Array_Get_Item) == 0x000268, "Member 'GiveRewards_C_GiveRewards::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GiveRewards_C_GiveRewards, CallFunc_Array_Get_Item_1) == 0x000278, "Member 'GiveRewards_C_GiveRewards::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(GiveRewards_C_GiveRewards, CallFunc_Conv_StringToName_ReturnValue) == 0x00027C, "Member 'GiveRewards_C_GiveRewards::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GiveRewards_C_GiveRewards, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000284, "Member 'GiveRewards_C_GiveRewards::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GiveRewards_C_GiveRewards, CallFunc_GetDataTableRowFromName_OutRow) == 0x000288, "Member 'GiveRewards_C_GiveRewards::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(GiveRewards_C_GiveRewards, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0004A8, "Member 'GiveRewards_C_GiveRewards::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GiveRewards_C_GiveRewards, K2Node_SetFieldsInStruct_StructOut) == 0x0004B0, "Member 'GiveRewards_C_GiveRewards::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");
static_assert(offsetof(GiveRewards_C_GiveRewards, CallFunc_Add_IntInt_ReturnValue) == 0x0006D0, "Member 'GiveRewards_C_GiveRewards::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GiveRewards_C_GiveRewards, K2Node_MakeArray_Array) == 0x0006D8, "Member 'GiveRewards_C_GiveRewards::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(GiveRewards_C_GiveRewards, CallFunc_JSAddItem_Ad) == 0x0006E8, "Member 'GiveRewards_C_GiveRewards::CallFunc_JSAddItem_Ad' has a wrong offset!");

}

