#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GPSViewScript

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GPSViewScript.GPSViewScript_C.ExecuteUbergraph_GPSViewScript
// 0x0068 (0x0068 - 0x0000)
struct GPSViewScript_C_ExecuteUbergraph_GPSViewScript final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UATPCCameraComponent*                   K2Node_Event_Camera;                               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UATPCCameraLocationObject*              CallFunc_GetCameraLocationObject_ReturnValue;      // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UATPCCameraComponent*                   K2Node_Event_Camera_1;                             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UATPCCameraLocationObject*              CallFunc_GetCameraLocationObject_ReturnValue_1;    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetViewRotation_ReturnValue;              // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GPSViewScript_C_ExecuteUbergraph_GPSViewScript) == 0x000008, "Wrong alignment on GPSViewScript_C_ExecuteUbergraph_GPSViewScript");
static_assert(sizeof(GPSViewScript_C_ExecuteUbergraph_GPSViewScript) == 0x000068, "Wrong size on GPSViewScript_C_ExecuteUbergraph_GPSViewScript");
static_assert(offsetof(GPSViewScript_C_ExecuteUbergraph_GPSViewScript, EntryPoint) == 0x000000, "Member 'GPSViewScript_C_ExecuteUbergraph_GPSViewScript::EntryPoint' has a wrong offset!");
static_assert(offsetof(GPSViewScript_C_ExecuteUbergraph_GPSViewScript, K2Node_Event_Camera) == 0x000008, "Member 'GPSViewScript_C_ExecuteUbergraph_GPSViewScript::K2Node_Event_Camera' has a wrong offset!");
static_assert(offsetof(GPSViewScript_C_ExecuteUbergraph_GPSViewScript, CallFunc_GetCameraLocationObject_ReturnValue) == 0x000010, "Member 'GPSViewScript_C_ExecuteUbergraph_GPSViewScript::CallFunc_GetCameraLocationObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GPSViewScript_C_ExecuteUbergraph_GPSViewScript, K2Node_Event_Camera_1) == 0x000018, "Member 'GPSViewScript_C_ExecuteUbergraph_GPSViewScript::K2Node_Event_Camera_1' has a wrong offset!");
static_assert(offsetof(GPSViewScript_C_ExecuteUbergraph_GPSViewScript, CallFunc_GetCameraLocationObject_ReturnValue_1) == 0x000020, "Member 'GPSViewScript_C_ExecuteUbergraph_GPSViewScript::CallFunc_GetCameraLocationObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GPSViewScript_C_ExecuteUbergraph_GPSViewScript, CallFunc_GetViewRotation_ReturnValue) == 0x000028, "Member 'GPSViewScript_C_ExecuteUbergraph_GPSViewScript::CallFunc_GetViewRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GPSViewScript_C_ExecuteUbergraph_GPSViewScript, CallFunc_BreakRotator_Roll) == 0x000040, "Member 'GPSViewScript_C_ExecuteUbergraph_GPSViewScript::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(GPSViewScript_C_ExecuteUbergraph_GPSViewScript, CallFunc_BreakRotator_Pitch) == 0x000044, "Member 'GPSViewScript_C_ExecuteUbergraph_GPSViewScript::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(GPSViewScript_C_ExecuteUbergraph_GPSViewScript, CallFunc_BreakRotator_Yaw) == 0x000048, "Member 'GPSViewScript_C_ExecuteUbergraph_GPSViewScript::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(GPSViewScript_C_ExecuteUbergraph_GPSViewScript, CallFunc_MakeRotator_ReturnValue) == 0x000050, "Member 'GPSViewScript_C_ExecuteUbergraph_GPSViewScript::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");

// Function GPSViewScript.GPSViewScript_C.K2_OnEnterCameraMode
// 0x0008 (0x0008 - 0x0000)
struct GPSViewScript_C_K2_OnEnterCameraMode final
{
public:
	class UATPCCameraComponent*                   Camera;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GPSViewScript_C_K2_OnEnterCameraMode) == 0x000008, "Wrong alignment on GPSViewScript_C_K2_OnEnterCameraMode");
static_assert(sizeof(GPSViewScript_C_K2_OnEnterCameraMode) == 0x000008, "Wrong size on GPSViewScript_C_K2_OnEnterCameraMode");
static_assert(offsetof(GPSViewScript_C_K2_OnEnterCameraMode, Camera) == 0x000000, "Member 'GPSViewScript_C_K2_OnEnterCameraMode::Camera' has a wrong offset!");

// Function GPSViewScript.GPSViewScript_C.K2_OnExitCameraMode
// 0x0008 (0x0008 - 0x0000)
struct GPSViewScript_C_K2_OnExitCameraMode final
{
public:
	class UATPCCameraComponent*                   Camera;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GPSViewScript_C_K2_OnExitCameraMode) == 0x000008, "Wrong alignment on GPSViewScript_C_K2_OnExitCameraMode");
static_assert(sizeof(GPSViewScript_C_K2_OnExitCameraMode) == 0x000008, "Wrong size on GPSViewScript_C_K2_OnExitCameraMode");
static_assert(offsetof(GPSViewScript_C_K2_OnExitCameraMode, Camera) == 0x000000, "Member 'GPSViewScript_C_K2_OnExitCameraMode::Camera' has a wrong offset!");

}

