#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Head_Traider_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct Head_Traider_Skeleton_AnimBlueprint.Head_Traider_Skeleton_AnimBlueprint_C.AnimBlueprintGeneratedConstantData
// 0x0107 (0x0108 - 0x0001)
struct Head_Traider_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	bool                                          __BoolProperty_16;                                 // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_17;                                // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_18;                               // 0x0008(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_19;                                // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_20;                                 // 0x0038(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_21;                                 // 0x0039(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_22;                                 // 0x003A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_23;                               // 0x0040(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_24;                                 // 0x0060(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_25;                                 // 0x0068(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0070(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00F0(0x0018)()
};
static_assert(alignof(Head_Traider_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on Head_Traider_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(Head_Traider_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData) == 0x000108, "Wrong size on Head_Traider_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(Head_Traider_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __BoolProperty_16) == 0x000001, "Member 'Head_Traider_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__BoolProperty_16' has a wrong offset!");
static_assert(offsetof(Head_Traider_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __FloatProperty_17) == 0x000004, "Member 'Head_Traider_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__FloatProperty_17' has a wrong offset!");
static_assert(offsetof(Head_Traider_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __StructProperty_18) == 0x000008, "Member 'Head_Traider_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__StructProperty_18' has a wrong offset!");
static_assert(offsetof(Head_Traider_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __FloatProperty_19) == 0x000034, "Member 'Head_Traider_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__FloatProperty_19' has a wrong offset!");
static_assert(offsetof(Head_Traider_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __BoolProperty_20) == 0x000038, "Member 'Head_Traider_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__BoolProperty_20' has a wrong offset!");
static_assert(offsetof(Head_Traider_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __EnumProperty_21) == 0x000039, "Member 'Head_Traider_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__EnumProperty_21' has a wrong offset!");
static_assert(offsetof(Head_Traider_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __ByteProperty_22) == 0x00003A, "Member 'Head_Traider_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__ByteProperty_22' has a wrong offset!");
static_assert(offsetof(Head_Traider_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __StructProperty_23) == 0x000040, "Member 'Head_Traider_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__StructProperty_23' has a wrong offset!");
static_assert(offsetof(Head_Traider_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_24) == 0x000060, "Member 'Head_Traider_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_24' has a wrong offset!");
static_assert(offsetof(Head_Traider_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_25) == 0x000068, "Member 'Head_Traider_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_25' has a wrong offset!");
static_assert(offsetof(Head_Traider_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000070, "Member 'Head_Traider_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(Head_Traider_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000F0, "Member 'Head_Traider_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

