#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HUD_MainMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Enum_WarningMessageType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass HUD_MainMenu.HUD_MainMenu_C
// 0x00A8 (0x0428 - 0x0380)
class AHUD_MainMenu_C final : public AHUD
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0380(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMediaSoundComponent*                   MediaSound;                                        // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUIW_MainMenuV2_C*                      UI;                                                // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_MainMenu_C*                          MainMenu;                                          // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_ButtonWaitingLabel_C*                WaitingLabel;                                      // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_PerkInfo_C*                        PerkInfo;                                          // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_CharacterCreate_C*                 CharacterCreate;                                   // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ServerScreen_C*                    ServerScreen;                                      // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_StartingLoading_C*                   WStartingLoading;                                  // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_PrivacyPolicy_C*                   PrivacyPolicy;                                     // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ULevelSequence*                         IntroSequence;                                     // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UWBP_CoinIntro_C*                       CoinIntro;                                         // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_disclaimer_C*                        WDisclaimer;                                       // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          LevelLoaded;                                       // 0x03F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMediaPlayer*                           MediaPlayer;                                       // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          VideoEnded;                                        // 0x0400(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_401[0x7];                                      // 0x0401(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USavePrivacyPolicy_C*                   Privacy_Policy_Save_Ref;                           // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UW_CoinStart_C*                         WCoinStart;                                        // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                W_BlackScreen;                                     // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMediaPlayer*                           MediaPlayer2;                                      // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BlockGameInput();
	void ConsoleCommands();
	void ECloseDisclaimer();
	void ECloseMovie();
	void ESkipAnyKeyScreen();
	void ExecuteUbergraph_HUD_MainMenu(int32 EntryPoint);
	void FinalizeCharacterCreation();
	void Finished_E6D02326448224EC0359FE914ED1776A();
	void GetLoginData();
	void GetPerkInfo(class UWBP_PerkInfo_C** Param_PerkInfo);
	void OnClickDirectConnect(const class FString& Address);
	void OnClickPlayButton();
	void OnPressAnyKeyInMenu();
	void PlayMovie();
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void ReleaseGameInput();
	void SelectServer(const struct FS_ServerInfo& ServerInfo);
	void SetDefaultInputMode();
	void SetErrorText(const class FString& Text);
	void SetInfoText(const class FString& Text);
	void SetResponseErrorText(const class FString& Text);
	void SetResponseText(const class FString& Text);
	void ShowKickedFromAFKWidget();
	void ShowWidget();
	void SkipAnyKeyScreen();
	void WarningMessage(class UW_DialoguePerks_C* Widget);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HUD_MainMenu_C">();
	}
	static class AHUD_MainMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHUD_MainMenu_C>();
	}
};
static_assert(alignof(AHUD_MainMenu_C) == 0x000008, "Wrong alignment on AHUD_MainMenu_C");
static_assert(sizeof(AHUD_MainMenu_C) == 0x000428, "Wrong size on AHUD_MainMenu_C");
static_assert(offsetof(AHUD_MainMenu_C, UberGraphFrame) == 0x000380, "Member 'AHUD_MainMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AHUD_MainMenu_C, MediaSound) == 0x000388, "Member 'AHUD_MainMenu_C::MediaSound' has a wrong offset!");
static_assert(offsetof(AHUD_MainMenu_C, DefaultSceneRoot) == 0x000390, "Member 'AHUD_MainMenu_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AHUD_MainMenu_C, UI) == 0x000398, "Member 'AHUD_MainMenu_C::UI' has a wrong offset!");
static_assert(offsetof(AHUD_MainMenu_C, MainMenu) == 0x0003A0, "Member 'AHUD_MainMenu_C::MainMenu' has a wrong offset!");
static_assert(offsetof(AHUD_MainMenu_C, WaitingLabel) == 0x0003A8, "Member 'AHUD_MainMenu_C::WaitingLabel' has a wrong offset!");
static_assert(offsetof(AHUD_MainMenu_C, PerkInfo) == 0x0003B0, "Member 'AHUD_MainMenu_C::PerkInfo' has a wrong offset!");
static_assert(offsetof(AHUD_MainMenu_C, CharacterCreate) == 0x0003B8, "Member 'AHUD_MainMenu_C::CharacterCreate' has a wrong offset!");
static_assert(offsetof(AHUD_MainMenu_C, ServerScreen) == 0x0003C0, "Member 'AHUD_MainMenu_C::ServerScreen' has a wrong offset!");
static_assert(offsetof(AHUD_MainMenu_C, WStartingLoading) == 0x0003C8, "Member 'AHUD_MainMenu_C::WStartingLoading' has a wrong offset!");
static_assert(offsetof(AHUD_MainMenu_C, PrivacyPolicy) == 0x0003D0, "Member 'AHUD_MainMenu_C::PrivacyPolicy' has a wrong offset!");
static_assert(offsetof(AHUD_MainMenu_C, IntroSequence) == 0x0003D8, "Member 'AHUD_MainMenu_C::IntroSequence' has a wrong offset!");
static_assert(offsetof(AHUD_MainMenu_C, CoinIntro) == 0x0003E0, "Member 'AHUD_MainMenu_C::CoinIntro' has a wrong offset!");
static_assert(offsetof(AHUD_MainMenu_C, WDisclaimer) == 0x0003E8, "Member 'AHUD_MainMenu_C::WDisclaimer' has a wrong offset!");
static_assert(offsetof(AHUD_MainMenu_C, LevelLoaded) == 0x0003F0, "Member 'AHUD_MainMenu_C::LevelLoaded' has a wrong offset!");
static_assert(offsetof(AHUD_MainMenu_C, MediaPlayer) == 0x0003F8, "Member 'AHUD_MainMenu_C::MediaPlayer' has a wrong offset!");
static_assert(offsetof(AHUD_MainMenu_C, VideoEnded) == 0x000400, "Member 'AHUD_MainMenu_C::VideoEnded' has a wrong offset!");
static_assert(offsetof(AHUD_MainMenu_C, Privacy_Policy_Save_Ref) == 0x000408, "Member 'AHUD_MainMenu_C::Privacy_Policy_Save_Ref' has a wrong offset!");
static_assert(offsetof(AHUD_MainMenu_C, WCoinStart) == 0x000410, "Member 'AHUD_MainMenu_C::WCoinStart' has a wrong offset!");
static_assert(offsetof(AHUD_MainMenu_C, W_BlackScreen) == 0x000418, "Member 'AHUD_MainMenu_C::W_BlackScreen' has a wrong offset!");
static_assert(offsetof(AHUD_MainMenu_C, MediaPlayer2) == 0x000420, "Member 'AHUD_MainMenu_C::MediaPlayer2' has a wrong offset!");

}

