#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: I_Shine

#include "Basic.hpp"


namespace SDK::Params
{

// Function I_Shine.I_Shine_C.OverlapEnd
// 0x0001 (0x0001 - 0x0000)
struct I_Shine_C_OverlapEnd final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(I_Shine_C_OverlapEnd) == 0x000001, "Wrong alignment on I_Shine_C_OverlapEnd");
static_assert(sizeof(I_Shine_C_OverlapEnd) == 0x000001, "Wrong size on I_Shine_C_OverlapEnd");
static_assert(offsetof(I_Shine_C_OverlapEnd, Success) == 0x000000, "Member 'I_Shine_C_OverlapEnd::Success' has a wrong offset!");

// Function I_Shine.I_Shine_C.OverlapStart
// 0x0001 (0x0001 - 0x0000)
struct I_Shine_C_OverlapStart final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(I_Shine_C_OverlapStart) == 0x000001, "Wrong alignment on I_Shine_C_OverlapStart");
static_assert(sizeof(I_Shine_C_OverlapStart) == 0x000001, "Wrong size on I_Shine_C_OverlapStart");
static_assert(offsetof(I_Shine_C_OverlapStart, Success) == 0x000000, "Member 'I_Shine_C_OverlapStart::Success' has a wrong offset!");

}

