#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: I_StatsInterface

#include "Basic.hpp"

#include "E_WeakeningEffect_structs.hpp"


namespace SDK::Params
{

// Function I_StatsInterface.I_StatsInterface_C.GetStatsComponent
// 0x0008 (0x0008 - 0x0000)
struct I_StatsInterface_C_GetStatsComponent final
{
public:
	class UBPC_PlayerStatsComponent_C*            PlayerStats;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(I_StatsInterface_C_GetStatsComponent) == 0x000008, "Wrong alignment on I_StatsInterface_C_GetStatsComponent");
static_assert(sizeof(I_StatsInterface_C_GetStatsComponent) == 0x000008, "Wrong size on I_StatsInterface_C_GetStatsComponent");
static_assert(offsetof(I_StatsInterface_C_GetStatsComponent, PlayerStats) == 0x000000, "Member 'I_StatsInterface_C_GetStatsComponent::PlayerStats' has a wrong offset!");

// Function I_StatsInterface.I_StatsInterface_C.StopEffectByName
// 0x0018 (0x0018 - 0x0000)
struct I_StatsInterface_C_StopEffectByName final
{
public:
	TArray<class FText>                           EffectName;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	E_WeakeningEffect                             WeakeningEffects;                                  // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RemoveAll;                                         // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x0012(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(I_StatsInterface_C_StopEffectByName) == 0x000008, "Wrong alignment on I_StatsInterface_C_StopEffectByName");
static_assert(sizeof(I_StatsInterface_C_StopEffectByName) == 0x000018, "Wrong size on I_StatsInterface_C_StopEffectByName");
static_assert(offsetof(I_StatsInterface_C_StopEffectByName, EffectName) == 0x000000, "Member 'I_StatsInterface_C_StopEffectByName::EffectName' has a wrong offset!");
static_assert(offsetof(I_StatsInterface_C_StopEffectByName, WeakeningEffects) == 0x000010, "Member 'I_StatsInterface_C_StopEffectByName::WeakeningEffects' has a wrong offset!");
static_assert(offsetof(I_StatsInterface_C_StopEffectByName, RemoveAll) == 0x000011, "Member 'I_StatsInterface_C_StopEffectByName::RemoveAll' has a wrong offset!");
static_assert(offsetof(I_StatsInterface_C_StopEffectByName, Return) == 0x000012, "Member 'I_StatsInterface_C_StopEffectByName::Return' has a wrong offset!");

// Function I_StatsInterface.I_StatsInterface_C.StopEffectByRef
// 0x0010 (0x0010 - 0x0000)
struct I_StatsInterface_C_StopEffectByRef final
{
public:
	class UEffectMain_C*                          NewParam;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(I_StatsInterface_C_StopEffectByRef) == 0x000008, "Wrong alignment on I_StatsInterface_C_StopEffectByRef");
static_assert(sizeof(I_StatsInterface_C_StopEffectByRef) == 0x000010, "Wrong size on I_StatsInterface_C_StopEffectByRef");
static_assert(offsetof(I_StatsInterface_C_StopEffectByRef, NewParam) == 0x000000, "Member 'I_StatsInterface_C_StopEffectByRef::NewParam' has a wrong offset!");
static_assert(offsetof(I_StatsInterface_C_StopEffectByRef, Return) == 0x000008, "Member 'I_StatsInterface_C_StopEffectByRef::Return' has a wrong offset!");

}

