#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: I_SurvAnimPP

#include "Basic.hpp"


namespace SDK::Params
{

// Function I_SurvAnimPP.I_SurvAnimPP_C.GetIKEnable
// 0x0001 (0x0001 - 0x0000)
struct I_SurvAnimPP_C_GetIKEnable final
{
public:
	bool                                          IsEnable;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(I_SurvAnimPP_C_GetIKEnable) == 0x000001, "Wrong alignment on I_SurvAnimPP_C_GetIKEnable");
static_assert(sizeof(I_SurvAnimPP_C_GetIKEnable) == 0x000001, "Wrong size on I_SurvAnimPP_C_GetIKEnable");
static_assert(offsetof(I_SurvAnimPP_C_GetIKEnable, IsEnable) == 0x000000, "Member 'I_SurvAnimPP_C_GetIKEnable::IsEnable' has a wrong offset!");

// Function I_SurvAnimPP.I_SurvAnimPP_C.GetPelvisHeight
// 0x0008 (0x0008 - 0x0000)
struct I_SurvAnimPP_C_GetPelvisHeight final
{
public:
	double                                        PelvisHeight;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(I_SurvAnimPP_C_GetPelvisHeight) == 0x000008, "Wrong alignment on I_SurvAnimPP_C_GetPelvisHeight");
static_assert(sizeof(I_SurvAnimPP_C_GetPelvisHeight) == 0x000008, "Wrong size on I_SurvAnimPP_C_GetPelvisHeight");
static_assert(offsetof(I_SurvAnimPP_C_GetPelvisHeight, PelvisHeight) == 0x000000, "Member 'I_SurvAnimPP_C_GetPelvisHeight::PelvisHeight' has a wrong offset!");

// Function I_SurvAnimPP.I_SurvAnimPP_C.SetIKEnable
// 0x0001 (0x0001 - 0x0000)
struct I_SurvAnimPP_C_SetIKEnable final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(I_SurvAnimPP_C_SetIKEnable) == 0x000001, "Wrong alignment on I_SurvAnimPP_C_SetIKEnable");
static_assert(sizeof(I_SurvAnimPP_C_SetIKEnable) == 0x000001, "Wrong size on I_SurvAnimPP_C_SetIKEnable");
static_assert(offsetof(I_SurvAnimPP_C_SetIKEnable, Enable) == 0x000000, "Member 'I_SurvAnimPP_C_SetIKEnable::Enable' has a wrong offset!");

}

