#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IconComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function IconComponent.IconComponent_C.GetMapIconData
// 0x0090 (0x0090 - 0x0000)
struct IconComponent_C_GetMapIconData final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Param_Icon;                                        // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Param_IconSize;                                    // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RotationYaw;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 WorldActor;                                        // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   Param_Name;                                        // 0x0040(0x0018)(Parm, OutParm)
	class FText                                   Description;                                       // 0x0058(0x0018)(Parm, OutParm)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IconComponent_C_GetMapIconData) == 0x000008, "Wrong alignment on IconComponent_C_GetMapIconData");
static_assert(sizeof(IconComponent_C_GetMapIconData) == 0x000090, "Wrong size on IconComponent_C_GetMapIconData");
static_assert(offsetof(IconComponent_C_GetMapIconData, Location) == 0x000000, "Member 'IconComponent_C_GetMapIconData::Location' has a wrong offset!");
static_assert(offsetof(IconComponent_C_GetMapIconData, Param_Icon) == 0x000018, "Member 'IconComponent_C_GetMapIconData::Param_Icon' has a wrong offset!");
static_assert(offsetof(IconComponent_C_GetMapIconData, Param_IconSize) == 0x000020, "Member 'IconComponent_C_GetMapIconData::Param_IconSize' has a wrong offset!");
static_assert(offsetof(IconComponent_C_GetMapIconData, RotationYaw) == 0x000030, "Member 'IconComponent_C_GetMapIconData::RotationYaw' has a wrong offset!");
static_assert(offsetof(IconComponent_C_GetMapIconData, WorldActor) == 0x000038, "Member 'IconComponent_C_GetMapIconData::WorldActor' has a wrong offset!");
static_assert(offsetof(IconComponent_C_GetMapIconData, Param_Name) == 0x000040, "Member 'IconComponent_C_GetMapIconData::Param_Name' has a wrong offset!");
static_assert(offsetof(IconComponent_C_GetMapIconData, Description) == 0x000058, "Member 'IconComponent_C_GetMapIconData::Description' has a wrong offset!");
static_assert(offsetof(IconComponent_C_GetMapIconData, CallFunc_GetOwner_ReturnValue) == 0x000070, "Member 'IconComponent_C_GetMapIconData::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(IconComponent_C_GetMapIconData, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000078, "Member 'IconComponent_C_GetMapIconData::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");

}

