#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IdleShake

#include "Basic.hpp"


namespace SDK::Params
{

// Function IdleShake.IdleShake_C.ExecuteUbergraph_IdleShake
// 0x0008 (0x0008 - 0x0000)
struct IdleShake_C_ExecuteUbergraph_IdleShake final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Scale;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IdleShake_C_ExecuteUbergraph_IdleShake) == 0x000004, "Wrong alignment on IdleShake_C_ExecuteUbergraph_IdleShake");
static_assert(sizeof(IdleShake_C_ExecuteUbergraph_IdleShake) == 0x000008, "Wrong size on IdleShake_C_ExecuteUbergraph_IdleShake");
static_assert(offsetof(IdleShake_C_ExecuteUbergraph_IdleShake, EntryPoint) == 0x000000, "Member 'IdleShake_C_ExecuteUbergraph_IdleShake::EntryPoint' has a wrong offset!");
static_assert(offsetof(IdleShake_C_ExecuteUbergraph_IdleShake, K2Node_Event_Scale) == 0x000004, "Member 'IdleShake_C_ExecuteUbergraph_IdleShake::K2Node_Event_Scale' has a wrong offset!");

// Function IdleShake.IdleShake_C.ReceivePlayShake_1
// 0x0004 (0x0004 - 0x0000)
struct IdleShake_C_ReceivePlayShake_1 final
{
public:
	float                                         Scale;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IdleShake_C_ReceivePlayShake_1) == 0x000004, "Wrong alignment on IdleShake_C_ReceivePlayShake_1");
static_assert(sizeof(IdleShake_C_ReceivePlayShake_1) == 0x000004, "Wrong size on IdleShake_C_ReceivePlayShake_1");
static_assert(offsetof(IdleShake_C_ReceivePlayShake_1, Scale) == 0x000000, "Member 'IdleShake_C_ReceivePlayShake_1::Scale' has a wrong offset!");

}

