#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InactiveDoor

#include "Basic.hpp"


namespace SDK::Params
{

// Function InactiveDoor.InactiveDoor_C.ExecuteUbergraph_InactiveDoor
// 0x0050 (0x0050 - 0x0000)
struct InactiveDoor_C_ExecuteUbergraph_InactiveDoor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      K2Node_Event_Player_1;                             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_Player;                               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GeneralInterface_C> K2Node_DynamicCast_AsBPI_General_Interface;        // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_GeneralInterface_C> K2Node_DynamicCast_AsBPI_General_Interface_1;      // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFMODAudioComponent*                    CallFunc_FMODPlayEventAttached_ReturnValue;        // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InactiveDoor_C_ExecuteUbergraph_InactiveDoor) == 0x000008, "Wrong alignment on InactiveDoor_C_ExecuteUbergraph_InactiveDoor");
static_assert(sizeof(InactiveDoor_C_ExecuteUbergraph_InactiveDoor) == 0x000050, "Wrong size on InactiveDoor_C_ExecuteUbergraph_InactiveDoor");
static_assert(offsetof(InactiveDoor_C_ExecuteUbergraph_InactiveDoor, EntryPoint) == 0x000000, "Member 'InactiveDoor_C_ExecuteUbergraph_InactiveDoor::EntryPoint' has a wrong offset!");
static_assert(offsetof(InactiveDoor_C_ExecuteUbergraph_InactiveDoor, K2Node_Event_Player_1) == 0x000008, "Member 'InactiveDoor_C_ExecuteUbergraph_InactiveDoor::K2Node_Event_Player_1' has a wrong offset!");
static_assert(offsetof(InactiveDoor_C_ExecuteUbergraph_InactiveDoor, K2Node_Event_Player) == 0x000010, "Member 'InactiveDoor_C_ExecuteUbergraph_InactiveDoor::K2Node_Event_Player' has a wrong offset!");
static_assert(offsetof(InactiveDoor_C_ExecuteUbergraph_InactiveDoor, K2Node_DynamicCast_AsBPI_General_Interface) == 0x000018, "Member 'InactiveDoor_C_ExecuteUbergraph_InactiveDoor::K2Node_DynamicCast_AsBPI_General_Interface' has a wrong offset!");
static_assert(offsetof(InactiveDoor_C_ExecuteUbergraph_InactiveDoor, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'InactiveDoor_C_ExecuteUbergraph_InactiveDoor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(InactiveDoor_C_ExecuteUbergraph_InactiveDoor, K2Node_DynamicCast_AsBPI_General_Interface_1) == 0x000030, "Member 'InactiveDoor_C_ExecuteUbergraph_InactiveDoor::K2Node_DynamicCast_AsBPI_General_Interface_1' has a wrong offset!");
static_assert(offsetof(InactiveDoor_C_ExecuteUbergraph_InactiveDoor, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'InactiveDoor_C_ExecuteUbergraph_InactiveDoor::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(InactiveDoor_C_ExecuteUbergraph_InactiveDoor, CallFunc_FMODPlayEventAttached_ReturnValue) == 0x000048, "Member 'InactiveDoor_C_ExecuteUbergraph_InactiveDoor::CallFunc_FMODPlayEventAttached_ReturnValue' has a wrong offset!");

// Function InactiveDoor.InactiveDoor_C.GeneratorEnabledClientSide
// 0x0008 (0x0008 - 0x0000)
struct InactiveDoor_C_GeneratorEnabledClientSide final
{
public:
	class ASurvivalPlayer_C*                      Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InactiveDoor_C_GeneratorEnabledClientSide) == 0x000008, "Wrong alignment on InactiveDoor_C_GeneratorEnabledClientSide");
static_assert(sizeof(InactiveDoor_C_GeneratorEnabledClientSide) == 0x000008, "Wrong size on InactiveDoor_C_GeneratorEnabledClientSide");
static_assert(offsetof(InactiveDoor_C_GeneratorEnabledClientSide, Player) == 0x000000, "Member 'InactiveDoor_C_GeneratorEnabledClientSide::Player' has a wrong offset!");

// Function InactiveDoor.InactiveDoor_C.OnLocalInteract
// 0x0008 (0x0008 - 0x0000)
struct InactiveDoor_C_OnLocalInteract final
{
public:
	class APawn*                                  Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InactiveDoor_C_OnLocalInteract) == 0x000008, "Wrong alignment on InactiveDoor_C_OnLocalInteract");
static_assert(sizeof(InactiveDoor_C_OnLocalInteract) == 0x000008, "Wrong size on InactiveDoor_C_OnLocalInteract");
static_assert(offsetof(InactiveDoor_C_OnLocalInteract, Player) == 0x000000, "Member 'InactiveDoor_C_OnLocalInteract::Player' has a wrong offset!");

}

