#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InGameContainerWidget

#include "Basic.hpp"

#include "Survival_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "F_FurnitureUpgradeHouseInfo_structs.hpp"
#include "ContainerPickupsInfo_structs.hpp"
#include "JSItemType_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function InGameContainerWidget.InGameContainerWidget_C.BndEvt__InGameContainerWidget_MainInventoryContainer_K2Node_ComponentBoundEvent_0_OnSlotMouseButtonDown__DelegateSignature
// 0x0028 (0x0028 - 0x0000)
struct InGameContainerWidget_C_BndEvt__InGameContainerWidget_MainInventoryContainer_K2Node_ComponentBoundEvent_0_OnSlotMouseButtonDown__DelegateSignature final
{
public:
	class UJSIContainer_C*                        Container;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJSI_Slot_C*                            SlotRef;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   Button;                                            // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(InGameContainerWidget_C_BndEvt__InGameContainerWidget_MainInventoryContainer_K2Node_ComponentBoundEvent_0_OnSlotMouseButtonDown__DelegateSignature) == 0x000008, "Wrong alignment on InGameContainerWidget_C_BndEvt__InGameContainerWidget_MainInventoryContainer_K2Node_ComponentBoundEvent_0_OnSlotMouseButtonDown__DelegateSignature");
static_assert(sizeof(InGameContainerWidget_C_BndEvt__InGameContainerWidget_MainInventoryContainer_K2Node_ComponentBoundEvent_0_OnSlotMouseButtonDown__DelegateSignature) == 0x000028, "Wrong size on InGameContainerWidget_C_BndEvt__InGameContainerWidget_MainInventoryContainer_K2Node_ComponentBoundEvent_0_OnSlotMouseButtonDown__DelegateSignature");
static_assert(offsetof(InGameContainerWidget_C_BndEvt__InGameContainerWidget_MainInventoryContainer_K2Node_ComponentBoundEvent_0_OnSlotMouseButtonDown__DelegateSignature, Container) == 0x000000, "Member 'InGameContainerWidget_C_BndEvt__InGameContainerWidget_MainInventoryContainer_K2Node_ComponentBoundEvent_0_OnSlotMouseButtonDown__DelegateSignature::Container' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_BndEvt__InGameContainerWidget_MainInventoryContainer_K2Node_ComponentBoundEvent_0_OnSlotMouseButtonDown__DelegateSignature, SlotRef) == 0x000008, "Member 'InGameContainerWidget_C_BndEvt__InGameContainerWidget_MainInventoryContainer_K2Node_ComponentBoundEvent_0_OnSlotMouseButtonDown__DelegateSignature::SlotRef' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_BndEvt__InGameContainerWidget_MainInventoryContainer_K2Node_ComponentBoundEvent_0_OnSlotMouseButtonDown__DelegateSignature, Button) == 0x000010, "Member 'InGameContainerWidget_C_BndEvt__InGameContainerWidget_MainInventoryContainer_K2Node_ComponentBoundEvent_0_OnSlotMouseButtonDown__DelegateSignature::Button' has a wrong offset!");

// Function InGameContainerWidget.InGameContainerWidget_C.BndEvt__InGameContainerWidget_MainInventoryContainer_K2Node_ComponentBoundEvent_2_OnSlotDoubleClick__DelegateSignature
// 0x0028 (0x0028 - 0x0000)
struct InGameContainerWidget_C_BndEvt__InGameContainerWidget_MainInventoryContainer_K2Node_ComponentBoundEvent_2_OnSlotDoubleClick__DelegateSignature final
{
public:
	class UJSIContainer_C*                        Container;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJSI_Slot_C*                            SlotRef;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   Button;                                            // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(InGameContainerWidget_C_BndEvt__InGameContainerWidget_MainInventoryContainer_K2Node_ComponentBoundEvent_2_OnSlotDoubleClick__DelegateSignature) == 0x000008, "Wrong alignment on InGameContainerWidget_C_BndEvt__InGameContainerWidget_MainInventoryContainer_K2Node_ComponentBoundEvent_2_OnSlotDoubleClick__DelegateSignature");
static_assert(sizeof(InGameContainerWidget_C_BndEvt__InGameContainerWidget_MainInventoryContainer_K2Node_ComponentBoundEvent_2_OnSlotDoubleClick__DelegateSignature) == 0x000028, "Wrong size on InGameContainerWidget_C_BndEvt__InGameContainerWidget_MainInventoryContainer_K2Node_ComponentBoundEvent_2_OnSlotDoubleClick__DelegateSignature");
static_assert(offsetof(InGameContainerWidget_C_BndEvt__InGameContainerWidget_MainInventoryContainer_K2Node_ComponentBoundEvent_2_OnSlotDoubleClick__DelegateSignature, Container) == 0x000000, "Member 'InGameContainerWidget_C_BndEvt__InGameContainerWidget_MainInventoryContainer_K2Node_ComponentBoundEvent_2_OnSlotDoubleClick__DelegateSignature::Container' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_BndEvt__InGameContainerWidget_MainInventoryContainer_K2Node_ComponentBoundEvent_2_OnSlotDoubleClick__DelegateSignature, SlotRef) == 0x000008, "Member 'InGameContainerWidget_C_BndEvt__InGameContainerWidget_MainInventoryContainer_K2Node_ComponentBoundEvent_2_OnSlotDoubleClick__DelegateSignature::SlotRef' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_BndEvt__InGameContainerWidget_MainInventoryContainer_K2Node_ComponentBoundEvent_2_OnSlotDoubleClick__DelegateSignature, Button) == 0x000010, "Member 'InGameContainerWidget_C_BndEvt__InGameContainerWidget_MainInventoryContainer_K2Node_ComponentBoundEvent_2_OnSlotDoubleClick__DelegateSignature::Button' has a wrong offset!");

// Function InGameContainerWidget.InGameContainerWidget_C.BndEvt__InGameContainerWidget_MainInventoryContainer_K2Node_ComponentBoundEvent_4_DropInfo_ContainerToContainer__DelegateSignature
// 0x0028 (0x0028 - 0x0000)
struct InGameContainerWidget_C_BndEvt__InGameContainerWidget_MainInventoryContainer_K2Node_ComponentBoundEvent_4_DropInfo_ContainerToContainer__DelegateSignature final
{
public:
	class UJSIContainer_C*                        From;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJSIContainer_C*                        To;                                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJSI_Slot_C*                            FromSlotRef;                                       // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJSI_Slot_C*                            ToSlotRef;                                         // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          ToEmptySlot_;                                      // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MovedAll_;                                         // 0x0021(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InGameContainerWidget_C_BndEvt__InGameContainerWidget_MainInventoryContainer_K2Node_ComponentBoundEvent_4_DropInfo_ContainerToContainer__DelegateSignature) == 0x000008, "Wrong alignment on InGameContainerWidget_C_BndEvt__InGameContainerWidget_MainInventoryContainer_K2Node_ComponentBoundEvent_4_DropInfo_ContainerToContainer__DelegateSignature");
static_assert(sizeof(InGameContainerWidget_C_BndEvt__InGameContainerWidget_MainInventoryContainer_K2Node_ComponentBoundEvent_4_DropInfo_ContainerToContainer__DelegateSignature) == 0x000028, "Wrong size on InGameContainerWidget_C_BndEvt__InGameContainerWidget_MainInventoryContainer_K2Node_ComponentBoundEvent_4_DropInfo_ContainerToContainer__DelegateSignature");
static_assert(offsetof(InGameContainerWidget_C_BndEvt__InGameContainerWidget_MainInventoryContainer_K2Node_ComponentBoundEvent_4_DropInfo_ContainerToContainer__DelegateSignature, From) == 0x000000, "Member 'InGameContainerWidget_C_BndEvt__InGameContainerWidget_MainInventoryContainer_K2Node_ComponentBoundEvent_4_DropInfo_ContainerToContainer__DelegateSignature::From' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_BndEvt__InGameContainerWidget_MainInventoryContainer_K2Node_ComponentBoundEvent_4_DropInfo_ContainerToContainer__DelegateSignature, To) == 0x000008, "Member 'InGameContainerWidget_C_BndEvt__InGameContainerWidget_MainInventoryContainer_K2Node_ComponentBoundEvent_4_DropInfo_ContainerToContainer__DelegateSignature::To' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_BndEvt__InGameContainerWidget_MainInventoryContainer_K2Node_ComponentBoundEvent_4_DropInfo_ContainerToContainer__DelegateSignature, FromSlotRef) == 0x000010, "Member 'InGameContainerWidget_C_BndEvt__InGameContainerWidget_MainInventoryContainer_K2Node_ComponentBoundEvent_4_DropInfo_ContainerToContainer__DelegateSignature::FromSlotRef' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_BndEvt__InGameContainerWidget_MainInventoryContainer_K2Node_ComponentBoundEvent_4_DropInfo_ContainerToContainer__DelegateSignature, ToSlotRef) == 0x000018, "Member 'InGameContainerWidget_C_BndEvt__InGameContainerWidget_MainInventoryContainer_K2Node_ComponentBoundEvent_4_DropInfo_ContainerToContainer__DelegateSignature::ToSlotRef' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_BndEvt__InGameContainerWidget_MainInventoryContainer_K2Node_ComponentBoundEvent_4_DropInfo_ContainerToContainer__DelegateSignature, ToEmptySlot_) == 0x000020, "Member 'InGameContainerWidget_C_BndEvt__InGameContainerWidget_MainInventoryContainer_K2Node_ComponentBoundEvent_4_DropInfo_ContainerToContainer__DelegateSignature::ToEmptySlot_' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_BndEvt__InGameContainerWidget_MainInventoryContainer_K2Node_ComponentBoundEvent_4_DropInfo_ContainerToContainer__DelegateSignature, MovedAll_) == 0x000021, "Member 'InGameContainerWidget_C_BndEvt__InGameContainerWidget_MainInventoryContainer_K2Node_ComponentBoundEvent_4_DropInfo_ContainerToContainer__DelegateSignature::MovedAll_' has a wrong offset!");

// Function InGameContainerWidget.InGameContainerWidget_C.BndEvt__InGameContainerWidget_ScrollBox_68_K2Node_ComponentBoundEvent_3_OnUserScrolledEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct InGameContainerWidget_C_BndEvt__InGameContainerWidget_ScrollBox_68_K2Node_ComponentBoundEvent_3_OnUserScrolledEvent__DelegateSignature final
{
public:
	float                                         CurrentOffset;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InGameContainerWidget_C_BndEvt__InGameContainerWidget_ScrollBox_68_K2Node_ComponentBoundEvent_3_OnUserScrolledEvent__DelegateSignature) == 0x000004, "Wrong alignment on InGameContainerWidget_C_BndEvt__InGameContainerWidget_ScrollBox_68_K2Node_ComponentBoundEvent_3_OnUserScrolledEvent__DelegateSignature");
static_assert(sizeof(InGameContainerWidget_C_BndEvt__InGameContainerWidget_ScrollBox_68_K2Node_ComponentBoundEvent_3_OnUserScrolledEvent__DelegateSignature) == 0x000004, "Wrong size on InGameContainerWidget_C_BndEvt__InGameContainerWidget_ScrollBox_68_K2Node_ComponentBoundEvent_3_OnUserScrolledEvent__DelegateSignature");
static_assert(offsetof(InGameContainerWidget_C_BndEvt__InGameContainerWidget_ScrollBox_68_K2Node_ComponentBoundEvent_3_OnUserScrolledEvent__DelegateSignature, CurrentOffset) == 0x000000, "Member 'InGameContainerWidget_C_BndEvt__InGameContainerWidget_ScrollBox_68_K2Node_ComponentBoundEvent_3_OnUserScrolledEvent__DelegateSignature::CurrentOffset' has a wrong offset!");

// Function InGameContainerWidget.InGameContainerWidget_C.CanAddItem
// 0x0058 (0x0058 - 0x0000)
struct InGameContainerWidget_C_CanAddItem final
{
public:
	class UJSIContainer_C*                        ContainerRef;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJSI_Slot_C*                            SlotRef;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetEquipmentContainer_Result;             // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJSIContainer_C*                        CallFunc_GetEquipmentContainer_Container;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanAddItem_Can;                           // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_CanAddItem_SlotIndex;                     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanAddItem_CanStack;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJSI_Slot_C*                            CallFunc_CanAddItem_ItemRef;                       // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEquipped__ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsItemCanBeEquipped_Result;               // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InGameContainerWidget_C_CanAddItem) == 0x000008, "Wrong alignment on InGameContainerWidget_C_CanAddItem");
static_assert(sizeof(InGameContainerWidget_C_CanAddItem) == 0x000058, "Wrong size on InGameContainerWidget_C_CanAddItem");
static_assert(offsetof(InGameContainerWidget_C_CanAddItem, ContainerRef) == 0x000000, "Member 'InGameContainerWidget_C_CanAddItem::ContainerRef' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_CanAddItem, SlotRef) == 0x000008, "Member 'InGameContainerWidget_C_CanAddItem::SlotRef' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_CanAddItem, Result) == 0x000010, "Member 'InGameContainerWidget_C_CanAddItem::Result' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_CanAddItem, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000018, "Member 'InGameContainerWidget_C_CanAddItem::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_CanAddItem, K2Node_DynamicCast_AsSurvival_Player) == 0x000020, "Member 'InGameContainerWidget_C_CanAddItem::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_CanAddItem, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'InGameContainerWidget_C_CanAddItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_CanAddItem, CallFunc_GetEquipmentContainer_Result) == 0x000029, "Member 'InGameContainerWidget_C_CanAddItem::CallFunc_GetEquipmentContainer_Result' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_CanAddItem, CallFunc_GetEquipmentContainer_Container) == 0x000030, "Member 'InGameContainerWidget_C_CanAddItem::CallFunc_GetEquipmentContainer_Container' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_CanAddItem, CallFunc_CanAddItem_Can) == 0x000038, "Member 'InGameContainerWidget_C_CanAddItem::CallFunc_CanAddItem_Can' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_CanAddItem, CallFunc_CanAddItem_SlotIndex) == 0x00003C, "Member 'InGameContainerWidget_C_CanAddItem::CallFunc_CanAddItem_SlotIndex' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_CanAddItem, CallFunc_CanAddItem_CanStack) == 0x000040, "Member 'InGameContainerWidget_C_CanAddItem::CallFunc_CanAddItem_CanStack' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_CanAddItem, CallFunc_CanAddItem_ItemRef) == 0x000048, "Member 'InGameContainerWidget_C_CanAddItem::CallFunc_CanAddItem_ItemRef' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_CanAddItem, CallFunc_IsEquipped__ReturnValue) == 0x000050, "Member 'InGameContainerWidget_C_CanAddItem::CallFunc_IsEquipped__ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_CanAddItem, CallFunc_IsItemCanBeEquipped_Result) == 0x000051, "Member 'InGameContainerWidget_C_CanAddItem::CallFunc_IsItemCanBeEquipped_Result' has a wrong offset!");

// Function InGameContainerWidget.InGameContainerWidget_C.CheckInventoryContainer
// 0x0020 (0x0020 - 0x0000)
struct InGameContainerWidget_C_CheckInventoryContainer final
{
public:
	class UObject*                                StashContainer;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPocketContainer_Result;                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJSIContainer_C*                        CallFunc_GetPocketContainer_Container;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InGameContainerWidget_C_CheckInventoryContainer) == 0x000008, "Wrong alignment on InGameContainerWidget_C_CheckInventoryContainer");
static_assert(sizeof(InGameContainerWidget_C_CheckInventoryContainer) == 0x000020, "Wrong size on InGameContainerWidget_C_CheckInventoryContainer");
static_assert(offsetof(InGameContainerWidget_C_CheckInventoryContainer, StashContainer) == 0x000000, "Member 'InGameContainerWidget_C_CheckInventoryContainer::StashContainer' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_CheckInventoryContainer, ReturnValue) == 0x000008, "Member 'InGameContainerWidget_C_CheckInventoryContainer::ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_CheckInventoryContainer, CallFunc_GetPocketContainer_Result) == 0x000009, "Member 'InGameContainerWidget_C_CheckInventoryContainer::CallFunc_GetPocketContainer_Result' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_CheckInventoryContainer, CallFunc_GetPocketContainer_Container) == 0x000010, "Member 'InGameContainerWidget_C_CheckInventoryContainer::CallFunc_GetPocketContainer_Container' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_CheckInventoryContainer, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000018, "Member 'InGameContainerWidget_C_CheckInventoryContainer::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function InGameContainerWidget.InGameContainerWidget_C.EquipItem
// 0x0100 (0x0100 - 0x0000)
struct InGameContainerWidget_C_EquipItem final
{
public:
	class UJSIContainer_C*                        Container_Ref;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJSI_Slot_C*                            Slot_Ref;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Equipped;                                          // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJSIContainer_C*                        Temp_object_Variable;                              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJSIContainer_C*                        Temp_object_Variable_1;                            // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJSIContainer_C*                        Temp_object_Variable_2;                            // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJSIContainer_C*                        Temp_object_Variable_3;                            // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJSIContainer_C*                        Temp_object_Variable_4;                            // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJSIContainer_C*                        Temp_object_Variable_5;                            // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJSIContainer_C*                        Temp_object_Variable_6;                            // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJSIContainer_C*                        Temp_object_Variable_7;                            // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJSIContainer_C*                        Temp_object_Variable_8;                            // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJSIContainer_C*                        Temp_object_Variable_9;                            // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJSIContainer_C*                        Temp_object_Variable_10;                           // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJSIContainer_C*                        Temp_object_Variable_11;                           // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJSIContainer_C*                        Temp_object_Variable_12;                           // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJSIContainer_C*                        Temp_object_Variable_13;                           // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJSIContainer_C*                        Temp_object_Variable_14;                           // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJSIContainer_C*                        Temp_object_Variable_15;                           // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJSIContainer_C*                        Temp_object_Variable_16;                           // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EJSItemType                                   Temp_byte_Variable;                                // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEquipped__ReturnValue;                  // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BB[0x5];                                       // 0x00BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UJSIContainer_C*                        K2Node_Select_Default;                             // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UJSIContainer_C*                        K2Node_Select_Default_1;                           // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameHUD_C>        K2Node_DynamicCast_AsBPI_Game_HUD;                 // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F2[0x6];                                       // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMPInGameInventory_C*                   CallFunc_GetInventoryWidget_Widget;                // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InGameContainerWidget_C_EquipItem) == 0x000008, "Wrong alignment on InGameContainerWidget_C_EquipItem");
static_assert(sizeof(InGameContainerWidget_C_EquipItem) == 0x000100, "Wrong size on InGameContainerWidget_C_EquipItem");
static_assert(offsetof(InGameContainerWidget_C_EquipItem, Container_Ref) == 0x000000, "Member 'InGameContainerWidget_C_EquipItem::Container_Ref' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_EquipItem, Slot_Ref) == 0x000008, "Member 'InGameContainerWidget_C_EquipItem::Slot_Ref' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_EquipItem, Equipped) == 0x000010, "Member 'InGameContainerWidget_C_EquipItem::Equipped' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_EquipItem, Temp_object_Variable) == 0x000018, "Member 'InGameContainerWidget_C_EquipItem::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_EquipItem, Temp_object_Variable_1) == 0x000020, "Member 'InGameContainerWidget_C_EquipItem::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_EquipItem, Temp_object_Variable_2) == 0x000028, "Member 'InGameContainerWidget_C_EquipItem::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_EquipItem, Temp_object_Variable_3) == 0x000030, "Member 'InGameContainerWidget_C_EquipItem::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_EquipItem, Temp_object_Variable_4) == 0x000038, "Member 'InGameContainerWidget_C_EquipItem::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_EquipItem, Temp_object_Variable_5) == 0x000040, "Member 'InGameContainerWidget_C_EquipItem::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_EquipItem, Temp_object_Variable_6) == 0x000048, "Member 'InGameContainerWidget_C_EquipItem::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_EquipItem, Temp_object_Variable_7) == 0x000050, "Member 'InGameContainerWidget_C_EquipItem::Temp_object_Variable_7' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_EquipItem, Temp_object_Variable_8) == 0x000058, "Member 'InGameContainerWidget_C_EquipItem::Temp_object_Variable_8' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_EquipItem, Temp_object_Variable_9) == 0x000060, "Member 'InGameContainerWidget_C_EquipItem::Temp_object_Variable_9' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_EquipItem, Temp_object_Variable_10) == 0x000068, "Member 'InGameContainerWidget_C_EquipItem::Temp_object_Variable_10' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_EquipItem, Temp_object_Variable_11) == 0x000070, "Member 'InGameContainerWidget_C_EquipItem::Temp_object_Variable_11' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_EquipItem, Temp_object_Variable_12) == 0x000078, "Member 'InGameContainerWidget_C_EquipItem::Temp_object_Variable_12' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_EquipItem, Temp_object_Variable_13) == 0x000080, "Member 'InGameContainerWidget_C_EquipItem::Temp_object_Variable_13' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_EquipItem, Temp_object_Variable_14) == 0x000088, "Member 'InGameContainerWidget_C_EquipItem::Temp_object_Variable_14' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_EquipItem, Temp_object_Variable_15) == 0x000090, "Member 'InGameContainerWidget_C_EquipItem::Temp_object_Variable_15' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_EquipItem, Temp_object_Variable_16) == 0x000098, "Member 'InGameContainerWidget_C_EquipItem::Temp_object_Variable_16' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_EquipItem, Temp_byte_Variable) == 0x0000A0, "Member 'InGameContainerWidget_C_EquipItem::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_EquipItem, CallFunc_GetPlayerCharacter_ReturnValue) == 0x0000A8, "Member 'InGameContainerWidget_C_EquipItem::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_EquipItem, K2Node_DynamicCast_AsSurvival_Player) == 0x0000B0, "Member 'InGameContainerWidget_C_EquipItem::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_EquipItem, K2Node_DynamicCast_bSuccess) == 0x0000B8, "Member 'InGameContainerWidget_C_EquipItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_EquipItem, CallFunc_IsEquipped__ReturnValue) == 0x0000B9, "Member 'InGameContainerWidget_C_EquipItem::CallFunc_IsEquipped__ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_EquipItem, Temp_bool_Variable) == 0x0000BA, "Member 'InGameContainerWidget_C_EquipItem::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_EquipItem, CallFunc_GetPlayerController_ReturnValue) == 0x0000C0, "Member 'InGameContainerWidget_C_EquipItem::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_EquipItem, K2Node_Select_Default) == 0x0000C8, "Member 'InGameContainerWidget_C_EquipItem::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_EquipItem, CallFunc_GetHUD_ReturnValue) == 0x0000D0, "Member 'InGameContainerWidget_C_EquipItem::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_EquipItem, K2Node_Select_Default_1) == 0x0000D8, "Member 'InGameContainerWidget_C_EquipItem::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_EquipItem, K2Node_DynamicCast_AsBPI_Game_HUD) == 0x0000E0, "Member 'InGameContainerWidget_C_EquipItem::K2Node_DynamicCast_AsBPI_Game_HUD' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_EquipItem, K2Node_DynamicCast_bSuccess_1) == 0x0000F0, "Member 'InGameContainerWidget_C_EquipItem::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_EquipItem, CallFunc_IsValid_ReturnValue) == 0x0000F1, "Member 'InGameContainerWidget_C_EquipItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_EquipItem, CallFunc_GetInventoryWidget_Widget) == 0x0000F8, "Member 'InGameContainerWidget_C_EquipItem::CallFunc_GetInventoryWidget_Widget' has a wrong offset!");

// Function InGameContainerWidget.InGameContainerWidget_C.ExecuteUbergraph_InGameContainerWidget
// 0x0318 (0x0318 - 0x0000)
struct InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJSIContainer_C*                        K2Node_ComponentBoundEvent_From;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJSIContainer_C*                        K2Node_ComponentBoundEvent_To;                     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJSI_Slot_C*                            K2Node_ComponentBoundEvent_FromSlotRef;            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJSI_Slot_C*                            K2Node_ComponentBoundEvent_ToSlotRef;              // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_ToEmptySlot_;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_MovedAll_;              // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckInventoryContainer_ReturnValue;      // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UpdateStorageTutorialPointer_ItemsFound;  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0030(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UJSIContainer_C* Container, class UJSI_Slot_C* SlotRef, const struct FKey& Button)> K2Node_CreateDelegate_OutputDelegate;              // 0x006C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x00A0(0x0010)(ReferenceParm)
	struct FF_FurnitureUpgradeHouseInfo           CallFunc_GetDataTableRowFromName_OutRow;           // 0x00B0(0x0060)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJSI_Slot_C*                            CallFunc_Array_Get_Item;                           // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0188(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJSIContainer_C*                        K2Node_CustomEvent_Container;                      // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJSI_Slot_C*                            K2Node_CustomEvent_SlotRef;                        // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_CustomEvent_Button;                         // 0x01C8(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x3];                                      // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvPC_C*                              K2Node_DynamicCast_AsSurv_PC;                      // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FA[0x2];                                      // 0x01FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJSIContainer_C*                        K2Node_ComponentBoundEvent_Container_1;            // 0x0200(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJSI_Slot_C*                            K2Node_ComponentBoundEvent_SlotRef_1;              // 0x0208(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_ComponentBoundEvent_Button_1;               // 0x0210(0x0018)(HasGetValueTypeHash)
	class UJSIContainer_C*                        K2Node_ComponentBoundEvent_Container;              // 0x0228(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJSI_Slot_C*                            K2Node_ComponentBoundEvent_SlotRef;                // 0x0230(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_ComponentBoundEvent_Button;                 // 0x0238(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_1;          // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsBeginner_IsBeginner;                 // 0x0252(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0253(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_2;          // 0x0254(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0255(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0256(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanAddItem_result;                        // 0x0257(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFMODAudioComponent*                    CallFunc_PlayEventAttached_ReturnValue;            // 0x0258(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCount_Count;                           // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CountOut_OutInt;                          // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_UpdateCount_Count;                        // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x026C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsBeginner_IsBeginner_1;               // 0x026D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckTutorial_Locked;                     // 0x026E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckTutorial_IsCase;                     // 0x026F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryToAddItemToStashContainer_Locaked;     // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_GI_Survival_C>      K2Node_DynamicCast_AsI_GI_Survival;                // 0x0280(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_291[0x3];                                      // 0x0291(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UJSIContainer_C* FromContainer, class UJSIContainer_C* ToContainer, class UJSI_Slot_C* SlotReceiver, class UJSI_Slot_C* SlotDropped, bool SlotDroppedRemoved_)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0294(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_CurrentOffset;          // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FF_FurnitureUpgradeHouseInfo           CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x02B0(0x0060)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryToAddItemToStashContainer_Locaked_1;   // 0x0311(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget) == 0x000008, "Wrong alignment on InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget");
static_assert(sizeof(InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget) == 0x000318, "Wrong size on InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget");
static_assert(offsetof(InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget, EntryPoint) == 0x000000, "Member 'InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget, K2Node_Event_IsDesignTime) == 0x000004, "Member 'InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget, K2Node_ComponentBoundEvent_From) == 0x000008, "Member 'InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget::K2Node_ComponentBoundEvent_From' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget, K2Node_ComponentBoundEvent_To) == 0x000010, "Member 'InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget::K2Node_ComponentBoundEvent_To' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget, K2Node_ComponentBoundEvent_FromSlotRef) == 0x000018, "Member 'InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget::K2Node_ComponentBoundEvent_FromSlotRef' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget, K2Node_ComponentBoundEvent_ToSlotRef) == 0x000020, "Member 'InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget::K2Node_ComponentBoundEvent_ToSlotRef' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget, K2Node_ComponentBoundEvent_ToEmptySlot_) == 0x000028, "Member 'InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget::K2Node_ComponentBoundEvent_ToEmptySlot_' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget, K2Node_ComponentBoundEvent_MovedAll_) == 0x000029, "Member 'InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget::K2Node_ComponentBoundEvent_MovedAll_' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget, CallFunc_CheckInventoryContainer_ReturnValue) == 0x00002A, "Member 'InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget::CallFunc_CheckInventoryContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget, CallFunc_IsValid_ReturnValue) == 0x00002B, "Member 'InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget, CallFunc_UpdateStorageTutorialPointer_ItemsFound) == 0x00002C, "Member 'InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget::CallFunc_UpdateStorageTutorialPointer_ItemsFound' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget, K2Node_Event_MyGeometry) == 0x000030, "Member 'InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget, K2Node_Event_InDeltaTime) == 0x000068, "Member 'InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget, K2Node_CreateDelegate_OutputDelegate) == 0x00006C, "Member 'InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000080, "Member 'InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget, K2Node_DynamicCast_AsSurvival_Player) == 0x000088, "Member 'InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget, Temp_int_Array_Index_Variable) == 0x000094, "Member 'InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget, CallFunc_IsValid_ReturnValue_1) == 0x000098, "Member 'InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget, CallFunc_GetDataTableRowNames_OutRowNames) == 0x0000A0, "Member 'InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget, CallFunc_GetDataTableRowFromName_OutRow) == 0x0000B0, "Member 'InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000110, "Member 'InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget, CallFunc_Array_Get_Item) == 0x000118, "Member 'InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget, CallFunc_Conv_TextToString_ReturnValue) == 0x000120, "Member 'InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget, CallFunc_Conv_IntToString_ReturnValue) == 0x000130, "Member 'InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget, CallFunc_Concat_StrStr_ReturnValue) == 0x000140, "Member 'InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000150, "Member 'InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget, CallFunc_Array_Length_ReturnValue) == 0x000160, "Member 'InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000168, "Member 'InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000178, "Member 'InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget, K2Node_CreateDelegate_OutputDelegate_1) == 0x000188, "Member 'InGameContainerWidget_C_ExecuteUbergraph_InGameContainerWidget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
