#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InitTowersZones

#include "Basic.hpp"

#include "QuestFramework_structs.hpp"


namespace SDK::Params
{

// Function InitTowersZones.InitTowersZones_C.ExecuteEvent
// 0x0028 (0x0028 - 0x0000)
struct InitTowersZones_C_ExecuteEvent final
{
public:
	class UQuestContext*                          Context;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FQuestEventPayload                     Payload;                                           // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(InitTowersZones_C_ExecuteEvent) == 0x000008, "Wrong alignment on InitTowersZones_C_ExecuteEvent");
static_assert(sizeof(InitTowersZones_C_ExecuteEvent) == 0x000028, "Wrong size on InitTowersZones_C_ExecuteEvent");
static_assert(offsetof(InitTowersZones_C_ExecuteEvent, Context) == 0x000000, "Member 'InitTowersZones_C_ExecuteEvent::Context' has a wrong offset!");
static_assert(offsetof(InitTowersZones_C_ExecuteEvent, Payload) == 0x000008, "Member 'InitTowersZones_C_ExecuteEvent::Payload' has a wrong offset!");

// Function InitTowersZones.InitTowersZones_C.ExecuteUbergraph_InitTowersZones
// 0x00C0 (0x00C0 - 0x0000)
struct InitTowersZones_C_ExecuteUbergraph_InitTowersZones final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQuestContext*                          K2Node_Event_Context;                              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FQuestEventPayload                     K2Node_Event_Payload;                              // 0x0018(0x0020)(ConstParm, NoDestructor)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UQuest*                                 CallFunc_GetQuestAsset_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GS_TDB_C>         K2Node_DynamicCast_AsBPI_GS_TDB;                   // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetOwnerController_ReturnValue;           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_QuestZone_C*>                CallFunc_GetTowersZones_Zones;                     // 0x0068(0x0010)(ReferenceParm)
	class ASurvPC_C*                              K2Node_DynamicCast_AsSurv_PC;                      // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_QuestZone_C*                        CallFunc_Array_Get_Item;                           // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_QuestZone_Towers_C*                 K2Node_DynamicCast_AsBP_Quest_Zone_Towers;         // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuestVariable                         K2Node_MakeStruct_QuestVariable;                   // 0x00B0(0x000C)(NoDestructor)
};
static_assert(alignof(InitTowersZones_C_ExecuteUbergraph_InitTowersZones) == 0x000008, "Wrong alignment on InitTowersZones_C_ExecuteUbergraph_InitTowersZones");
static_assert(sizeof(InitTowersZones_C_ExecuteUbergraph_InitTowersZones) == 0x0000C0, "Wrong size on InitTowersZones_C_ExecuteUbergraph_InitTowersZones");
static_assert(offsetof(InitTowersZones_C_ExecuteUbergraph_InitTowersZones, EntryPoint) == 0x000000, "Member 'InitTowersZones_C_ExecuteUbergraph_InitTowersZones::EntryPoint' has a wrong offset!");
static_assert(offsetof(InitTowersZones_C_ExecuteUbergraph_InitTowersZones, Temp_int_Array_Index_Variable) == 0x000004, "Member 'InitTowersZones_C_ExecuteUbergraph_InitTowersZones::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(InitTowersZones_C_ExecuteUbergraph_InitTowersZones, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'InitTowersZones_C_ExecuteUbergraph_InitTowersZones::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(InitTowersZones_C_ExecuteUbergraph_InitTowersZones, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'InitTowersZones_C_ExecuteUbergraph_InitTowersZones::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InitTowersZones_C_ExecuteUbergraph_InitTowersZones, K2Node_Event_Context) == 0x000010, "Member 'InitTowersZones_C_ExecuteUbergraph_InitTowersZones::K2Node_Event_Context' has a wrong offset!");
static_assert(offsetof(InitTowersZones_C_ExecuteUbergraph_InitTowersZones, K2Node_Event_Payload) == 0x000018, "Member 'InitTowersZones_C_ExecuteUbergraph_InitTowersZones::K2Node_Event_Payload' has a wrong offset!");
static_assert(offsetof(InitTowersZones_C_ExecuteUbergraph_InitTowersZones, CallFunc_GetGameState_ReturnValue) == 0x000038, "Member 'InitTowersZones_C_ExecuteUbergraph_InitTowersZones::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(InitTowersZones_C_ExecuteUbergraph_InitTowersZones, CallFunc_GetQuestAsset_ReturnValue) == 0x000040, "Member 'InitTowersZones_C_ExecuteUbergraph_InitTowersZones::CallFunc_GetQuestAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(InitTowersZones_C_ExecuteUbergraph_InitTowersZones, K2Node_DynamicCast_AsBPI_GS_TDB) == 0x000048, "Member 'InitTowersZones_C_ExecuteUbergraph_InitTowersZones::K2Node_DynamicCast_AsBPI_GS_TDB' has a wrong offset!");
static_assert(offsetof(InitTowersZones_C_ExecuteUbergraph_InitTowersZones, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'InitTowersZones_C_ExecuteUbergraph_InitTowersZones::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(InitTowersZones_C_ExecuteUbergraph_InitTowersZones, CallFunc_GetOwnerController_ReturnValue) == 0x000060, "Member 'InitTowersZones_C_ExecuteUbergraph_InitTowersZones::CallFunc_GetOwnerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(InitTowersZones_C_ExecuteUbergraph_InitTowersZones, CallFunc_GetTowersZones_Zones) == 0x000068, "Member 'InitTowersZones_C_ExecuteUbergraph_InitTowersZones::CallFunc_GetTowersZones_Zones' has a wrong offset!");
static_assert(offsetof(InitTowersZones_C_ExecuteUbergraph_InitTowersZones, K2Node_DynamicCast_AsSurv_PC) == 0x000078, "Member 'InitTowersZones_C_ExecuteUbergraph_InitTowersZones::K2Node_DynamicCast_AsSurv_PC' has a wrong offset!");
static_assert(offsetof(InitTowersZones_C_ExecuteUbergraph_InitTowersZones, K2Node_DynamicCast_bSuccess_1) == 0x000080, "Member 'InitTowersZones_C_ExecuteUbergraph_InitTowersZones::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(InitTowersZones_C_ExecuteUbergraph_InitTowersZones, CallFunc_Array_Get_Item) == 0x000088, "Member 'InitTowersZones_C_ExecuteUbergraph_InitTowersZones::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(InitTowersZones_C_ExecuteUbergraph_InitTowersZones, K2Node_DynamicCast_AsBP_Quest_Zone_Towers) == 0x000090, "Member 'InitTowersZones_C_ExecuteUbergraph_InitTowersZones::K2Node_DynamicCast_AsBP_Quest_Zone_Towers' has a wrong offset!");
static_assert(offsetof(InitTowersZones_C_ExecuteUbergraph_InitTowersZones, K2Node_DynamicCast_bSuccess_2) == 0x000098, "Member 'InitTowersZones_C_ExecuteUbergraph_InitTowersZones::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(InitTowersZones_C_ExecuteUbergraph_InitTowersZones, CallFunc_Array_Add_ReturnValue) == 0x00009C, "Member 'InitTowersZones_C_ExecuteUbergraph_InitTowersZones::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(InitTowersZones_C_ExecuteUbergraph_InitTowersZones, CallFunc_Array_Contains_ReturnValue) == 0x0000A0, "Member 'InitTowersZones_C_ExecuteUbergraph_InitTowersZones::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(InitTowersZones_C_ExecuteUbergraph_InitTowersZones, CallFunc_Array_Length_ReturnValue) == 0x0000A4, "Member 'InitTowersZones_C_ExecuteUbergraph_InitTowersZones::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(InitTowersZones_C_ExecuteUbergraph_InitTowersZones, CallFunc_Less_IntInt_ReturnValue) == 0x0000A8, "Member 'InitTowersZones_C_ExecuteUbergraph_InitTowersZones::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InitTowersZones_C_ExecuteUbergraph_InitTowersZones, CallFunc_Array_Length_ReturnValue_1) == 0x0000AC, "Member 'InitTowersZones_C_ExecuteUbergraph_InitTowersZones::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InitTowersZones_C_ExecuteUbergraph_InitTowersZones, K2Node_MakeStruct_QuestVariable) == 0x0000B0, "Member 'InitTowersZones_C_ExecuteUbergraph_InitTowersZones::K2Node_MakeStruct_QuestVariable' has a wrong offset!");

}

