#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Init3DWidget

#include "Basic.hpp"

#include "QuestFramework_structs.hpp"


namespace SDK::Params
{

// Function Init3DWidget.Init3DWidget_C.ExecuteEvent
// 0x0028 (0x0028 - 0x0000)
struct Init3DWidget_C_ExecuteEvent final
{
public:
	class UQuestContext*                          Context;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FQuestEventPayload                     Payload;                                           // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(Init3DWidget_C_ExecuteEvent) == 0x000008, "Wrong alignment on Init3DWidget_C_ExecuteEvent");
static_assert(sizeof(Init3DWidget_C_ExecuteEvent) == 0x000028, "Wrong size on Init3DWidget_C_ExecuteEvent");
static_assert(offsetof(Init3DWidget_C_ExecuteEvent, Context) == 0x000000, "Member 'Init3DWidget_C_ExecuteEvent::Context' has a wrong offset!");
static_assert(offsetof(Init3DWidget_C_ExecuteEvent, Payload) == 0x000008, "Member 'Init3DWidget_C_ExecuteEvent::Payload' has a wrong offset!");

// Function Init3DWidget.Init3DWidget_C.ExecuteUbergraph_Init3DWidget
// 0x00D8 (0x00D8 - 0x0000)
struct Init3DWidget_C_ExecuteUbergraph_Init3DWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameHUD_C>        K2Node_DynamicCast_AsBPI_Game_HUD;                 // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGUIHidden_Hidden;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UQuestContext*                          K2Node_Event_Context;                              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FQuestEventPayload                     K2Node_Event_Payload;                              // 0x0048(0x0020)(ConstParm, NoDestructor)
	class AController*                            CallFunc_GetOwnerController_ReturnValue;           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvPC_C*                              K2Node_DynamicCast_AsSurv_PC;                      // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_InitQuestActor_QuestActor;                // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_Interactable_C>     K2Node_DynamicCast_AsI_Interactable;               // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TScriptInterface<class II_Interactable_C>     K2Node_DynamicCast_AsI_Interactable_1;             // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Init3DWidget_C_ExecuteUbergraph_Init3DWidget) == 0x000008, "Wrong alignment on Init3DWidget_C_ExecuteUbergraph_Init3DWidget");
static_assert(sizeof(Init3DWidget_C_ExecuteUbergraph_Init3DWidget) == 0x0000D8, "Wrong size on Init3DWidget_C_ExecuteUbergraph_Init3DWidget");
static_assert(offsetof(Init3DWidget_C_ExecuteUbergraph_Init3DWidget, EntryPoint) == 0x000000, "Member 'Init3DWidget_C_ExecuteUbergraph_Init3DWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(Init3DWidget_C_ExecuteUbergraph_Init3DWidget, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'Init3DWidget_C_ExecuteUbergraph_Init3DWidget::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Init3DWidget_C_ExecuteUbergraph_Init3DWidget, CallFunc_GetHUD_ReturnValue) == 0x000010, "Member 'Init3DWidget_C_ExecuteUbergraph_Init3DWidget::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(Init3DWidget_C_ExecuteUbergraph_Init3DWidget, K2Node_DynamicCast_AsBPI_Game_HUD) == 0x000018, "Member 'Init3DWidget_C_ExecuteUbergraph_Init3DWidget::K2Node_DynamicCast_AsBPI_Game_HUD' has a wrong offset!");
static_assert(offsetof(Init3DWidget_C_ExecuteUbergraph_Init3DWidget, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'Init3DWidget_C_ExecuteUbergraph_Init3DWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Init3DWidget_C_ExecuteUbergraph_Init3DWidget, CallFunc_GetGUIHidden_Hidden) == 0x000029, "Member 'Init3DWidget_C_ExecuteUbergraph_Init3DWidget::CallFunc_GetGUIHidden_Hidden' has a wrong offset!");
static_assert(offsetof(Init3DWidget_C_ExecuteUbergraph_Init3DWidget, CallFunc_GetGameState_ReturnValue) == 0x000030, "Member 'Init3DWidget_C_ExecuteUbergraph_Init3DWidget::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(Init3DWidget_C_ExecuteUbergraph_Init3DWidget, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000038, "Member 'Init3DWidget_C_ExecuteUbergraph_Init3DWidget::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Init3DWidget_C_ExecuteUbergraph_Init3DWidget, K2Node_Event_Context) == 0x000040, "Member 'Init3DWidget_C_ExecuteUbergraph_Init3DWidget::K2Node_Event_Context' has a wrong offset!");
static_assert(offsetof(Init3DWidget_C_ExecuteUbergraph_Init3DWidget, K2Node_Event_Payload) == 0x000048, "Member 'Init3DWidget_C_ExecuteUbergraph_Init3DWidget::K2Node_Event_Payload' has a wrong offset!");
static_assert(offsetof(Init3DWidget_C_ExecuteUbergraph_Init3DWidget, CallFunc_GetOwnerController_ReturnValue) == 0x000068, "Member 'Init3DWidget_C_ExecuteUbergraph_Init3DWidget::CallFunc_GetOwnerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Init3DWidget_C_ExecuteUbergraph_Init3DWidget, K2Node_DynamicCast_AsSurv_PC) == 0x000070, "Member 'Init3DWidget_C_ExecuteUbergraph_Init3DWidget::K2Node_DynamicCast_AsSurv_PC' has a wrong offset!");
static_assert(offsetof(Init3DWidget_C_ExecuteUbergraph_Init3DWidget, K2Node_DynamicCast_bSuccess_1) == 0x000078, "Member 'Init3DWidget_C_ExecuteUbergraph_Init3DWidget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Init3DWidget_C_ExecuteUbergraph_Init3DWidget, CallFunc_InitQuestActor_QuestActor) == 0x000080, "Member 'Init3DWidget_C_ExecuteUbergraph_Init3DWidget::CallFunc_InitQuestActor_QuestActor' has a wrong offset!");
static_assert(offsetof(Init3DWidget_C_ExecuteUbergraph_Init3DWidget, K2Node_DynamicCast_AsI_Interactable) == 0x000088, "Member 'Init3DWidget_C_ExecuteUbergraph_Init3DWidget::K2Node_DynamicCast_AsI_Interactable' has a wrong offset!");
static_assert(offsetof(Init3DWidget_C_ExecuteUbergraph_Init3DWidget, K2Node_DynamicCast_bSuccess_2) == 0x000098, "Member 'Init3DWidget_C_ExecuteUbergraph_Init3DWidget::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Init3DWidget_C_ExecuteUbergraph_Init3DWidget, CallFunc_IsValid_ReturnValue) == 0x000099, "Member 'Init3DWidget_C_ExecuteUbergraph_Init3DWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Init3DWidget_C_ExecuteUbergraph_Init3DWidget, CallFunc_GetDisplayName_ReturnValue) == 0x0000A0, "Member 'Init3DWidget_C_ExecuteUbergraph_Init3DWidget::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Init3DWidget_C_ExecuteUbergraph_Init3DWidget, CallFunc_Concat_StrStr_ReturnValue) == 0x0000B0, "Member 'Init3DWidget_C_ExecuteUbergraph_Init3DWidget::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Init3DWidget_C_ExecuteUbergraph_Init3DWidget, K2Node_DynamicCast_AsI_Interactable_1) == 0x0000C0, "Member 'Init3DWidget_C_ExecuteUbergraph_Init3DWidget::K2Node_DynamicCast_AsI_Interactable_1' has a wrong offset!");
static_assert(offsetof(Init3DWidget_C_ExecuteUbergraph_Init3DWidget, K2Node_DynamicCast_bSuccess_3) == 0x0000D0, "Member 'Init3DWidget_C_ExecuteUbergraph_Init3DWidget::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(Init3DWidget_C_ExecuteUbergraph_Init3DWidget, CallFunc_IsValid_ReturnValue_1) == 0x0000D1, "Member 'Init3DWidget_C_ExecuteUbergraph_Init3DWidget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Init3DWidget_C_ExecuteUbergraph_Init3DWidget, CallFunc_IsValid_ReturnValue_2) == 0x0000D2, "Member 'Init3DWidget_C_ExecuteUbergraph_Init3DWidget::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function Init3DWidget.Init3DWidget_C.InitQuestActor
// 0x00E8 (0x00E8 - 0x0000)
struct Init3DWidget_C_InitQuestActor final
{
public:
	class ASurvPC_C*                              PlayerController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 QuestActor;                                        // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsActor;                   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_GS_TDB_C>         K2Node_DynamicCast_AsBPI_GS_TDB;                   // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetClassDisplayName_ReturnValue;          // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetActorOfClass_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetClassDisplayName_ReturnValue_1;        // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetQuestActor_Actor;                      // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Init3DWidget_C_InitQuestActor) == 0x000008, "Wrong alignment on Init3DWidget_C_InitQuestActor");
static_assert(sizeof(Init3DWidget_C_InitQuestActor) == 0x0000E8, "Wrong size on Init3DWidget_C_InitQuestActor");
static_assert(offsetof(Init3DWidget_C_InitQuestActor, PlayerController) == 0x000000, "Member 'Init3DWidget_C_InitQuestActor::PlayerController' has a wrong offset!");
static_assert(offsetof(Init3DWidget_C_InitQuestActor, QuestActor) == 0x000008, "Member 'Init3DWidget_C_InitQuestActor::QuestActor' has a wrong offset!");
static_assert(offsetof(Init3DWidget_C_InitQuestActor, K2Node_ClassDynamicCast_AsActor) == 0x000010, "Member 'Init3DWidget_C_InitQuestActor::K2Node_ClassDynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(Init3DWidget_C_InitQuestActor, K2Node_ClassDynamicCast_bSuccess) == 0x000018, "Member 'Init3DWidget_C_InitQuestActor::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Init3DWidget_C_InitQuestActor, K2Node_DynamicCast_AsBPI_GS_TDB) == 0x000020, "Member 'Init3DWidget_C_InitQuestActor::K2Node_DynamicCast_AsBPI_GS_TDB' has a wrong offset!");
static_assert(offsetof(Init3DWidget_C_InitQuestActor, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'Init3DWidget_C_InitQuestActor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Init3DWidget_C_InitQuestActor, CallFunc_GetClassDisplayName_ReturnValue) == 0x000038, "Member 'Init3DWidget_C_InitQuestActor::CallFunc_GetClassDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Init3DWidget_C_InitQuestActor, CallFunc_GetActorOfClass_ReturnValue) == 0x000048, "Member 'Init3DWidget_C_InitQuestActor::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Init3DWidget_C_InitQuestActor, CallFunc_Concat_StrStr_ReturnValue) == 0x000050, "Member 'Init3DWidget_C_InitQuestActor::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Init3DWidget_C_InitQuestActor, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'Init3DWidget_C_InitQuestActor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Init3DWidget_C_InitQuestActor, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000068, "Member 'Init3DWidget_C_InitQuestActor::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Init3DWidget_C_InitQuestActor, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000078, "Member 'Init3DWidget_C_InitQuestActor::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Init3DWidget_C_InitQuestActor, CallFunc_GetClassDisplayName_ReturnValue_1) == 0x000088, "Member 'Init3DWidget_C_InitQuestActor::CallFunc_GetClassDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Init3DWidget_C_InitQuestActor, CallFunc_GetQuestActor_Actor) == 0x000098, "Member 'Init3DWidget_C_InitQuestActor::CallFunc_GetQuestActor_Actor' has a wrong offset!");
static_assert(offsetof(Init3DWidget_C_InitQuestActor, CallFunc_GetDisplayName_ReturnValue) == 0x0000A0, "Member 'Init3DWidget_C_InitQuestActor::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Init3DWidget_C_InitQuestActor, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0000B0, "Member 'Init3DWidget_C_InitQuestActor::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Init3DWidget_C_InitQuestActor, CallFunc_IsValid_ReturnValue_1) == 0x0000C0, "Member 'Init3DWidget_C_InitQuestActor::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Init3DWidget_C_InitQuestActor, CallFunc_Concat_StrStr_ReturnValue_4) == 0x0000C8, "Member 'Init3DWidget_C_InitQuestActor::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Init3DWidget_C_InitQuestActor, CallFunc_Concat_StrStr_ReturnValue_5) == 0x0000D8, "Member 'Init3DWidget_C_InitQuestActor::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");

}

