#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InitQuestZones

#include "Basic.hpp"

#include "QuestFramework_structs.hpp"


namespace SDK::Params
{

// Function InitQuestZones.InitQuestZones_C.Add Message
// 0x0008 (0x0008 - 0x0000)
struct InitQuestZones_C_Add_Message final
{
public:
	class UQuestContext*                          Context;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InitQuestZones_C_Add_Message) == 0x000008, "Wrong alignment on InitQuestZones_C_Add_Message");
static_assert(sizeof(InitQuestZones_C_Add_Message) == 0x000008, "Wrong size on InitQuestZones_C_Add_Message");
static_assert(offsetof(InitQuestZones_C_Add_Message, Context) == 0x000000, "Member 'InitQuestZones_C_Add_Message::Context' has a wrong offset!");

// Function InitQuestZones.InitQuestZones_C.ExecuteEvent
// 0x0028 (0x0028 - 0x0000)
struct InitQuestZones_C_ExecuteEvent final
{
public:
	class UQuestContext*                          Context;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FQuestEventPayload                     Payload;                                           // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(InitQuestZones_C_ExecuteEvent) == 0x000008, "Wrong alignment on InitQuestZones_C_ExecuteEvent");
static_assert(sizeof(InitQuestZones_C_ExecuteEvent) == 0x000028, "Wrong size on InitQuestZones_C_ExecuteEvent");
static_assert(offsetof(InitQuestZones_C_ExecuteEvent, Context) == 0x000000, "Member 'InitQuestZones_C_ExecuteEvent::Context' has a wrong offset!");
static_assert(offsetof(InitQuestZones_C_ExecuteEvent, Payload) == 0x000008, "Member 'InitQuestZones_C_ExecuteEvent::Payload' has a wrong offset!");

// Function InitQuestZones.InitQuestZones_C.ExecuteUbergraph_InitQuestZones
// 0x0158 (0x0158 - 0x0000)
struct InitQuestZones_C_ExecuteUbergraph_InitQuestZones final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UQuestContext*                          K2Node_CustomEvent_Context;                        // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetOwnerController_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvPC_C*                              K2Node_DynamicCast_AsSurv_PC;                      // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalController_ReturnValue;            // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UQuest*                                 CallFunc_GetQuestAsset_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FQuestVariable                         K2Node_MakeStruct_QuestVariable;                   // 0x0038(0x000C)(NoDestructor)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UQuestCustomData*                 CallFunc_GetCustomData_ReturnValue;                // 0x0048(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetQuestVariableValueAsInteger_ReturnValue; // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UQuestData_C*                     K2Node_DynamicCast_AsQuest_Data;                   // 0x0058(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0068(0x0018)()
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FQuestVariable                         K2Node_MakeStruct_QuestVariable_1;                 // 0x0090(0x000C)(NoDestructor)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00A0(0x0018)()
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GS_TDB_C>         K2Node_DynamicCast_AsBPI_GS_TDB;                   // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UQuestContext*                          K2Node_Event_Context;                              // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FQuestEventPayload                     K2Node_Event_Payload;                              // 0x00E0(0x0020)(ConstParm, NoDestructor)
	class UQuest*                                 CallFunc_GetQuestAsset_ReturnValue_1;              // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetOwnerController_ReturnValue_1;         // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UQuestCustomData*                 CallFunc_GetCustomData_ReturnValue_1;              // 0x0110(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvPC_C*                              K2Node_DynamicCast_AsSurv_PC_1;                    // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UQuestData_C*                     K2Node_DynamicCast_AsQuest_Data_1;                 // 0x0128(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_QuestZone_C*>                CallFunc_GetQuestZoneByJobName_Zones;              // 0x0138(0x0010)(ReferenceParm)
	TArray<class ABP_QuestZone_C*>                CallFunc_GetQuestZoneByJobName_ProgressZones;      // 0x0148(0x0010)(ReferenceParm)
};
static_assert(alignof(InitQuestZones_C_ExecuteUbergraph_InitQuestZones) == 0x000008, "Wrong alignment on InitQuestZones_C_ExecuteUbergraph_InitQuestZones");
static_assert(sizeof(InitQuestZones_C_ExecuteUbergraph_InitQuestZones) == 0x000158, "Wrong size on InitQuestZones_C_ExecuteUbergraph_InitQuestZones");
static_assert(offsetof(InitQuestZones_C_ExecuteUbergraph_InitQuestZones, EntryPoint) == 0x000000, "Member 'InitQuestZones_C_ExecuteUbergraph_InitQuestZones::EntryPoint' has a wrong offset!");
static_assert(offsetof(InitQuestZones_C_ExecuteUbergraph_InitQuestZones, K2Node_CustomEvent_Context) == 0x000008, "Member 'InitQuestZones_C_ExecuteUbergraph_InitQuestZones::K2Node_CustomEvent_Context' has a wrong offset!");
static_assert(offsetof(InitQuestZones_C_ExecuteUbergraph_InitQuestZones, CallFunc_IsDedicatedServer_ReturnValue) == 0x000010, "Member 'InitQuestZones_C_ExecuteUbergraph_InitQuestZones::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(InitQuestZones_C_ExecuteUbergraph_InitQuestZones, CallFunc_GetOwnerController_ReturnValue) == 0x000018, "Member 'InitQuestZones_C_ExecuteUbergraph_InitQuestZones::CallFunc_GetOwnerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(InitQuestZones_C_ExecuteUbergraph_InitQuestZones, K2Node_DynamicCast_AsSurv_PC) == 0x000020, "Member 'InitQuestZones_C_ExecuteUbergraph_InitQuestZones::K2Node_DynamicCast_AsSurv_PC' has a wrong offset!");
static_assert(offsetof(InitQuestZones_C_ExecuteUbergraph_InitQuestZones, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'InitQuestZones_C_ExecuteUbergraph_InitQuestZones::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(InitQuestZones_C_ExecuteUbergraph_InitQuestZones, CallFunc_IsLocalController_ReturnValue) == 0x000029, "Member 'InitQuestZones_C_ExecuteUbergraph_InitQuestZones::CallFunc_IsLocalController_ReturnValue' has a wrong offset!");
static_assert(offsetof(InitQuestZones_C_ExecuteUbergraph_InitQuestZones, CallFunc_GetQuestAsset_ReturnValue) == 0x000030, "Member 'InitQuestZones_C_ExecuteUbergraph_InitQuestZones::CallFunc_GetQuestAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(InitQuestZones_C_ExecuteUbergraph_InitQuestZones, K2Node_MakeStruct_QuestVariable) == 0x000038, "Member 'InitQuestZones_C_ExecuteUbergraph_InitQuestZones::K2Node_MakeStruct_QuestVariable' has a wrong offset!");
static_assert(offsetof(InitQuestZones_C_ExecuteUbergraph_InitQuestZones, CallFunc_GetCustomData_ReturnValue) == 0x000048, "Member 'InitQuestZones_C_ExecuteUbergraph_InitQuestZones::CallFunc_GetCustomData_ReturnValue' has a wrong offset!");
static_assert(offsetof(InitQuestZones_C_ExecuteUbergraph_InitQuestZones, CallFunc_GetQuestVariableValueAsInteger_ReturnValue) == 0x000050, "Member 'InitQuestZones_C_ExecuteUbergraph_InitQuestZones::CallFunc_GetQuestVariableValueAsInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(InitQuestZones_C_ExecuteUbergraph_InitQuestZones, K2Node_DynamicCast_AsQuest_Data) == 0x000058, "Member 'InitQuestZones_C_ExecuteUbergraph_InitQuestZones::K2Node_DynamicCast_AsQuest_Data' has a wrong offset!");
static_assert(offsetof(InitQuestZones_C_ExecuteUbergraph_InitQuestZones, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'InitQuestZones_C_ExecuteUbergraph_InitQuestZones::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(InitQuestZones_C_ExecuteUbergraph_InitQuestZones, CallFunc_Conv_IntToText_ReturnValue) == 0x000068, "Member 'InitQuestZones_C_ExecuteUbergraph_InitQuestZones::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(InitQuestZones_C_ExecuteUbergraph_InitQuestZones, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000080, "Member 'InitQuestZones_C_ExecuteUbergraph_InitQuestZones::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(InitQuestZones_C_ExecuteUbergraph_InitQuestZones, K2Node_MakeStruct_QuestVariable_1) == 0x000090, "Member 'InitQuestZones_C_ExecuteUbergraph_InitQuestZones::K2Node_MakeStruct_QuestVariable_1' has a wrong offset!");
static_assert(offsetof(InitQuestZones_C_ExecuteUbergraph_InitQuestZones, CallFunc_Conv_StringToText_ReturnValue) == 0x0000A0, "Member 'InitQuestZones_C_ExecuteUbergraph_InitQuestZones::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(InitQuestZones_C_ExecuteUbergraph_InitQuestZones, CallFunc_GetGameState_ReturnValue) == 0x0000B8, "Member 'InitQuestZones_C_ExecuteUbergraph_InitQuestZones::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(InitQuestZones_C_ExecuteUbergraph_InitQuestZones, K2Node_DynamicCast_AsBPI_GS_TDB) == 0x0000C0, "Member 'InitQuestZones_C_ExecuteUbergraph_InitQuestZones::K2Node_DynamicCast_AsBPI_GS_TDB' has a wrong offset!");
static_assert(offsetof(InitQuestZones_C_ExecuteUbergraph_InitQuestZones, K2Node_DynamicCast_bSuccess_2) == 0x0000D0, "Member 'InitQuestZones_C_ExecuteUbergraph_InitQuestZones::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(InitQuestZones_C_ExecuteUbergraph_InitQuestZones, K2Node_Event_Context) == 0x0000D8, "Member 'InitQuestZones_C_ExecuteUbergraph_InitQuestZones::K2Node_Event_Context' has a wrong offset!");
static_assert(offsetof(InitQuestZones_C_ExecuteUbergraph_InitQuestZones, K2Node_Event_Payload) == 0x0000E0, "Member 'InitQuestZones_C_ExecuteUbergraph_InitQuestZones::K2Node_Event_Payload' has a wrong offset!");
static_assert(offsetof(InitQuestZones_C_ExecuteUbergraph_InitQuestZones, CallFunc_GetQuestAsset_ReturnValue_1) == 0x000100, "Member 'InitQuestZones_C_ExecuteUbergraph_InitQuestZones::CallFunc_GetQuestAsset_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InitQuestZones_C_ExecuteUbergraph_InitQuestZones, CallFunc_GetOwnerController_ReturnValue_1) == 0x000108, "Member 'InitQuestZones_C_ExecuteUbergraph_InitQuestZones::CallFunc_GetOwnerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InitQuestZones_C_ExecuteUbergraph_InitQuestZones, CallFunc_GetCustomData_ReturnValue_1) == 0x000110, "Member 'InitQuestZones_C_ExecuteUbergraph_InitQuestZones::CallFunc_GetCustomData_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InitQuestZones_C_ExecuteUbergraph_InitQuestZones, K2Node_DynamicCast_AsSurv_PC_1) == 0x000118, "Member 'InitQuestZones_C_ExecuteUbergraph_InitQuestZones::K2Node_DynamicCast_AsSurv_PC_1' has a wrong offset!");
static_assert(offsetof(InitQuestZones_C_ExecuteUbergraph_InitQuestZones, K2Node_DynamicCast_bSuccess_3) == 0x000120, "Member 'InitQuestZones_C_ExecuteUbergraph_InitQuestZones::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(InitQuestZones_C_ExecuteUbergraph_InitQuestZones, K2Node_DynamicCast_AsQuest_Data_1) == 0x000128, "Member 'InitQuestZones_C_ExecuteUbergraph_InitQuestZones::K2Node_DynamicCast_AsQuest_Data_1' has a wrong offset!");
static_assert(offsetof(InitQuestZones_C_ExecuteUbergraph_InitQuestZones, K2Node_DynamicCast_bSuccess_4) == 0x000130, "Member 'InitQuestZones_C_ExecuteUbergraph_InitQuestZones::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(InitQuestZones_C_ExecuteUbergraph_InitQuestZones, CallFunc_Array_Length_ReturnValue) == 0x000134, "Member 'InitQuestZones_C_ExecuteUbergraph_InitQuestZones::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(InitQuestZones_C_ExecuteUbergraph_InitQuestZones, CallFunc_GetQuestZoneByJobName_Zones) == 0x000138, "Member 'InitQuestZones_C_ExecuteUbergraph_InitQuestZones::CallFunc_GetQuestZoneByJobName_Zones' has a wrong offset!");
static_assert(offsetof(InitQuestZones_C_ExecuteUbergraph_InitQuestZones, CallFunc_GetQuestZoneByJobName_ProgressZones) == 0x000148, "Member 'InitQuestZones_C_ExecuteUbergraph_InitQuestZones::CallFunc_GetQuestZoneByJobName_ProgressZones' has a wrong offset!");

}

