#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IsCurrentQuestStage

#include "Basic.hpp"

#include "AGSGraphRuntime_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass IsCurrentQuestStage.IsCurrentQuestStage_C
// 0x0030 (0x0068 - 0x0038)
class UIsCurrentQuestStage_C final : public UAGSCondition
{
public:
	bool                                          DontCurrentStage;                                  // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 StageName;                                         // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          IsArrayStage;                                      // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         ArrayStage;                                        // 0x0058(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	bool VerifyCondition(class APlayerController* PlayerController) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"IsCurrentQuestStage_C">();
	}
	static class UIsCurrentQuestStage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIsCurrentQuestStage_C>();
	}
};
static_assert(alignof(UIsCurrentQuestStage_C) == 0x000008, "Wrong alignment on UIsCurrentQuestStage_C");
static_assert(sizeof(UIsCurrentQuestStage_C) == 0x000068, "Wrong size on UIsCurrentQuestStage_C");
static_assert(offsetof(UIsCurrentQuestStage_C, DontCurrentStage) == 0x000038, "Member 'UIsCurrentQuestStage_C::DontCurrentStage' has a wrong offset!");
static_assert(offsetof(UIsCurrentQuestStage_C, StageName) == 0x000040, "Member 'UIsCurrentQuestStage_C::StageName' has a wrong offset!");
static_assert(offsetof(UIsCurrentQuestStage_C, IsArrayStage) == 0x000050, "Member 'UIsCurrentQuestStage_C::IsArrayStage' has a wrong offset!");
static_assert(offsetof(UIsCurrentQuestStage_C, ArrayStage) == 0x000058, "Member 'UIsCurrentQuestStage_C::ArrayStage' has a wrong offset!");

}

