#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IsTalkToStashAfterRaid

#include "Basic.hpp"


namespace SDK::Params
{

// Function IsTalkToStashAfterRaid.IsTalkToStashAfterRaid_C.VerifyCondition
// 0x0028 (0x0028 - 0x0000)
struct IsTalkToStashAfterRaid_C_VerifyCondition final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvPC_C*                              K2Node_DynamicCast_AsSurv_PC;                      // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAfterRaid_bAfterRaid;                  // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_1;                           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IsTalkToStashAfterRaid_C_VerifyCondition) == 0x000008, "Wrong alignment on IsTalkToStashAfterRaid_C_VerifyCondition");
static_assert(sizeof(IsTalkToStashAfterRaid_C_VerifyCondition) == 0x000028, "Wrong size on IsTalkToStashAfterRaid_C_VerifyCondition");
static_assert(offsetof(IsTalkToStashAfterRaid_C_VerifyCondition, PlayerController) == 0x000000, "Member 'IsTalkToStashAfterRaid_C_VerifyCondition::PlayerController' has a wrong offset!");
static_assert(offsetof(IsTalkToStashAfterRaid_C_VerifyCondition, ReturnValue) == 0x000008, "Member 'IsTalkToStashAfterRaid_C_VerifyCondition::ReturnValue' has a wrong offset!");
static_assert(offsetof(IsTalkToStashAfterRaid_C_VerifyCondition, Temp_bool_Variable) == 0x000009, "Member 'IsTalkToStashAfterRaid_C_VerifyCondition::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(IsTalkToStashAfterRaid_C_VerifyCondition, K2Node_DynamicCast_AsSurv_PC) == 0x000010, "Member 'IsTalkToStashAfterRaid_C_VerifyCondition::K2Node_DynamicCast_AsSurv_PC' has a wrong offset!");
static_assert(offsetof(IsTalkToStashAfterRaid_C_VerifyCondition, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'IsTalkToStashAfterRaid_C_VerifyCondition::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(IsTalkToStashAfterRaid_C_VerifyCondition, Temp_bool_Variable_1) == 0x000019, "Member 'IsTalkToStashAfterRaid_C_VerifyCondition::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(IsTalkToStashAfterRaid_C_VerifyCondition, CallFunc_IsValid_ReturnValue) == 0x00001A, "Member 'IsTalkToStashAfterRaid_C_VerifyCondition::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(IsTalkToStashAfterRaid_C_VerifyCondition, CallFunc_GetAfterRaid_bAfterRaid) == 0x00001B, "Member 'IsTalkToStashAfterRaid_C_VerifyCondition::CallFunc_GetAfterRaid_bAfterRaid' has a wrong offset!");
static_assert(offsetof(IsTalkToStashAfterRaid_C_VerifyCondition, Temp_bool_Variable_2) == 0x00001C, "Member 'IsTalkToStashAfterRaid_C_VerifyCondition::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(IsTalkToStashAfterRaid_C_VerifyCondition, CallFunc_Not_PreBool_ReturnValue) == 0x00001D, "Member 'IsTalkToStashAfterRaid_C_VerifyCondition::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(IsTalkToStashAfterRaid_C_VerifyCondition, Temp_bool_Variable_3) == 0x00001E, "Member 'IsTalkToStashAfterRaid_C_VerifyCondition::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(IsTalkToStashAfterRaid_C_VerifyCondition, K2Node_Select_Default) == 0x00001F, "Member 'IsTalkToStashAfterRaid_C_VerifyCondition::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(IsTalkToStashAfterRaid_C_VerifyCondition, K2Node_Select_Default_1) == 0x000020, "Member 'IsTalkToStashAfterRaid_C_VerifyCondition::K2Node_Select_Default_1' has a wrong offset!");

}

