#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IsTutorialNPC

#include "Basic.hpp"


namespace SDK::Params
{

// Function IsTutorialNPC.IsTutorialNPC_C.VerifyCondition
// 0x0040 (0x0040 - 0x0000)
struct IsTutorialNPC_C_VerifyCondition final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvPC_C*                              K2Node_DynamicCast_AsSurv_PC;                      // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsBeginner_IsBeginner;                 // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         K2Node_Select_Default;                             // 0x0020(0x0010)(ConstParm, ReferenceParm)
	class UObject*                                K2Node_Select_Default_1;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IsTutorialNPC_C_VerifyCondition) == 0x000008, "Wrong alignment on IsTutorialNPC_C_VerifyCondition");
static_assert(sizeof(IsTutorialNPC_C_VerifyCondition) == 0x000040, "Wrong size on IsTutorialNPC_C_VerifyCondition");
static_assert(offsetof(IsTutorialNPC_C_VerifyCondition, PlayerController) == 0x000000, "Member 'IsTutorialNPC_C_VerifyCondition::PlayerController' has a wrong offset!");
static_assert(offsetof(IsTutorialNPC_C_VerifyCondition, ReturnValue) == 0x000008, "Member 'IsTutorialNPC_C_VerifyCondition::ReturnValue' has a wrong offset!");
static_assert(offsetof(IsTutorialNPC_C_VerifyCondition, Temp_bool_Variable) == 0x000009, "Member 'IsTutorialNPC_C_VerifyCondition::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(IsTutorialNPC_C_VerifyCondition, K2Node_DynamicCast_AsSurv_PC) == 0x000010, "Member 'IsTutorialNPC_C_VerifyCondition::K2Node_DynamicCast_AsSurv_PC' has a wrong offset!");
static_assert(offsetof(IsTutorialNPC_C_VerifyCondition, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'IsTutorialNPC_C_VerifyCondition::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(IsTutorialNPC_C_VerifyCondition, Temp_bool_Variable_1) == 0x000019, "Member 'IsTutorialNPC_C_VerifyCondition::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(IsTutorialNPC_C_VerifyCondition, CallFunc_GetIsBeginner_IsBeginner) == 0x00001A, "Member 'IsTutorialNPC_C_VerifyCondition::CallFunc_GetIsBeginner_IsBeginner' has a wrong offset!");
static_assert(offsetof(IsTutorialNPC_C_VerifyCondition, CallFunc_IsValid_ReturnValue) == 0x00001B, "Member 'IsTutorialNPC_C_VerifyCondition::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(IsTutorialNPC_C_VerifyCondition, K2Node_Select_Default) == 0x000020, "Member 'IsTutorialNPC_C_VerifyCondition::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(IsTutorialNPC_C_VerifyCondition, K2Node_Select_Default_1) == 0x000030, "Member 'IsTutorialNPC_C_VerifyCondition::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(IsTutorialNPC_C_VerifyCondition, CallFunc_Array_Contains_ReturnValue) == 0x000038, "Member 'IsTutorialNPC_C_VerifyCondition::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(IsTutorialNPC_C_VerifyCondition, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000039, "Member 'IsTutorialNPC_C_VerifyCondition::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(IsTutorialNPC_C_VerifyCondition, CallFunc_BooleanOR_ReturnValue) == 0x00003A, "Member 'IsTutorialNPC_C_VerifyCondition::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(IsTutorialNPC_C_VerifyCondition, CallFunc_Not_PreBool_ReturnValue) == 0x00003B, "Member 'IsTutorialNPC_C_VerifyCondition::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

