#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IsWelcome

#include "Basic.hpp"


namespace SDK::Params
{

// Function isWelcome.isWelcome_C.VerifyCondition
// 0x0058 (0x0058 - 0x0000)
struct IsWelcome_C_VerifyCondition final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvPC_C*                              K2Node_DynamicCast_AsSurv_PC;                      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival;                  // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsWelcome_isWelcome;                   // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetVendorName_VendorName;                 // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsBeginner_IsBeginner;                 // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival_1;                // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsWelcome_isWelcome_1;                 // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IsWelcome_C_VerifyCondition) == 0x000008, "Wrong alignment on IsWelcome_C_VerifyCondition");
static_assert(sizeof(IsWelcome_C_VerifyCondition) == 0x000058, "Wrong size on IsWelcome_C_VerifyCondition");
static_assert(offsetof(IsWelcome_C_VerifyCondition, PlayerController) == 0x000000, "Member 'IsWelcome_C_VerifyCondition::PlayerController' has a wrong offset!");
static_assert(offsetof(IsWelcome_C_VerifyCondition, ReturnValue) == 0x000008, "Member 'IsWelcome_C_VerifyCondition::ReturnValue' has a wrong offset!");
static_assert(offsetof(IsWelcome_C_VerifyCondition, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'IsWelcome_C_VerifyCondition::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(IsWelcome_C_VerifyCondition, K2Node_DynamicCast_AsSurv_PC) == 0x000018, "Member 'IsWelcome_C_VerifyCondition::K2Node_DynamicCast_AsSurv_PC' has a wrong offset!");
static_assert(offsetof(IsWelcome_C_VerifyCondition, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'IsWelcome_C_VerifyCondition::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(IsWelcome_C_VerifyCondition, K2Node_DynamicCast_AsGI_Survival) == 0x000028, "Member 'IsWelcome_C_VerifyCondition::K2Node_DynamicCast_AsGI_Survival' has a wrong offset!");
static_assert(offsetof(IsWelcome_C_VerifyCondition, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'IsWelcome_C_VerifyCondition::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(IsWelcome_C_VerifyCondition, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'IsWelcome_C_VerifyCondition::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(IsWelcome_C_VerifyCondition, CallFunc_GetIsWelcome_isWelcome) == 0x000032, "Member 'IsWelcome_C_VerifyCondition::CallFunc_GetIsWelcome_isWelcome' has a wrong offset!");
static_assert(offsetof(IsWelcome_C_VerifyCondition, CallFunc_Not_PreBool_ReturnValue) == 0x000033, "Member 'IsWelcome_C_VerifyCondition::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(IsWelcome_C_VerifyCondition, CallFunc_GetVendorName_VendorName) == 0x000034, "Member 'IsWelcome_C_VerifyCondition::CallFunc_GetVendorName_VendorName' has a wrong offset!");
static_assert(offsetof(IsWelcome_C_VerifyCondition, CallFunc_GetIsBeginner_IsBeginner) == 0x00003C, "Member 'IsWelcome_C_VerifyCondition::CallFunc_GetIsBeginner_IsBeginner' has a wrong offset!");
static_assert(offsetof(IsWelcome_C_VerifyCondition, CallFunc_IsValid_ReturnValue_1) == 0x00003D, "Member 'IsWelcome_C_VerifyCondition::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IsWelcome_C_VerifyCondition, CallFunc_GetGameInstance_ReturnValue_1) == 0x000040, "Member 'IsWelcome_C_VerifyCondition::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IsWelcome_C_VerifyCondition, K2Node_DynamicCast_AsGI_Survival_1) == 0x000048, "Member 'IsWelcome_C_VerifyCondition::K2Node_DynamicCast_AsGI_Survival_1' has a wrong offset!");
static_assert(offsetof(IsWelcome_C_VerifyCondition, K2Node_DynamicCast_bSuccess_2) == 0x000050, "Member 'IsWelcome_C_VerifyCondition::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(IsWelcome_C_VerifyCondition, CallFunc_GetIsWelcome_isWelcome_1) == 0x000051, "Member 'IsWelcome_C_VerifyCondition::CallFunc_GetIsWelcome_isWelcome_1' has a wrong offset!");
static_assert(offsetof(IsWelcome_C_VerifyCondition, CallFunc_Not_PreBool_ReturnValue_1) == 0x000052, "Member 'IsWelcome_C_VerifyCondition::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");

}

