#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemsFuncLibrary

#include "Basic.hpp"

#include "FItemInfo_structs.hpp"
#include "ContainerPickupsInfo_structs.hpp"


namespace SDK::Params
{

// Function ItemsFuncLibrary.ItemsFuncLibrary_C.ConvertPickupItemToItemInfoFunc
// 0x06D8 (0x06D8 - 0x0000)
struct ItemsFuncLibrary_C_ConvertPickupItemToItemInfoFunc final
{
public:
	struct FContainerPickupsInfo                  PickupItem;                                        // 0x0000(0x0068)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0068(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFItemInfo                             ItemInfo;                                          // 0x0070(0x0220)(Parm, OutParm, ContainsInstancedReference, HasGetValueTypeHash)
	struct FFItemInfo                             CallFunc_GetDataTableRowFromName_OutRow;           // 0x0290(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B1[0x7];                                      // 0x04B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             K2Node_SetFieldsInStruct_StructOut;                // 0x04B8(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(ItemsFuncLibrary_C_ConvertPickupItemToItemInfoFunc) == 0x000008, "Wrong alignment on ItemsFuncLibrary_C_ConvertPickupItemToItemInfoFunc");
static_assert(sizeof(ItemsFuncLibrary_C_ConvertPickupItemToItemInfoFunc) == 0x0006D8, "Wrong size on ItemsFuncLibrary_C_ConvertPickupItemToItemInfoFunc");
static_assert(offsetof(ItemsFuncLibrary_C_ConvertPickupItemToItemInfoFunc, PickupItem) == 0x000000, "Member 'ItemsFuncLibrary_C_ConvertPickupItemToItemInfoFunc::PickupItem' has a wrong offset!");
static_assert(offsetof(ItemsFuncLibrary_C_ConvertPickupItemToItemInfoFunc, __WorldContext) == 0x000068, "Member 'ItemsFuncLibrary_C_ConvertPickupItemToItemInfoFunc::__WorldContext' has a wrong offset!");
static_assert(offsetof(ItemsFuncLibrary_C_ConvertPickupItemToItemInfoFunc, ItemInfo) == 0x000070, "Member 'ItemsFuncLibrary_C_ConvertPickupItemToItemInfoFunc::ItemInfo' has a wrong offset!");
static_assert(offsetof(ItemsFuncLibrary_C_ConvertPickupItemToItemInfoFunc, CallFunc_GetDataTableRowFromName_OutRow) == 0x000290, "Member 'ItemsFuncLibrary_C_ConvertPickupItemToItemInfoFunc::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(ItemsFuncLibrary_C_ConvertPickupItemToItemInfoFunc, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0004B0, "Member 'ItemsFuncLibrary_C_ConvertPickupItemToItemInfoFunc::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemsFuncLibrary_C_ConvertPickupItemToItemInfoFunc, K2Node_SetFieldsInStruct_StructOut) == 0x0004B8, "Member 'ItemsFuncLibrary_C_ConvertPickupItemToItemInfoFunc::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");

}

