#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JigSplitWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass JigSplitWidget.JigSplitWidget_C
// 0x0120 (0x03A0 - 0x0280)
class UJigSplitWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOut_Anim;                                      // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn_Anim;                                       // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_ModalClose;                                 // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Slider;                                     // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_SwitchLeft;                                 // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_SwitchRight;                                // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_64;                                          // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_183;                                         // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BG;                                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_VectorL;                                     // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_VectorR;                                     // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_DialogContent;                             // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           Plus;                                              // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_CountSlider;                               // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Progress;                                  // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USlider*                                Slider_539;                                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USlider*                                Slider_Main;                                       // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_CurrentCount;                            // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ItemName;                                // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ItemName_1;                              // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Max;                                     // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlockWhattodo;                                 // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ModalWindowButton_C*                 W_BaseDialogButton_Accept;                         // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ModalWindowButton_C*                 W_BaseDialogButton_Decline;                        // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UJSIContainer_C*                        ContainerRec;                                      // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UJSI_Slot_C*                            SlotRef;                                           // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         MaxCount;                                          // 0x0358(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentValue;                                      // 0x035C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ToSlot;                                            // 0x0360(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Weight;                                            // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           PressedIncreaseSplitItem_Timer;                    // 0x0370(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             NewEventDispatcher;                                // 0x0378(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FTimerHandle                           PressedDecreaseSplitItem_Timer;                    // 0x0388(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          NewVar;                                            // 0x0390(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_391[0x7];                                      // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SliderValue;                                       // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AcceptSplit();
	void BndEvt__JigSplitWidget_Button_126_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__JigSplitWidget_Button_Slider_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__JigSplitWidget_Button_SwitchLeft_K2Node_ComponentBoundEvent_2_OnButtonReleasedEvent__DelegateSignature();
	void BndEvt__JigSplitWidget_Button_SwitchLeft_K2Node_ComponentBoundEvent_8_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__JigSplitWidget_Button_SwitchRight_K2Node_ComponentBoundEvent_1_OnButtonReleasedEvent__DelegateSignature();
	void BndEvt__JigSplitWidget_Button_SwitchRight_K2Node_ComponentBoundEvent_7_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__JigSplitWidget_Slider_539_K2Node_ComponentBoundEvent_14_OnFloatValueChangedEvent__DelegateSignature(float Value);
	void BndEvt__JigSplitWidget_Slider_539_K2Node_ComponentBoundEvent_15_OnMouseCaptureBeginEvent__DelegateSignature();
	void BndEvt__JigSplitWidget_Slider_Main_K2Node_ComponentBoundEvent_3_OnFloatValueChangedEvent__DelegateSignature(float Value);
	void BndEvt__JigSplitWidget_W_ModalWindowButton_87_K2Node_ComponentBoundEvent_6_OnPressed__DelegateSignature();
	void BndEvt__JigSplitWidget_W_ModalWindowButton_K2Node_ComponentBoundEvent_5_OnPressed__DelegateSignature();
	void ChangeCountOfSplitItem(bool bIsNeedToIncrease);
	void Construct();
	void Delete();
	void ExecuteUbergraph_JigSplitWidget(int32 EntryPoint);
	void Finished_F395720742C9261F785F698171BADDCE();
	void NewEventDispatcher__DelegateSignature();
	void OnCounterValueChanged(double Value);
	void OnDecreaseSplitItem();
	void OnIncreaseSplitItem();
	void PreConstruct(bool IsDesignTime);
	void RemoveItem();
	void SetTextWeight();
	void TempFItem(struct FFItemInfo* StructOut);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"JigSplitWidget_C">();
	}
	static class UJigSplitWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJigSplitWidget_C>();
	}
};
static_assert(alignof(UJigSplitWidget_C) == 0x000008, "Wrong alignment on UJigSplitWidget_C");
static_assert(sizeof(UJigSplitWidget_C) == 0x0003A0, "Wrong size on UJigSplitWidget_C");
static_assert(offsetof(UJigSplitWidget_C, UberGraphFrame) == 0x000280, "Member 'UJigSplitWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UJigSplitWidget_C, FadeOut_Anim) == 0x000288, "Member 'UJigSplitWidget_C::FadeOut_Anim' has a wrong offset!");
static_assert(offsetof(UJigSplitWidget_C, FadeIn_Anim) == 0x000290, "Member 'UJigSplitWidget_C::FadeIn_Anim' has a wrong offset!");
static_assert(offsetof(UJigSplitWidget_C, Button_ModalClose) == 0x000298, "Member 'UJigSplitWidget_C::Button_ModalClose' has a wrong offset!");
static_assert(offsetof(UJigSplitWidget_C, Button_Slider) == 0x0002A0, "Member 'UJigSplitWidget_C::Button_Slider' has a wrong offset!");
static_assert(offsetof(UJigSplitWidget_C, Button_SwitchLeft) == 0x0002A8, "Member 'UJigSplitWidget_C::Button_SwitchLeft' has a wrong offset!");
static_assert(offsetof(UJigSplitWidget_C, Button_SwitchRight) == 0x0002B0, "Member 'UJigSplitWidget_C::Button_SwitchRight' has a wrong offset!");
static_assert(offsetof(UJigSplitWidget_C, Image_64) == 0x0002B8, "Member 'UJigSplitWidget_C::Image_64' has a wrong offset!");
static_assert(offsetof(UJigSplitWidget_C, Image_183) == 0x0002C0, "Member 'UJigSplitWidget_C::Image_183' has a wrong offset!");
static_assert(offsetof(UJigSplitWidget_C, Image_BG) == 0x0002C8, "Member 'UJigSplitWidget_C::Image_BG' has a wrong offset!");
static_assert(offsetof(UJigSplitWidget_C, Image_VectorL) == 0x0002D0, "Member 'UJigSplitWidget_C::Image_VectorL' has a wrong offset!");
static_assert(offsetof(UJigSplitWidget_C, Image_VectorR) == 0x0002D8, "Member 'UJigSplitWidget_C::Image_VectorR' has a wrong offset!");
static_assert(offsetof(UJigSplitWidget_C, Overlay_DialogContent) == 0x0002E0, "Member 'UJigSplitWidget_C::Overlay_DialogContent' has a wrong offset!");
static_assert(offsetof(UJigSplitWidget_C, Plus) == 0x0002E8, "Member 'UJigSplitWidget_C::Plus' has a wrong offset!");
static_assert(offsetof(UJigSplitWidget_C, SizeBox_CountSlider) == 0x0002F0, "Member 'UJigSplitWidget_C::SizeBox_CountSlider' has a wrong offset!");
static_assert(offsetof(UJigSplitWidget_C, SizeBox_Progress) == 0x0002F8, "Member 'UJigSplitWidget_C::SizeBox_Progress' has a wrong offset!");
static_assert(offsetof(UJigSplitWidget_C, Slider_539) == 0x000300, "Member 'UJigSplitWidget_C::Slider_539' has a wrong offset!");
static_assert(offsetof(UJigSplitWidget_C, Slider_Main) == 0x000308, "Member 'UJigSplitWidget_C::Slider_Main' has a wrong offset!");
static_assert(offsetof(UJigSplitWidget_C, TextBlock_CurrentCount) == 0x000310, "Member 'UJigSplitWidget_C::TextBlock_CurrentCount' has a wrong offset!");
static_assert(offsetof(UJigSplitWidget_C, TextBlock_ItemName) == 0x000318, "Member 'UJigSplitWidget_C::TextBlock_ItemName' has a wrong offset!");
static_assert(offsetof(UJigSplitWidget_C, TextBlock_ItemName_1) == 0x000320, "Member 'UJigSplitWidget_C::TextBlock_ItemName_1' has a wrong offset!");
static_assert(offsetof(UJigSplitWidget_C, TextBlock_Max) == 0x000328, "Member 'UJigSplitWidget_C::TextBlock_Max' has a wrong offset!");
static_assert(offsetof(UJigSplitWidget_C, TextBlockWhattodo) == 0x000330, "Member 'UJigSplitWidget_C::TextBlockWhattodo' has a wrong offset!");
static_assert(offsetof(UJigSplitWidget_C, W_BaseDialogButton_Accept) == 0x000338, "Member 'UJigSplitWidget_C::W_BaseDialogButton_Accept' has a wrong offset!");
static_assert(offsetof(UJigSplitWidget_C, W_BaseDialogButton_Decline) == 0x000340, "Member 'UJigSplitWidget_C::W_BaseDialogButton_Decline' has a wrong offset!");
static_assert(offsetof(UJigSplitWidget_C, ContainerRec) == 0x000348, "Member 'UJigSplitWidget_C::ContainerRec' has a wrong offset!");
static_assert(offsetof(UJigSplitWidget_C, SlotRef) == 0x000350, "Member 'UJigSplitWidget_C::SlotRef' has a wrong offset!");
static_assert(offsetof(UJigSplitWidget_C, MaxCount) == 0x000358, "Member 'UJigSplitWidget_C::MaxCount' has a wrong offset!");
static_assert(offsetof(UJigSplitWidget_C, CurrentValue) == 0x00035C, "Member 'UJigSplitWidget_C::CurrentValue' has a wrong offset!");
static_assert(offsetof(UJigSplitWidget_C, ToSlot) == 0x000360, "Member 'UJigSplitWidget_C::ToSlot' has a wrong offset!");
static_assert(offsetof(UJigSplitWidget_C, Weight) == 0x000368, "Member 'UJigSplitWidget_C::Weight' has a wrong offset!");
static_assert(offsetof(UJigSplitWidget_C, PressedIncreaseSplitItem_Timer) == 0x000370, "Member 'UJigSplitWidget_C::PressedIncreaseSplitItem_Timer' has a wrong offset!");
static_assert(offsetof(UJigSplitWidget_C, NewEventDispatcher) == 0x000378, "Member 'UJigSplitWidget_C::NewEventDispatcher' has a wrong offset!");
static_assert(offsetof(UJigSplitWidget_C, PressedDecreaseSplitItem_Timer) == 0x000388, "Member 'UJigSplitWidget_C::PressedDecreaseSplitItem_Timer' has a wrong offset!");
static_assert(offsetof(UJigSplitWidget_C, NewVar) == 0x000390, "Member 'UJigSplitWidget_C::NewVar' has a wrong offset!");
static_assert(offsetof(UJigSplitWidget_C, SliderValue) == 0x000398, "Member 'UJigSplitWidget_C::SliderValue' has a wrong offset!");

}

