#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JigSplitWidget

#include "Basic.hpp"

#include "FItemInfo_structs.hpp"
#include "FMODStudio_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function JigSplitWidget.JigSplitWidget_C.BndEvt__JigSplitWidget_Slider_539_K2Node_ComponentBoundEvent_14_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct JigSplitWidget_C_BndEvt__JigSplitWidget_Slider_539_K2Node_ComponentBoundEvent_14_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(JigSplitWidget_C_BndEvt__JigSplitWidget_Slider_539_K2Node_ComponentBoundEvent_14_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on JigSplitWidget_C_BndEvt__JigSplitWidget_Slider_539_K2Node_ComponentBoundEvent_14_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(JigSplitWidget_C_BndEvt__JigSplitWidget_Slider_539_K2Node_ComponentBoundEvent_14_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on JigSplitWidget_C_BndEvt__JigSplitWidget_Slider_539_K2Node_ComponentBoundEvent_14_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(JigSplitWidget_C_BndEvt__JigSplitWidget_Slider_539_K2Node_ComponentBoundEvent_14_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'JigSplitWidget_C_BndEvt__JigSplitWidget_Slider_539_K2Node_ComponentBoundEvent_14_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function JigSplitWidget.JigSplitWidget_C.BndEvt__JigSplitWidget_Slider_Main_K2Node_ComponentBoundEvent_3_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct JigSplitWidget_C_BndEvt__JigSplitWidget_Slider_Main_K2Node_ComponentBoundEvent_3_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(JigSplitWidget_C_BndEvt__JigSplitWidget_Slider_Main_K2Node_ComponentBoundEvent_3_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on JigSplitWidget_C_BndEvt__JigSplitWidget_Slider_Main_K2Node_ComponentBoundEvent_3_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(JigSplitWidget_C_BndEvt__JigSplitWidget_Slider_Main_K2Node_ComponentBoundEvent_3_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on JigSplitWidget_C_BndEvt__JigSplitWidget_Slider_Main_K2Node_ComponentBoundEvent_3_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(JigSplitWidget_C_BndEvt__JigSplitWidget_Slider_Main_K2Node_ComponentBoundEvent_3_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'JigSplitWidget_C_BndEvt__JigSplitWidget_Slider_Main_K2Node_ComponentBoundEvent_3_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function JigSplitWidget.JigSplitWidget_C.ChangeCountOfSplitItem
// 0x00C0 (0x00C0 - 0x0000)
struct JigSplitWidget_C_ChangeCountOfSplitItem final
{
public:
	bool                                          bIsNeedToIncrease;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
	int32                                         Temp_int_Variable_1;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0028(0x0018)()
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue;           // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue_1;         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_CountOut_OutInt;                          // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x0088(0x0018)()
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_InRange_FloatFloat_Value_ImplicitCast;    // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_InRange_FloatFloat_Value_ImplicitCast_1;  // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(JigSplitWidget_C_ChangeCountOfSplitItem) == 0x000008, "Wrong alignment on JigSplitWidget_C_ChangeCountOfSplitItem");
static_assert(sizeof(JigSplitWidget_C_ChangeCountOfSplitItem) == 0x0000C0, "Wrong size on JigSplitWidget_C_ChangeCountOfSplitItem");
static_assert(offsetof(JigSplitWidget_C_ChangeCountOfSplitItem, bIsNeedToIncrease) == 0x000000, "Member 'JigSplitWidget_C_ChangeCountOfSplitItem::bIsNeedToIncrease' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ChangeCountOfSplitItem, Temp_int_Variable) == 0x000004, "Member 'JigSplitWidget_C_ChangeCountOfSplitItem::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ChangeCountOfSplitItem, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'JigSplitWidget_C_ChangeCountOfSplitItem::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ChangeCountOfSplitItem, Temp_int_Variable_1) == 0x000020, "Member 'JigSplitWidget_C_ChangeCountOfSplitItem::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ChangeCountOfSplitItem, CallFunc_Greater_IntInt_ReturnValue) == 0x000024, "Member 'JigSplitWidget_C_ChangeCountOfSplitItem::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ChangeCountOfSplitItem, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000028, "Member 'JigSplitWidget_C_ChangeCountOfSplitItem::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ChangeCountOfSplitItem, CallFunc_InRange_FloatFloat_ReturnValue) == 0x000040, "Member 'JigSplitWidget_C_ChangeCountOfSplitItem::CallFunc_InRange_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ChangeCountOfSplitItem, CallFunc_Subtract_IntInt_ReturnValue) == 0x000044, "Member 'JigSplitWidget_C_ChangeCountOfSplitItem::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ChangeCountOfSplitItem, CallFunc_BooleanAND_ReturnValue) == 0x000048, "Member 'JigSplitWidget_C_ChangeCountOfSplitItem::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ChangeCountOfSplitItem, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000050, "Member 'JigSplitWidget_C_ChangeCountOfSplitItem::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ChangeCountOfSplitItem, CallFunc_InRange_FloatFloat_ReturnValue_1) == 0x000058, "Member 'JigSplitWidget_C_ChangeCountOfSplitItem::CallFunc_InRange_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ChangeCountOfSplitItem, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000060, "Member 'JigSplitWidget_C_ChangeCountOfSplitItem::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ChangeCountOfSplitItem, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000068, "Member 'JigSplitWidget_C_ChangeCountOfSplitItem::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ChangeCountOfSplitItem, CallFunc_FClamp_ReturnValue) == 0x000070, "Member 'JigSplitWidget_C_ChangeCountOfSplitItem::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ChangeCountOfSplitItem, CallFunc_PlayEvent2D_ReturnValue) == 0x000078, "Member 'JigSplitWidget_C_ChangeCountOfSplitItem::CallFunc_PlayEvent2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ChangeCountOfSplitItem, CallFunc_CountOut_OutInt) == 0x000080, "Member 'JigSplitWidget_C_ChangeCountOfSplitItem::CallFunc_CountOut_OutInt' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ChangeCountOfSplitItem, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000084, "Member 'JigSplitWidget_C_ChangeCountOfSplitItem::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ChangeCountOfSplitItem, CallFunc_Conv_IntToText_ReturnValue_2) == 0x000088, "Member 'JigSplitWidget_C_ChangeCountOfSplitItem::CallFunc_Conv_IntToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ChangeCountOfSplitItem, CallFunc_Add_IntInt_ReturnValue) == 0x0000A0, "Member 'JigSplitWidget_C_ChangeCountOfSplitItem::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ChangeCountOfSplitItem, CallFunc_InRange_FloatFloat_Value_ImplicitCast) == 0x0000A8, "Member 'JigSplitWidget_C_ChangeCountOfSplitItem::CallFunc_InRange_FloatFloat_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ChangeCountOfSplitItem, CallFunc_InRange_FloatFloat_Value_ImplicitCast_1) == 0x0000B0, "Member 'JigSplitWidget_C_ChangeCountOfSplitItem::CallFunc_InRange_FloatFloat_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ChangeCountOfSplitItem, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x0000B8, "Member 'JigSplitWidget_C_ChangeCountOfSplitItem::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");

// Function JigSplitWidget.JigSplitWidget_C.ExecuteUbergraph_JigSplitWidget
// 0x0510 (0x0510 - 0x0000)
struct JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0050(0x0018)()
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x0070(0x0018)()
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0094(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_Value;                          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value_1;                // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue;           // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B6[0x2];                                       // 0x00B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D6[0x2];                                       // 0x00D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC;                  // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_CountOut_OutInt;                          // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_TabsWindow_C*                        CallFunc_GetTabsWidget_Widget;                     // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC_1;                // 0x0110(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_TabsWindow_C*                        CallFunc_GetTabsWidget_Widget_1;                   // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_133[0x5];                                      // 0x0133(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC_2;                // 0x0140(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_TabsWindow_C*                        CallFunc_GetTabsWidget_Widget_2;                   // 0x0158(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_1;                // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0178(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CountOut_OutInt_1;                        // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x018C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_3;             // 0x01A0(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue;       // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue_1;     // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DA[0x2];                                      // 0x01DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_ComponentBoundEvent_Value;                  // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_2;           // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_UpdateCount_Count;                        // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_2;                // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_CountOut_OutInt_2;                        // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_3;            // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_3;           // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_4;             // 0x0208(0x0018)()
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_4;           // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_3;                // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_4;                // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_V2_C*                   K2Node_DynamicCast_AsSurvival_Player_V2;           // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             CallFunc_TempFItem_StructOut;                      // 0x0270(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_1;              // 0x0490(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanAddItem_Can;                           // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_499[0x3];                                      // 0x0499(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_CanAddItem_SlotIndex;                     // 0x049C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanAddItem_CanStack;                      // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A1[0x7];                                      // 0x04A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJSI_Slot_C*                            CallFunc_CanAddItem_ItemRef;                       // 0x04A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_V2_C*                   K2Node_DynamicCast_AsSurvival_Player_V2_1;         // 0x04B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x04B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x04B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x04BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BB[0x5];                                      // 0x04BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_2;              // 0x04C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x04C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C9[0x7];                                      // 0x04C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_V2_C*                   K2Node_DynamicCast_AsSurvival_Player_V2_2;         // 0x04D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D9[0x7];                                      // 0x04D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_OnCounterValueChanged_Value_ImplicitCast; // 0x04E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_InRange_FloatFloat_Value_ImplicitCast;    // 0x04E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x04F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_SliderValue_ImplicitCast;       // 0x04F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetValue_InValue_ImplicitCast;            // 0x0500(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetMaxValue_InValue_ImplicitCast;         // 0x0504(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x0508(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast_1;      // 0x050C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget) == 0x000008, "Wrong alignment on JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget");
static_assert(sizeof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget) == 0x000510, "Wrong size on JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, EntryPoint) == 0x000000, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000040, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000048, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000050, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_FTrunc_ReturnValue) == 0x000068, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_Conv_IntToText_ReturnValue_2) == 0x000070, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_Conv_IntToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_Add_IntInt_ReturnValue) == 0x000088, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_Array_Length_ReturnValue) == 0x00008C, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_Greater_IntInt_ReturnValue) == 0x000090, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, K2Node_CreateDelegate_OutputDelegate_2) == 0x000094, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, K2Node_CustomEvent_Value) == 0x0000A8, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::K2Node_CustomEvent_Value' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, K2Node_ComponentBoundEvent_Value_1) == 0x0000B0, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::K2Node_ComponentBoundEvent_Value_1' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_IsValid_ReturnValue) == 0x0000B4, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_InRange_FloatFloat_ReturnValue) == 0x0000B5, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_InRange_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_Conv_IntToDouble_ReturnValue) == 0x0000B8, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000C0, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_Round_ReturnValue) == 0x0000C8, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000CC, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_SelectInt_ReturnValue) == 0x0000D0, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, K2Node_Event_IsDesignTime) == 0x0000D4, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_IsValid_ReturnValue_1) == 0x0000D5, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_GetPlayerController_ReturnValue) == 0x0000D8, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, K2Node_DynamicCast_AsBPI_Surv_PC) == 0x0000E0, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::K2Node_DynamicCast_AsBPI_Surv_PC' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_CountOut_OutInt) == 0x0000F4, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_CountOut_OutInt' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_GetTabsWidget_Widget) == 0x0000F8, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_GetTabsWidget_Widget' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_Subtract_IntInt_ReturnValue) == 0x000100, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000104, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_GetPlayerController_ReturnValue_1) == 0x000108, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, K2Node_DynamicCast_AsBPI_Surv_PC_1) == 0x000110, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::K2Node_DynamicCast_AsBPI_Surv_PC_1' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, K2Node_DynamicCast_bSuccess_1) == 0x000120, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_GetTabsWidget_Widget_1) == 0x000128, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_GetTabsWidget_Widget_1' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_IsValid_ReturnValue_2) == 0x000130, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_BooleanAND_ReturnValue) == 0x000131, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000132, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_GetPlayerController_ReturnValue_2) == 0x000138, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, K2Node_DynamicCast_AsBPI_Surv_PC_2) == 0x000140, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::K2Node_DynamicCast_AsBPI_Surv_PC_2' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, K2Node_DynamicCast_bSuccess_2) == 0x000150, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_GetTabsWidget_Widget_2) == 0x000158, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_GetTabsWidget_Widget_2' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_PlayAnimationForward_ReturnValue) == 0x000160, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_PlayEvent2D_ReturnValue) == 0x000168, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_PlayEvent2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_PlayEvent2D_ReturnValue_1) == 0x000170, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_PlayEvent2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, K2Node_CreateDelegate_OutputDelegate_3) == 0x000178, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_CountOut_OutInt_1) == 0x000188, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_CountOut_OutInt_1' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, K2Node_CreateDelegate_OutputDelegate_4) == 0x00018C, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x00019C, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_Conv_IntToText_ReturnValue_3) == 0x0001A0, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_Conv_IntToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x0001B8, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x0001C0, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_IsValid_ReturnValue_3) == 0x0001C8, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x0001D0, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_K2_IsTimerActiveHandle_ReturnValue) == 0x0001D8, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_K2_IsTimerActiveHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_K2_IsTimerActiveHandle_ReturnValue_1) == 0x0001D9, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_K2_IsTimerActiveHandle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, K2Node_ComponentBoundEvent_Value) == 0x0001DC, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_Conv_IntToDouble_ReturnValue_2) == 0x0001E0, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_Conv_IntToDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x0001E8, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_UpdateCount_Count) == 0x0001EC, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_UpdateCount_Count' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_PlayEvent2D_ReturnValue_2) == 0x0001F0, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_PlayEvent2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_CountOut_OutInt_2) == 0x0001F8, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_CountOut_OutInt_2' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_Subtract_IntInt_ReturnValue_3) == 0x0001FC, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_Subtract_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_Conv_IntToDouble_ReturnValue_3) == 0x000200, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_Conv_IntToDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_Conv_IntToText_ReturnValue_4) == 0x000208, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_Conv_IntToText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_Conv_IntToDouble_ReturnValue_4) == 0x000220, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_Conv_IntToDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_PlayEvent2D_ReturnValue_3) == 0x000228, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_PlayEvent2D_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000230, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_FClamp_ReturnValue) == 0x000238, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_PlayEvent2D_ReturnValue_4) == 0x000240, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_PlayEvent2D_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000248, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_FClamp_ReturnValue_1) == 0x000250, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_GetPlayerPawn_ReturnValue) == 0x000258, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, K2Node_DynamicCast_AsSurvival_Player_V2) == 0x000260, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::K2Node_DynamicCast_AsSurvival_Player_V2' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, K2Node_DynamicCast_bSuccess_3) == 0x000268, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_TempFItem_StructOut) == 0x000270, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_TempFItem_StructOut' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_GetPlayerPawn_ReturnValue_1) == 0x000490, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_GetPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_CanAddItem_Can) == 0x000498, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_CanAddItem_Can' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_CanAddItem_SlotIndex) == 0x00049C, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_CanAddItem_SlotIndex' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_CanAddItem_CanStack) == 0x0004A0, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_CanAddItem_CanStack' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_CanAddItem_ItemRef) == 0x0004A8, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_CanAddItem_ItemRef' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, K2Node_DynamicCast_AsSurvival_Player_V2_1) == 0x0004B0, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::K2Node_DynamicCast_AsSurvival_Player_V2_1' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, K2Node_DynamicCast_bSuccess_4) == 0x0004B8, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_BooleanAND_ReturnValue_1) == 0x0004B9, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_IsValid_ReturnValue_4) == 0x0004BA, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_GetPlayerPawn_ReturnValue_2) == 0x0004C0, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_GetPlayerPawn_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0004C8, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, K2Node_DynamicCast_AsSurvival_Player_V2_2) == 0x0004D0, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::K2Node_DynamicCast_AsSurvival_Player_V2_2' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, K2Node_DynamicCast_bSuccess_5) == 0x0004D8, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_OnCounterValueChanged_Value_ImplicitCast) == 0x0004E0, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_OnCounterValueChanged_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_InRange_FloatFloat_Value_ImplicitCast) == 0x0004E8, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_InRange_FloatFloat_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_Multiply_DoubleDouble_B_ImplicitCast) == 0x0004F0, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_Multiply_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, K2Node_VariableSet_SliderValue_ImplicitCast) == 0x0004F8, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::K2Node_VariableSet_SliderValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_SetValue_InValue_ImplicitCast) == 0x000500, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_SetValue_InValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_SetMaxValue_InValue_ImplicitCast) == 0x000504, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_SetMaxValue_InValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x000508, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");
static_assert(offsetof(JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget, CallFunc_SetPercent_InPercent_ImplicitCast_1) == 0x00050C, "Member 'JigSplitWidget_C_ExecuteUbergraph_JigSplitWidget::CallFunc_SetPercent_InPercent_ImplicitCast_1' has a wrong offset!");

// Function JigSplitWidget.JigSplitWidget_C.OnCounterValueChanged
// 0x0008 (0x0008 - 0x0000)
struct JigSplitWidget_C_OnCounterValueChanged final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(JigSplitWidget_C_OnCounterValueChanged) == 0x000008, "Wrong alignment on JigSplitWidget_C_OnCounterValueChanged");
static_assert(sizeof(JigSplitWidget_C_OnCounterValueChanged) == 0x000008, "Wrong size on JigSplitWidget_C_OnCounterValueChanged");
static_assert(offsetof(JigSplitWidget_C_OnCounterValueChanged, Value) == 0x000000, "Member 'JigSplitWidget_C_OnCounterValueChanged::Value' has a wrong offset!");

// Function JigSplitWidget.JigSplitWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct JigSplitWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(JigSplitWidget_C_PreConstruct) == 0x000001, "Wrong alignment on JigSplitWidget_C_PreConstruct");
static_assert(sizeof(JigSplitWidget_C_PreConstruct) == 0x000001, "Wrong size on JigSplitWidget_C_PreConstruct");
static_assert(offsetof(JigSplitWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'JigSplitWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function JigSplitWidget.JigSplitWidget_C.TempFItem
// 0x0440 (0x0440 - 0x0000)
struct JigSplitWidget_C_TempFItem final
{
public:
	struct FFItemInfo                             StructOut;                                         // 0x0000(0x0220)(Parm, OutParm, ContainsInstancedReference, HasGetValueTypeHash)
	struct FFItemInfo                             NewLocalVar;                                       // 0x0220(0x0220)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(JigSplitWidget_C_TempFItem) == 0x000008, "Wrong alignment on JigSplitWidget_C_TempFItem");
