#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JSI_Slot

#include "Basic.hpp"

#include "JSItemType_structs.hpp"
#include "FMODStudio_structs.hpp"
#include "E_ShopContainer_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FItemInfo_structs.hpp"
#include "SlateCore_structs.hpp"
#include "ContainerType_structs.hpp"
#include "UMG_structs.hpp"
#include "AttachmentInfo_structs.hpp"
#include "S_ShopItemList_structs.hpp"
#include "S_Attachment_structs.hpp"
#include "E_ItemColorTypes_structs.hpp"
#include "Engine_structs.hpp"
#include "SlotRarity_structs.hpp"
#include "InputCore_structs.hpp"
#include "RarityColors_structs.hpp"


namespace SDK::Params
{

// Function JSI_Slot.JSI_Slot_C.AddAttachment
// 0x0014 (0x0014 - 0x0000)
struct JSI_Slot_C_AddAttachment final
{
public:
	struct FAttachmentInfo                        AttachmentInfo;                                    // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(JSI_Slot_C_AddAttachment) == 0x000004, "Wrong alignment on JSI_Slot_C_AddAttachment");
static_assert(sizeof(JSI_Slot_C_AddAttachment) == 0x000014, "Wrong size on JSI_Slot_C_AddAttachment");
static_assert(offsetof(JSI_Slot_C_AddAttachment, AttachmentInfo) == 0x000000, "Member 'JSI_Slot_C_AddAttachment::AttachmentInfo' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_AddAttachment, CallFunc_Array_Add_ReturnValue) == 0x000010, "Member 'JSI_Slot_C_AddAttachment::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function JSI_Slot.JSI_Slot_C.AddToXY
// 0x0058 (0x0058 - 0x0000)
struct JSI_Slot_C_AddToXY final
{
public:
	int32                                         X;                                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Y;                                                 // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              SlotDimension;                                     // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(JSI_Slot_C_AddToXY) == 0x000008, "Wrong alignment on JSI_Slot_C_AddToXY");
static_assert(sizeof(JSI_Slot_C_AddToXY) == 0x000058, "Wrong size on JSI_Slot_C_AddToXY");
static_assert(offsetof(JSI_Slot_C_AddToXY, X) == 0x000000, "Member 'JSI_Slot_C_AddToXY::X' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_AddToXY, Y) == 0x000004, "Member 'JSI_Slot_C_AddToXY::Y' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_AddToXY, SlotDimension) == 0x000008, "Member 'JSI_Slot_C_AddToXY::SlotDimension' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_AddToXY, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000018, "Member 'JSI_Slot_C_AddToXY::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_AddToXY, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000020, "Member 'JSI_Slot_C_AddToXY::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_AddToXY, CallFunc_BreakVector2D_X) == 0x000028, "Member 'JSI_Slot_C_AddToXY::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_AddToXY, CallFunc_BreakVector2D_Y) == 0x000030, "Member 'JSI_Slot_C_AddToXY::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_AddToXY, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000038, "Member 'JSI_Slot_C_AddToXY::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_AddToXY, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000040, "Member 'JSI_Slot_C_AddToXY::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_AddToXY, CallFunc_MakeVector2D_ReturnValue) == 0x000048, "Member 'JSI_Slot_C_AddToXY::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

// Function JSI_Slot.JSI_Slot_C.BlockTimer
// 0x0008 (0x0008 - 0x0000)
struct JSI_Slot_C_BlockTimer final
{
public:
	double                                        Param_Time;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(JSI_Slot_C_BlockTimer) == 0x000008, "Wrong alignment on JSI_Slot_C_BlockTimer");
static_assert(sizeof(JSI_Slot_C_BlockTimer) == 0x000008, "Wrong size on JSI_Slot_C_BlockTimer");
static_assert(offsetof(JSI_Slot_C_BlockTimer, Param_Time) == 0x000000, "Member 'JSI_Slot_C_BlockTimer::Param_Time' has a wrong offset!");

// Function JSI_Slot.JSI_Slot_C.ButtonPressed
// 0x0003 (0x0003 - 0x0000)
struct JSI_Slot_C_ButtonPressed final
{
public:
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(JSI_Slot_C_ButtonPressed) == 0x000001, "Wrong alignment on JSI_Slot_C_ButtonPressed");
static_assert(sizeof(JSI_Slot_C_ButtonPressed) == 0x000003, "Wrong size on JSI_Slot_C_ButtonPressed");
static_assert(offsetof(JSI_Slot_C_ButtonPressed, CallFunc_Not_PreBool_ReturnValue) == 0x000000, "Member 'JSI_Slot_C_ButtonPressed::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_ButtonPressed, CallFunc_Not_PreBool_ReturnValue_1) == 0x000001, "Member 'JSI_Slot_C_ButtonPressed::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_ButtonPressed, CallFunc_BooleanOR_ReturnValue) == 0x000002, "Member 'JSI_Slot_C_ButtonPressed::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function JSI_Slot.JSI_Slot_C.Calculate Result Price
// 0x0518 (0x0518 - 0x0000)
struct JSI_Slot_C_Calculate_Result_Price final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Price;                                             // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_ShopContainer                               Temp_byte_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJSItemType                                   Temp_byte_Variable_1;                              // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4;                              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_ShopContainer                               Temp_byte_Variable_2;                              // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63[0x5];                                       // 0x0063(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             CallFunc_GetDataTableRowFromName_OutRow;           // 0x0068(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x3];                                      // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAttachmentInfo                        CallFunc_Array_Get_Item;                           // 0x028C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x02A0(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C1[0x3];                                      // 0x04C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x04C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x04C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_7;                              // 0x04C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CA[0x2];                                      // 0x04CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Round_ReturnValue;                        // 0x04CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_1;                           // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D1[0x3];                                      // 0x04D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x04D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D9[0x7];                                      // 0x04D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default_2;                           // 0x04E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x04E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EC[0x4];                                      // 0x04EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x04F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x04F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0500(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0508(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0510(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(JSI_Slot_C_Calculate_Result_Price) == 0x000008, "Wrong alignment on JSI_Slot_C_Calculate_Result_Price");
static_assert(sizeof(JSI_Slot_C_Calculate_Result_Price) == 0x000518, "Wrong size on JSI_Slot_C_Calculate_Result_Price");
static_assert(offsetof(JSI_Slot_C_Calculate_Result_Price, ReturnValue) == 0x000000, "Member 'JSI_Slot_C_Calculate_Result_Price::ReturnValue' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Result_Price, Price) == 0x000008, "Member 'JSI_Slot_C_Calculate_Result_Price::Price' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Result_Price, Temp_bool_Variable) == 0x000010, "Member 'JSI_Slot_C_Calculate_Result_Price::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Result_Price, Temp_byte_Variable) == 0x000011, "Member 'JSI_Slot_C_Calculate_Result_Price::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Result_Price, Temp_bool_Variable_1) == 0x000012, "Member 'JSI_Slot_C_Calculate_Result_Price::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Result_Price, Temp_bool_Variable_2) == 0x000013, "Member 'JSI_Slot_C_Calculate_Result_Price::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Result_Price, Temp_bool_Variable_3) == 0x000014, "Member 'JSI_Slot_C_Calculate_Result_Price::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Result_Price, Temp_bool_Variable_4) == 0x000015, "Member 'JSI_Slot_C_Calculate_Result_Price::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Result_Price, Temp_byte_Variable_1) == 0x000016, "Member 'JSI_Slot_C_Calculate_Result_Price::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Result_Price, Temp_real_Variable) == 0x000018, "Member 'JSI_Slot_C_Calculate_Result_Price::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Result_Price, Temp_real_Variable_1) == 0x000020, "Member 'JSI_Slot_C_Calculate_Result_Price::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Result_Price, Temp_real_Variable_2) == 0x000028, "Member 'JSI_Slot_C_Calculate_Result_Price::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Result_Price, Temp_real_Variable_3) == 0x000030, "Member 'JSI_Slot_C_Calculate_Result_Price::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Result_Price, Temp_real_Variable_4) == 0x000038, "Member 'JSI_Slot_C_Calculate_Result_Price::Temp_real_Variable_4' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Result_Price, Temp_int_Array_Index_Variable) == 0x000040, "Member 'JSI_Slot_C_Calculate_Result_Price::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Result_Price, Temp_bool_Variable_5) == 0x000044, "Member 'JSI_Slot_C_Calculate_Result_Price::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Result_Price, CallFunc_GetPlayerController_ReturnValue) == 0x000048, "Member 'JSI_Slot_C_Calculate_Result_Price::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Result_Price, CallFunc_K2_GetPawn_ReturnValue) == 0x000050, "Member 'JSI_Slot_C_Calculate_Result_Price::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Result_Price, K2Node_DynamicCast_AsSurvival_Player) == 0x000058, "Member 'JSI_Slot_C_Calculate_Result_Price::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Result_Price, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'JSI_Slot_C_Calculate_Result_Price::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Result_Price, K2Node_Select_Default) == 0x000061, "Member 'JSI_Slot_C_Calculate_Result_Price::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Result_Price, Temp_byte_Variable_2) == 0x000062, "Member 'JSI_Slot_C_Calculate_Result_Price::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Result_Price, CallFunc_GetDataTableRowFromName_OutRow) == 0x000068, "Member 'JSI_Slot_C_Calculate_Result_Price::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Result_Price, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000288, "Member 'JSI_Slot_C_Calculate_Result_Price::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Result_Price, CallFunc_Array_Get_Item) == 0x00028C, "Member 'JSI_Slot_C_Calculate_Result_Price::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Result_Price, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x0002A0, "Member 'JSI_Slot_C_Calculate_Result_Price::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Result_Price, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x0004C0, "Member 'JSI_Slot_C_Calculate_Result_Price::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Result_Price, CallFunc_Array_Length_ReturnValue) == 0x0004C4, "Member 'JSI_Slot_C_Calculate_Result_Price::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Result_Price, Temp_bool_Variable_6) == 0x0004C8, "Member 'JSI_Slot_C_Calculate_Result_Price::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Result_Price, Temp_bool_Variable_7) == 0x0004C9, "Member 'JSI_Slot_C_Calculate_Result_Price::Temp_bool_Variable_7' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Result_Price, CallFunc_Round_ReturnValue) == 0x0004CC, "Member 'JSI_Slot_C_Calculate_Result_Price::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Result_Price, K2Node_Select_Default_1) == 0x0004D0, "Member 'JSI_Slot_C_Calculate_Result_Price::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Result_Price, Temp_int_Loop_Counter_Variable) == 0x0004D4, "Member 'JSI_Slot_C_Calculate_Result_Price::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Result_Price, CallFunc_Less_IntInt_ReturnValue) == 0x0004D8, "Member 'JSI_Slot_C_Calculate_Result_Price::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Result_Price, K2Node_Select_Default_2) == 0x0004E0, "Member 'JSI_Slot_C_Calculate_Result_Price::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Result_Price, CallFunc_Add_IntInt_ReturnValue) == 0x0004E8, "Member 'JSI_Slot_C_Calculate_Result_Price::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Result_Price, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0004F0, "Member 'JSI_Slot_C_Calculate_Result_Price::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Result_Price, CallFunc_SelectFloat_ReturnValue) == 0x0004F8, "Member 'JSI_Slot_C_Calculate_Result_Price::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Result_Price, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000500, "Member 'JSI_Slot_C_Calculate_Result_Price::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Result_Price, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000508, "Member 'JSI_Slot_C_Calculate_Result_Price::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Result_Price, CallFunc_SelectFloat_ReturnValue_1) == 0x000510, "Member 'JSI_Slot_C_Calculate_Result_Price::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");

// Function JSI_Slot.JSI_Slot_C.Calculate Size With Ratio
// 0x06B0 (0x06B0 - 0x0000)
struct JSI_Slot_C_Calculate_Size_With_Ratio final
{
public:
	struct FVector2D                              Param_Size;                                        // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              FinishSize;                                        // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              BaseSize;                                          // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CurrentSlotDimension;                              // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              LocalSize;                                         // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_4;                            // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_5;                            // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_6;                            // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_7;                            // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_8;                            // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_9;                            // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_ItemColorTypes                              Temp_byte_Variable;                                // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X;                          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_5;      // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_2;           // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0160(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_6;      // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_7;      // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_3;           // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0188(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0198(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A8[0x8];                                      // 0x01A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_GetSlotBrushes_BG_Brush;                  // 0x01B0(0x00D0)()
	struct FSlateBrush                            CallFunc_GetSlotBrushes_Gradient_Brush;            // 0x0280(0x00D0)()
	struct FSlateBrush                            CallFunc_GetSlotBrushes_Highlight_Brush;           // 0x0350(0x00D0)()
	struct FSlateBrush                            CallFunc_GetSlotBrushes_Hover_Brush;               // 0x0420(0x00D0)()
	class UPaperSprite*                           CallFunc_GetSlotBrushes_BGSprite;                  // 0x04F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_isRotated__ReturnValue;                   // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F9[0x7];                                      // 0x04F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_MakeBrushFromSprite_ReturnValue;          // 0x0500(0x00D0)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x05D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D1[0xF];                                      // 0x05D1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_SetFieldsInStruct_StructOut;                // 0x05E0(0x00D0)()
};
static_assert(alignof(JSI_Slot_C_Calculate_Size_With_Ratio) == 0x000010, "Wrong alignment on JSI_Slot_C_Calculate_Size_With_Ratio");
static_assert(sizeof(JSI_Slot_C_Calculate_Size_With_Ratio) == 0x0006B0, "Wrong size on JSI_Slot_C_Calculate_Size_With_Ratio");
static_assert(offsetof(JSI_Slot_C_Calculate_Size_With_Ratio, Param_Size) == 0x000000, "Member 'JSI_Slot_C_Calculate_Size_With_Ratio::Param_Size' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Size_With_Ratio, FinishSize) == 0x000010, "Member 'JSI_Slot_C_Calculate_Size_With_Ratio::FinishSize' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Size_With_Ratio, BaseSize) == 0x000020, "Member 'JSI_Slot_C_Calculate_Size_With_Ratio::BaseSize' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Size_With_Ratio, CurrentSlotDimension) == 0x000030, "Member 'JSI_Slot_C_Calculate_Size_With_Ratio::CurrentSlotDimension' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Size_With_Ratio, LocalSize) == 0x000040, "Member 'JSI_Slot_C_Calculate_Size_With_Ratio::LocalSize' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Size_With_Ratio, Temp_struct_Variable) == 0x000050, "Member 'JSI_Slot_C_Calculate_Size_With_Ratio::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Size_With_Ratio, Temp_struct_Variable_1) == 0x000060, "Member 'JSI_Slot_C_Calculate_Size_With_Ratio::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Size_With_Ratio, Temp_struct_Variable_2) == 0x000070, "Member 'JSI_Slot_C_Calculate_Size_With_Ratio::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Size_With_Ratio, Temp_struct_Variable_3) == 0x000080, "Member 'JSI_Slot_C_Calculate_Size_With_Ratio::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Size_With_Ratio, Temp_struct_Variable_4) == 0x000090, "Member 'JSI_Slot_C_Calculate_Size_With_Ratio::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Size_With_Ratio, Temp_struct_Variable_5) == 0x0000A0, "Member 'JSI_Slot_C_Calculate_Size_With_Ratio::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Size_With_Ratio, Temp_struct_Variable_6) == 0x0000B0, "Member 'JSI_Slot_C_Calculate_Size_With_Ratio::Temp_struct_Variable_6' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Size_With_Ratio, Temp_struct_Variable_7) == 0x0000C0, "Member 'JSI_Slot_C_Calculate_Size_With_Ratio::Temp_struct_Variable_7' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Size_With_Ratio, Temp_struct_Variable_8) == 0x0000D0, "Member 'JSI_Slot_C_Calculate_Size_With_Ratio::Temp_struct_Variable_8' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Size_With_Ratio, Temp_struct_Variable_9) == 0x0000E0, "Member 'JSI_Slot_C_Calculate_Size_With_Ratio::Temp_struct_Variable_9' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Size_With_Ratio, Temp_byte_Variable) == 0x0000F0, "Member 'JSI_Slot_C_Calculate_Size_With_Ratio::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Size_With_Ratio, CallFunc_BreakVector2D_X) == 0x0000F8, "Member 'JSI_Slot_C_Calculate_Size_With_Ratio::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Size_With_Ratio, CallFunc_BreakVector2D_Y) == 0x000100, "Member 'JSI_Slot_C_Calculate_Size_With_Ratio::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Size_With_Ratio, CallFunc_BreakVector2D_X_1) == 0x000108, "Member 'JSI_Slot_C_Calculate_Size_With_Ratio::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Size_With_Ratio, CallFunc_BreakVector2D_Y_1) == 0x000110, "Member 'JSI_Slot_C_Calculate_Size_With_Ratio::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Size_With_Ratio, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000118, "Member 'JSI_Slot_C_Calculate_Size_With_Ratio::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Size_With_Ratio, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000120, "Member 'JSI_Slot_C_Calculate_Size_With_Ratio::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Size_With_Ratio, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000128, "Member 'JSI_Slot_C_Calculate_Size_With_Ratio::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Size_With_Ratio, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x000130, "Member 'JSI_Slot_C_Calculate_Size_With_Ratio::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Size_With_Ratio, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000138, "Member 'JSI_Slot_C_Calculate_Size_With_Ratio::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Size_With_Ratio, CallFunc_Multiply_DoubleDouble_ReturnValue_4) == 0x000140, "Member 'JSI_Slot_C_Calculate_Size_With_Ratio::CallFunc_Multiply_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Size_With_Ratio, CallFunc_Multiply_DoubleDouble_ReturnValue_5) == 0x000148, "Member 'JSI_Slot_C_Calculate_Size_With_Ratio::CallFunc_Multiply_DoubleDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Size_With_Ratio, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000150, "Member 'JSI_Slot_C_Calculate_Size_With_Ratio::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Size_With_Ratio, CallFunc_Add_DoubleDouble_ReturnValue_2) == 0x000158, "Member 'JSI_Slot_C_Calculate_Size_With_Ratio::CallFunc_Add_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Size_With_Ratio, CallFunc_MakeVector2D_ReturnValue) == 0x000160, "Member 'JSI_Slot_C_Calculate_Size_With_Ratio::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Size_With_Ratio, CallFunc_Multiply_DoubleDouble_ReturnValue_6) == 0x000170, "Member 'JSI_Slot_C_Calculate_Size_With_Ratio::CallFunc_Multiply_DoubleDouble_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Size_With_Ratio, CallFunc_Multiply_DoubleDouble_ReturnValue_7) == 0x000178, "Member 'JSI_Slot_C_Calculate_Size_With_Ratio::CallFunc_Multiply_DoubleDouble_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Size_With_Ratio, CallFunc_Add_DoubleDouble_ReturnValue_3) == 0x000180, "Member 'JSI_Slot_C_Calculate_Size_With_Ratio::CallFunc_Add_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Size_With_Ratio, CallFunc_MakeVector2D_ReturnValue_1) == 0x000188, "Member 'JSI_Slot_C_Calculate_Size_With_Ratio::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Size_With_Ratio, K2Node_Select_Default) == 0x000198, "Member 'JSI_Slot_C_Calculate_Size_With_Ratio::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Size_With_Ratio, CallFunc_GetSlotBrushes_BG_Brush) == 0x0001B0, "Member 'JSI_Slot_C_Calculate_Size_With_Ratio::CallFunc_GetSlotBrushes_BG_Brush' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Size_With_Ratio, CallFunc_GetSlotBrushes_Gradient_Brush) == 0x000280, "Member 'JSI_Slot_C_Calculate_Size_With_Ratio::CallFunc_GetSlotBrushes_Gradient_Brush' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Size_With_Ratio, CallFunc_GetSlotBrushes_Highlight_Brush) == 0x000350, "Member 'JSI_Slot_C_Calculate_Size_With_Ratio::CallFunc_GetSlotBrushes_Highlight_Brush' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Size_With_Ratio, CallFunc_GetSlotBrushes_Hover_Brush) == 0x000420, "Member 'JSI_Slot_C_Calculate_Size_With_Ratio::CallFunc_GetSlotBrushes_Hover_Brush' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Size_With_Ratio, CallFunc_GetSlotBrushes_BGSprite) == 0x0004F0, "Member 'JSI_Slot_C_Calculate_Size_With_Ratio::CallFunc_GetSlotBrushes_BGSprite' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Size_With_Ratio, CallFunc_isRotated__ReturnValue) == 0x0004F8, "Member 'JSI_Slot_C_Calculate_Size_With_Ratio::CallFunc_isRotated__ReturnValue' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Size_With_Ratio, CallFunc_MakeBrushFromSprite_ReturnValue) == 0x000500, "Member 'JSI_Slot_C_Calculate_Size_With_Ratio::CallFunc_MakeBrushFromSprite_ReturnValue' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Size_With_Ratio, CallFunc_Not_PreBool_ReturnValue) == 0x0005D0, "Member 'JSI_Slot_C_Calculate_Size_With_Ratio::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_Calculate_Size_With_Ratio, K2Node_SetFieldsInStruct_StructOut) == 0x0005E0, "Member 'JSI_Slot_C_Calculate_Size_With_Ratio::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");

// Function JSI_Slot.JSI_Slot_C.CanAttachAttachment
// 0x0030 (0x0030 - 0x0000)
struct JSI_Slot_C_CanAttachAttachment final
{
public:
	class FName                                   AttachmentID;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSupportedAttachment_ReturnValue;        // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAttachmentInfo                        CallFunc_Array_Get_Item;                           // 0x001C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(JSI_Slot_C_CanAttachAttachment) == 0x000004, "Wrong alignment on JSI_Slot_C_CanAttachAttachment");
static_assert(sizeof(JSI_Slot_C_CanAttachAttachment) == 0x000030, "Wrong size on JSI_Slot_C_CanAttachAttachment");
static_assert(offsetof(JSI_Slot_C_CanAttachAttachment, AttachmentID) == 0x000000, "Member 'JSI_Slot_C_CanAttachAttachment::AttachmentID' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_CanAttachAttachment, ReturnValue) == 0x000008, "Member 'JSI_Slot_C_CanAttachAttachment::ReturnValue' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_CanAttachAttachment, CallFunc_IsSupportedAttachment_ReturnValue) == 0x000009, "Member 'JSI_Slot_C_CanAttachAttachment::CallFunc_IsSupportedAttachment_ReturnValue' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_CanAttachAttachment, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'JSI_Slot_C_CanAttachAttachment::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_CanAttachAttachment, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'JSI_Slot_C_CanAttachAttachment::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_CanAttachAttachment, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'JSI_Slot_C_CanAttachAttachment::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_CanAttachAttachment, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'JSI_Slot_C_CanAttachAttachment::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_CanAttachAttachment, CallFunc_Array_Get_Item) == 0x00001C, "Member 'JSI_Slot_C_CanAttachAttachment::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_CanAttachAttachment, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'JSI_Slot_C_CanAttachAttachment::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_CanAttachAttachment, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00002D, "Member 'JSI_Slot_C_CanAttachAttachment::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");

// Function JSI_Slot.JSI_Slot_C.CanOpenSpecialContainer?
// 0x0004 (0x0004 - 0x0000)
struct JSI_Slot_C_CanOpenSpecialContainer_ final
{
public:
	bool                                          Return_value;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(JSI_Slot_C_CanOpenSpecialContainer_) == 0x000001, "Wrong alignment on JSI_Slot_C_CanOpenSpecialContainer_");
static_assert(sizeof(JSI_Slot_C_CanOpenSpecialContainer_) == 0x000004, "Wrong size on JSI_Slot_C_CanOpenSpecialContainer_");
static_assert(offsetof(JSI_Slot_C_CanOpenSpecialContainer_, Return_value) == 0x000000, "Member 'JSI_Slot_C_CanOpenSpecialContainer_::Return_value' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_CanOpenSpecialContainer_, CallFunc_IsVisible_ReturnValue) == 0x000001, "Member 'JSI_Slot_C_CanOpenSpecialContainer_::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_CanOpenSpecialContainer_, CallFunc_IsValid_ReturnValue) == 0x000002, "Member 'JSI_Slot_C_CanOpenSpecialContainer_::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_CanOpenSpecialContainer_, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'JSI_Slot_C_CanOpenSpecialContainer_::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function JSI_Slot.JSI_Slot_C.ChangeImageAnchors
// 0x0001 (0x0001 - 0x0000)
struct JSI_Slot_C_ChangeImageAnchors final
{
public:
	bool                                          Equipped;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(JSI_Slot_C_ChangeImageAnchors) == 0x000001, "Wrong alignment on JSI_Slot_C_ChangeImageAnchors");
static_assert(sizeof(JSI_Slot_C_ChangeImageAnchors) == 0x000001, "Wrong size on JSI_Slot_C_ChangeImageAnchors");
static_assert(offsetof(JSI_Slot_C_ChangeImageAnchors, Equipped) == 0x000000, "Member 'JSI_Slot_C_ChangeImageAnchors::Equipped' has a wrong offset!");

// Function JSI_Slot.JSI_Slot_C.ChangePrice
// 0x0008 (0x0008 - 0x0000)
struct JSI_Slot_C_ChangePrice final
{
public:
	double                                        Price;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(JSI_Slot_C_ChangePrice) == 0x000008, "Wrong alignment on JSI_Slot_C_ChangePrice");
static_assert(sizeof(JSI_Slot_C_ChangePrice) == 0x000008, "Wrong size on JSI_Slot_C_ChangePrice");
static_assert(offsetof(JSI_Slot_C_ChangePrice, Price) == 0x000000, "Member 'JSI_Slot_C_ChangePrice::Price' has a wrong offset!");

// Function JSI_Slot.JSI_Slot_C.ChangeRarity
// 0x0002 (0x0002 - 0x0000)
struct JSI_Slot_C_ChangeRarity final
{
public:
	ESlotRarity                                   Param_Rarity;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Changed_;                                          // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(JSI_Slot_C_ChangeRarity) == 0x000001, "Wrong alignment on JSI_Slot_C_ChangeRarity");
static_assert(sizeof(JSI_Slot_C_ChangeRarity) == 0x000002, "Wrong size on JSI_Slot_C_ChangeRarity");
static_assert(offsetof(JSI_Slot_C_ChangeRarity, Param_Rarity) == 0x000000, "Member 'JSI_Slot_C_ChangeRarity::Param_Rarity' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_ChangeRarity, Changed_) == 0x000001, "Member 'JSI_Slot_C_ChangeRarity::Changed_' has a wrong offset!");

// Function JSI_Slot.JSI_Slot_C.ChangesImageAnchors
// 0x0050 (0x0050 - 0x0000)
struct JSI_Slot_C_ChangesImageAnchors final
{
public:
	struct FWidgetTransform                       K2Node_MakeStruct_WidgetTransform;                 // 0x0000(0x0038)(NoDestructor)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue_1;    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(JSI_Slot_C_ChangesImageAnchors) == 0x000008, "Wrong alignment on JSI_Slot_C_ChangesImageAnchors");
static_assert(sizeof(JSI_Slot_C_ChangesImageAnchors) == 0x000050, "Wrong size on JSI_Slot_C_ChangesImageAnchors");
static_assert(offsetof(JSI_Slot_C_ChangesImageAnchors, K2Node_MakeStruct_WidgetTransform) == 0x000000, "Member 'JSI_Slot_C_ChangesImageAnchors::K2Node_MakeStruct_WidgetTransform' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_ChangesImageAnchors, CallFunc_BreakVector2D_X) == 0x000038, "Member 'JSI_Slot_C_ChangesImageAnchors::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_ChangesImageAnchors, CallFunc_BreakVector2D_Y) == 0x000040, "Member 'JSI_Slot_C_ChangesImageAnchors::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_ChangesImageAnchors, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000048, "Member 'JSI_Slot_C_ChangesImageAnchors::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_ChangesImageAnchors, CallFunc_EqualEqual_DoubleDouble_ReturnValue_1) == 0x000049, "Member 'JSI_Slot_C_ChangesImageAnchors::CallFunc_EqualEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_ChangesImageAnchors, CallFunc_BooleanAND_ReturnValue) == 0x00004A, "Member 'JSI_Slot_C_ChangesImageAnchors::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function JSI_Slot.JSI_Slot_C.CheckRootContainer
// 0x0028 (0x0028 - 0x0000)
struct JSI_Slot_C_CheckRootContainer final
{
public:
	class UJSI_Slot_C*                            DraggedItem;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CanAdd_;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UJSIContainer_C*>                CallFunc_GetContainerHierarchy_Containers;         // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(JSI_Slot_C_CheckRootContainer) == 0x000008, "Wrong alignment on JSI_Slot_C_CheckRootContainer");
static_assert(sizeof(JSI_Slot_C_CheckRootContainer) == 0x000028, "Wrong size on JSI_Slot_C_CheckRootContainer");
static_assert(offsetof(JSI_Slot_C_CheckRootContainer, DraggedItem) == 0x000000, "Member 'JSI_Slot_C_CheckRootContainer::DraggedItem' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_CheckRootContainer, CanAdd_) == 0x000008, "Member 'JSI_Slot_C_CheckRootContainer::CanAdd_' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_CheckRootContainer, CallFunc_GetContainerHierarchy_Containers) == 0x000010, "Member 'JSI_Slot_C_CheckRootContainer::CallFunc_GetContainerHierarchy_Containers' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_CheckRootContainer, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'JSI_Slot_C_CheckRootContainer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_CheckRootContainer, CallFunc_Array_Contains_ReturnValue) == 0x000021, "Member 'JSI_Slot_C_CheckRootContainer::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_CheckRootContainer, CallFunc_Not_PreBool_ReturnValue) == 0x000022, "Member 'JSI_Slot_C_CheckRootContainer::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(JSI_Slot_C_CheckRootContainer, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000023, "Member 'JSI_Slot_C_CheckRootContainer::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function JSI_Slot.JSI_Slot_C.CheckShopContainer
// 0x0048 (0x0048 - 0x0000)
struct JSI_Slot_C_CheckShopContainer final
{
public:
	int32                                         PageIndex;                                         // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_ShopContainer                               GetShopContainer;                                  // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJSIContainer_C*                        ShopContainer;                                     // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
