#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JSIContainer

#include "Basic.hpp"

#include "FItemInfo_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ContainerType_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "ContainerPickupsInfo_structs.hpp"
#include "JSItemType_structs.hpp"
#include "Engine_structs.hpp"
#include "SlotRarity_structs.hpp"
#include "InputCore_structs.hpp"
#include "DefaultItemInfo_structs.hpp"


namespace SDK::Params
{

// Function JSIContainer.JSIContainer_C.AddMultipleInventoryItems
// 0x0288 (0x0288 - 0x0000)
struct JSIContainer_C_AddMultipleInventoryItems final
{
public:
	TArray<int32>                                 ItemIDs;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<int32>                                 NotAdded;                                          // 0x0010(0x0010)(Parm, OutParm)
	TArray<int32>                                 IDNotAdded;                                        // 0x0020(0x0010)(Edit, BlueprintVisible)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddNewInventoryItem_Added;                // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AddNewInventoryItem_SlotIndex;            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             CallFunc_AddNewInventoryItem_ItemInfo;             // 0x0058(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	class UJSI_Slot_C*                            CallFunc_AddNewInventoryItem_SlotItemRef;          // 0x0278(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddNewInventoryItem_StackRemainder;       // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(JSIContainer_C_AddMultipleInventoryItems) == 0x000008, "Wrong alignment on JSIContainer_C_AddMultipleInventoryItems");
static_assert(sizeof(JSIContainer_C_AddMultipleInventoryItems) == 0x000288, "Wrong size on JSIContainer_C_AddMultipleInventoryItems");
static_assert(offsetof(JSIContainer_C_AddMultipleInventoryItems, ItemIDs) == 0x000000, "Member 'JSIContainer_C_AddMultipleInventoryItems::ItemIDs' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddMultipleInventoryItems, NotAdded) == 0x000010, "Member 'JSIContainer_C_AddMultipleInventoryItems::NotAdded' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddMultipleInventoryItems, IDNotAdded) == 0x000020, "Member 'JSIContainer_C_AddMultipleInventoryItems::IDNotAdded' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddMultipleInventoryItems, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'JSIContainer_C_AddMultipleInventoryItems::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddMultipleInventoryItems, Temp_int_Array_Index_Variable) == 0x000034, "Member 'JSIContainer_C_AddMultipleInventoryItems::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddMultipleInventoryItems, CallFunc_Array_Get_Item) == 0x000038, "Member 'JSIContainer_C_AddMultipleInventoryItems::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddMultipleInventoryItems, Temp_int_Loop_Counter_Variable) == 0x00003C, "Member 'JSIContainer_C_AddMultipleInventoryItems::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddMultipleInventoryItems, CallFunc_Array_Add_ReturnValue) == 0x000040, "Member 'JSIContainer_C_AddMultipleInventoryItems::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddMultipleInventoryItems, CallFunc_Less_IntInt_ReturnValue) == 0x000044, "Member 'JSIContainer_C_AddMultipleInventoryItems::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddMultipleInventoryItems, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'JSIContainer_C_AddMultipleInventoryItems::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddMultipleInventoryItems, CallFunc_AddNewInventoryItem_Added) == 0x00004C, "Member 'JSIContainer_C_AddMultipleInventoryItems::CallFunc_AddNewInventoryItem_Added' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddMultipleInventoryItems, CallFunc_AddNewInventoryItem_SlotIndex) == 0x000050, "Member 'JSIContainer_C_AddMultipleInventoryItems::CallFunc_AddNewInventoryItem_SlotIndex' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddMultipleInventoryItems, CallFunc_AddNewInventoryItem_ItemInfo) == 0x000058, "Member 'JSIContainer_C_AddMultipleInventoryItems::CallFunc_AddNewInventoryItem_ItemInfo' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddMultipleInventoryItems, CallFunc_AddNewInventoryItem_SlotItemRef) == 0x000278, "Member 'JSIContainer_C_AddMultipleInventoryItems::CallFunc_AddNewInventoryItem_SlotItemRef' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddMultipleInventoryItems, CallFunc_AddNewInventoryItem_StackRemainder) == 0x000280, "Member 'JSIContainer_C_AddMultipleInventoryItems::CallFunc_AddNewInventoryItem_StackRemainder' has a wrong offset!");

// Function JSIContainer.JSIContainer_C.AddNewInventoryItem
// 0x1288 (0x1288 - 0x0000)
struct JSIContainer_C_AddNewInventoryItem final
{
public:
	class FName                                   ItemId;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ToSlot;                                            // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Rotated_;                                          // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TryRotated_;                                       // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TryToStack_;                                       // 0x0012(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             CustomInfo;                                        // 0x0018(0x0220)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          Added;                                             // 0x0238(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x3];                                      // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SlotIndex;                                         // 0x023C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFItemInfo                             ItemInfo;                                          // 0x0240(0x0220)(Parm, OutParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UJSI_Slot_C*                            SlotItemRef;                                       // 0x0460(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         StackRemainder;                                    // 0x0468(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46C[0x4];                                      // 0x046C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJSI_Slot_C*                            ArrayElement;                                      // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          IdenticalVector;                                   // 0x0478(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_479[0x7];                                      // 0x0479(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              OrigDim;                                           // 0x0480(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FromDataSource;                                    // 0x0490(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_491[0x7];                                      // 0x0491(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              OrigSlotVec;                                       // 0x0498(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFItemInfo                             TempItemInfo;                                      // 0x04A8(0x0220)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         FreeSpace;                                         // 0x06C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentCount;                                      // 0x06CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFItemInfo                             K2Node_SetFieldsInStruct_StructOut;                // 0x06D0(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x08F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x08F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0900(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0910(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0911(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_912[0x2];                                      // 0x0912(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCount_Count;                           // 0x0914(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCount_Count_1;                         // 0x0918(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_UpdateCount_Count;                        // 0x091C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0920(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0921(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_922[0x6];                                      // 0x0922(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0928(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0938(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0939(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x093A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x093B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x093C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x093D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x093E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_3;             // 0x093F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0940(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0944(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_UpdateCount_Count_1;                      // 0x0948(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x094C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94D[0x3];                                      // 0x094D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0950(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0954(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0958(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_959[0x3];                                      // 0x0959(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x095C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0960(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_961[0x7];                                      // 0x0961(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x0968(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x0970(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0978(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_979[0x3];                                      // 0x0979(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x097C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJSI_Slot_C*                            CallFunc_Array_Get_Item;                           // 0x0980(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0988(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x098C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x098D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x098E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddNewItem_Added;                         // 0x098F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddNewItem_AddedToSlot;                   // 0x0990(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_994[0x4];                                      // 0x0994(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             CallFunc_AddNewItem_Info;                          // 0x0998(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	class UJSI_Slot_C*                            CallFunc_AddNewItem_SlotItemRef;                   // 0x0BB8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0BC0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0BD0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0BE0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x0BE1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0BE2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BE3[0x1];                                      // 0x0BE3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0BE4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0BE8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x0BE9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BEA[0x6];                                      // 0x0BEA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             CallFunc_GetDataTableRowFromName_OutRow;           // 0x0BF0(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0E10(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E11[0x7];                                      // 0x0E11(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Select_Default_1;                           // 0x0E18(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFItemInfo                             K2Node_Select_Default_2;                           // 0x0E28(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x1048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1049[0x3];                                     // 0x1049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x104C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddNewItem_Added_1;                       // 0x1050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1051[0x3];                                     // 0x1051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AddNewItem_AddedToSlot_1;                 // 0x1054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFItemInfo                             CallFunc_AddNewItem_Info_1;                        // 0x1058(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	class UJSI_Slot_C*                            CallFunc_AddNewItem_SlotItemRef_1;                 // 0x1278(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_3;                           // 0x1280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x1281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1282[0x2];                                     // 0x1282(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue_2;                  // 0x1284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(JSIContainer_C_AddNewInventoryItem) == 0x000008, "Wrong alignment on JSIContainer_C_AddNewInventoryItem");
static_assert(sizeof(JSIContainer_C_AddNewInventoryItem) == 0x001288, "Wrong size on JSIContainer_C_AddNewInventoryItem");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, ItemId) == 0x000000, "Member 'JSIContainer_C_AddNewInventoryItem::ItemId' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, Count) == 0x000008, "Member 'JSIContainer_C_AddNewInventoryItem::Count' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, ToSlot) == 0x00000C, "Member 'JSIContainer_C_AddNewInventoryItem::ToSlot' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, Rotated_) == 0x000010, "Member 'JSIContainer_C_AddNewInventoryItem::Rotated_' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, TryRotated_) == 0x000011, "Member 'JSIContainer_C_AddNewInventoryItem::TryRotated_' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, TryToStack_) == 0x000012, "Member 'JSIContainer_C_AddNewInventoryItem::TryToStack_' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, CustomInfo) == 0x000018, "Member 'JSIContainer_C_AddNewInventoryItem::CustomInfo' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, Added) == 0x000238, "Member 'JSIContainer_C_AddNewInventoryItem::Added' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, SlotIndex) == 0x00023C, "Member 'JSIContainer_C_AddNewInventoryItem::SlotIndex' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, ItemInfo) == 0x000240, "Member 'JSIContainer_C_AddNewInventoryItem::ItemInfo' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, SlotItemRef) == 0x000460, "Member 'JSIContainer_C_AddNewInventoryItem::SlotItemRef' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, StackRemainder) == 0x000468, "Member 'JSIContainer_C_AddNewInventoryItem::StackRemainder' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, ArrayElement) == 0x000470, "Member 'JSIContainer_C_AddNewInventoryItem::ArrayElement' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, IdenticalVector) == 0x000478, "Member 'JSIContainer_C_AddNewInventoryItem::IdenticalVector' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, OrigDim) == 0x000480, "Member 'JSIContainer_C_AddNewInventoryItem::OrigDim' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, FromDataSource) == 0x000490, "Member 'JSIContainer_C_AddNewInventoryItem::FromDataSource' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, OrigSlotVec) == 0x000498, "Member 'JSIContainer_C_AddNewInventoryItem::OrigSlotVec' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, TempItemInfo) == 0x0004A8, "Member 'JSIContainer_C_AddNewInventoryItem::TempItemInfo' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, FreeSpace) == 0x0006C8, "Member 'JSIContainer_C_AddNewInventoryItem::FreeSpace' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, CurrentCount) == 0x0006CC, "Member 'JSIContainer_C_AddNewInventoryItem::CurrentCount' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, K2Node_SetFieldsInStruct_StructOut) == 0x0006D0, "Member 'JSIContainer_C_AddNewInventoryItem::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, CallFunc_BreakVector2D_X) == 0x0008F0, "Member 'JSIContainer_C_AddNewInventoryItem::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, CallFunc_BreakVector2D_Y) == 0x0008F8, "Member 'JSIContainer_C_AddNewInventoryItem::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, CallFunc_MakeVector2D_ReturnValue) == 0x000900, "Member 'JSIContainer_C_AddNewInventoryItem::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, CallFunc_Greater_IntInt_ReturnValue) == 0x000910, "Member 'JSIContainer_C_AddNewInventoryItem::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000911, "Member 'JSIContainer_C_AddNewInventoryItem::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, CallFunc_GetCount_Count) == 0x000914, "Member 'JSIContainer_C_AddNewInventoryItem::CallFunc_GetCount_Count' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, CallFunc_GetCount_Count_1) == 0x000918, "Member 'JSIContainer_C_AddNewInventoryItem::CallFunc_GetCount_Count_1' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, CallFunc_UpdateCount_Count) == 0x00091C, "Member 'JSIContainer_C_AddNewInventoryItem::CallFunc_UpdateCount_Count' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000920, "Member 'JSIContainer_C_AddNewInventoryItem::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, Temp_bool_Variable) == 0x000921, "Member 'JSIContainer_C_AddNewInventoryItem::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, CallFunc_Conv_NameToString_ReturnValue) == 0x000928, "Member 'JSIContainer_C_AddNewInventoryItem::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, Temp_bool_Variable_1) == 0x000938, "Member 'JSIContainer_C_AddNewInventoryItem::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000939, "Member 'JSIContainer_C_AddNewInventoryItem::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, Temp_bool_Variable_2) == 0x00093A, "Member 'JSIContainer_C_AddNewInventoryItem::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, CallFunc_Not_PreBool_ReturnValue) == 0x00093B, "Member 'JSIContainer_C_AddNewInventoryItem::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, Temp_bool_Variable_3) == 0x00093C, "Member 'JSIContainer_C_AddNewInventoryItem::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, Temp_bool_Variable_4) == 0x00093D, "Member 'JSIContainer_C_AddNewInventoryItem::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, CallFunc_Greater_IntInt_ReturnValue_2) == 0x00093E, "Member 'JSIContainer_C_AddNewInventoryItem::CallFunc_Greater_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, CallFunc_Greater_IntInt_ReturnValue_3) == 0x00093F, "Member 'JSIContainer_C_AddNewInventoryItem::CallFunc_Greater_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, CallFunc_Array_Length_ReturnValue) == 0x000940, "Member 'JSIContainer_C_AddNewInventoryItem::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, CallFunc_Add_IntInt_ReturnValue) == 0x000944, "Member 'JSIContainer_C_AddNewInventoryItem::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, CallFunc_UpdateCount_Count_1) == 0x000948, "Member 'JSIContainer_C_AddNewInventoryItem::CallFunc_UpdateCount_Count_1' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00094C, "Member 'JSIContainer_C_AddNewInventoryItem::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, CallFunc_Subtract_IntInt_ReturnValue) == 0x000950, "Member 'JSIContainer_C_AddNewInventoryItem::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, Temp_int_Loop_Counter_Variable) == 0x000954, "Member 'JSIContainer_C_AddNewInventoryItem::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, CallFunc_Less_IntInt_ReturnValue) == 0x000958, "Member 'JSIContainer_C_AddNewInventoryItem::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, CallFunc_Add_IntInt_ReturnValue_1) == 0x00095C, "Member 'JSIContainer_C_AddNewInventoryItem::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, CallFunc_BooleanAND_ReturnValue) == 0x000960, "Member 'JSIContainer_C_AddNewInventoryItem::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, CallFunc_BreakVector2D_X_1) == 0x000968, "Member 'JSIContainer_C_AddNewInventoryItem::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, CallFunc_BreakVector2D_Y_1) == 0x000970, "Member 'JSIContainer_C_AddNewInventoryItem::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000978, "Member 'JSIContainer_C_AddNewInventoryItem::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, Temp_int_Array_Index_Variable) == 0x00097C, "Member 'JSIContainer_C_AddNewInventoryItem::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, CallFunc_Array_Get_Item) == 0x000980, "Member 'JSIContainer_C_AddNewInventoryItem::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000988, "Member 'JSIContainer_C_AddNewInventoryItem::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x00098C, "Member 'JSIContainer_C_AddNewInventoryItem::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, CallFunc_BooleanAND_ReturnValue_1) == 0x00098D, "Member 'JSIContainer_C_AddNewInventoryItem::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, CallFunc_BooleanAND_ReturnValue_2) == 0x00098E, "Member 'JSIContainer_C_AddNewInventoryItem::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, CallFunc_AddNewItem_Added) == 0x00098F, "Member 'JSIContainer_C_AddNewInventoryItem::CallFunc_AddNewItem_Added' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, CallFunc_AddNewItem_AddedToSlot) == 0x000990, "Member 'JSIContainer_C_AddNewInventoryItem::CallFunc_AddNewItem_AddedToSlot' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, CallFunc_AddNewItem_Info) == 0x000998, "Member 'JSIContainer_C_AddNewInventoryItem::CallFunc_AddNewItem_Info' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, CallFunc_AddNewItem_SlotItemRef) == 0x000BB8, "Member 'JSIContainer_C_AddNewInventoryItem::CallFunc_AddNewItem_SlotItemRef' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, CallFunc_Concat_StrStr_ReturnValue) == 0x000BC0, "Member 'JSIContainer_C_AddNewInventoryItem::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000BD0, "Member 'JSIContainer_C_AddNewInventoryItem::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, CallFunc_Not_PreBool_ReturnValue_1) == 0x000BE0, "Member 'JSIContainer_C_AddNewInventoryItem::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, K2Node_Select_Default) == 0x000BE1, "Member 'JSIContainer_C_AddNewInventoryItem::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, CallFunc_Not_PreBool_ReturnValue_2) == 0x000BE2, "Member 'JSIContainer_C_AddNewInventoryItem::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, CallFunc_SelectInt_ReturnValue) == 0x000BE4, "Member 'JSIContainer_C_AddNewInventoryItem::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, CallFunc_Less_IntInt_ReturnValue_1) == 0x000BE8, "Member 'JSIContainer_C_AddNewInventoryItem::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, Temp_bool_Variable_5) == 0x000BE9, "Member 'JSIContainer_C_AddNewInventoryItem::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, CallFunc_GetDataTableRowFromName_OutRow) == 0x000BF0, "Member 'JSIContainer_C_AddNewInventoryItem::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000E10, "Member 'JSIContainer_C_AddNewInventoryItem::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, K2Node_Select_Default_1) == 0x000E18, "Member 'JSIContainer_C_AddNewInventoryItem::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, K2Node_Select_Default_2) == 0x000E28, "Member 'JSIContainer_C_AddNewInventoryItem::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, CallFunc_IsValid_ReturnValue) == 0x001048, "Member 'JSIContainer_C_AddNewInventoryItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, CallFunc_SelectInt_ReturnValue_1) == 0x00104C, "Member 'JSIContainer_C_AddNewInventoryItem::CallFunc_SelectInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, CallFunc_AddNewItem_Added_1) == 0x001050, "Member 'JSIContainer_C_AddNewInventoryItem::CallFunc_AddNewItem_Added_1' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, CallFunc_AddNewItem_AddedToSlot_1) == 0x001054, "Member 'JSIContainer_C_AddNewInventoryItem::CallFunc_AddNewItem_AddedToSlot_1' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, CallFunc_AddNewItem_Info_1) == 0x001058, "Member 'JSIContainer_C_AddNewInventoryItem::CallFunc_AddNewItem_Info_1' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, CallFunc_AddNewItem_SlotItemRef_1) == 0x001278, "Member 'JSIContainer_C_AddNewInventoryItem::CallFunc_AddNewItem_SlotItemRef_1' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, K2Node_Select_Default_3) == 0x001280, "Member 'JSIContainer_C_AddNewInventoryItem::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, CallFunc_Not_PreBool_ReturnValue_3) == 0x001281, "Member 'JSIContainer_C_AddNewInventoryItem::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem, CallFunc_SelectInt_ReturnValue_2) == 0x001284, "Member 'JSIContainer_C_AddNewInventoryItem::CallFunc_SelectInt_ReturnValue_2' has a wrong offset!");

// Function JSIContainer.JSIContainer_C.AddNewInventoryItem_CustomVector
// 0x0D28 (0x0D28 - 0x0000)
struct JSIContainer_C_AddNewInventoryItem_CustomVector final
{
public:
	class FName                                   ItemId;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ToSlot;                                            // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              SlotVector;                                        // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              OriginalSize;                                      // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFItemInfo                             CustomInfo;                                        // 0x0030(0x0220)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          Added;                                             // 0x0250(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x3];                                      // 0x0251(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SlotIndex;                                         // 0x0254(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFItemInfo                             ItemInfo;                                          // 0x0258(0x0220)(Parm, OutParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UJSI_Slot_C*                            SlotItemRef;                                       // 0x0478(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0481(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0482(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_483[0x5];                                      // 0x0483(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             CallFunc_GetDataTableRowFromName_OutRow;           // 0x0488(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x06A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x06A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6AA[0x6];                                      // 0x06AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             K2Node_Select_Default;                             // 0x06B0(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x08D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D4[0x4];                                      // 0x08D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             K2Node_SetFieldsInStruct_StructOut;                // 0x08D8(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_AddNewItem_Added;                         // 0x0AF8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AF9[0x3];                                      // 0x0AF9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AddNewItem_AddedToSlot;                   // 0x0AFC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFItemInfo                             CallFunc_AddNewItem_Info;                          // 0x0B00(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	class UJSI_Slot_C*                            CallFunc_AddNewItem_SlotItemRef;                   // 0x0D20(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(JSIContainer_C_AddNewInventoryItem_CustomVector) == 0x000008, "Wrong alignment on JSIContainer_C_AddNewInventoryItem_CustomVector");
static_assert(sizeof(JSIContainer_C_AddNewInventoryItem_CustomVector) == 0x000D28, "Wrong size on JSIContainer_C_AddNewInventoryItem_CustomVector");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem_CustomVector, ItemId) == 0x000000, "Member 'JSIContainer_C_AddNewInventoryItem_CustomVector::ItemId' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem_CustomVector, Count) == 0x000008, "Member 'JSIContainer_C_AddNewInventoryItem_CustomVector::Count' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem_CustomVector, ToSlot) == 0x00000C, "Member 'JSIContainer_C_AddNewInventoryItem_CustomVector::ToSlot' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem_CustomVector, SlotVector) == 0x000010, "Member 'JSIContainer_C_AddNewInventoryItem_CustomVector::SlotVector' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem_CustomVector, OriginalSize) == 0x000020, "Member 'JSIContainer_C_AddNewInventoryItem_CustomVector::OriginalSize' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem_CustomVector, CustomInfo) == 0x000030, "Member 'JSIContainer_C_AddNewInventoryItem_CustomVector::CustomInfo' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem_CustomVector, Added) == 0x000250, "Member 'JSIContainer_C_AddNewInventoryItem_CustomVector::Added' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem_CustomVector, SlotIndex) == 0x000254, "Member 'JSIContainer_C_AddNewInventoryItem_CustomVector::SlotIndex' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem_CustomVector, ItemInfo) == 0x000258, "Member 'JSIContainer_C_AddNewInventoryItem_CustomVector::ItemInfo' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem_CustomVector, SlotItemRef) == 0x000478, "Member 'JSIContainer_C_AddNewInventoryItem_CustomVector::SlotItemRef' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem_CustomVector, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000480, "Member 'JSIContainer_C_AddNewInventoryItem_CustomVector::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem_CustomVector, CallFunc_Less_IntInt_ReturnValue) == 0x000481, "Member 'JSIContainer_C_AddNewInventoryItem_CustomVector::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem_CustomVector, Temp_bool_Variable) == 0x000482, "Member 'JSIContainer_C_AddNewInventoryItem_CustomVector::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem_CustomVector, CallFunc_GetDataTableRowFromName_OutRow) == 0x000488, "Member 'JSIContainer_C_AddNewInventoryItem_CustomVector::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem_CustomVector, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0006A8, "Member 'JSIContainer_C_AddNewInventoryItem_CustomVector::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem_CustomVector, CallFunc_IsValid_ReturnValue) == 0x0006A9, "Member 'JSIContainer_C_AddNewInventoryItem_CustomVector::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem_CustomVector, K2Node_Select_Default) == 0x0006B0, "Member 'JSIContainer_C_AddNewInventoryItem_CustomVector::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem_CustomVector, CallFunc_SelectInt_ReturnValue) == 0x0008D0, "Member 'JSIContainer_C_AddNewInventoryItem_CustomVector::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem_CustomVector, K2Node_SetFieldsInStruct_StructOut) == 0x0008D8, "Member 'JSIContainer_C_AddNewInventoryItem_CustomVector::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem_CustomVector, CallFunc_AddNewItem_Added) == 0x000AF8, "Member 'JSIContainer_C_AddNewInventoryItem_CustomVector::CallFunc_AddNewItem_Added' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem_CustomVector, CallFunc_AddNewItem_AddedToSlot) == 0x000AFC, "Member 'JSIContainer_C_AddNewInventoryItem_CustomVector::CallFunc_AddNewItem_AddedToSlot' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem_CustomVector, CallFunc_AddNewItem_Info) == 0x000B00, "Member 'JSIContainer_C_AddNewInventoryItem_CustomVector::CallFunc_AddNewItem_Info' has a wrong offset!");
static_assert(offsetof(JSIContainer_C_AddNewInventoryItem_CustomVector, CallFunc_AddNewItem_SlotItemRef) == 0x000D20, "Member 'JSIContainer_C_AddNewInventoryItem_CustomVector::CallFunc_AddNewItem_SlotItemRef' has a wrong offset!");

// Function JSIContainer.JSIContainer_C.AddNewItem
// 0x0A88 (0x0A88 - 0x0000)
struct JSIContainer_C_AddNewItem final
{
public:
	int32                                         ToSlot;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UObject>                 Image;                                             // 0x0008(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	struct FVector2D                              SlotVector;                                        // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlotRarity                                   Rarity;                                            // 0x0048(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             ItemInfo;                                          // 0x0050(0x0220)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          SetVector;                                         // 0x0270(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Added;                                             // 0x0271(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_272[0x2];                                      // 0x0272(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AddedToSlot;                                       // 0x0274(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFItemInfo                             Info;                                              // 0x0278(0x0220)(Parm, OutParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UJSI_Slot_C*                            SlotItemRef;                                       // 0x0498(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFItemInfo                             LocalItemInfo;                                     // 0x04A0(0x0220)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          IsDesiredSlot_;                                    // 0x06C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C1[0x3];                                      // 0x06C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AddToSlot;                                         // 0x06C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SlotInvalid_;                                      // 0x06C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C9[0x3];                                      // 0x06C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RowIndex;                                          // 0x06CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ColumnIndex;                                       // 0x06D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                NewSlotPadding;                                    // 0x06D4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E4[0x4];                                      // 0x06E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJSI_Slot_C*                            NewItem;                                           // 0x06E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UJSI_Slot_C*>                    ArrayOfItemFound;                                  // 0x06F0(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	class UJSI_Slot_C*                            ItemFound;                                         // 0x0700(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJSI_Slot_C*                            CallFunc_Create_ReturnValue;                       // 0x0708(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CountIn_OutInt;                           // 0x0710(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0714(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFItemInfo                             K2Node_SetFieldsInStruct_StructOut;                // 0x0718(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0938(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x093C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0940(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0941(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0942(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
