#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Lenny_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct Lenny_Skeleton_AnimBlueprint.Lenny_Skeleton_AnimBlueprint_C.AnimBlueprintGeneratedConstantData
// 0x014F (0x0150 - 0x0001)
struct Lenny_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_94;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_95;                                 // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_96;                                   // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_97;                                 // 0x0020(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_98;                                 // 0x0021(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_99;                                // 0x0028(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          __BoolProperty_100;                                // 0x0038(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_101;                                // 0x003C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_102;                                 // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_103;                               // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_104;                              // 0x004C(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_105;                               // 0x0078(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_106;                                // 0x007C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_107;                                // 0x007D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_108;                                // 0x007E(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7F[0x1];                                       // 0x007F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_109;                                // 0x0080(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_110;                                // 0x0088(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_111;                                 // 0x0090(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_112;                              // 0x0098(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00B8(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0138(0x0018)()
};
static_assert(alignof(Lenny_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on Lenny_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(Lenny_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData) == 0x000150, "Wrong size on Lenny_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(Lenny_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_94) == 0x000004, "Member 'Lenny_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_94' has a wrong offset!");
static_assert(offsetof(Lenny_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __BlendProfile_95) == 0x000010, "Member 'Lenny_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__BlendProfile_95' has a wrong offset!");
static_assert(offsetof(Lenny_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __CurveFloat_96) == 0x000018, "Member 'Lenny_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__CurveFloat_96' has a wrong offset!");
static_assert(offsetof(Lenny_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __EnumProperty_97) == 0x000020, "Member 'Lenny_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__EnumProperty_97' has a wrong offset!");
static_assert(offsetof(Lenny_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __EnumProperty_98) == 0x000021, "Member 'Lenny_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__EnumProperty_98' has a wrong offset!");
static_assert(offsetof(Lenny_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __ArrayProperty_99) == 0x000028, "Member 'Lenny_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__ArrayProperty_99' has a wrong offset!");
static_assert(offsetof(Lenny_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __BoolProperty_100) == 0x000038, "Member 'Lenny_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__BoolProperty_100' has a wrong offset!");
static_assert(offsetof(Lenny_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_101) == 0x00003C, "Member 'Lenny_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_101' has a wrong offset!");
static_assert(offsetof(Lenny_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __IntProperty_102) == 0x000044, "Member 'Lenny_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__IntProperty_102' has a wrong offset!");
static_assert(offsetof(Lenny_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __FloatProperty_103) == 0x000048, "Member 'Lenny_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__FloatProperty_103' has a wrong offset!");
static_assert(offsetof(Lenny_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __StructProperty_104) == 0x00004C, "Member 'Lenny_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__StructProperty_104' has a wrong offset!");
static_assert(offsetof(Lenny_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __FloatProperty_105) == 0x000078, "Member 'Lenny_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__FloatProperty_105' has a wrong offset!");
static_assert(offsetof(Lenny_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __BoolProperty_106) == 0x00007C, "Member 'Lenny_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__BoolProperty_106' has a wrong offset!");
static_assert(offsetof(Lenny_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __EnumProperty_107) == 0x00007D, "Member 'Lenny_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__EnumProperty_107' has a wrong offset!");
static_assert(offsetof(Lenny_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __ByteProperty_108) == 0x00007E, "Member 'Lenny_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__ByteProperty_108' has a wrong offset!");
static_assert(offsetof(Lenny_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_109) == 0x000080, "Member 'Lenny_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_109' has a wrong offset!");
static_assert(offsetof(Lenny_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_110) == 0x000088, "Member 'Lenny_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_110' has a wrong offset!");
static_assert(offsetof(Lenny_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __IntProperty_111) == 0x000090, "Member 'Lenny_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__IntProperty_111' has a wrong offset!");
static_assert(offsetof(Lenny_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __StructProperty_112) == 0x000098, "Member 'Lenny_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__StructProperty_112' has a wrong offset!");
static_assert(offsetof(Lenny_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000B8, "Member 'Lenny_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(Lenny_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000138, "Member 'Lenny_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct Lenny_Skeleton_AnimBlueprint.Lenny_Skeleton_AnimBlueprint_C.AnimBlueprintGeneratedMutableData
// 0x0001 (0x0002 - 0x0001)
struct Lenny_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Lenny_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on Lenny_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(Lenny_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedMutableData) == 0x000002, "Wrong size on Lenny_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(Lenny_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'Lenny_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");

}

