#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Lenny_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Lenny_Skeleton_AnimBlueprint_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Lenny_Skeleton_AnimBlueprint.Lenny_Skeleton_AnimBlueprint_C
// 0x05E0 (0x0930 - 0x0350)
class ULenny_Skeleton_AnimBlueprint_C final : public UAnimInstance
{
public:
	uint8                                         Pad_348[0x8];                                      // 0x0348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct Lenny_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x0358(0x0002)(HasGetValueTypeHash)
	uint8                                         Pad_35A[0x6];                                      // 0x035A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0360(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0368(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0370(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0390(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x03D8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0400(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x0448(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0468(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x04B0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x04D0(0x00C8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0598(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x05C0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0608(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0628(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0670(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0690(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0758(0x0108)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0860(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x0888(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x08D0(0x0048)()
	bool                                          bSurvInteracted;                                   // 0x0918(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_919[0x7];                                      // 0x0919(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFMODAudioComponent*                    NewVar;                                            // 0x0920(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UFMODAudioComponent*                    Lenny_wrinig;                                      // 0x0928(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void AnimNotify_Lenny_Start_Writing();
	void AnimNotify_Lenny_Writing();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Lenny_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_1167D57A483559DEB6093AB867209326();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Lenny_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_6CF1CD3B4AD4F97216ABC5AE53E8E676();
	void ExecuteUbergraph_Lenny_Skeleton_AnimBlueprint(int32 EntryPoint);
	void OnInteracted();
	void StopInteracting();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Lenny_Skeleton_AnimBlueprint_C">();
	}
	static class ULenny_Skeleton_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULenny_Skeleton_AnimBlueprint_C>();
	}
};
static_assert(alignof(ULenny_Skeleton_AnimBlueprint_C) == 0x000010, "Wrong alignment on ULenny_Skeleton_AnimBlueprint_C");
static_assert(sizeof(ULenny_Skeleton_AnimBlueprint_C) == 0x000930, "Wrong size on ULenny_Skeleton_AnimBlueprint_C");
static_assert(offsetof(ULenny_Skeleton_AnimBlueprint_C, UberGraphFrame) == 0x000350, "Member 'ULenny_Skeleton_AnimBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULenny_Skeleton_AnimBlueprint_C, __AnimBlueprintMutables) == 0x000358, "Member 'ULenny_Skeleton_AnimBlueprint_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(ULenny_Skeleton_AnimBlueprint_C, AnimBlueprintExtension_PropertyAccess) == 0x000360, "Member 'ULenny_Skeleton_AnimBlueprint_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ULenny_Skeleton_AnimBlueprint_C, AnimBlueprintExtension_Base) == 0x000368, "Member 'ULenny_Skeleton_AnimBlueprint_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ULenny_Skeleton_AnimBlueprint_C, AnimGraphNode_Root) == 0x000370, "Member 'ULenny_Skeleton_AnimBlueprint_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(ULenny_Skeleton_AnimBlueprint_C, AnimGraphNode_BlendListByBool) == 0x000390, "Member 'ULenny_Skeleton_AnimBlueprint_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(ULenny_Skeleton_AnimBlueprint_C, AnimGraphNode_TransitionResult_1) == 0x0003D8, "Member 'ULenny_Skeleton_AnimBlueprint_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(ULenny_Skeleton_AnimBlueprint_C, AnimGraphNode_SequencePlayer_3) == 0x000400, "Member 'ULenny_Skeleton_AnimBlueprint_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(ULenny_Skeleton_AnimBlueprint_C, AnimGraphNode_StateResult_3) == 0x000448, "Member 'ULenny_Skeleton_AnimBlueprint_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(ULenny_Skeleton_AnimBlueprint_C, AnimGraphNode_SequencePlayer_2) == 0x000468, "Member 'ULenny_Skeleton_AnimBlueprint_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(ULenny_Skeleton_AnimBlueprint_C, AnimGraphNode_StateResult_2) == 0x0004B0, "Member 'ULenny_Skeleton_AnimBlueprint_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(ULenny_Skeleton_AnimBlueprint_C, AnimGraphNode_StateMachine_1) == 0x0004D0, "Member 'ULenny_Skeleton_AnimBlueprint_C::AnimGraphNode_StateMachine_1' has a wrong offset!");
static_assert(offsetof(ULenny_Skeleton_AnimBlueprint_C, AnimGraphNode_TransitionResult) == 0x000598, "Member 'ULenny_Skeleton_AnimBlueprint_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(ULenny_Skeleton_AnimBlueprint_C, AnimGraphNode_SequencePlayer_1) == 0x0005C0, "Member 'ULenny_Skeleton_AnimBlueprint_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(ULenny_Skeleton_AnimBlueprint_C, AnimGraphNode_StateResult_1) == 0x000608, "Member 'ULenny_Skeleton_AnimBlueprint_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(ULenny_Skeleton_AnimBlueprint_C, AnimGraphNode_SequencePlayer) == 0x000628, "Member 'ULenny_Skeleton_AnimBlueprint_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(ULenny_Skeleton_AnimBlueprint_C, AnimGraphNode_StateResult) == 0x000670, "Member 'ULenny_Skeleton_AnimBlueprint_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(ULenny_Skeleton_AnimBlueprint_C, AnimGraphNode_StateMachine) == 0x000690, "Member 'ULenny_Skeleton_AnimBlueprint_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(ULenny_Skeleton_AnimBlueprint_C, AnimGraphNode_SaveCachedPose) == 0x000758, "Member 'ULenny_Skeleton_AnimBlueprint_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(ULenny_Skeleton_AnimBlueprint_C, AnimGraphNode_UseCachedPose) == 0x000860, "Member 'ULenny_Skeleton_AnimBlueprint_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(ULenny_Skeleton_AnimBlueprint_C, AnimGraphNode_Slot_1) == 0x000888, "Member 'ULenny_Skeleton_AnimBlueprint_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(ULenny_Skeleton_AnimBlueprint_C, AnimGraphNode_Slot) == 0x0008D0, "Member 'ULenny_Skeleton_AnimBlueprint_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(ULenny_Skeleton_AnimBlueprint_C, bSurvInteracted) == 0x000918, "Member 'ULenny_Skeleton_AnimBlueprint_C::bSurvInteracted' has a wrong offset!");
static_assert(offsetof(ULenny_Skeleton_AnimBlueprint_C, NewVar) == 0x000920, "Member 'ULenny_Skeleton_AnimBlueprint_C::NewVar' has a wrong offset!");
static_assert(offsetof(ULenny_Skeleton_AnimBlueprint_C, Lenny_wrinig) == 0x000928, "Member 'ULenny_Skeleton_AnimBlueprint_C::Lenny_wrinig' has a wrong offset!");

}

