#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LensFlare_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function LensFlare_BP.LensFlare_BP_C.ExecuteUbergraph_LensFlare_BP
// 0x0048 (0x0048 - 0x0000)
struct LensFlare_BP_C_ExecuteUbergraph_LensFlare_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMaterialSpriteElement                 K2Node_MakeStruct_MaterialSpriteElement;           // 0x0008(0x0028)(NoDestructor)
	TArray<struct FMaterialSpriteElement>         K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ConstParm, ReferenceParm)
	float                                         K2Node_MakeStruct_BaseSizeY_ImplicitCast;          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_BaseSizeX_ImplicitCast;          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LensFlare_BP_C_ExecuteUbergraph_LensFlare_BP) == 0x000008, "Wrong alignment on LensFlare_BP_C_ExecuteUbergraph_LensFlare_BP");
static_assert(sizeof(LensFlare_BP_C_ExecuteUbergraph_LensFlare_BP) == 0x000048, "Wrong size on LensFlare_BP_C_ExecuteUbergraph_LensFlare_BP");
static_assert(offsetof(LensFlare_BP_C_ExecuteUbergraph_LensFlare_BP, EntryPoint) == 0x000000, "Member 'LensFlare_BP_C_ExecuteUbergraph_LensFlare_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_ExecuteUbergraph_LensFlare_BP, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'LensFlare_BP_C_ExecuteUbergraph_LensFlare_BP::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_ExecuteUbergraph_LensFlare_BP, K2Node_MakeStruct_MaterialSpriteElement) == 0x000008, "Member 'LensFlare_BP_C_ExecuteUbergraph_LensFlare_BP::K2Node_MakeStruct_MaterialSpriteElement' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_ExecuteUbergraph_LensFlare_BP, K2Node_MakeArray_Array) == 0x000030, "Member 'LensFlare_BP_C_ExecuteUbergraph_LensFlare_BP::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_ExecuteUbergraph_LensFlare_BP, K2Node_MakeStruct_BaseSizeY_ImplicitCast) == 0x000040, "Member 'LensFlare_BP_C_ExecuteUbergraph_LensFlare_BP::K2Node_MakeStruct_BaseSizeY_ImplicitCast' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_ExecuteUbergraph_LensFlare_BP, K2Node_MakeStruct_BaseSizeX_ImplicitCast) == 0x000044, "Member 'LensFlare_BP_C_ExecuteUbergraph_LensFlare_BP::K2Node_MakeStruct_BaseSizeX_ImplicitCast' has a wrong offset!");

// Function LensFlare_BP.LensFlare_BP_C.InitFlare
// 0x0168 (0x0168 - 0x0000)
struct LensFlare_BP_C_InitFlare final
{
public:
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue_1;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_2; // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_3; // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_4; // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_5; // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_6; // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_7; // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_8; // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_9; // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_10; // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_11; // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_12; // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_13; // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_14; // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_15; // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_16; // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_17; // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_18; // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_19; // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_20; // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_21; // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_22; // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_23; // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_24; // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_25; // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_26; // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_27; // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_28; // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_29; // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_30; // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_31; // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_32; // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_33; // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_34; // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_35; // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_36; // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_37; // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_38; // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_39; // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_40; // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_41; // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_42; // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_43; // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_44; // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_45; // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_46; // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_47; // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_48; // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_49; // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_50; // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_51; // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_52; // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_53; // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_54; // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_55; // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_56; // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_57; // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_58; // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_59; // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_60; // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_61; // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_62; // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_63; // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_64; // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_65; // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_66; // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_67; // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_68; // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_69; // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_70; // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_71; // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_72; // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_73; // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_74; // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_75; // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_76; // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_77; // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_78; // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_79; // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LensFlare_BP_C_InitFlare) == 0x000008, "Wrong alignment on LensFlare_BP_C_InitFlare");
static_assert(sizeof(LensFlare_BP_C_InitFlare) == 0x000168, "Wrong size on LensFlare_BP_C_InitFlare");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_Conv_BoolToDouble_ReturnValue) == 0x000000, "Member 'LensFlare_BP_C_InitFlare::CallFunc_Conv_BoolToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_Conv_BoolToDouble_ReturnValue_1) == 0x000008, "Member 'LensFlare_BP_C_InitFlare::CallFunc_Conv_BoolToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_GetMaterial_ReturnValue) == 0x000010, "Member 'LensFlare_BP_C_InitFlare::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000018, "Member 'LensFlare_BP_C_InitFlare::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000020, "Member 'LensFlare_BP_C_InitFlare::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000028, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x00002C, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_2) == 0x000030, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_3) == 0x000034, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_4) == 0x000038, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_5) == 0x00003C, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_5' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_6) == 0x000040, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_6' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_7) == 0x000044, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_7' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_8) == 0x000048, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_8' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_9) == 0x00004C, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_9' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_10) == 0x000050, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_10' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_11) == 0x000054, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_11' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_12) == 0x000058, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_12' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_13) == 0x00005C, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_13' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_14) == 0x000060, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_14' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_15) == 0x000064, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_15' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_16) == 0x000068, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_16' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_17) == 0x00006C, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_17' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_18) == 0x000070, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_18' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_19) == 0x000074, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_19' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_20) == 0x000078, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_20' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_21) == 0x00007C, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_21' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_22) == 0x000080, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_22' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_23) == 0x000084, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_23' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_24) == 0x000088, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_24' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_25) == 0x00008C, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_25' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_26) == 0x000090, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_26' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_27) == 0x000094, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_27' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_28) == 0x000098, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_28' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_29) == 0x00009C, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_29' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_30) == 0x0000A0, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_30' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_31) == 0x0000A4, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_31' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_32) == 0x0000A8, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_32' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_33) == 0x0000AC, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_33' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_34) == 0x0000B0, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_34' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_35) == 0x0000B4, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_35' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_36) == 0x0000B8, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_36' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_37) == 0x0000BC, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_37' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_38) == 0x0000C0, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_38' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_39) == 0x0000C4, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_39' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_40) == 0x0000C8, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_40' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_41) == 0x0000CC, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_41' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_42) == 0x0000D0, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_42' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_43) == 0x0000D4, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_43' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_44) == 0x0000D8, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_44' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_45) == 0x0000DC, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_45' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_46) == 0x0000E0, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_46' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_47) == 0x0000E4, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_47' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_48) == 0x0000E8, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_48' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_49) == 0x0000EC, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_49' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_50) == 0x0000F0, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_50' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_51) == 0x0000F4, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_51' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_52) == 0x0000F8, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_52' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_53) == 0x0000FC, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_53' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_54) == 0x000100, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_54' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_55) == 0x000104, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_55' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_56) == 0x000108, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_56' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_57) == 0x00010C, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_57' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_58) == 0x000110, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_58' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_59) == 0x000114, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_59' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_60) == 0x000118, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_60' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_61) == 0x00011C, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_61' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_62) == 0x000120, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_62' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_63) == 0x000124, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_63' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_64) == 0x000128, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_64' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_65) == 0x00012C, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_65' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_66) == 0x000130, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_66' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_67) == 0x000134, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_67' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_68) == 0x000138, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_68' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_69) == 0x00013C, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_69' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_70) == 0x000140, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_70' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_71) == 0x000144, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_71' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_72) == 0x000148, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_72' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_73) == 0x00014C, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_73' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_74) == 0x000150, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_74' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_75) == 0x000154, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_75' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_76) == 0x000158, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_76' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_77) == 0x00015C, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_77' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_78) == 0x000160, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_78' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_InitFlare, CallFunc_SetScalarParameterValue_Value_ImplicitCast_79) == 0x000164, "Member 'LensFlare_BP_C_InitFlare::CallFunc_SetScalarParameterValue_Value_ImplicitCast_79' has a wrong offset!");

// Function LensFlare_BP.LensFlare_BP_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct LensFlare_BP_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LensFlare_BP_C_ReceiveTick) == 0x000004, "Wrong alignment on LensFlare_BP_C_ReceiveTick");
static_assert(sizeof(LensFlare_BP_C_ReceiveTick) == 0x000004, "Wrong size on LensFlare_BP_C_ReceiveTick");
static_assert(offsetof(LensFlare_BP_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'LensFlare_BP_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function LensFlare_BP.LensFlare_BP_C.UserConstructionScript
// 0x0040 (0x0040 - 0x0000)
struct LensFlare_BP_C_UserConstructionScript final
{
public:
	struct FMaterialSpriteElement                 K2Node_MakeStruct_MaterialSpriteElement;           // 0x0000(0x0028)(NoDestructor)
	TArray<struct FMaterialSpriteElement>         K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ConstParm, ReferenceParm)
	float                                         K2Node_MakeStruct_BaseSizeY_ImplicitCast;          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_BaseSizeX_ImplicitCast;          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LensFlare_BP_C_UserConstructionScript) == 0x000008, "Wrong alignment on LensFlare_BP_C_UserConstructionScript");
static_assert(sizeof(LensFlare_BP_C_UserConstructionScript) == 0x000040, "Wrong size on LensFlare_BP_C_UserConstructionScript");
static_assert(offsetof(LensFlare_BP_C_UserConstructionScript, K2Node_MakeStruct_MaterialSpriteElement) == 0x000000, "Member 'LensFlare_BP_C_UserConstructionScript::K2Node_MakeStruct_MaterialSpriteElement' has a wrong offset!");
static_assert(offsetof(LensFlare_BP_C_UserConstructionScript, K2Node_MakeArray_Array) == 0x000028, "Member 'LensFlare_BP_C_UserConstructionScript::K2Node_MakeArray_Array' has a wrong offset!");
