#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LevelStreamerFunctions

#include "Basic.hpp"


namespace SDK::Params
{

// Function LevelStreamerFunctions.LevelStreamerFunctions_C.GetStreamer
// 0x0038 (0x0038 - 0x0000)
struct LevelStreamerFunctions_C_GetStreamer final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALevelStreamer_C*                       Streamer;                                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class ALevelStreamer_C*>               CallFunc_GetAllActorsOfClass_OutActors;            // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALevelStreamer_C*                       CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LevelStreamerFunctions_C_GetStreamer) == 0x000008, "Wrong alignment on LevelStreamerFunctions_C_GetStreamer");
static_assert(sizeof(LevelStreamerFunctions_C_GetStreamer) == 0x000038, "Wrong size on LevelStreamerFunctions_C_GetStreamer");
static_assert(offsetof(LevelStreamerFunctions_C_GetStreamer, __WorldContext) == 0x000000, "Member 'LevelStreamerFunctions_C_GetStreamer::__WorldContext' has a wrong offset!");
static_assert(offsetof(LevelStreamerFunctions_C_GetStreamer, Streamer) == 0x000008, "Member 'LevelStreamerFunctions_C_GetStreamer::Streamer' has a wrong offset!");
static_assert(offsetof(LevelStreamerFunctions_C_GetStreamer, CallFunc_GetAllActorsOfClass_OutActors) == 0x000010, "Member 'LevelStreamerFunctions_C_GetStreamer::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(LevelStreamerFunctions_C_GetStreamer, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'LevelStreamerFunctions_C_GetStreamer::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(LevelStreamerFunctions_C_GetStreamer, CallFunc_Array_Get_Item) == 0x000028, "Member 'LevelStreamerFunctions_C_GetStreamer::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(LevelStreamerFunctions_C_GetStreamer, CallFunc_Greater_IntInt_ReturnValue) == 0x000030, "Member 'LevelStreamerFunctions_C_GetStreamer::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function LevelStreamerFunctions.LevelStreamerFunctions_C.GetStreamLevelByClass
// 0x0050 (0x0050 - 0x0000)
struct LevelStreamerFunctions_C_GetStreamLevelByClass final
{
public:
	const class UObject*                          Object;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   ReturnValue1;                                      // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetClassDisplayName_ReturnValue;          // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSubstring_ReturnValue;                 // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LevelStreamerFunctions_C_GetStreamLevelByClass) == 0x000008, "Wrong alignment on LevelStreamerFunctions_C_GetStreamLevelByClass");
static_assert(sizeof(LevelStreamerFunctions_C_GetStreamLevelByClass) == 0x000050, "Wrong size on LevelStreamerFunctions_C_GetStreamLevelByClass");
static_assert(offsetof(LevelStreamerFunctions_C_GetStreamLevelByClass, Object) == 0x000000, "Member 'LevelStreamerFunctions_C_GetStreamLevelByClass::Object' has a wrong offset!");
static_assert(offsetof(LevelStreamerFunctions_C_GetStreamLevelByClass, __WorldContext) == 0x000008, "Member 'LevelStreamerFunctions_C_GetStreamLevelByClass::__WorldContext' has a wrong offset!");
static_assert(offsetof(LevelStreamerFunctions_C_GetStreamLevelByClass, ReturnValue1) == 0x000010, "Member 'LevelStreamerFunctions_C_GetStreamLevelByClass::ReturnValue1' has a wrong offset!");
static_assert(offsetof(LevelStreamerFunctions_C_GetStreamLevelByClass, CallFunc_GetObjectClass_ReturnValue) == 0x000018, "Member 'LevelStreamerFunctions_C_GetStreamLevelByClass::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(LevelStreamerFunctions_C_GetStreamLevelByClass, CallFunc_GetClassDisplayName_ReturnValue) == 0x000020, "Member 'LevelStreamerFunctions_C_GetStreamLevelByClass::CallFunc_GetClassDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(LevelStreamerFunctions_C_GetStreamLevelByClass, CallFunc_Len_ReturnValue) == 0x000030, "Member 'LevelStreamerFunctions_C_GetStreamLevelByClass::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(LevelStreamerFunctions_C_GetStreamLevelByClass, CallFunc_Subtract_IntInt_ReturnValue) == 0x000034, "Member 'LevelStreamerFunctions_C_GetStreamLevelByClass::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LevelStreamerFunctions_C_GetStreamLevelByClass, CallFunc_GetSubstring_ReturnValue) == 0x000038, "Member 'LevelStreamerFunctions_C_GetStreamLevelByClass::CallFunc_GetSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(LevelStreamerFunctions_C_GetStreamLevelByClass, CallFunc_Conv_StringToName_ReturnValue) == 0x000048, "Member 'LevelStreamerFunctions_C_GetStreamLevelByClass::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");

}

