#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LevelStreamer

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "S_PlayersArray_structs.hpp"


namespace SDK::Params
{

// Function LevelStreamer.LevelStreamer_C.ExecuteUbergraph_LevelStreamer
// 0x0098 (0x0098 - 0x0000)
struct LevelStreamer_C_ExecuteUbergraph_LevelStreamer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_Name_2;                         // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_Name_1;                         // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APlayerPlaceholder_C*                   K2Node_CustomEvent_PlaceholderPlayer;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_LevelName_1;                    // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_Name;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_LevelName;                      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWithEditor_ReturnValue;                 // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTDB_LevelInspectorSubsystem*           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCurrentLevelLoadedFull_ReturnValue;    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LevelStreamer_C_ExecuteUbergraph_LevelStreamer) == 0x000008, "Wrong alignment on LevelStreamer_C_ExecuteUbergraph_LevelStreamer");
static_assert(sizeof(LevelStreamer_C_ExecuteUbergraph_LevelStreamer) == 0x000098, "Wrong size on LevelStreamer_C_ExecuteUbergraph_LevelStreamer");
static_assert(offsetof(LevelStreamer_C_ExecuteUbergraph_LevelStreamer, EntryPoint) == 0x000000, "Member 'LevelStreamer_C_ExecuteUbergraph_LevelStreamer::EntryPoint' has a wrong offset!");
static_assert(offsetof(LevelStreamer_C_ExecuteUbergraph_LevelStreamer, K2Node_CustomEvent_Name_2) == 0x000004, "Member 'LevelStreamer_C_ExecuteUbergraph_LevelStreamer::K2Node_CustomEvent_Name_2' has a wrong offset!");
static_assert(offsetof(LevelStreamer_C_ExecuteUbergraph_LevelStreamer, K2Node_CustomEvent_Name_1) == 0x00000C, "Member 'LevelStreamer_C_ExecuteUbergraph_LevelStreamer::K2Node_CustomEvent_Name_1' has a wrong offset!");
static_assert(offsetof(LevelStreamer_C_ExecuteUbergraph_LevelStreamer, CallFunc_Conv_NameToString_ReturnValue) == 0x000018, "Member 'LevelStreamer_C_ExecuteUbergraph_LevelStreamer::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(LevelStreamer_C_ExecuteUbergraph_LevelStreamer, CallFunc_Concat_StrStr_ReturnValue) == 0x000028, "Member 'LevelStreamer_C_ExecuteUbergraph_LevelStreamer::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(LevelStreamer_C_ExecuteUbergraph_LevelStreamer, K2Node_CustomEvent_PlaceholderPlayer) == 0x000038, "Member 'LevelStreamer_C_ExecuteUbergraph_LevelStreamer::K2Node_CustomEvent_PlaceholderPlayer' has a wrong offset!");
static_assert(offsetof(LevelStreamer_C_ExecuteUbergraph_LevelStreamer, K2Node_CustomEvent_LevelName_1) == 0x000040, "Member 'LevelStreamer_C_ExecuteUbergraph_LevelStreamer::K2Node_CustomEvent_LevelName_1' has a wrong offset!");
static_assert(offsetof(LevelStreamer_C_ExecuteUbergraph_LevelStreamer, K2Node_CustomEvent_Name) == 0x000048, "Member 'LevelStreamer_C_ExecuteUbergraph_LevelStreamer::K2Node_CustomEvent_Name' has a wrong offset!");
static_assert(offsetof(LevelStreamer_C_ExecuteUbergraph_LevelStreamer, K2Node_CustomEvent_LevelName) == 0x000050, "Member 'LevelStreamer_C_ExecuteUbergraph_LevelStreamer::K2Node_CustomEvent_LevelName' has a wrong offset!");
static_assert(offsetof(LevelStreamer_C_ExecuteUbergraph_LevelStreamer, CallFunc_Not_PreBool_ReturnValue) == 0x000058, "Member 'LevelStreamer_C_ExecuteUbergraph_LevelStreamer::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(LevelStreamer_C_ExecuteUbergraph_LevelStreamer, CallFunc_IsWithEditor_ReturnValue) == 0x000059, "Member 'LevelStreamer_C_ExecuteUbergraph_LevelStreamer::CallFunc_IsWithEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(LevelStreamer_C_ExecuteUbergraph_LevelStreamer, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000060, "Member 'LevelStreamer_C_ExecuteUbergraph_LevelStreamer::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(LevelStreamer_C_ExecuteUbergraph_LevelStreamer, CallFunc_Conv_IntToString_ReturnValue) == 0x000068, "Member 'LevelStreamer_C_ExecuteUbergraph_LevelStreamer::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(LevelStreamer_C_ExecuteUbergraph_LevelStreamer, CallFunc_GetCurrentLevelLoadedFull_ReturnValue) == 0x000078, "Member 'LevelStreamer_C_ExecuteUbergraph_LevelStreamer::CallFunc_GetCurrentLevelLoadedFull_ReturnValue' has a wrong offset!");
static_assert(offsetof(LevelStreamer_C_ExecuteUbergraph_LevelStreamer, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000080, "Member 'LevelStreamer_C_ExecuteUbergraph_LevelStreamer::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LevelStreamer_C_ExecuteUbergraph_LevelStreamer, CallFunc_IsServer_ReturnValue) == 0x000090, "Member 'LevelStreamer_C_ExecuteUbergraph_LevelStreamer::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(LevelStreamer_C_ExecuteUbergraph_LevelStreamer, CallFunc_IsServer_ReturnValue_1) == 0x000091, "Member 'LevelStreamer_C_ExecuteUbergraph_LevelStreamer::CallFunc_IsServer_ReturnValue_1' has a wrong offset!");

// Function LevelStreamer.LevelStreamer_C.InitLoading
// 0x0008 (0x0008 - 0x0000)
struct LevelStreamer_C_InitLoading final
{
public:
	class FName                                   LevelName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LevelStreamer_C_InitLoading) == 0x000004, "Wrong alignment on LevelStreamer_C_InitLoading");
static_assert(sizeof(LevelStreamer_C_InitLoading) == 0x000008, "Wrong size on LevelStreamer_C_InitLoading");
static_assert(offsetof(LevelStreamer_C_InitLoading, LevelName) == 0x000000, "Member 'LevelStreamer_C_InitLoading::LevelName' has a wrong offset!");

// Function LevelStreamer.LevelStreamer_C.IsLevelLoaded
// 0x0188 (0x0188 - 0x0000)
struct LevelStreamer_C_IsLevelLoaded final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWorldPartitionSubsystem*               CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWorldPartitionStreamingQuerySource    K2Node_MakeStruct_WorldPartitionStreamingQuerySource; // 0x0040(0x0130)()
	TArray<struct FWorldPartitionStreamingQuerySource> K2Node_MakeArray_Array;                            // 0x0170(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_IsWithEditor_ReturnValue;                 // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStreamingCompleted_ReturnValue;         // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStreamingCompleted_ReturnValue_1;       // 0x0182(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0183(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LevelStreamer_C_IsLevelLoaded) == 0x000008, "Wrong alignment on LevelStreamer_C_IsLevelLoaded");
static_assert(sizeof(LevelStreamer_C_IsLevelLoaded) == 0x000188, "Wrong size on LevelStreamer_C_IsLevelLoaded");
static_assert(offsetof(LevelStreamer_C_IsLevelLoaded, Result) == 0x000000, "Member 'LevelStreamer_C_IsLevelLoaded::Result' has a wrong offset!");
static_assert(offsetof(LevelStreamer_C_IsLevelLoaded, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000008, "Member 'LevelStreamer_C_IsLevelLoaded::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(LevelStreamer_C_IsLevelLoaded, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000010, "Member 'LevelStreamer_C_IsLevelLoaded::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LevelStreamer_C_IsLevelLoaded, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'LevelStreamer_C_IsLevelLoaded::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LevelStreamer_C_IsLevelLoaded, CallFunc_GetPlayerController_ReturnValue) == 0x000018, "Member 'LevelStreamer_C_IsLevelLoaded::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(LevelStreamer_C_IsLevelLoaded, Temp_int_Variable) == 0x000020, "Member 'LevelStreamer_C_IsLevelLoaded::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(LevelStreamer_C_IsLevelLoaded, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000028, "Member 'LevelStreamer_C_IsLevelLoaded::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(LevelStreamer_C_IsLevelLoaded, K2Node_MakeStruct_WorldPartitionStreamingQuerySource) == 0x000040, "Member 'LevelStreamer_C_IsLevelLoaded::K2Node_MakeStruct_WorldPartitionStreamingQuerySource' has a wrong offset!");
static_assert(offsetof(LevelStreamer_C_IsLevelLoaded, K2Node_MakeArray_Array) == 0x000170, "Member 'LevelStreamer_C_IsLevelLoaded::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(LevelStreamer_C_IsLevelLoaded, CallFunc_IsWithEditor_ReturnValue) == 0x000180, "Member 'LevelStreamer_C_IsLevelLoaded::CallFunc_IsWithEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(LevelStreamer_C_IsLevelLoaded, CallFunc_IsStreamingCompleted_ReturnValue) == 0x000181, "Member 'LevelStreamer_C_IsLevelLoaded::CallFunc_IsStreamingCompleted_ReturnValue' has a wrong offset!");
static_assert(offsetof(LevelStreamer_C_IsLevelLoaded, CallFunc_IsStreamingCompleted_ReturnValue_1) == 0x000182, "Member 'LevelStreamer_C_IsLevelLoaded::CallFunc_IsStreamingCompleted_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LevelStreamer_C_IsLevelLoaded, CallFunc_BooleanOR_ReturnValue) == 0x000183, "Member 'LevelStreamer_C_IsLevelLoaded::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function LevelStreamer.LevelStreamer_C.LevelLoaded
// 0x0030 (0x0030 - 0x0000)
struct LevelStreamer_C_LevelLoaded final
{
public:
	class FName                                   LevelName;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Player;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         PlayersCache;                                      // 0x0010(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	struct FS_PlayersArray                        StructCache;                                       // 0x0020(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
static_assert(alignof(LevelStreamer_C_LevelLoaded) == 0x000008, "Wrong alignment on LevelStreamer_C_LevelLoaded");
static_assert(sizeof(LevelStreamer_C_LevelLoaded) == 0x000030, "Wrong size on LevelStreamer_C_LevelLoaded");
static_assert(offsetof(LevelStreamer_C_LevelLoaded, LevelName) == 0x000000, "Member 'LevelStreamer_C_LevelLoaded::LevelName' has a wrong offset!");
static_assert(offsetof(LevelStreamer_C_LevelLoaded, Player) == 0x000008, "Member 'LevelStreamer_C_LevelLoaded::Player' has a wrong offset!");
static_assert(offsetof(LevelStreamer_C_LevelLoaded, PlayersCache) == 0x000010, "Member 'LevelStreamer_C_LevelLoaded::PlayersCache' has a wrong offset!");
static_assert(offsetof(LevelStreamer_C_LevelLoaded, StructCache) == 0x000020, "Member 'LevelStreamer_C_LevelLoaded::StructCache' has a wrong offset!");

// Function LevelStreamer.LevelStreamer_C.LevelUnloaded
// 0x0030 (0x0030 - 0x0000)
struct LevelStreamer_C_LevelUnloaded final
{
public:
	class FName                                   LevelName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Player;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         PlayersCache;                                      // 0x0010(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	struct FS_PlayersArray                        StructCache;                                       // 0x0020(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
static_assert(alignof(LevelStreamer_C_LevelUnloaded) == 0x000008, "Wrong alignment on LevelStreamer_C_LevelUnloaded");
static_assert(sizeof(LevelStreamer_C_LevelUnloaded) == 0x000030, "Wrong size on LevelStreamer_C_LevelUnloaded");
static_assert(offsetof(LevelStreamer_C_LevelUnloaded, LevelName) == 0x000000, "Member 'LevelStreamer_C_LevelUnloaded::LevelName' has a wrong offset!");
static_assert(offsetof(LevelStreamer_C_LevelUnloaded, Player) == 0x000008, "Member 'LevelStreamer_C_LevelUnloaded::Player' has a wrong offset!");
static_assert(offsetof(LevelStreamer_C_LevelUnloaded, PlayersCache) == 0x000010, "Member 'LevelStreamer_C_LevelUnloaded::PlayersCache' has a wrong offset!");
static_assert(offsetof(LevelStreamer_C_LevelUnloaded, StructCache) == 0x000020, "Member 'LevelStreamer_C_LevelUnloaded::StructCache' has a wrong offset!");

// Function LevelStreamer.LevelStreamer_C.LoadFromPlaceholder
// 0x0010 (0x0010 - 0x0000)
struct LevelStreamer_C_LoadFromPlaceholder final
{
public:
	class APlayerPlaceholder_C*                   PlaceholderPlayer;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   LevelName;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LevelStreamer_C_LoadFromPlaceholder) == 0x000008, "Wrong alignment on LevelStreamer_C_LoadFromPlaceholder");
static_assert(sizeof(LevelStreamer_C_LoadFromPlaceholder) == 0x000010, "Wrong size on LevelStreamer_C_LoadFromPlaceholder");
static_assert(offsetof(LevelStreamer_C_LoadFromPlaceholder, PlaceholderPlayer) == 0x000000, "Member 'LevelStreamer_C_LoadFromPlaceholder::PlaceholderPlayer' has a wrong offset!");
static_assert(offsetof(LevelStreamer_C_LoadFromPlaceholder, LevelName) == 0x000008, "Member 'LevelStreamer_C_LoadFromPlaceholder::LevelName' has a wrong offset!");

// Function LevelStreamer.LevelStreamer_C.LoadLevel_private
// 0x0008 (0x0008 - 0x0000)
struct LevelStreamer_C_LoadLevel_private final
{
public:
	class FName                                   Param_Name;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LevelStreamer_C_LoadLevel_private) == 0x000004, "Wrong alignment on LevelStreamer_C_LoadLevel_private");
static_assert(sizeof(LevelStreamer_C_LoadLevel_private) == 0x000008, "Wrong size on LevelStreamer_C_LoadLevel_private");
static_assert(offsetof(LevelStreamer_C_LoadLevel_private, Param_Name) == 0x000000, "Member 'LevelStreamer_C_LoadLevel_private::Param_Name' has a wrong offset!");

// Function LevelStreamer.LevelStreamer_C.OnAAA
// 0x0008 (0x0008 - 0x0000)
struct LevelStreamer_C_OnAAA final
{
public:
	class FName                                   Param_Name;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LevelStreamer_C_OnAAA) == 0x000004, "Wrong alignment on LevelStreamer_C_OnAAA");
static_assert(sizeof(LevelStreamer_C_OnAAA) == 0x000008, "Wrong size on LevelStreamer_C_OnAAA");
static_assert(offsetof(LevelStreamer_C_OnAAA, Param_Name) == 0x000000, "Member 'LevelStreamer_C_OnAAA::Param_Name' has a wrong offset!");

// Function LevelStreamer.LevelStreamer_C.OnBBB
// 0x0008 (0x0008 - 0x0000)
struct LevelStreamer_C_OnBBB final
{
public:
	class FName                                   Param_Name;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LevelStreamer_C_OnBBB) == 0x000004, "Wrong alignment on LevelStreamer_C_OnBBB");
static_assert(sizeof(LevelStreamer_C_OnBBB) == 0x000008, "Wrong size on LevelStreamer_C_OnBBB");
static_assert(offsetof(LevelStreamer_C_OnBBB, Param_Name) == 0x000000, "Member 'LevelStreamer_C_OnBBB::Param_Name' has a wrong offset!");

// Function LevelStreamer.LevelStreamer_C.OnLevelLoaded_0__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct LevelStreamer_C_OnLevelLoaded_0__DelegateSignature final
{
public:
	class FName                                   LevelName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LevelStreamer_C_OnLevelLoaded_0__DelegateSignature) == 0x000004, "Wrong alignment on LevelStreamer_C_OnLevelLoaded_0__DelegateSignature");
static_assert(sizeof(LevelStreamer_C_OnLevelLoaded_0__DelegateSignature) == 0x000008, "Wrong size on LevelStreamer_C_OnLevelLoaded_0__DelegateSignature");
static_assert(offsetof(LevelStreamer_C_OnLevelLoaded_0__DelegateSignature, LevelName) == 0x000000, "Member 'LevelStreamer_C_OnLevelLoaded_0__DelegateSignature::LevelName' has a wrong offset!");

// Function LevelStreamer.LevelStreamer_C.OnLevelUnloaded_0__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct LevelStreamer_C_OnLevelUnloaded_0__DelegateSignature final
{
public:
	class FName                                   LevelName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LevelStreamer_C_OnLevelUnloaded_0__DelegateSignature) == 0x000004, "Wrong alignment on LevelStreamer_C_OnLevelUnloaded_0__DelegateSignature");
static_assert(sizeof(LevelStreamer_C_OnLevelUnloaded_0__DelegateSignature) == 0x000008, "Wrong size on LevelStreamer_C_OnLevelUnloaded_0__DelegateSignature");
static_assert(offsetof(LevelStreamer_C_OnLevelUnloaded_0__DelegateSignature, LevelName) == 0x000000, "Member 'LevelStreamer_C_OnLevelUnloaded_0__DelegateSignature::LevelName' has a wrong offset!");

// Function LevelStreamer.LevelStreamer_C.UnloadLevel_private
// 0x0008 (0x0008 - 0x0000)
struct LevelStreamer_C_UnloadLevel_private final
{
public:
	class FName                                   LevelName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LevelStreamer_C_UnloadLevel_private) == 0x000004, "Wrong alignment on LevelStreamer_C_UnloadLevel_private");
static_assert(sizeof(LevelStreamer_C_UnloadLevel_private) == 0x000008, "Wrong size on LevelStreamer_C_UnloadLevel_private");
static_assert(offsetof(LevelStreamer_C_UnloadLevel_private, LevelName) == 0x000000, "Member 'LevelStreamer_C_UnloadLevel_private::LevelName' has a wrong offset!");

}

