#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LootPointUniversalManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "DefaultItemInfo_structs.hpp"
#include "HouseManagerEnum_structs.hpp"
#include "ContainerPickupsInfo_structs.hpp"


namespace SDK::Params
{

// Function LootPointUniversalManager.LootPointUniversalManager_C.ActivateLootpoints
// 0x0100 (0x0100 - 0x0000)
struct LootPointUniversalManager_C_ActivateLootpoints final
{
public:
	TArray<class ALootPoint_C*>                   Array;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Param_HiddenLootPoints;                            // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALootPoint_C*                           Local_CurrentLootpoint;                            // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALootPoint_C*                           CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0070(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UPrimitiveComponent*                    CallFunc_Array_Get_Item_1;                         // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UBoxComponent*>                  CallFunc_K2_GetComponentsByClass_ReturnValue_1;    // 0x0088(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UBoxComponent*                          CallFunc_Array_Get_Item_2;                         // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBoxComponent*>                  CallFunc_K2_GetComponentsByClass_ReturnValue_2;    // 0x00B0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UBoxComponent*                          CallFunc_Array_Get_Item_3;                         // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           CallFunc_K2_GetComponentsByClass_ReturnValue_3;    // 0x00D0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_4;                         // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LootPointUniversalManager_C_ActivateLootpoints) == 0x000008, "Wrong alignment on LootPointUniversalManager_C_ActivateLootpoints");
static_assert(sizeof(LootPointUniversalManager_C_ActivateLootpoints) == 0x000100, "Wrong size on LootPointUniversalManager_C_ActivateLootpoints");
static_assert(offsetof(LootPointUniversalManager_C_ActivateLootpoints, Array) == 0x000000, "Member 'LootPointUniversalManager_C_ActivateLootpoints::Array' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_ActivateLootpoints, Param_HiddenLootPoints) == 0x000010, "Member 'LootPointUniversalManager_C_ActivateLootpoints::Param_HiddenLootPoints' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_ActivateLootpoints, Local_CurrentLootpoint) == 0x000018, "Member 'LootPointUniversalManager_C_ActivateLootpoints::Local_CurrentLootpoint' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_ActivateLootpoints, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'LootPointUniversalManager_C_ActivateLootpoints::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_ActivateLootpoints, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'LootPointUniversalManager_C_ActivateLootpoints::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_ActivateLootpoints, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'LootPointUniversalManager_C_ActivateLootpoints::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_ActivateLootpoints, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'LootPointUniversalManager_C_ActivateLootpoints::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_ActivateLootpoints, Temp_int_Loop_Counter_Variable_1) == 0x000030, "Member 'LootPointUniversalManager_C_ActivateLootpoints::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_ActivateLootpoints, CallFunc_Add_IntInt_ReturnValue_1) == 0x000034, "Member 'LootPointUniversalManager_C_ActivateLootpoints::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_ActivateLootpoints, Temp_int_Array_Index_Variable_1) == 0x000038, "Member 'LootPointUniversalManager_C_ActivateLootpoints::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_ActivateLootpoints, Temp_int_Array_Index_Variable_2) == 0x00003C, "Member 'LootPointUniversalManager_C_ActivateLootpoints::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_ActivateLootpoints, Temp_int_Loop_Counter_Variable_2) == 0x000040, "Member 'LootPointUniversalManager_C_ActivateLootpoints::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_ActivateLootpoints, Temp_int_Loop_Counter_Variable_3) == 0x000044, "Member 'LootPointUniversalManager_C_ActivateLootpoints::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_ActivateLootpoints, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'LootPointUniversalManager_C_ActivateLootpoints::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_ActivateLootpoints, CallFunc_Add_IntInt_ReturnValue_2) == 0x00004C, "Member 'LootPointUniversalManager_C_ActivateLootpoints::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_ActivateLootpoints, CallFunc_Add_IntInt_ReturnValue_3) == 0x000050, "Member 'LootPointUniversalManager_C_ActivateLootpoints::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_ActivateLootpoints, Temp_int_Array_Index_Variable_3) == 0x000054, "Member 'LootPointUniversalManager_C_ActivateLootpoints::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_ActivateLootpoints, Temp_int_Array_Index_Variable_4) == 0x000058, "Member 'LootPointUniversalManager_C_ActivateLootpoints::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_ActivateLootpoints, CallFunc_Array_Get_Item) == 0x000060, "Member 'LootPointUniversalManager_C_ActivateLootpoints::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_ActivateLootpoints, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'LootPointUniversalManager_C_ActivateLootpoints::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_ActivateLootpoints, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000070, "Member 'LootPointUniversalManager_C_ActivateLootpoints::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_ActivateLootpoints, CallFunc_Array_Get_Item_1) == 0x000080, "Member 'LootPointUniversalManager_C_ActivateLootpoints::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_ActivateLootpoints, CallFunc_K2_GetComponentsByClass_ReturnValue_1) == 0x000088, "Member 'LootPointUniversalManager_C_ActivateLootpoints::CallFunc_K2_GetComponentsByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_ActivateLootpoints, CallFunc_Array_Get_Item_2) == 0x000098, "Member 'LootPointUniversalManager_C_ActivateLootpoints::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_ActivateLootpoints, CallFunc_Array_Length_ReturnValue_1) == 0x0000A0, "Member 'LootPointUniversalManager_C_ActivateLootpoints::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_ActivateLootpoints, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000A4, "Member 'LootPointUniversalManager_C_ActivateLootpoints::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_ActivateLootpoints, CallFunc_Array_Length_ReturnValue_2) == 0x0000A8, "Member 'LootPointUniversalManager_C_ActivateLootpoints::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_ActivateLootpoints, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000AC, "Member 'LootPointUniversalManager_C_ActivateLootpoints::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_ActivateLootpoints, CallFunc_K2_GetComponentsByClass_ReturnValue_2) == 0x0000B0, "Member 'LootPointUniversalManager_C_ActivateLootpoints::CallFunc_K2_GetComponentsByClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_ActivateLootpoints, CallFunc_Array_Get_Item_3) == 0x0000C0, "Member 'LootPointUniversalManager_C_ActivateLootpoints::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_ActivateLootpoints, CallFunc_Array_Length_ReturnValue_3) == 0x0000C8, "Member 'LootPointUniversalManager_C_ActivateLootpoints::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_ActivateLootpoints, CallFunc_Less_IntInt_ReturnValue_3) == 0x0000CC, "Member 'LootPointUniversalManager_C_ActivateLootpoints::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_ActivateLootpoints, CallFunc_K2_GetComponentsByClass_ReturnValue_3) == 0x0000D0, "Member 'LootPointUniversalManager_C_ActivateLootpoints::CallFunc_K2_GetComponentsByClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_ActivateLootpoints, CallFunc_Array_Get_Item_4) == 0x0000E0, "Member 'LootPointUniversalManager_C_ActivateLootpoints::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_ActivateLootpoints, CallFunc_Array_Length_ReturnValue_4) == 0x0000E8, "Member 'LootPointUniversalManager_C_ActivateLootpoints::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_ActivateLootpoints, CallFunc_Less_IntInt_ReturnValue_4) == 0x0000EC, "Member 'LootPointUniversalManager_C_ActivateLootpoints::CallFunc_Less_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_ActivateLootpoints, Temp_int_Loop_Counter_Variable_4) == 0x0000F0, "Member 'LootPointUniversalManager_C_ActivateLootpoints::Temp_int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_ActivateLootpoints, CallFunc_Less_IntInt_ReturnValue_5) == 0x0000F4, "Member 'LootPointUniversalManager_C_ActivateLootpoints::CallFunc_Less_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_ActivateLootpoints, CallFunc_Add_IntInt_ReturnValue_4) == 0x0000F8, "Member 'LootPointUniversalManager_C_ActivateLootpoints::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");

// Function LootPointUniversalManager.LootPointUniversalManager_C.BndEvt__LootPointHouseManager_BoxCheckPlayerDebug_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct LootPointUniversalManager_C_BndEvt__LootPointHouseManager_BoxCheckPlayerDebug_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(LootPointUniversalManager_C_BndEvt__LootPointHouseManager_BoxCheckPlayerDebug_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on LootPointUniversalManager_C_BndEvt__LootPointHouseManager_BoxCheckPlayerDebug_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(LootPointUniversalManager_C_BndEvt__LootPointHouseManager_BoxCheckPlayerDebug_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on LootPointUniversalManager_C_BndEvt__LootPointHouseManager_BoxCheckPlayerDebug_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(LootPointUniversalManager_C_BndEvt__LootPointHouseManager_BoxCheckPlayerDebug_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'LootPointUniversalManager_C_BndEvt__LootPointHouseManager_BoxCheckPlayerDebug_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_BndEvt__LootPointHouseManager_BoxCheckPlayerDebug_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'LootPointUniversalManager_C_BndEvt__LootPointHouseManager_BoxCheckPlayerDebug_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_BndEvt__LootPointHouseManager_BoxCheckPlayerDebug_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'LootPointUniversalManager_C_BndEvt__LootPointHouseManager_BoxCheckPlayerDebug_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_BndEvt__LootPointHouseManager_BoxCheckPlayerDebug_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'LootPointUniversalManager_C_BndEvt__LootPointHouseManager_BoxCheckPlayerDebug_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_BndEvt__LootPointHouseManager_BoxCheckPlayerDebug_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'LootPointUniversalManager_C_BndEvt__LootPointHouseManager_BoxCheckPlayerDebug_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_BndEvt__LootPointHouseManager_BoxCheckPlayerDebug_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'LootPointUniversalManager_C_BndEvt__LootPointHouseManager_BoxCheckPlayerDebug_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function LootPointUniversalManager.LootPointUniversalManager_C.BndEvt__LootPointHouseManager_BoxCheckPlayerDebug_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct LootPointUniversalManager_C_BndEvt__LootPointHouseManager_BoxCheckPlayerDebug_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LootPointUniversalManager_C_BndEvt__LootPointHouseManager_BoxCheckPlayerDebug_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on LootPointUniversalManager_C_BndEvt__LootPointHouseManager_BoxCheckPlayerDebug_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(LootPointUniversalManager_C_BndEvt__LootPointHouseManager_BoxCheckPlayerDebug_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on LootPointUniversalManager_C_BndEvt__LootPointHouseManager_BoxCheckPlayerDebug_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(LootPointUniversalManager_C_BndEvt__LootPointHouseManager_BoxCheckPlayerDebug_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'LootPointUniversalManager_C_BndEvt__LootPointHouseManager_BoxCheckPlayerDebug_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_BndEvt__LootPointHouseManager_BoxCheckPlayerDebug_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'LootPointUniversalManager_C_BndEvt__LootPointHouseManager_BoxCheckPlayerDebug_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_BndEvt__LootPointHouseManager_BoxCheckPlayerDebug_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'LootPointUniversalManager_C_BndEvt__LootPointHouseManager_BoxCheckPlayerDebug_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_BndEvt__LootPointHouseManager_BoxCheckPlayerDebug_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'LootPointUniversalManager_C_BndEvt__LootPointHouseManager_BoxCheckPlayerDebug_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function LootPointUniversalManager.LootPointUniversalManager_C.CloseAllLootPoints
// 0x0080 (0x0080 - 0x0000)
struct LootPointUniversalManager_C_CloseAllLootPoints final
{
public:
	class ALootPoint_C*                           LootpointInProcess;                                // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UBoxComponent*>                  CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UStaticMeshComponent*>           CallFunc_K2_GetComponentsByClass_ReturnValue_1;    // 0x0040(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UBoxComponent*                          CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_1;                         // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALootPoint_C*                           CallFunc_Array_Get_Item_2;                         // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LootPointUniversalManager_C_CloseAllLootPoints) == 0x000008, "Wrong alignment on LootPointUniversalManager_C_CloseAllLootPoints");
static_assert(sizeof(LootPointUniversalManager_C_CloseAllLootPoints) == 0x000080, "Wrong size on LootPointUniversalManager_C_CloseAllLootPoints");
static_assert(offsetof(LootPointUniversalManager_C_CloseAllLootPoints, LootpointInProcess) == 0x000000, "Member 'LootPointUniversalManager_C_CloseAllLootPoints::LootpointInProcess' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_CloseAllLootPoints, Temp_int_Array_Index_Variable) == 0x000008, "Member 'LootPointUniversalManager_C_CloseAllLootPoints::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_CloseAllLootPoints, Temp_bool_True_if_break_was_hit_Variable) == 0x00000C, "Member 'LootPointUniversalManager_C_CloseAllLootPoints::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_CloseAllLootPoints, CallFunc_Not_PreBool_ReturnValue) == 0x00000D, "Member 'LootPointUniversalManager_C_CloseAllLootPoints::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_CloseAllLootPoints, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'LootPointUniversalManager_C_CloseAllLootPoints::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_CloseAllLootPoints, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'LootPointUniversalManager_C_CloseAllLootPoints::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_CloseAllLootPoints, Temp_int_Array_Index_Variable_1) == 0x000018, "Member 'LootPointUniversalManager_C_CloseAllLootPoints::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_CloseAllLootPoints, Temp_int_Loop_Counter_Variable_1) == 0x00001C, "Member 'LootPointUniversalManager_C_CloseAllLootPoints::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_CloseAllLootPoints, CallFunc_Add_IntInt_ReturnValue_1) == 0x000020, "Member 'LootPointUniversalManager_C_CloseAllLootPoints::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_CloseAllLootPoints, Temp_int_Array_Index_Variable_2) == 0x000024, "Member 'LootPointUniversalManager_C_CloseAllLootPoints::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_CloseAllLootPoints, Temp_int_Loop_Counter_Variable_2) == 0x000028, "Member 'LootPointUniversalManager_C_CloseAllLootPoints::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_CloseAllLootPoints, CallFunc_Add_IntInt_ReturnValue_2) == 0x00002C, "Member 'LootPointUniversalManager_C_CloseAllLootPoints::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_CloseAllLootPoints, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000030, "Member 'LootPointUniversalManager_C_CloseAllLootPoints::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_CloseAllLootPoints, CallFunc_K2_GetComponentsByClass_ReturnValue_1) == 0x000040, "Member 'LootPointUniversalManager_C_CloseAllLootPoints::CallFunc_K2_GetComponentsByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_CloseAllLootPoints, CallFunc_Array_Get_Item) == 0x000050, "Member 'LootPointUniversalManager_C_CloseAllLootPoints::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_CloseAllLootPoints, CallFunc_Array_Get_Item_1) == 0x000058, "Member 'LootPointUniversalManager_C_CloseAllLootPoints::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_CloseAllLootPoints, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'LootPointUniversalManager_C_CloseAllLootPoints::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_CloseAllLootPoints, CallFunc_Array_Length_ReturnValue_1) == 0x000064, "Member 'LootPointUniversalManager_C_CloseAllLootPoints::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_CloseAllLootPoints, CallFunc_Less_IntInt_ReturnValue) == 0x000068, "Member 'LootPointUniversalManager_C_CloseAllLootPoints::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_CloseAllLootPoints, CallFunc_Less_IntInt_ReturnValue_1) == 0x000069, "Member 'LootPointUniversalManager_C_CloseAllLootPoints::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_CloseAllLootPoints, CallFunc_Array_Length_ReturnValue_2) == 0x00006C, "Member 'LootPointUniversalManager_C_CloseAllLootPoints::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_CloseAllLootPoints, CallFunc_Array_Get_Item_2) == 0x000070, "Member 'LootPointUniversalManager_C_CloseAllLootPoints::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_CloseAllLootPoints, CallFunc_Less_IntInt_ReturnValue_2) == 0x000078, "Member 'LootPointUniversalManager_C_CloseAllLootPoints::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_CloseAllLootPoints, CallFunc_IsValid_ReturnValue) == 0x000079, "Member 'LootPointUniversalManager_C_CloseAllLootPoints::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(LootPointUniversalManager_C_CloseAllLootPoints, CallFunc_BooleanAND_ReturnValue) == 0x00007A, "Member 'LootPointUniversalManager_C_CloseAllLootPoints::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function LootPointUniversalManager.LootPointUniversalManager_C.ExecuteUbergraph_LootPointUniversalManager
// 0x0458 (0x0458 - 0x0000)
struct LootPointUniversalManager_C_ExecuteUbergraph_LootPointUniversalManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_NeedReset;                      // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0098(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B6[0x2];                                       // 0x00B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Map_Length_ReturnValue;                   // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_5;                   // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALootPoint_C*                           CallFunc_Array_Get_Item;                           // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            CallFunc_GetCollisionResponseToChannel_ReturnValue; // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FContainerPickupsInfo                  CallFunc_Array_Get_Item_1;                         // 0x00D8(0x0068)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Length_ReturnValue_1;                 // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1;  // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_185[0x3];                                      // 0x0185(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable_1;        // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0192(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0193(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_2;               // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0195(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_196[0x2];                                      // 0x0196(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19D[0x3];                                      // 0x019D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_HiddenLootPoints_1;             // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_HiddenLootPoints;               // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_5;                  // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B5[0x3];                                      // 0x01B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_7;                 // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BD[0x3];                                      // 0x01BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ALootPoint_C*                           CallFunc_Array_Get_Item_2;                         // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CD[0x3];                                      // 0x01CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ALootPoint_C*                           CallFunc_Array_Get_Item_3;                         // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsTimerPausedHandle_ReturnValue;       // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x3];                                      // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_6;                  // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_8;                 // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_2;                     // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1ED[0x3];                                      // 0x01ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_6;                   // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALootPoint_C*                           CallFunc_Array_Get_Item_4;                         // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_6;               // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0205(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            CallFunc_GetCollisionResponseToChannel_ReturnValue_1; // 0x0206(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_207[0x1];                                      // 0x0207(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_7;               // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20D[0x3];                                      // 0x020D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_9;                 // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_215[0x3];                                      // 0x0215(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_10;                // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FContainerPickupsInfo                  CallFunc_Array_Get_Item_5;                         // 0x0228(0x0068)(ContainsInstancedReference, HasGetValueTypeHash)
