#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LP_ForTestsQuests

#include "Basic.hpp"

#include "DefaultItemInfo_structs.hpp"
#include "FItemInfo_structs.hpp"


namespace SDK::Params
{

// Function LP_ForTestsQuests.LP_ForTestsQuests_C.ExecuteUbergraph_LP_ForTestsQuests
// 0x0004 (0x0004 - 0x0000)
struct LP_ForTestsQuests_C_ExecuteUbergraph_LP_ForTestsQuests final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LP_ForTestsQuests_C_ExecuteUbergraph_LP_ForTestsQuests) == 0x000004, "Wrong alignment on LP_ForTestsQuests_C_ExecuteUbergraph_LP_ForTestsQuests");
static_assert(sizeof(LP_ForTestsQuests_C_ExecuteUbergraph_LP_ForTestsQuests) == 0x000004, "Wrong size on LP_ForTestsQuests_C_ExecuteUbergraph_LP_ForTestsQuests");
static_assert(offsetof(LP_ForTestsQuests_C_ExecuteUbergraph_LP_ForTestsQuests, EntryPoint) == 0x000000, "Member 'LP_ForTestsQuests_C_ExecuteUbergraph_LP_ForTestsQuests::EntryPoint' has a wrong offset!");

// Function LP_ForTestsQuests.LP_ForTestsQuests_C.NewFunction
// 0x02B0 (0x02B0 - 0x0000)
struct LP_ForTestsQuests_C_NewFunction final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             CallFunc_GetDataTableRowFromName_OutRow;           // 0x0030(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0258(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FDefaultItemInfo                       K2Node_MakeStruct_DefaultItemInfo;                 // 0x0268(0x0040)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x02AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LP_ForTestsQuests_C_NewFunction) == 0x000008, "Wrong alignment on LP_ForTestsQuests_C_NewFunction");
static_assert(sizeof(LP_ForTestsQuests_C_NewFunction) == 0x0002B0, "Wrong size on LP_ForTestsQuests_C_NewFunction");
static_assert(offsetof(LP_ForTestsQuests_C_NewFunction, Temp_int_Array_Index_Variable) == 0x000000, "Member 'LP_ForTestsQuests_C_NewFunction::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(LP_ForTestsQuests_C_NewFunction, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'LP_ForTestsQuests_C_NewFunction::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(LP_ForTestsQuests_C_NewFunction, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'LP_ForTestsQuests_C_NewFunction::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LP_ForTestsQuests_C_NewFunction, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000010, "Member 'LP_ForTestsQuests_C_NewFunction::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(LP_ForTestsQuests_C_NewFunction, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'LP_ForTestsQuests_C_NewFunction::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(LP_ForTestsQuests_C_NewFunction, CallFunc_Array_Get_Item) == 0x000024, "Member 'LP_ForTestsQuests_C_NewFunction::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(LP_ForTestsQuests_C_NewFunction, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'LP_ForTestsQuests_C_NewFunction::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LP_ForTestsQuests_C_NewFunction, CallFunc_GetDataTableRowFromName_OutRow) == 0x000030, "Member 'LP_ForTestsQuests_C_NewFunction::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(LP_ForTestsQuests_C_NewFunction, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000250, "Member 'LP_ForTestsQuests_C_NewFunction::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(LP_ForTestsQuests_C_NewFunction, CallFunc_Conv_NameToString_ReturnValue) == 0x000258, "Member 'LP_ForTestsQuests_C_NewFunction::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(LP_ForTestsQuests_C_NewFunction, K2Node_MakeStruct_DefaultItemInfo) == 0x000268, "Member 'LP_ForTestsQuests_C_NewFunction::K2Node_MakeStruct_DefaultItemInfo' has a wrong offset!");
static_assert(offsetof(LP_ForTestsQuests_C_NewFunction, CallFunc_Array_Add_ReturnValue) == 0x0002A8, "Member 'LP_ForTestsQuests_C_NewFunction::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(LP_ForTestsQuests_C_NewFunction, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0002AC, "Member 'LP_ForTestsQuests_C_NewFunction::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

}

