#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LP_Sportbag_for_start_level

#include "Basic.hpp"

#include "E_InteractType_structs.hpp"


namespace SDK::Params
{

// Function LP_Sportbag_for_start_level.LP_Sportbag_for_start_level_C.ExecuteUbergraph_LP_Sportbag_for_start_level
// 0x0010 (0x0010 - 0x0000)
struct LP_Sportbag_for_start_level_C_ExecuteUbergraph_LP_Sportbag_for_start_level final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_AddMeshToShining_DynamicMaterial;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LP_Sportbag_for_start_level_C_ExecuteUbergraph_LP_Sportbag_for_start_level) == 0x000008, "Wrong alignment on LP_Sportbag_for_start_level_C_ExecuteUbergraph_LP_Sportbag_for_start_level");
static_assert(sizeof(LP_Sportbag_for_start_level_C_ExecuteUbergraph_LP_Sportbag_for_start_level) == 0x000010, "Wrong size on LP_Sportbag_for_start_level_C_ExecuteUbergraph_LP_Sportbag_for_start_level");
static_assert(offsetof(LP_Sportbag_for_start_level_C_ExecuteUbergraph_LP_Sportbag_for_start_level, EntryPoint) == 0x000000, "Member 'LP_Sportbag_for_start_level_C_ExecuteUbergraph_LP_Sportbag_for_start_level::EntryPoint' has a wrong offset!");
static_assert(offsetof(LP_Sportbag_for_start_level_C_ExecuteUbergraph_LP_Sportbag_for_start_level, CallFunc_AddMeshToShining_DynamicMaterial) == 0x000008, "Member 'LP_Sportbag_for_start_level_C_ExecuteUbergraph_LP_Sportbag_for_start_level::CallFunc_AddMeshToShining_DynamicMaterial' has a wrong offset!");

// Function LP_Sportbag_for_start_level.LP_Sportbag_for_start_level_C.OnFocused
// 0x0068 (0x0068 - 0x0000)
struct LP_Sportbag_for_start_level_C_OnFocused final
{
public:
	class APawn*                                  Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 HighlightActor;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UActorComponent*                        HighlightActorComponent;                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	E_InteractType                                InteractType;                                      // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        LateTime;                                          // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Time;                                              // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_InteractType                                Type;                                              // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameHUD_C>        K2Node_DynamicCast_AsBPI_Game_HUD;                 // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_PlayerMain_C*                      CallFunc_GetGUI_GUI;                               // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LP_Sportbag_for_start_level_C_OnFocused) == 0x000008, "Wrong alignment on LP_Sportbag_for_start_level_C_OnFocused");
static_assert(sizeof(LP_Sportbag_for_start_level_C_OnFocused) == 0x000068, "Wrong size on LP_Sportbag_for_start_level_C_OnFocused");
static_assert(offsetof(LP_Sportbag_for_start_level_C_OnFocused, Player) == 0x000000, "Member 'LP_Sportbag_for_start_level_C_OnFocused::Player' has a wrong offset!");
static_assert(offsetof(LP_Sportbag_for_start_level_C_OnFocused, HighlightActor) == 0x000008, "Member 'LP_Sportbag_for_start_level_C_OnFocused::HighlightActor' has a wrong offset!");
static_assert(offsetof(LP_Sportbag_for_start_level_C_OnFocused, HighlightActorComponent) == 0x000010, "Member 'LP_Sportbag_for_start_level_C_OnFocused::HighlightActorComponent' has a wrong offset!");
static_assert(offsetof(LP_Sportbag_for_start_level_C_OnFocused, InteractType) == 0x000018, "Member 'LP_Sportbag_for_start_level_C_OnFocused::InteractType' has a wrong offset!");
static_assert(offsetof(LP_Sportbag_for_start_level_C_OnFocused, LateTime) == 0x000020, "Member 'LP_Sportbag_for_start_level_C_OnFocused::LateTime' has a wrong offset!");
static_assert(offsetof(LP_Sportbag_for_start_level_C_OnFocused, Time) == 0x000028, "Member 'LP_Sportbag_for_start_level_C_OnFocused::Time' has a wrong offset!");
static_assert(offsetof(LP_Sportbag_for_start_level_C_OnFocused, Type) == 0x000030, "Member 'LP_Sportbag_for_start_level_C_OnFocused::Type' has a wrong offset!");
static_assert(offsetof(LP_Sportbag_for_start_level_C_OnFocused, CallFunc_GetPlayerController_ReturnValue) == 0x000038, "Member 'LP_Sportbag_for_start_level_C_OnFocused::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(LP_Sportbag_for_start_level_C_OnFocused, CallFunc_GetHUD_ReturnValue) == 0x000040, "Member 'LP_Sportbag_for_start_level_C_OnFocused::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(LP_Sportbag_for_start_level_C_OnFocused, K2Node_DynamicCast_AsBPI_Game_HUD) == 0x000048, "Member 'LP_Sportbag_for_start_level_C_OnFocused::K2Node_DynamicCast_AsBPI_Game_HUD' has a wrong offset!");
static_assert(offsetof(LP_Sportbag_for_start_level_C_OnFocused, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'LP_Sportbag_for_start_level_C_OnFocused::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(LP_Sportbag_for_start_level_C_OnFocused, CallFunc_GetGUI_GUI) == 0x000060, "Member 'LP_Sportbag_for_start_level_C_OnFocused::CallFunc_GetGUI_GUI' has a wrong offset!");

}

