#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LS_CoinIntro

#include "Basic.hpp"


namespace SDK::Params
{

// Function LS_CoinIntro.LS_CoinIntro_DirectorBP_C.ExecuteUbergraph_LS_CoinIntro (Director BP)
// 0x0090 (0x0090 - 0x0000)
struct LS_CoinIntro_DirectorBP_C_ExecuteUbergraph_LS_CoinIntro__Director_BP_ final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD_MainMenu_C*                        K2Node_DynamicCast_AsHUD_Main_Menu;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue_1;                     // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD_MainMenu_C*                        K2Node_DynamicCast_AsHUD_Main_Menu_1;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue_2;                     // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUD_MainMenu_C*                        K2Node_DynamicCast_AsHUD_Main_Menu_2;              // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue_3;                     // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD_MainMenu_C*                        K2Node_DynamicCast_AsHUD_Main_Menu_3;              // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LS_CoinIntro_DirectorBP_C_ExecuteUbergraph_LS_CoinIntro__Director_BP_) == 0x000008, "Wrong alignment on LS_CoinIntro_DirectorBP_C_ExecuteUbergraph_LS_CoinIntro__Director_BP_");
static_assert(sizeof(LS_CoinIntro_DirectorBP_C_ExecuteUbergraph_LS_CoinIntro__Director_BP_) == 0x000090, "Wrong size on LS_CoinIntro_DirectorBP_C_ExecuteUbergraph_LS_CoinIntro__Director_BP_");
static_assert(offsetof(LS_CoinIntro_DirectorBP_C_ExecuteUbergraph_LS_CoinIntro__Director_BP_, EntryPoint) == 0x000000, "Member 'LS_CoinIntro_DirectorBP_C_ExecuteUbergraph_LS_CoinIntro__Director_BP_::EntryPoint' has a wrong offset!");
static_assert(offsetof(LS_CoinIntro_DirectorBP_C_ExecuteUbergraph_LS_CoinIntro__Director_BP_, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'LS_CoinIntro_DirectorBP_C_ExecuteUbergraph_LS_CoinIntro__Director_BP_::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_CoinIntro_DirectorBP_C_ExecuteUbergraph_LS_CoinIntro__Director_BP_, CallFunc_GetHUD_ReturnValue) == 0x000010, "Member 'LS_CoinIntro_DirectorBP_C_ExecuteUbergraph_LS_CoinIntro__Director_BP_::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_CoinIntro_DirectorBP_C_ExecuteUbergraph_LS_CoinIntro__Director_BP_, K2Node_DynamicCast_AsHUD_Main_Menu) == 0x000018, "Member 'LS_CoinIntro_DirectorBP_C_ExecuteUbergraph_LS_CoinIntro__Director_BP_::K2Node_DynamicCast_AsHUD_Main_Menu' has a wrong offset!");
static_assert(offsetof(LS_CoinIntro_DirectorBP_C_ExecuteUbergraph_LS_CoinIntro__Director_BP_, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'LS_CoinIntro_DirectorBP_C_ExecuteUbergraph_LS_CoinIntro__Director_BP_::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(LS_CoinIntro_DirectorBP_C_ExecuteUbergraph_LS_CoinIntro__Director_BP_, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'LS_CoinIntro_DirectorBP_C_ExecuteUbergraph_LS_CoinIntro__Director_BP_::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_CoinIntro_DirectorBP_C_ExecuteUbergraph_LS_CoinIntro__Director_BP_, CallFunc_IsValid_ReturnValue_1) == 0x000022, "Member 'LS_CoinIntro_DirectorBP_C_ExecuteUbergraph_LS_CoinIntro__Director_BP_::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LS_CoinIntro_DirectorBP_C_ExecuteUbergraph_LS_CoinIntro__Director_BP_, CallFunc_IsValid_ReturnValue_2) == 0x000023, "Member 'LS_CoinIntro_DirectorBP_C_ExecuteUbergraph_LS_CoinIntro__Director_BP_::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LS_CoinIntro_DirectorBP_C_ExecuteUbergraph_LS_CoinIntro__Director_BP_, CallFunc_GetPlayerController_ReturnValue_1) == 0x000028, "Member 'LS_CoinIntro_DirectorBP_C_ExecuteUbergraph_LS_CoinIntro__Director_BP_::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LS_CoinIntro_DirectorBP_C_ExecuteUbergraph_LS_CoinIntro__Director_BP_, CallFunc_GetHUD_ReturnValue_1) == 0x000030, "Member 'LS_CoinIntro_DirectorBP_C_ExecuteUbergraph_LS_CoinIntro__Director_BP_::CallFunc_GetHUD_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LS_CoinIntro_DirectorBP_C_ExecuteUbergraph_LS_CoinIntro__Director_BP_, K2Node_DynamicCast_AsHUD_Main_Menu_1) == 0x000038, "Member 'LS_CoinIntro_DirectorBP_C_ExecuteUbergraph_LS_CoinIntro__Director_BP_::K2Node_DynamicCast_AsHUD_Main_Menu_1' has a wrong offset!");
static_assert(offsetof(LS_CoinIntro_DirectorBP_C_ExecuteUbergraph_LS_CoinIntro__Director_BP_, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'LS_CoinIntro_DirectorBP_C_ExecuteUbergraph_LS_CoinIntro__Director_BP_::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(LS_CoinIntro_DirectorBP_C_ExecuteUbergraph_LS_CoinIntro__Director_BP_, CallFunc_GetPlayerController_ReturnValue_2) == 0x000048, "Member 'LS_CoinIntro_DirectorBP_C_ExecuteUbergraph_LS_CoinIntro__Director_BP_::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LS_CoinIntro_DirectorBP_C_ExecuteUbergraph_LS_CoinIntro__Director_BP_, CallFunc_GetHUD_ReturnValue_2) == 0x000050, "Member 'LS_CoinIntro_DirectorBP_C_ExecuteUbergraph_LS_CoinIntro__Director_BP_::CallFunc_GetHUD_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LS_CoinIntro_DirectorBP_C_ExecuteUbergraph_LS_CoinIntro__Director_BP_, CallFunc_IsValid_ReturnValue_3) == 0x000058, "Member 'LS_CoinIntro_DirectorBP_C_ExecuteUbergraph_LS_CoinIntro__Director_BP_::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(LS_CoinIntro_DirectorBP_C_ExecuteUbergraph_LS_CoinIntro__Director_BP_, K2Node_DynamicCast_AsHUD_Main_Menu_2) == 0x000060, "Member 'LS_CoinIntro_DirectorBP_C_ExecuteUbergraph_LS_CoinIntro__Director_BP_::K2Node_DynamicCast_AsHUD_Main_Menu_2' has a wrong offset!");
static_assert(offsetof(LS_CoinIntro_DirectorBP_C_ExecuteUbergraph_LS_CoinIntro__Director_BP_, K2Node_DynamicCast_bSuccess_2) == 0x000068, "Member 'LS_CoinIntro_DirectorBP_C_ExecuteUbergraph_LS_CoinIntro__Director_BP_::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(LS_CoinIntro_DirectorBP_C_ExecuteUbergraph_LS_CoinIntro__Director_BP_, CallFunc_IsValid_ReturnValue_4) == 0x000069, "Member 'LS_CoinIntro_DirectorBP_C_ExecuteUbergraph_LS_CoinIntro__Director_BP_::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(LS_CoinIntro_DirectorBP_C_ExecuteUbergraph_LS_CoinIntro__Director_BP_, CallFunc_IsValid_ReturnValue_5) == 0x00006A, "Member 'LS_CoinIntro_DirectorBP_C_ExecuteUbergraph_LS_CoinIntro__Director_BP_::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(LS_CoinIntro_DirectorBP_C_ExecuteUbergraph_LS_CoinIntro__Director_BP_, CallFunc_IsValid_ReturnValue_6) == 0x00006B, "Member 'LS_CoinIntro_DirectorBP_C_ExecuteUbergraph_LS_CoinIntro__Director_BP_::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(LS_CoinIntro_DirectorBP_C_ExecuteUbergraph_LS_CoinIntro__Director_BP_, CallFunc_GetPlayerController_ReturnValue_3) == 0x000070, "Member 'LS_CoinIntro_DirectorBP_C_ExecuteUbergraph_LS_CoinIntro__Director_BP_::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(LS_CoinIntro_DirectorBP_C_ExecuteUbergraph_LS_CoinIntro__Director_BP_, CallFunc_GetHUD_ReturnValue_3) == 0x000078, "Member 'LS_CoinIntro_DirectorBP_C_ExecuteUbergraph_LS_CoinIntro__Director_BP_::CallFunc_GetHUD_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(LS_CoinIntro_DirectorBP_C_ExecuteUbergraph_LS_CoinIntro__Director_BP_, K2Node_DynamicCast_AsHUD_Main_Menu_3) == 0x000080, "Member 'LS_CoinIntro_DirectorBP_C_ExecuteUbergraph_LS_CoinIntro__Director_BP_::K2Node_DynamicCast_AsHUD_Main_Menu_3' has a wrong offset!");
static_assert(offsetof(LS_CoinIntro_DirectorBP_C_ExecuteUbergraph_LS_CoinIntro__Director_BP_, K2Node_DynamicCast_bSuccess_3) == 0x000088, "Member 'LS_CoinIntro_DirectorBP_C_ExecuteUbergraph_LS_CoinIntro__Director_BP_::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(LS_CoinIntro_DirectorBP_C_ExecuteUbergraph_LS_CoinIntro__Director_BP_, CallFunc_IsValid_ReturnValue_7) == 0x000089, "Member 'LS_CoinIntro_DirectorBP_C_ExecuteUbergraph_LS_CoinIntro__Director_BP_::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");

}

