#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LS_ExitFromDoubleDoors

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function LS_ExitFromDoubleDoors.LS_ExitFromDoubleDoors_DirectorBP_C.ExecuteUbergraph_LS_ExitFromDoubleDoors_DirectorBP
// 0x01E0 (0x01E0 - 0x0000)
struct LS_ExitFromDoubleDoors_DirectorBP_C_ExecuteUbergraph_LS_ExitFromDoubleDoors_DirectorBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_PlayerPlaceholder;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_V2_C*                   K2Node_CustomEvent_SurvivalPlayer_V2;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0020(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocationAndRotation_SweepHitResult; // 0x00E8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocationAndRotation_ReturnValue; // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LS_ExitFromDoubleDoors_DirectorBP_C_ExecuteUbergraph_LS_ExitFromDoubleDoors_DirectorBP) == 0x000010, "Wrong alignment on LS_ExitFromDoubleDoors_DirectorBP_C_ExecuteUbergraph_LS_ExitFromDoubleDoors_DirectorBP");
static_assert(sizeof(LS_ExitFromDoubleDoors_DirectorBP_C_ExecuteUbergraph_LS_ExitFromDoubleDoors_DirectorBP) == 0x0001E0, "Wrong size on LS_ExitFromDoubleDoors_DirectorBP_C_ExecuteUbergraph_LS_ExitFromDoubleDoors_DirectorBP");
static_assert(offsetof(LS_ExitFromDoubleDoors_DirectorBP_C_ExecuteUbergraph_LS_ExitFromDoubleDoors_DirectorBP, EntryPoint) == 0x000000, "Member 'LS_ExitFromDoubleDoors_DirectorBP_C_ExecuteUbergraph_LS_ExitFromDoubleDoors_DirectorBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(LS_ExitFromDoubleDoors_DirectorBP_C_ExecuteUbergraph_LS_ExitFromDoubleDoors_DirectorBP, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'LS_ExitFromDoubleDoors_DirectorBP_C_ExecuteUbergraph_LS_ExitFromDoubleDoors_DirectorBP::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_ExitFromDoubleDoors_DirectorBP_C_ExecuteUbergraph_LS_ExitFromDoubleDoors_DirectorBP, K2Node_CustomEvent_PlayerPlaceholder) == 0x000010, "Member 'LS_ExitFromDoubleDoors_DirectorBP_C_ExecuteUbergraph_LS_ExitFromDoubleDoors_DirectorBP::K2Node_CustomEvent_PlayerPlaceholder' has a wrong offset!");
static_assert(offsetof(LS_ExitFromDoubleDoors_DirectorBP_C_ExecuteUbergraph_LS_ExitFromDoubleDoors_DirectorBP, K2Node_CustomEvent_SurvivalPlayer_V2) == 0x000018, "Member 'LS_ExitFromDoubleDoors_DirectorBP_C_ExecuteUbergraph_LS_ExitFromDoubleDoors_DirectorBP::K2Node_CustomEvent_SurvivalPlayer_V2' has a wrong offset!");
static_assert(offsetof(LS_ExitFromDoubleDoors_DirectorBP_C_ExecuteUbergraph_LS_ExitFromDoubleDoors_DirectorBP, CallFunc_GetTransform_ReturnValue) == 0x000020, "Member 'LS_ExitFromDoubleDoors_DirectorBP_C_ExecuteUbergraph_LS_ExitFromDoubleDoors_DirectorBP::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_ExitFromDoubleDoors_DirectorBP_C_ExecuteUbergraph_LS_ExitFromDoubleDoors_DirectorBP, CallFunc_BreakTransform_Location) == 0x000080, "Member 'LS_ExitFromDoubleDoors_DirectorBP_C_ExecuteUbergraph_LS_ExitFromDoubleDoors_DirectorBP::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(LS_ExitFromDoubleDoors_DirectorBP_C_ExecuteUbergraph_LS_ExitFromDoubleDoors_DirectorBP, CallFunc_BreakTransform_Rotation) == 0x000098, "Member 'LS_ExitFromDoubleDoors_DirectorBP_C_ExecuteUbergraph_LS_ExitFromDoubleDoors_DirectorBP::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(LS_ExitFromDoubleDoors_DirectorBP_C_ExecuteUbergraph_LS_ExitFromDoubleDoors_DirectorBP, CallFunc_BreakTransform_Scale) == 0x0000B0, "Member 'LS_ExitFromDoubleDoors_DirectorBP_C_ExecuteUbergraph_LS_ExitFromDoubleDoors_DirectorBP::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(LS_ExitFromDoubleDoors_DirectorBP_C_ExecuteUbergraph_LS_ExitFromDoubleDoors_DirectorBP, CallFunc_GetPlayerPawn_ReturnValue) == 0x0000C8, "Member 'LS_ExitFromDoubleDoors_DirectorBP_C_ExecuteUbergraph_LS_ExitFromDoubleDoors_DirectorBP::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_ExitFromDoubleDoors_DirectorBP_C_ExecuteUbergraph_LS_ExitFromDoubleDoors_DirectorBP, CallFunc_Add_VectorVector_ReturnValue) == 0x0000D0, "Member 'LS_ExitFromDoubleDoors_DirectorBP_C_ExecuteUbergraph_LS_ExitFromDoubleDoors_DirectorBP::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_ExitFromDoubleDoors_DirectorBP_C_ExecuteUbergraph_LS_ExitFromDoubleDoors_DirectorBP, CallFunc_K2_SetActorLocationAndRotation_SweepHitResult) == 0x0000E8, "Member 'LS_ExitFromDoubleDoors_DirectorBP_C_ExecuteUbergraph_LS_ExitFromDoubleDoors_DirectorBP::CallFunc_K2_SetActorLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(LS_ExitFromDoubleDoors_DirectorBP_C_ExecuteUbergraph_LS_ExitFromDoubleDoors_DirectorBP, CallFunc_K2_SetActorLocationAndRotation_ReturnValue) == 0x0001D0, "Member 'LS_ExitFromDoubleDoors_DirectorBP_C_ExecuteUbergraph_LS_ExitFromDoubleDoors_DirectorBP::CallFunc_K2_SetActorLocationAndRotation_ReturnValue' has a wrong offset!");

// Function LS_ExitFromDoubleDoors.LS_ExitFromDoubleDoors_DirectorBP_C.PlayerPlaceholder_Event_0
// 0x0008 (0x0008 - 0x0000)
struct LS_ExitFromDoubleDoors_DirectorBP_C_PlayerPlaceholder_Event_0 final
{
public:
	class AActor*                                 PlayerPlaceholder;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LS_ExitFromDoubleDoors_DirectorBP_C_PlayerPlaceholder_Event_0) == 0x000008, "Wrong alignment on LS_ExitFromDoubleDoors_DirectorBP_C_PlayerPlaceholder_Event_0");
static_assert(sizeof(LS_ExitFromDoubleDoors_DirectorBP_C_PlayerPlaceholder_Event_0) == 0x000008, "Wrong size on LS_ExitFromDoubleDoors_DirectorBP_C_PlayerPlaceholder_Event_0");
static_assert(offsetof(LS_ExitFromDoubleDoors_DirectorBP_C_PlayerPlaceholder_Event_0, PlayerPlaceholder) == 0x000000, "Member 'LS_ExitFromDoubleDoors_DirectorBP_C_PlayerPlaceholder_Event_0::PlayerPlaceholder' has a wrong offset!");

// Function LS_ExitFromDoubleDoors.LS_ExitFromDoubleDoors_DirectorBP_C.SequenceEvent__ENTRYPOINTLS_ExitFromDoubleDoors_DirectorBP
// 0x0008 (0x0008 - 0x0000)
struct LS_ExitFromDoubleDoors_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_ExitFromDoubleDoors_DirectorBP final
{
public:
	class AActor*                                 PlayerPlaceholder;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LS_ExitFromDoubleDoors_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_ExitFromDoubleDoors_DirectorBP) == 0x000008, "Wrong alignment on LS_ExitFromDoubleDoors_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_ExitFromDoubleDoors_DirectorBP");
static_assert(sizeof(LS_ExitFromDoubleDoors_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_ExitFromDoubleDoors_DirectorBP) == 0x000008, "Wrong size on LS_ExitFromDoubleDoors_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_ExitFromDoubleDoors_DirectorBP");
static_assert(offsetof(LS_ExitFromDoubleDoors_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_ExitFromDoubleDoors_DirectorBP, PlayerPlaceholder) == 0x000000, "Member 'LS_ExitFromDoubleDoors_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_ExitFromDoubleDoors_DirectorBP::PlayerPlaceholder' has a wrong offset!");

// Function LS_ExitFromDoubleDoors.LS_ExitFromDoubleDoors_DirectorBP_C.SurvivalPlayer_V2_Event_0
// 0x0008 (0x0008 - 0x0000)
struct LS_ExitFromDoubleDoors_DirectorBP_C_SurvivalPlayer_V2_Event_0 final
{
public:
	class ASurvivalPlayer_V2_C*                   SurvivalPlayer_V2;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LS_ExitFromDoubleDoors_DirectorBP_C_SurvivalPlayer_V2_Event_0) == 0x000008, "Wrong alignment on LS_ExitFromDoubleDoors_DirectorBP_C_SurvivalPlayer_V2_Event_0");
static_assert(sizeof(LS_ExitFromDoubleDoors_DirectorBP_C_SurvivalPlayer_V2_Event_0) == 0x000008, "Wrong size on LS_ExitFromDoubleDoors_DirectorBP_C_SurvivalPlayer_V2_Event_0");
static_assert(offsetof(LS_ExitFromDoubleDoors_DirectorBP_C_SurvivalPlayer_V2_Event_0, SurvivalPlayer_V2) == 0x000000, "Member 'LS_ExitFromDoubleDoors_DirectorBP_C_SurvivalPlayer_V2_Event_0::SurvivalPlayer_V2' has a wrong offset!");

}

