#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LS_InteractWithDoorHUB

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function LS_InteractWithDoorHUB.LS_InteractWithDoorHUB_DirectorBP_C.ExecuteUbergraph_LS_InteractWithDoorHUB (Director BP)
// 0x01F0 (0x01F0 - 0x0000)
struct LS_InteractWithDoorHUB_DirectorBP_C_ExecuteUbergraph_LS_InteractWithDoorHUB__Director_BP_ final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_V2_C*                   K2Node_CustomEvent_SurvivalPlayer_V2;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_PlayerPlaceholder;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_1;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0030(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocationAndRotation_SweepHitResult; // 0x00F8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocationAndRotation_ReturnValue; // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LS_InteractWithDoorHUB_DirectorBP_C_ExecuteUbergraph_LS_InteractWithDoorHUB__Director_BP_) == 0x000010, "Wrong alignment on LS_InteractWithDoorHUB_DirectorBP_C_ExecuteUbergraph_LS_InteractWithDoorHUB__Director_BP_");
static_assert(sizeof(LS_InteractWithDoorHUB_DirectorBP_C_ExecuteUbergraph_LS_InteractWithDoorHUB__Director_BP_) == 0x0001F0, "Wrong size on LS_InteractWithDoorHUB_DirectorBP_C_ExecuteUbergraph_LS_InteractWithDoorHUB__Director_BP_");
static_assert(offsetof(LS_InteractWithDoorHUB_DirectorBP_C_ExecuteUbergraph_LS_InteractWithDoorHUB__Director_BP_, EntryPoint) == 0x000000, "Member 'LS_InteractWithDoorHUB_DirectorBP_C_ExecuteUbergraph_LS_InteractWithDoorHUB__Director_BP_::EntryPoint' has a wrong offset!");
static_assert(offsetof(LS_InteractWithDoorHUB_DirectorBP_C_ExecuteUbergraph_LS_InteractWithDoorHUB__Director_BP_, CallFunc_GetPlayerPawn_ReturnValue) == 0x000008, "Member 'LS_InteractWithDoorHUB_DirectorBP_C_ExecuteUbergraph_LS_InteractWithDoorHUB__Director_BP_::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_InteractWithDoorHUB_DirectorBP_C_ExecuteUbergraph_LS_InteractWithDoorHUB__Director_BP_, K2Node_CustomEvent_SurvivalPlayer_V2) == 0x000010, "Member 'LS_InteractWithDoorHUB_DirectorBP_C_ExecuteUbergraph_LS_InteractWithDoorHUB__Director_BP_::K2Node_CustomEvent_SurvivalPlayer_V2' has a wrong offset!");
static_assert(offsetof(LS_InteractWithDoorHUB_DirectorBP_C_ExecuteUbergraph_LS_InteractWithDoorHUB__Director_BP_, K2Node_CustomEvent_PlayerPlaceholder) == 0x000018, "Member 'LS_InteractWithDoorHUB_DirectorBP_C_ExecuteUbergraph_LS_InteractWithDoorHUB__Director_BP_::K2Node_CustomEvent_PlayerPlaceholder' has a wrong offset!");
static_assert(offsetof(LS_InteractWithDoorHUB_DirectorBP_C_ExecuteUbergraph_LS_InteractWithDoorHUB__Director_BP_, CallFunc_GetPlayerPawn_ReturnValue_1) == 0x000020, "Member 'LS_InteractWithDoorHUB_DirectorBP_C_ExecuteUbergraph_LS_InteractWithDoorHUB__Director_BP_::CallFunc_GetPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LS_InteractWithDoorHUB_DirectorBP_C_ExecuteUbergraph_LS_InteractWithDoorHUB__Director_BP_, CallFunc_GetTransform_ReturnValue) == 0x000030, "Member 'LS_InteractWithDoorHUB_DirectorBP_C_ExecuteUbergraph_LS_InteractWithDoorHUB__Director_BP_::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_InteractWithDoorHUB_DirectorBP_C_ExecuteUbergraph_LS_InteractWithDoorHUB__Director_BP_, CallFunc_BreakTransform_Location) == 0x000090, "Member 'LS_InteractWithDoorHUB_DirectorBP_C_ExecuteUbergraph_LS_InteractWithDoorHUB__Director_BP_::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(LS_InteractWithDoorHUB_DirectorBP_C_ExecuteUbergraph_LS_InteractWithDoorHUB__Director_BP_, CallFunc_BreakTransform_Rotation) == 0x0000A8, "Member 'LS_InteractWithDoorHUB_DirectorBP_C_ExecuteUbergraph_LS_InteractWithDoorHUB__Director_BP_::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(LS_InteractWithDoorHUB_DirectorBP_C_ExecuteUbergraph_LS_InteractWithDoorHUB__Director_BP_, CallFunc_BreakTransform_Scale) == 0x0000C0, "Member 'LS_InteractWithDoorHUB_DirectorBP_C_ExecuteUbergraph_LS_InteractWithDoorHUB__Director_BP_::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(LS_InteractWithDoorHUB_DirectorBP_C_ExecuteUbergraph_LS_InteractWithDoorHUB__Director_BP_, CallFunc_Add_VectorVector_ReturnValue) == 0x0000D8, "Member 'LS_InteractWithDoorHUB_DirectorBP_C_ExecuteUbergraph_LS_InteractWithDoorHUB__Director_BP_::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_InteractWithDoorHUB_DirectorBP_C_ExecuteUbergraph_LS_InteractWithDoorHUB__Director_BP_, CallFunc_K2_SetActorRotation_ReturnValue) == 0x0000F0, "Member 'LS_InteractWithDoorHUB_DirectorBP_C_ExecuteUbergraph_LS_InteractWithDoorHUB__Director_BP_::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_InteractWithDoorHUB_DirectorBP_C_ExecuteUbergraph_LS_InteractWithDoorHUB__Director_BP_, CallFunc_K2_SetActorLocationAndRotation_SweepHitResult) == 0x0000F8, "Member 'LS_InteractWithDoorHUB_DirectorBP_C_ExecuteUbergraph_LS_InteractWithDoorHUB__Director_BP_::CallFunc_K2_SetActorLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(LS_InteractWithDoorHUB_DirectorBP_C_ExecuteUbergraph_LS_InteractWithDoorHUB__Director_BP_, CallFunc_K2_SetActorLocationAndRotation_ReturnValue) == 0x0001E0, "Member 'LS_InteractWithDoorHUB_DirectorBP_C_ExecuteUbergraph_LS_InteractWithDoorHUB__Director_BP_::CallFunc_K2_SetActorLocationAndRotation_ReturnValue' has a wrong offset!");

// Function LS_InteractWithDoorHUB.LS_InteractWithDoorHUB_DirectorBP_C.PlayerPlaceholder_Event_0
// 0x0008 (0x0008 - 0x0000)
struct LS_InteractWithDoorHUB_DirectorBP_C_PlayerPlaceholder_Event_0 final
{
public:
	class AActor*                                 PlayerPlaceholder;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LS_InteractWithDoorHUB_DirectorBP_C_PlayerPlaceholder_Event_0) == 0x000008, "Wrong alignment on LS_InteractWithDoorHUB_DirectorBP_C_PlayerPlaceholder_Event_0");
static_assert(sizeof(LS_InteractWithDoorHUB_DirectorBP_C_PlayerPlaceholder_Event_0) == 0x000008, "Wrong size on LS_InteractWithDoorHUB_DirectorBP_C_PlayerPlaceholder_Event_0");
static_assert(offsetof(LS_InteractWithDoorHUB_DirectorBP_C_PlayerPlaceholder_Event_0, PlayerPlaceholder) == 0x000000, "Member 'LS_InteractWithDoorHUB_DirectorBP_C_PlayerPlaceholder_Event_0::PlayerPlaceholder' has a wrong offset!");

// Function LS_InteractWithDoorHUB.LS_InteractWithDoorHUB_DirectorBP_C.SequenceEvent__ENTRYPOINTLS_InteractWithDoorHUB (Director BP)
// 0x0008 (0x0008 - 0x0000)
struct LS_InteractWithDoorHUB_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_InteractWithDoorHUB__Director_BP_ final
{
public:
	class AActor*                                 PlayerPlaceholder;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LS_InteractWithDoorHUB_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_InteractWithDoorHUB__Director_BP_) == 0x000008, "Wrong alignment on LS_InteractWithDoorHUB_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_InteractWithDoorHUB__Director_BP_");
static_assert(sizeof(LS_InteractWithDoorHUB_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_InteractWithDoorHUB__Director_BP_) == 0x000008, "Wrong size on LS_InteractWithDoorHUB_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_InteractWithDoorHUB__Director_BP_");
static_assert(offsetof(LS_InteractWithDoorHUB_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_InteractWithDoorHUB__Director_BP_, PlayerPlaceholder) == 0x000000, "Member 'LS_InteractWithDoorHUB_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_InteractWithDoorHUB__Director_BP_::PlayerPlaceholder' has a wrong offset!");

// Function LS_InteractWithDoorHUB.LS_InteractWithDoorHUB_DirectorBP_C.SurvivalPlayer_V2_Event_0
// 0x0008 (0x0008 - 0x0000)
struct LS_InteractWithDoorHUB_DirectorBP_C_SurvivalPlayer_V2_Event_0 final
{
public:
	class ASurvivalPlayer_V2_C*                   SurvivalPlayer_V2;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LS_InteractWithDoorHUB_DirectorBP_C_SurvivalPlayer_V2_Event_0) == 0x000008, "Wrong alignment on LS_InteractWithDoorHUB_DirectorBP_C_SurvivalPlayer_V2_Event_0");
static_assert(sizeof(LS_InteractWithDoorHUB_DirectorBP_C_SurvivalPlayer_V2_Event_0) == 0x000008, "Wrong size on LS_InteractWithDoorHUB_DirectorBP_C_SurvivalPlayer_V2_Event_0");
static_assert(offsetof(LS_InteractWithDoorHUB_DirectorBP_C_SurvivalPlayer_V2_Event_0, SurvivalPlayer_V2) == 0x000000, "Member 'LS_InteractWithDoorHUB_DirectorBP_C_SurvivalPlayer_V2_Event_0::SurvivalPlayer_V2' has a wrong offset!");

}

