#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LS_TeleportToWorld

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FMODStudio_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function LS_TeleportToWorld.LS_TeleportToWorld_DirectorBP_C.ExecuteUbergraph_LS_TeleportToWorld_DirectorBP
// 0x0550 (0x0550 - 0x0000)
struct LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_V2_C*                   K2Node_CustomEvent_SurvivalPlayer_V2;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_PlayerPlaceholder;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue;         // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0050(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ASurvivalPlayer_C*>              CallFunc_GetAllActorsOfClass_OutActors;            // 0x0158(0x0010)(ReferenceParm)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0168(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0252(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_253[0x1];                                      // 0x0253(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0260(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0278(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0290(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x02A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x02F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0310(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0340(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0358(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocationAndRotation_SweepHitResult; // 0x0370(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocationAndRotation_ReturnValue; // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_459[0x7];                                      // 0x0459(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0460(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP) == 0x000010, "Wrong alignment on LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP");
static_assert(sizeof(LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP) == 0x000550, "Wrong size on LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP");
static_assert(offsetof(LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP, EntryPoint) == 0x000000, "Member 'LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP, CallFunc_PlayEvent2D_ReturnValue) == 0x000008, "Member 'LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP::CallFunc_PlayEvent2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000010, "Member 'LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP, CallFunc_MakeVector_ReturnValue) == 0x000018, "Member 'LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP, K2Node_CustomEvent_SurvivalPlayer_V2) == 0x000030, "Member 'LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP::K2Node_CustomEvent_SurvivalPlayer_V2' has a wrong offset!");
static_assert(offsetof(LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP, K2Node_CustomEvent_PlayerPlaceholder) == 0x000038, "Member 'LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP::K2Node_CustomEvent_PlayerPlaceholder' has a wrong offset!");
static_assert(offsetof(LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP, CallFunc_GetPlayerPawn_ReturnValue) == 0x000040, "Member 'LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP, CallFunc_GetAttachParentActor_ReturnValue) == 0x000048, "Member 'LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP::CallFunc_GetAttachParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP, CallFunc_GetTransform_ReturnValue) == 0x000050, "Member 'LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000B0, "Member 'LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP, CallFunc_BreakTransform_Location) == 0x0000C8, "Member 'LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP, CallFunc_BreakTransform_Rotation) == 0x0000E0, "Member 'LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP, CallFunc_BreakTransform_Scale) == 0x0000F8, "Member 'LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP, CallFunc_BreakVector_X) == 0x000110, "Member 'LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP, CallFunc_BreakVector_Y) == 0x000118, "Member 'LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP, CallFunc_BreakVector_Z) == 0x000120, "Member 'LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP, CallFunc_Add_VectorVector_ReturnValue) == 0x000128, "Member 'LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000140, "Member 'LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP, CallFunc_GetAllActorsOfClass_OutActors) == 0x000158, "Member 'LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP, CallFunc_LineTraceSingle_OutHit) == 0x000168, "Member 'LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP, CallFunc_LineTraceSingle_ReturnValue) == 0x000250, "Member 'LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP, CallFunc_BreakHitResult_bBlockingHit) == 0x000251, "Member 'LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP, CallFunc_BreakHitResult_bInitialOverlap) == 0x000252, "Member 'LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP, CallFunc_BreakHitResult_Time) == 0x000254, "Member 'LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP, CallFunc_BreakHitResult_Distance) == 0x000258, "Member 'LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP, CallFunc_BreakHitResult_Location) == 0x000260, "Member 'LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP, CallFunc_BreakHitResult_ImpactPoint) == 0x000278, "Member 'LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP, CallFunc_BreakHitResult_Normal) == 0x000290, "Member 'LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP, CallFunc_BreakHitResult_ImpactNormal) == 0x0002A8, "Member 'LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP, CallFunc_BreakHitResult_PhysMat) == 0x0002C0, "Member 'LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP, CallFunc_BreakHitResult_HitActor) == 0x0002C8, "Member 'LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP, CallFunc_BreakHitResult_HitComponent) == 0x0002D0, "Member 'LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP, CallFunc_BreakHitResult_HitBoneName) == 0x0002D8, "Member 'LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP, CallFunc_BreakHitResult_BoneName) == 0x0002E0, "Member 'LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP, CallFunc_BreakHitResult_HitItem) == 0x0002E8, "Member 'LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP, CallFunc_BreakHitResult_ElementIndex) == 0x0002EC, "Member 'LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP, CallFunc_BreakHitResult_FaceIndex) == 0x0002F0, "Member 'LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP, CallFunc_BreakHitResult_TraceStart) == 0x0002F8, "Member 'LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP, CallFunc_BreakHitResult_TraceEnd) == 0x000310, "Member 'LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP, CallFunc_BreakVector_X_1) == 0x000328, "Member 'LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP, CallFunc_BreakVector_Y_1) == 0x000330, "Member 'LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP, CallFunc_BreakVector_Z_1) == 0x000338, "Member 'LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000340, "Member 'LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP, CallFunc_MakeVector_ReturnValue_1) == 0x000358, "Member 'LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP, CallFunc_K2_SetActorLocationAndRotation_SweepHitResult) == 0x000370, "Member 'LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP::CallFunc_K2_SetActorLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP, CallFunc_K2_SetActorLocationAndRotation_ReturnValue) == 0x000458, "Member 'LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP::CallFunc_K2_SetActorLocationAndRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000460, "Member 'LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000548, "Member 'LS_TeleportToWorld_DirectorBP_C_ExecuteUbergraph_LS_TeleportToWorld_DirectorBP::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");

// Function LS_TeleportToWorld.LS_TeleportToWorld_DirectorBP_C.PlayerPlaceholder_Event_0
// 0x0008 (0x0008 - 0x0000)
struct LS_TeleportToWorld_DirectorBP_C_PlayerPlaceholder_Event_0 final
{
public:
	class AActor*                                 PlayerPlaceholder;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LS_TeleportToWorld_DirectorBP_C_PlayerPlaceholder_Event_0) == 0x000008, "Wrong alignment on LS_TeleportToWorld_DirectorBP_C_PlayerPlaceholder_Event_0");
static_assert(sizeof(LS_TeleportToWorld_DirectorBP_C_PlayerPlaceholder_Event_0) == 0x000008, "Wrong size on LS_TeleportToWorld_DirectorBP_C_PlayerPlaceholder_Event_0");
static_assert(offsetof(LS_TeleportToWorld_DirectorBP_C_PlayerPlaceholder_Event_0, PlayerPlaceholder) == 0x000000, "Member 'LS_TeleportToWorld_DirectorBP_C_PlayerPlaceholder_Event_0::PlayerPlaceholder' has a wrong offset!");

// Function LS_TeleportToWorld.LS_TeleportToWorld_DirectorBP_C.SequenceEvent__ENTRYPOINTLS_TeleportToWorld_DirectorBP
// 0x0008 (0x0008 - 0x0000)
struct LS_TeleportToWorld_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_TeleportToWorld_DirectorBP final
{
public:
	class AActor*                                 PlayerPlaceholder;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LS_TeleportToWorld_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_TeleportToWorld_DirectorBP) == 0x000008, "Wrong alignment on LS_TeleportToWorld_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_TeleportToWorld_DirectorBP");
static_assert(sizeof(LS_TeleportToWorld_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_TeleportToWorld_DirectorBP) == 0x000008, "Wrong size on LS_TeleportToWorld_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_TeleportToWorld_DirectorBP");
static_assert(offsetof(LS_TeleportToWorld_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_TeleportToWorld_DirectorBP, PlayerPlaceholder) == 0x000000, "Member 'LS_TeleportToWorld_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_TeleportToWorld_DirectorBP::PlayerPlaceholder' has a wrong offset!");

// Function LS_TeleportToWorld.LS_TeleportToWorld_DirectorBP_C.SurvivalPlayer_V2_Event_0
// 0x0008 (0x0008 - 0x0000)
struct LS_TeleportToWorld_DirectorBP_C_SurvivalPlayer_V2_Event_0 final
{
public:
	class ASurvivalPlayer_V2_C*                   SurvivalPlayer_V2;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LS_TeleportToWorld_DirectorBP_C_SurvivalPlayer_V2_Event_0) == 0x000008, "Wrong alignment on LS_TeleportToWorld_DirectorBP_C_SurvivalPlayer_V2_Event_0");
static_assert(sizeof(LS_TeleportToWorld_DirectorBP_C_SurvivalPlayer_V2_Event_0) == 0x000008, "Wrong size on LS_TeleportToWorld_DirectorBP_C_SurvivalPlayer_V2_Event_0");
static_assert(offsetof(LS_TeleportToWorld_DirectorBP_C_SurvivalPlayer_V2_Event_0, SurvivalPlayer_V2) == 0x000000, "Member 'LS_TeleportToWorld_DirectorBP_C_SurvivalPlayer_V2_Event_0::SurvivalPlayer_V2' has a wrong offset!");

}

