#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LS_WakingUpIntro

#include "Basic.hpp"


namespace SDK::Params
{

// Function LS_WakingUpIntro.LS_WakingUpIntro_DirectorBP_C.ExecuteUbergraph_LS_WakingUpIntro (Director BP)
// 0x0068 (0x0068 - 0x0000)
struct LS_WakingUpIntro_DirectorBP_C_ExecuteUbergraph_LS_WakingUpIntro__Director_BP_ final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_V2_C*                   K2Node_CustomEvent_SurvivalPlayer_V2;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_PlayerPlaceholder;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameHUD_C>        K2Node_DynamicCast_AsBPI_Game_HUD;                 // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue_1;                     // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameHUD_C>        K2Node_DynamicCast_AsBPI_Game_HUD_1;               // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LS_WakingUpIntro_DirectorBP_C_ExecuteUbergraph_LS_WakingUpIntro__Director_BP_) == 0x000008, "Wrong alignment on LS_WakingUpIntro_DirectorBP_C_ExecuteUbergraph_LS_WakingUpIntro__Director_BP_");
static_assert(sizeof(LS_WakingUpIntro_DirectorBP_C_ExecuteUbergraph_LS_WakingUpIntro__Director_BP_) == 0x000068, "Wrong size on LS_WakingUpIntro_DirectorBP_C_ExecuteUbergraph_LS_WakingUpIntro__Director_BP_");
static_assert(offsetof(LS_WakingUpIntro_DirectorBP_C_ExecuteUbergraph_LS_WakingUpIntro__Director_BP_, EntryPoint) == 0x000000, "Member 'LS_WakingUpIntro_DirectorBP_C_ExecuteUbergraph_LS_WakingUpIntro__Director_BP_::EntryPoint' has a wrong offset!");
static_assert(offsetof(LS_WakingUpIntro_DirectorBP_C_ExecuteUbergraph_LS_WakingUpIntro__Director_BP_, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'LS_WakingUpIntro_DirectorBP_C_ExecuteUbergraph_LS_WakingUpIntro__Director_BP_::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_WakingUpIntro_DirectorBP_C_ExecuteUbergraph_LS_WakingUpIntro__Director_BP_, K2Node_CustomEvent_SurvivalPlayer_V2) == 0x000010, "Member 'LS_WakingUpIntro_DirectorBP_C_ExecuteUbergraph_LS_WakingUpIntro__Director_BP_::K2Node_CustomEvent_SurvivalPlayer_V2' has a wrong offset!");
static_assert(offsetof(LS_WakingUpIntro_DirectorBP_C_ExecuteUbergraph_LS_WakingUpIntro__Director_BP_, CallFunc_GetHUD_ReturnValue) == 0x000018, "Member 'LS_WakingUpIntro_DirectorBP_C_ExecuteUbergraph_LS_WakingUpIntro__Director_BP_::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_WakingUpIntro_DirectorBP_C_ExecuteUbergraph_LS_WakingUpIntro__Director_BP_, K2Node_CustomEvent_PlayerPlaceholder) == 0x000020, "Member 'LS_WakingUpIntro_DirectorBP_C_ExecuteUbergraph_LS_WakingUpIntro__Director_BP_::K2Node_CustomEvent_PlayerPlaceholder' has a wrong offset!");
static_assert(offsetof(LS_WakingUpIntro_DirectorBP_C_ExecuteUbergraph_LS_WakingUpIntro__Director_BP_, K2Node_DynamicCast_AsBPI_Game_HUD) == 0x000028, "Member 'LS_WakingUpIntro_DirectorBP_C_ExecuteUbergraph_LS_WakingUpIntro__Director_BP_::K2Node_DynamicCast_AsBPI_Game_HUD' has a wrong offset!");
static_assert(offsetof(LS_WakingUpIntro_DirectorBP_C_ExecuteUbergraph_LS_WakingUpIntro__Director_BP_, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'LS_WakingUpIntro_DirectorBP_C_ExecuteUbergraph_LS_WakingUpIntro__Director_BP_::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(LS_WakingUpIntro_DirectorBP_C_ExecuteUbergraph_LS_WakingUpIntro__Director_BP_, CallFunc_GetPlayerController_ReturnValue_1) == 0x000040, "Member 'LS_WakingUpIntro_DirectorBP_C_ExecuteUbergraph_LS_WakingUpIntro__Director_BP_::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LS_WakingUpIntro_DirectorBP_C_ExecuteUbergraph_LS_WakingUpIntro__Director_BP_, CallFunc_GetHUD_ReturnValue_1) == 0x000048, "Member 'LS_WakingUpIntro_DirectorBP_C_ExecuteUbergraph_LS_WakingUpIntro__Director_BP_::CallFunc_GetHUD_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LS_WakingUpIntro_DirectorBP_C_ExecuteUbergraph_LS_WakingUpIntro__Director_BP_, K2Node_DynamicCast_AsBPI_Game_HUD_1) == 0x000050, "Member 'LS_WakingUpIntro_DirectorBP_C_ExecuteUbergraph_LS_WakingUpIntro__Director_BP_::K2Node_DynamicCast_AsBPI_Game_HUD_1' has a wrong offset!");
static_assert(offsetof(LS_WakingUpIntro_DirectorBP_C_ExecuteUbergraph_LS_WakingUpIntro__Director_BP_, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'LS_WakingUpIntro_DirectorBP_C_ExecuteUbergraph_LS_WakingUpIntro__Director_BP_::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function LS_WakingUpIntro.LS_WakingUpIntro_DirectorBP_C.PlayerPlaceholder_Event_0
// 0x0008 (0x0008 - 0x0000)
struct LS_WakingUpIntro_DirectorBP_C_PlayerPlaceholder_Event_0 final
{
public:
	class AActor*                                 PlayerPlaceholder;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LS_WakingUpIntro_DirectorBP_C_PlayerPlaceholder_Event_0) == 0x000008, "Wrong alignment on LS_WakingUpIntro_DirectorBP_C_PlayerPlaceholder_Event_0");
static_assert(sizeof(LS_WakingUpIntro_DirectorBP_C_PlayerPlaceholder_Event_0) == 0x000008, "Wrong size on LS_WakingUpIntro_DirectorBP_C_PlayerPlaceholder_Event_0");
static_assert(offsetof(LS_WakingUpIntro_DirectorBP_C_PlayerPlaceholder_Event_0, PlayerPlaceholder) == 0x000000, "Member 'LS_WakingUpIntro_DirectorBP_C_PlayerPlaceholder_Event_0::PlayerPlaceholder' has a wrong offset!");

// Function LS_WakingUpIntro.LS_WakingUpIntro_DirectorBP_C.SequenceEvent__ENTRYPOINTLS_WakingUpIntro (Director BP)
// 0x0008 (0x0008 - 0x0000)
struct LS_WakingUpIntro_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_WakingUpIntro__Director_BP_ final
{
public:
	class AActor*                                 PlayerPlaceholder;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LS_WakingUpIntro_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_WakingUpIntro__Director_BP_) == 0x000008, "Wrong alignment on LS_WakingUpIntro_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_WakingUpIntro__Director_BP_");
static_assert(sizeof(LS_WakingUpIntro_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_WakingUpIntro__Director_BP_) == 0x000008, "Wrong size on LS_WakingUpIntro_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_WakingUpIntro__Director_BP_");
static_assert(offsetof(LS_WakingUpIntro_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_WakingUpIntro__Director_BP_, PlayerPlaceholder) == 0x000000, "Member 'LS_WakingUpIntro_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_WakingUpIntro__Director_BP_::PlayerPlaceholder' has a wrong offset!");

// Function LS_WakingUpIntro.LS_WakingUpIntro_DirectorBP_C.SurvivalPlayer_V2_Event_0
// 0x0008 (0x0008 - 0x0000)
struct LS_WakingUpIntro_DirectorBP_C_SurvivalPlayer_V2_Event_0 final
{
public:
	class ASurvivalPlayer_V2_C*                   SurvivalPlayer_V2;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LS_WakingUpIntro_DirectorBP_C_SurvivalPlayer_V2_Event_0) == 0x000008, "Wrong alignment on LS_WakingUpIntro_DirectorBP_C_SurvivalPlayer_V2_Event_0");
static_assert(sizeof(LS_WakingUpIntro_DirectorBP_C_SurvivalPlayer_V2_Event_0) == 0x000008, "Wrong size on LS_WakingUpIntro_DirectorBP_C_SurvivalPlayer_V2_Event_0");
static_assert(offsetof(LS_WakingUpIntro_DirectorBP_C_SurvivalPlayer_V2_Event_0, SurvivalPlayer_V2) == 0x000000, "Member 'LS_WakingUpIntro_DirectorBP_C_SurvivalPlayer_V2_Event_0::SurvivalPlayer_V2' has a wrong offset!");

}

