#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LS_WakingUpRespawnHospital

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function LS_WakingUpRespawnHospital.LS_WakingUpRespawnHospital_DirectorBP_C.ExecuteUbergraph_LS_WakingUpRespawnHospital (Director BP)
// 0x0250 (0x0250 - 0x0000)
struct LS_WakingUpRespawnHospital_DirectorBP_C_ExecuteUbergraph_LS_WakingUpRespawnHospital__Director_BP_ final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_PlayerPlaceholder;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0030(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_V2_C*                   K2Node_CustomEvent_SurvivalPlayer_V2;              // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocationAndRotation_SweepHitResult; // 0x0100(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocationAndRotation_ReturnValue; // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameHUD_C>        K2Node_DynamicCast_AsBPI_Game_HUD;                 // 0x0210(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUD*                                   CallFunc_GetHUD_ReturnValue_1;                     // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameHUD_C>        K2Node_DynamicCast_AsBPI_Game_HUD_1;               // 0x0230(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LS_WakingUpRespawnHospital_DirectorBP_C_ExecuteUbergraph_LS_WakingUpRespawnHospital__Director_BP_) == 0x000010, "Wrong alignment on LS_WakingUpRespawnHospital_DirectorBP_C_ExecuteUbergraph_LS_WakingUpRespawnHospital__Director_BP_");
static_assert(sizeof(LS_WakingUpRespawnHospital_DirectorBP_C_ExecuteUbergraph_LS_WakingUpRespawnHospital__Director_BP_) == 0x000250, "Wrong size on LS_WakingUpRespawnHospital_DirectorBP_C_ExecuteUbergraph_LS_WakingUpRespawnHospital__Director_BP_");
static_assert(offsetof(LS_WakingUpRespawnHospital_DirectorBP_C_ExecuteUbergraph_LS_WakingUpRespawnHospital__Director_BP_, EntryPoint) == 0x000000, "Member 'LS_WakingUpRespawnHospital_DirectorBP_C_ExecuteUbergraph_LS_WakingUpRespawnHospital__Director_BP_::EntryPoint' has a wrong offset!");
static_assert(offsetof(LS_WakingUpRespawnHospital_DirectorBP_C_ExecuteUbergraph_LS_WakingUpRespawnHospital__Director_BP_, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000008, "Member 'LS_WakingUpRespawnHospital_DirectorBP_C_ExecuteUbergraph_LS_WakingUpRespawnHospital__Director_BP_::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_WakingUpRespawnHospital_DirectorBP_C_ExecuteUbergraph_LS_WakingUpRespawnHospital__Director_BP_, K2Node_CustomEvent_PlayerPlaceholder) == 0x000010, "Member 'LS_WakingUpRespawnHospital_DirectorBP_C_ExecuteUbergraph_LS_WakingUpRespawnHospital__Director_BP_::K2Node_CustomEvent_PlayerPlaceholder' has a wrong offset!");
static_assert(offsetof(LS_WakingUpRespawnHospital_DirectorBP_C_ExecuteUbergraph_LS_WakingUpRespawnHospital__Director_BP_, CallFunc_MakeVector_ReturnValue) == 0x000018, "Member 'LS_WakingUpRespawnHospital_DirectorBP_C_ExecuteUbergraph_LS_WakingUpRespawnHospital__Director_BP_::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_WakingUpRespawnHospital_DirectorBP_C_ExecuteUbergraph_LS_WakingUpRespawnHospital__Director_BP_, CallFunc_GetTransform_ReturnValue) == 0x000030, "Member 'LS_WakingUpRespawnHospital_DirectorBP_C_ExecuteUbergraph_LS_WakingUpRespawnHospital__Director_BP_::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_WakingUpRespawnHospital_DirectorBP_C_ExecuteUbergraph_LS_WakingUpRespawnHospital__Director_BP_, CallFunc_GetPlayerPawn_ReturnValue) == 0x000090, "Member 'LS_WakingUpRespawnHospital_DirectorBP_C_ExecuteUbergraph_LS_WakingUpRespawnHospital__Director_BP_::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_WakingUpRespawnHospital_DirectorBP_C_ExecuteUbergraph_LS_WakingUpRespawnHospital__Director_BP_, CallFunc_BreakTransform_Location) == 0x000098, "Member 'LS_WakingUpRespawnHospital_DirectorBP_C_ExecuteUbergraph_LS_WakingUpRespawnHospital__Director_BP_::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(LS_WakingUpRespawnHospital_DirectorBP_C_ExecuteUbergraph_LS_WakingUpRespawnHospital__Director_BP_, CallFunc_BreakTransform_Rotation) == 0x0000B0, "Member 'LS_WakingUpRespawnHospital_DirectorBP_C_ExecuteUbergraph_LS_WakingUpRespawnHospital__Director_BP_::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(LS_WakingUpRespawnHospital_DirectorBP_C_ExecuteUbergraph_LS_WakingUpRespawnHospital__Director_BP_, CallFunc_BreakTransform_Scale) == 0x0000C8, "Member 'LS_WakingUpRespawnHospital_DirectorBP_C_ExecuteUbergraph_LS_WakingUpRespawnHospital__Director_BP_::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(LS_WakingUpRespawnHospital_DirectorBP_C_ExecuteUbergraph_LS_WakingUpRespawnHospital__Director_BP_, K2Node_CustomEvent_SurvivalPlayer_V2) == 0x0000E0, "Member 'LS_WakingUpRespawnHospital_DirectorBP_C_ExecuteUbergraph_LS_WakingUpRespawnHospital__Director_BP_::K2Node_CustomEvent_SurvivalPlayer_V2' has a wrong offset!");
static_assert(offsetof(LS_WakingUpRespawnHospital_DirectorBP_C_ExecuteUbergraph_LS_WakingUpRespawnHospital__Director_BP_, CallFunc_Add_VectorVector_ReturnValue) == 0x0000E8, "Member 'LS_WakingUpRespawnHospital_DirectorBP_C_ExecuteUbergraph_LS_WakingUpRespawnHospital__Director_BP_::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_WakingUpRespawnHospital_DirectorBP_C_ExecuteUbergraph_LS_WakingUpRespawnHospital__Director_BP_, CallFunc_K2_SetActorLocationAndRotation_SweepHitResult) == 0x000100, "Member 'LS_WakingUpRespawnHospital_DirectorBP_C_ExecuteUbergraph_LS_WakingUpRespawnHospital__Director_BP_::CallFunc_K2_SetActorLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(LS_WakingUpRespawnHospital_DirectorBP_C_ExecuteUbergraph_LS_WakingUpRespawnHospital__Director_BP_, CallFunc_K2_SetActorLocationAndRotation_ReturnValue) == 0x0001E8, "Member 'LS_WakingUpRespawnHospital_DirectorBP_C_ExecuteUbergraph_LS_WakingUpRespawnHospital__Director_BP_::CallFunc_K2_SetActorLocationAndRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_WakingUpRespawnHospital_DirectorBP_C_ExecuteUbergraph_LS_WakingUpRespawnHospital__Director_BP_, CallFunc_GetPlayerController_ReturnValue) == 0x0001F0, "Member 'LS_WakingUpRespawnHospital_DirectorBP_C_ExecuteUbergraph_LS_WakingUpRespawnHospital__Director_BP_::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_WakingUpRespawnHospital_DirectorBP_C_ExecuteUbergraph_LS_WakingUpRespawnHospital__Director_BP_, CallFunc_GetPlayerController_ReturnValue_1) == 0x0001F8, "Member 'LS_WakingUpRespawnHospital_DirectorBP_C_ExecuteUbergraph_LS_WakingUpRespawnHospital__Director_BP_::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LS_WakingUpRespawnHospital_DirectorBP_C_ExecuteUbergraph_LS_WakingUpRespawnHospital__Director_BP_, CallFunc_GetHUD_ReturnValue) == 0x000200, "Member 'LS_WakingUpRespawnHospital_DirectorBP_C_ExecuteUbergraph_LS_WakingUpRespawnHospital__Director_BP_::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_WakingUpRespawnHospital_DirectorBP_C_ExecuteUbergraph_LS_WakingUpRespawnHospital__Director_BP_, CallFunc_GetPlayerController_ReturnValue_2) == 0x000208, "Member 'LS_WakingUpRespawnHospital_DirectorBP_C_ExecuteUbergraph_LS_WakingUpRespawnHospital__Director_BP_::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LS_WakingUpRespawnHospital_DirectorBP_C_ExecuteUbergraph_LS_WakingUpRespawnHospital__Director_BP_, K2Node_DynamicCast_AsBPI_Game_HUD) == 0x000210, "Member 'LS_WakingUpRespawnHospital_DirectorBP_C_ExecuteUbergraph_LS_WakingUpRespawnHospital__Director_BP_::K2Node_DynamicCast_AsBPI_Game_HUD' has a wrong offset!");
static_assert(offsetof(LS_WakingUpRespawnHospital_DirectorBP_C_ExecuteUbergraph_LS_WakingUpRespawnHospital__Director_BP_, K2Node_DynamicCast_bSuccess) == 0x000220, "Member 'LS_WakingUpRespawnHospital_DirectorBP_C_ExecuteUbergraph_LS_WakingUpRespawnHospital__Director_BP_::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(LS_WakingUpRespawnHospital_DirectorBP_C_ExecuteUbergraph_LS_WakingUpRespawnHospital__Director_BP_, CallFunc_GetHUD_ReturnValue_1) == 0x000228, "Member 'LS_WakingUpRespawnHospital_DirectorBP_C_ExecuteUbergraph_LS_WakingUpRespawnHospital__Director_BP_::CallFunc_GetHUD_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LS_WakingUpRespawnHospital_DirectorBP_C_ExecuteUbergraph_LS_WakingUpRespawnHospital__Director_BP_, K2Node_DynamicCast_AsBPI_Game_HUD_1) == 0x000230, "Member 'LS_WakingUpRespawnHospital_DirectorBP_C_ExecuteUbergraph_LS_WakingUpRespawnHospital__Director_BP_::K2Node_DynamicCast_AsBPI_Game_HUD_1' has a wrong offset!");
static_assert(offsetof(LS_WakingUpRespawnHospital_DirectorBP_C_ExecuteUbergraph_LS_WakingUpRespawnHospital__Director_BP_, K2Node_DynamicCast_bSuccess_1) == 0x000240, "Member 'LS_WakingUpRespawnHospital_DirectorBP_C_ExecuteUbergraph_LS_WakingUpRespawnHospital__Director_BP_::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function LS_WakingUpRespawnHospital.LS_WakingUpRespawnHospital_DirectorBP_C.PlayerPlaceholder_Event_0
// 0x0008 (0x0008 - 0x0000)
struct LS_WakingUpRespawnHospital_DirectorBP_C_PlayerPlaceholder_Event_0 final
{
public:
	class AActor*                                 PlayerPlaceholder;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LS_WakingUpRespawnHospital_DirectorBP_C_PlayerPlaceholder_Event_0) == 0x000008, "Wrong alignment on LS_WakingUpRespawnHospital_DirectorBP_C_PlayerPlaceholder_Event_0");
static_assert(sizeof(LS_WakingUpRespawnHospital_DirectorBP_C_PlayerPlaceholder_Event_0) == 0x000008, "Wrong size on LS_WakingUpRespawnHospital_DirectorBP_C_PlayerPlaceholder_Event_0");
static_assert(offsetof(LS_WakingUpRespawnHospital_DirectorBP_C_PlayerPlaceholder_Event_0, PlayerPlaceholder) == 0x000000, "Member 'LS_WakingUpRespawnHospital_DirectorBP_C_PlayerPlaceholder_Event_0::PlayerPlaceholder' has a wrong offset!");

// Function LS_WakingUpRespawnHospital.LS_WakingUpRespawnHospital_DirectorBP_C.SequenceEvent__ENTRYPOINTLS_WakingUpRespawnHospital (Director BP)
// 0x0008 (0x0008 - 0x0000)
struct LS_WakingUpRespawnHospital_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_WakingUpRespawnHospital__Director_BP_ final
{
public:
	class AActor*                                 PlayerPlaceholder;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LS_WakingUpRespawnHospital_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_WakingUpRespawnHospital__Director_BP_) == 0x000008, "Wrong alignment on LS_WakingUpRespawnHospital_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_WakingUpRespawnHospital__Director_BP_");
static_assert(sizeof(LS_WakingUpRespawnHospital_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_WakingUpRespawnHospital__Director_BP_) == 0x000008, "Wrong size on LS_WakingUpRespawnHospital_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_WakingUpRespawnHospital__Director_BP_");
static_assert(offsetof(LS_WakingUpRespawnHospital_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_WakingUpRespawnHospital__Director_BP_, PlayerPlaceholder) == 0x000000, "Member 'LS_WakingUpRespawnHospital_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_WakingUpRespawnHospital__Director_BP_::PlayerPlaceholder' has a wrong offset!");

// Function LS_WakingUpRespawnHospital.LS_WakingUpRespawnHospital_DirectorBP_C.SurvivalPlayer_V2_Event_0
// 0x0008 (0x0008 - 0x0000)
struct LS_WakingUpRespawnHospital_DirectorBP_C_SurvivalPlayer_V2_Event_0 final
{
public:
	class ASurvivalPlayer_V2_C*                   SurvivalPlayer_V2;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LS_WakingUpRespawnHospital_DirectorBP_C_SurvivalPlayer_V2_Event_0) == 0x000008, "Wrong alignment on LS_WakingUpRespawnHospital_DirectorBP_C_SurvivalPlayer_V2_Event_0");
static_assert(sizeof(LS_WakingUpRespawnHospital_DirectorBP_C_SurvivalPlayer_V2_Event_0) == 0x000008, "Wrong size on LS_WakingUpRespawnHospital_DirectorBP_C_SurvivalPlayer_V2_Event_0");
static_assert(offsetof(LS_WakingUpRespawnHospital_DirectorBP_C_SurvivalPlayer_V2_Event_0, SurvivalPlayer_V2) == 0x000000, "Member 'LS_WakingUpRespawnHospital_DirectorBP_C_SurvivalPlayer_V2_Event_0::SurvivalPlayer_V2' has a wrong offset!");

}

