#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MPContainerWidget_v2

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "FItemInfo_structs.hpp"


namespace SDK::Params
{

// Function MPContainerWidget_v2.MPContainerWidget_v2_C.AddItem
// 0x0288 (0x0288 - 0x0000)
struct MPContainerWidget_v2_C_AddItem final
{
public:
	struct FFItemInfo                             ItemInfo;                                          // 0x0000(0x0220)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
	class UWBP_LootEntry_C*                       EntryRef;                                          // 0x0220(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_LootEntry_C* EntryRef)> K2Node_CreateDelegate_OutputDelegate;              // 0x0228(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0238(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UWBP_LootEntry_C*                       CallFunc_Create_ReturnValue;                       // 0x0248(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25D[0x3];                                      // 0x025D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_LootEntry_C*                       CallFunc_Array_Get_Item;                           // 0x0260(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       K2Node_DynamicCast_AsVertical_Box_Slot;            // 0x0270(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0280(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MPContainerWidget_v2_C_AddItem) == 0x000008, "Wrong alignment on MPContainerWidget_v2_C_AddItem");
static_assert(sizeof(MPContainerWidget_v2_C_AddItem) == 0x000288, "Wrong size on MPContainerWidget_v2_C_AddItem");
static_assert(offsetof(MPContainerWidget_v2_C_AddItem, ItemInfo) == 0x000000, "Member 'MPContainerWidget_v2_C_AddItem::ItemInfo' has a wrong offset!");
static_assert(offsetof(MPContainerWidget_v2_C_AddItem, EntryRef) == 0x000220, "Member 'MPContainerWidget_v2_C_AddItem::EntryRef' has a wrong offset!");
static_assert(offsetof(MPContainerWidget_v2_C_AddItem, K2Node_CreateDelegate_OutputDelegate) == 0x000228, "Member 'MPContainerWidget_v2_C_AddItem::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(MPContainerWidget_v2_C_AddItem, K2Node_MakeStruct_Margin) == 0x000238, "Member 'MPContainerWidget_v2_C_AddItem::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(MPContainerWidget_v2_C_AddItem, CallFunc_Create_ReturnValue) == 0x000248, "Member 'MPContainerWidget_v2_C_AddItem::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(MPContainerWidget_v2_C_AddItem, CallFunc_Array_LastIndex_ReturnValue) == 0x000250, "Member 'MPContainerWidget_v2_C_AddItem::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(MPContainerWidget_v2_C_AddItem, CallFunc_Array_Length_ReturnValue) == 0x000254, "Member 'MPContainerWidget_v2_C_AddItem::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MPContainerWidget_v2_C_AddItem, CallFunc_Subtract_IntInt_ReturnValue) == 0x000258, "Member 'MPContainerWidget_v2_C_AddItem::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MPContainerWidget_v2_C_AddItem, CallFunc_Greater_IntInt_ReturnValue) == 0x00025C, "Member 'MPContainerWidget_v2_C_AddItem::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MPContainerWidget_v2_C_AddItem, CallFunc_Array_Get_Item) == 0x000260, "Member 'MPContainerWidget_v2_C_AddItem::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MPContainerWidget_v2_C_AddItem, CallFunc_Array_Add_ReturnValue) == 0x000268, "Member 'MPContainerWidget_v2_C_AddItem::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(MPContainerWidget_v2_C_AddItem, K2Node_DynamicCast_AsVertical_Box_Slot) == 0x000270, "Member 'MPContainerWidget_v2_C_AddItem::K2Node_DynamicCast_AsVertical_Box_Slot' has a wrong offset!");
static_assert(offsetof(MPContainerWidget_v2_C_AddItem, K2Node_DynamicCast_bSuccess) == 0x000278, "Member 'MPContainerWidget_v2_C_AddItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MPContainerWidget_v2_C_AddItem, CallFunc_AddChild_ReturnValue) == 0x000280, "Member 'MPContainerWidget_v2_C_AddItem::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function MPContainerWidget_v2.MPContainerWidget_v2_C.Clear
// 0x0020 (0x0020 - 0x0000)
struct MPContainerWidget_v2_C_Clear final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_LootEntry_C*                       CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MPContainerWidget_v2_C_Clear) == 0x000008, "Wrong alignment on MPContainerWidget_v2_C_Clear");
static_assert(sizeof(MPContainerWidget_v2_C_Clear) == 0x000020, "Wrong size on MPContainerWidget_v2_C_Clear");
static_assert(offsetof(MPContainerWidget_v2_C_Clear, Temp_int_Array_Index_Variable) == 0x000000, "Member 'MPContainerWidget_v2_C_Clear::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MPContainerWidget_v2_C_Clear, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'MPContainerWidget_v2_C_Clear::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MPContainerWidget_v2_C_Clear, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'MPContainerWidget_v2_C_Clear::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MPContainerWidget_v2_C_Clear, CallFunc_Array_Get_Item) == 0x000010, "Member 'MPContainerWidget_v2_C_Clear::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MPContainerWidget_v2_C_Clear, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'MPContainerWidget_v2_C_Clear::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MPContainerWidget_v2_C_Clear, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'MPContainerWidget_v2_C_Clear::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function MPContainerWidget_v2.MPContainerWidget_v2_C.EntryDragged
// 0x0008 (0x0008 - 0x0000)
struct MPContainerWidget_v2_C_EntryDragged final
{
public:
	class UWBP_LootEntry_C*                       EntryRef;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MPContainerWidget_v2_C_EntryDragged) == 0x000008, "Wrong alignment on MPContainerWidget_v2_C_EntryDragged");
static_assert(sizeof(MPContainerWidget_v2_C_EntryDragged) == 0x000008, "Wrong size on MPContainerWidget_v2_C_EntryDragged");
static_assert(offsetof(MPContainerWidget_v2_C_EntryDragged, EntryRef) == 0x000000, "Member 'MPContainerWidget_v2_C_EntryDragged::EntryRef' has a wrong offset!");

// Function MPContainerWidget_v2.MPContainerWidget_v2_C.ExecuteUbergraph_MPContainerWidget_v2
// 0x0010 (0x0010 - 0x0000)
struct MPContainerWidget_v2_C_ExecuteUbergraph_MPContainerWidget_v2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_LootEntry_C*                       K2Node_CustomEvent_EntryRef;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MPContainerWidget_v2_C_ExecuteUbergraph_MPContainerWidget_v2) == 0x000008, "Wrong alignment on MPContainerWidget_v2_C_ExecuteUbergraph_MPContainerWidget_v2");
static_assert(sizeof(MPContainerWidget_v2_C_ExecuteUbergraph_MPContainerWidget_v2) == 0x000010, "Wrong size on MPContainerWidget_v2_C_ExecuteUbergraph_MPContainerWidget_v2");
static_assert(offsetof(MPContainerWidget_v2_C_ExecuteUbergraph_MPContainerWidget_v2, EntryPoint) == 0x000000, "Member 'MPContainerWidget_v2_C_ExecuteUbergraph_MPContainerWidget_v2::EntryPoint' has a wrong offset!");
static_assert(offsetof(MPContainerWidget_v2_C_ExecuteUbergraph_MPContainerWidget_v2, K2Node_CustomEvent_EntryRef) == 0x000008, "Member 'MPContainerWidget_v2_C_ExecuteUbergraph_MPContainerWidget_v2::K2Node_CustomEvent_EntryRef' has a wrong offset!");

// Function MPContainerWidget_v2.MPContainerWidget_v2_C.OnContainerDropped__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct MPContainerWidget_v2_C_OnContainerDropped__DelegateSignature final
{
public:
	class UJSIContainer_C*                        FromContainerRef;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJSI_Slot_C*                            FromSlotRef;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_LootEntry_C*                       ToEntryRef;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJSI_Slot_C*                            ToSlotRef;                                         // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MPContainerWidget_v2_C_OnContainerDropped__DelegateSignature) == 0x000008, "Wrong alignment on MPContainerWidget_v2_C_OnContainerDropped__DelegateSignature");
static_assert(sizeof(MPContainerWidget_v2_C_OnContainerDropped__DelegateSignature) == 0x000020, "Wrong size on MPContainerWidget_v2_C_OnContainerDropped__DelegateSignature");
static_assert(offsetof(MPContainerWidget_v2_C_OnContainerDropped__DelegateSignature, FromContainerRef) == 0x000000, "Member 'MPContainerWidget_v2_C_OnContainerDropped__DelegateSignature::FromContainerRef' has a wrong offset!");
static_assert(offsetof(MPContainerWidget_v2_C_OnContainerDropped__DelegateSignature, FromSlotRef) == 0x000008, "Member 'MPContainerWidget_v2_C_OnContainerDropped__DelegateSignature::FromSlotRef' has a wrong offset!");
static_assert(offsetof(MPContainerWidget_v2_C_OnContainerDropped__DelegateSignature, ToEntryRef) == 0x000010, "Member 'MPContainerWidget_v2_C_OnContainerDropped__DelegateSignature::ToEntryRef' has a wrong offset!");
static_assert(offsetof(MPContainerWidget_v2_C_OnContainerDropped__DelegateSignature, ToSlotRef) == 0x000018, "Member 'MPContainerWidget_v2_C_OnContainerDropped__DelegateSignature::ToSlotRef' has a wrong offset!");

// Function MPContainerWidget_v2.MPContainerWidget_v2_C.OnDrop
// 0x00E0 (0x00E0 - 0x0000)
struct MPContainerWidget_v2_C_OnDrop final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          PointerEvent;                                      // 0x0038(0x0078)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UDragDropOperation*                     Operation;                                         // 0x00B0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x00B8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJigSDragOperation_C*                   K2Node_DynamicCast_AsJig_SDrag_Operation;          // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_LootEntry_C*                       CallFunc_AddItem_EntryRef;                         // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveInventoryItemByRef_Removed;         // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MPContainerWidget_v2_C_OnDrop) == 0x000008, "Wrong alignment on MPContainerWidget_v2_C_OnDrop");
static_assert(sizeof(MPContainerWidget_v2_C_OnDrop) == 0x0000E0, "Wrong size on MPContainerWidget_v2_C_OnDrop");
static_assert(offsetof(MPContainerWidget_v2_C_OnDrop, MyGeometry) == 0x000000, "Member 'MPContainerWidget_v2_C_OnDrop::MyGeometry' has a wrong offset!");
static_assert(offsetof(MPContainerWidget_v2_C_OnDrop, PointerEvent) == 0x000038, "Member 'MPContainerWidget_v2_C_OnDrop::PointerEvent' has a wrong offset!");
static_assert(offsetof(MPContainerWidget_v2_C_OnDrop, Operation) == 0x0000B0, "Member 'MPContainerWidget_v2_C_OnDrop::Operation' has a wrong offset!");
static_assert(offsetof(MPContainerWidget_v2_C_OnDrop, ReturnValue) == 0x0000B8, "Member 'MPContainerWidget_v2_C_OnDrop::ReturnValue' has a wrong offset!");
static_assert(offsetof(MPContainerWidget_v2_C_OnDrop, K2Node_DynamicCast_AsJig_SDrag_Operation) == 0x0000C0, "Member 'MPContainerWidget_v2_C_OnDrop::K2Node_DynamicCast_AsJig_SDrag_Operation' has a wrong offset!");
static_assert(offsetof(MPContainerWidget_v2_C_OnDrop, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'MPContainerWidget_v2_C_OnDrop::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MPContainerWidget_v2_C_OnDrop, CallFunc_AddItem_EntryRef) == 0x0000D0, "Member 'MPContainerWidget_v2_C_OnDrop::CallFunc_AddItem_EntryRef' has a wrong offset!");
static_assert(offsetof(MPContainerWidget_v2_C_OnDrop, CallFunc_RemoveInventoryItemByRef_Removed) == 0x0000D8, "Member 'MPContainerWidget_v2_C_OnDrop::CallFunc_RemoveInventoryItemByRef_Removed' has a wrong offset!");
static_assert(offsetof(MPContainerWidget_v2_C_OnDrop, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x0000D9, "Member 'MPContainerWidget_v2_C_OnDrop::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(MPContainerWidget_v2_C_OnDrop, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000DA, "Member 'MPContainerWidget_v2_C_OnDrop::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(MPContainerWidget_v2_C_OnDrop, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0000DB, "Member 'MPContainerWidget_v2_C_OnDrop::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");

// Function MPContainerWidget_v2.MPContainerWidget_v2_C.OnEntryDragged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct MPContainerWidget_v2_C_OnEntryDragged__DelegateSignature final
{
public:
	class UWBP_LootEntry_C*                       EntryRef;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MPContainerWidget_v2_C_OnEntryDragged__DelegateSignature) == 0x000008, "Wrong alignment on MPContainerWidget_v2_C_OnEntryDragged__DelegateSignature");
static_assert(sizeof(MPContainerWidget_v2_C_OnEntryDragged__DelegateSignature) == 0x000008, "Wrong size on MPContainerWidget_v2_C_OnEntryDragged__DelegateSignature");
static_assert(offsetof(MPContainerWidget_v2_C_OnEntryDragged__DelegateSignature, EntryRef) == 0x000000, "Member 'MPContainerWidget_v2_C_OnEntryDragged__DelegateSignature::EntryRef' has a wrong offset!");

// Function MPContainerWidget_v2.MPContainerWidget_v2_C.RemoveItem
// 0x0258 (0x0258 - 0x0000)
struct MPContainerWidget_v2_C_RemoveItem final
{
public:
	struct FFItemInfo                             ItemInfo;                                          // 0x0000(0x0220)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0220(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0225(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_226[0x2];                                      // 0x0226(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_LootEntry_C*                       CallFunc_Array_Get_Item;                           // 0x0240(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChildAt_ReturnValue;                // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x3];                                      // 0x0249(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetUniqueID_UniqueID;                     // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0254(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0255(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0256(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MPContainerWidget_v2_C_RemoveItem) == 0x000008, "Wrong alignment on MPContainerWidget_v2_C_RemoveItem");
static_assert(sizeof(MPContainerWidget_v2_C_RemoveItem) == 0x000258, "Wrong size on MPContainerWidget_v2_C_RemoveItem");
static_assert(offsetof(MPContainerWidget_v2_C_RemoveItem, ItemInfo) == 0x000000, "Member 'MPContainerWidget_v2_C_RemoveItem::ItemInfo' has a wrong offset!");
static_assert(offsetof(MPContainerWidget_v2_C_RemoveItem, Param_Index) == 0x000220, "Member 'MPContainerWidget_v2_C_RemoveItem::Param_Index' has a wrong offset!");
static_assert(offsetof(MPContainerWidget_v2_C_RemoveItem, Temp_bool_True_if_break_was_hit_Variable) == 0x000224, "Member 'MPContainerWidget_v2_C_RemoveItem::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(MPContainerWidget_v2_C_RemoveItem, CallFunc_Not_PreBool_ReturnValue) == 0x000225, "Member 'MPContainerWidget_v2_C_RemoveItem::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(MPContainerWidget_v2_C_RemoveItem, Temp_int_Array_Index_Variable) == 0x000228, "Member 'MPContainerWidget_v2_C_RemoveItem::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MPContainerWidget_v2_C_RemoveItem, Temp_int_Loop_Counter_Variable) == 0x00022C, "Member 'MPContainerWidget_v2_C_RemoveItem::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MPContainerWidget_v2_C_RemoveItem, CallFunc_Add_IntInt_ReturnValue) == 0x000230, "Member 'MPContainerWidget_v2_C_RemoveItem::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MPContainerWidget_v2_C_RemoveItem, CallFunc_Array_Length_ReturnValue) == 0x000234, "Member 'MPContainerWidget_v2_C_RemoveItem::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MPContainerWidget_v2_C_RemoveItem, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000238, "Member 'MPContainerWidget_v2_C_RemoveItem::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MPContainerWidget_v2_C_RemoveItem, CallFunc_Array_Get_Item) == 0x000240, "Member 'MPContainerWidget_v2_C_RemoveItem::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MPContainerWidget_v2_C_RemoveItem, CallFunc_RemoveChildAt_ReturnValue) == 0x000248, "Member 'MPContainerWidget_v2_C_RemoveItem::CallFunc_RemoveChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MPContainerWidget_v2_C_RemoveItem, CallFunc_GetUniqueID_UniqueID) == 0x00024C, "Member 'MPContainerWidget_v2_C_RemoveItem::CallFunc_GetUniqueID_UniqueID' has a wrong offset!");
static_assert(offsetof(MPContainerWidget_v2_C_RemoveItem, CallFunc_Array_Length_ReturnValue_1) == 0x000250, "Member 'MPContainerWidget_v2_C_RemoveItem::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MPContainerWidget_v2_C_RemoveItem, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000254, "Member 'MPContainerWidget_v2_C_RemoveItem::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MPContainerWidget_v2_C_RemoveItem, CallFunc_Less_IntInt_ReturnValue) == 0x000255, "Member 'MPContainerWidget_v2_C_RemoveItem::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MPContainerWidget_v2_C_RemoveItem, CallFunc_BooleanAND_ReturnValue) == 0x000256, "Member 'MPContainerWidget_v2_C_RemoveItem::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

