#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MPInGameInventory

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "S_PointerHintInfo_structs.hpp"
#include "UMG_structs.hpp"
#include "FMODStudio_structs.hpp"
#include "E_ShopContainer_structs.hpp"
#include "JSItemType_structs.hpp"
#include "ContainerPickupsInfo_structs.hpp"
#include "FItemInfo_structs.hpp"
#include "Engine_structs.hpp"
#include "E_TrainStatType_structs.hpp"
#include "SlateCore_structs.hpp"
#include "S_EffectInfo_structs.hpp"
#include "WS_CharaterPerks_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "InfoType_structs.hpp"


namespace SDK::Params
{

// Function MPInGameInventory.MPInGameInventory_C.Add Child Widget Perks
// 0x01D0 (0x01D0 - 0x0000)
struct MPInGameInventory_C_Add_Child_Widget_Perks final
{
public:
	TArray<class FName>                           DebugPerkArray;                                    // 0x0000(0x0010)(Edit, BlueprintVisible)
	TArray<class FName>                           SelectedPerks;                                     // 0x0010(0x0010)(Edit, BlueprintVisible)
	int32                                         In_Row_Empty__local_;                              // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         In_Row__local_;                                    // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         In_Column_Empty__Local_;                           // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         In_Column__local_;                                 // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0058(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_EffectInfo                          CallFunc_GetDataTableRowFromName_OutRow;           // 0x0078(0x0040)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CharEffects_C*                     CallFunc_Create_ReturnValue;                       // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UWBP_CharEffects_C*                     CallFunc_Create_ReturnValue_1;                     // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_1;                   // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWS_CharaterPerks                      CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0110(0x00B8)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MPInGameInventory_C_Add_Child_Widget_Perks) == 0x000008, "Wrong alignment on MPInGameInventory_C_Add_Child_Widget_Perks");
static_assert(sizeof(MPInGameInventory_C_Add_Child_Widget_Perks) == 0x0001D0, "Wrong size on MPInGameInventory_C_Add_Child_Widget_Perks");
static_assert(offsetof(MPInGameInventory_C_Add_Child_Widget_Perks, DebugPerkArray) == 0x000000, "Member 'MPInGameInventory_C_Add_Child_Widget_Perks::DebugPerkArray' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_Add_Child_Widget_Perks, SelectedPerks) == 0x000010, "Member 'MPInGameInventory_C_Add_Child_Widget_Perks::SelectedPerks' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_Add_Child_Widget_Perks, In_Row_Empty__local_) == 0x000020, "Member 'MPInGameInventory_C_Add_Child_Widget_Perks::In_Row_Empty__local_' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_Add_Child_Widget_Perks, In_Row__local_) == 0x000024, "Member 'MPInGameInventory_C_Add_Child_Widget_Perks::In_Row__local_' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_Add_Child_Widget_Perks, In_Column_Empty__Local_) == 0x000028, "Member 'MPInGameInventory_C_Add_Child_Widget_Perks::In_Column_Empty__Local_' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_Add_Child_Widget_Perks, In_Column__local_) == 0x00002C, "Member 'MPInGameInventory_C_Add_Child_Widget_Perks::In_Column__local_' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_Add_Child_Widget_Perks, K2Node_MakeArray_Array) == 0x000030, "Member 'MPInGameInventory_C_Add_Child_Widget_Perks::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_Add_Child_Widget_Perks, Temp_int_Array_Index_Variable) == 0x000040, "Member 'MPInGameInventory_C_Add_Child_Widget_Perks::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_Add_Child_Widget_Perks, CallFunc_Array_Length_ReturnValue) == 0x000044, "Member 'MPInGameInventory_C_Add_Child_Widget_Perks::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_Add_Child_Widget_Perks, K2Node_MakeStruct_Margin) == 0x000048, "Member 'MPInGameInventory_C_Add_Child_Widget_Perks::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_Add_Child_Widget_Perks, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000058, "Member 'MPInGameInventory_C_Add_Child_Widget_Perks::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_Add_Child_Widget_Perks, Temp_int_Loop_Counter_Variable) == 0x000068, "Member 'MPInGameInventory_C_Add_Child_Widget_Perks::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_Add_Child_Widget_Perks, CallFunc_Array_Get_Item) == 0x00006C, "Member 'MPInGameInventory_C_Add_Child_Widget_Perks::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_Add_Child_Widget_Perks, CallFunc_GetDataTableRowFromName_OutRow) == 0x000078, "Member 'MPInGameInventory_C_Add_Child_Widget_Perks::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_Add_Child_Widget_Perks, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000B8, "Member 'MPInGameInventory_C_Add_Child_Widget_Perks::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_Add_Child_Widget_Perks, CallFunc_Add_IntInt_ReturnValue) == 0x0000BC, "Member 'MPInGameInventory_C_Add_Child_Widget_Perks::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_Add_Child_Widget_Perks, CallFunc_Array_Length_ReturnValue_1) == 0x0000C0, "Member 'MPInGameInventory_C_Add_Child_Widget_Perks::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_Add_Child_Widget_Perks, CallFunc_Less_IntInt_ReturnValue) == 0x0000C4, "Member 'MPInGameInventory_C_Add_Child_Widget_Perks::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_Add_Child_Widget_Perks, CallFunc_Create_ReturnValue) == 0x0000C8, "Member 'MPInGameInventory_C_Add_Child_Widget_Perks::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_Add_Child_Widget_Perks, CallFunc_AddChild_ReturnValue) == 0x0000D0, "Member 'MPInGameInventory_C_Add_Child_Widget_Perks::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_Add_Child_Widget_Perks, K2Node_MakeStruct_Margin_1) == 0x0000D8, "Member 'MPInGameInventory_C_Add_Child_Widget_Perks::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_Add_Child_Widget_Perks, CallFunc_Create_ReturnValue_1) == 0x0000E8, "Member 'MPInGameInventory_C_Add_Child_Widget_Perks::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_Add_Child_Widget_Perks, CallFunc_AddChild_ReturnValue_1) == 0x0000F0, "Member 'MPInGameInventory_C_Add_Child_Widget_Perks::CallFunc_AddChild_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_Add_Child_Widget_Perks, Temp_int_Loop_Counter_Variable_1) == 0x0000F8, "Member 'MPInGameInventory_C_Add_Child_Widget_Perks::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_Add_Child_Widget_Perks, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000FC, "Member 'MPInGameInventory_C_Add_Child_Widget_Perks::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_Add_Child_Widget_Perks, CallFunc_Add_IntInt_ReturnValue_1) == 0x000100, "Member 'MPInGameInventory_C_Add_Child_Widget_Perks::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_Add_Child_Widget_Perks, Temp_int_Array_Index_Variable_1) == 0x000104, "Member 'MPInGameInventory_C_Add_Child_Widget_Perks::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_Add_Child_Widget_Perks, CallFunc_Array_Get_Item_1) == 0x000108, "Member 'MPInGameInventory_C_Add_Child_Widget_Perks::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_Add_Child_Widget_Perks, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000110, "Member 'MPInGameInventory_C_Add_Child_Widget_Perks::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_Add_Child_Widget_Perks, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x0001C8, "Member 'MPInGameInventory_C_Add_Child_Widget_Perks::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");

// Function MPInGameInventory.MPInGameInventory_C.Add Squad Member Entry
// 0x0060 (0x0060 - 0x0000)
struct MPInGameInventory_C_Add_Squad_Member_Entry final
{
public:
	class UWBP_Group_C*                           SquadEntryWidget;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APS_TDB_C*                              PlayerPS;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class APS_TDB_C* PlayerState)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class APS_TDB_C* PlayerState)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class APS_TDB_C* PlayerState)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_Group_C* GroupEntry)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MPInGameInventory_C_Add_Squad_Member_Entry) == 0x000008, "Wrong alignment on MPInGameInventory_C_Add_Squad_Member_Entry");
static_assert(sizeof(MPInGameInventory_C_Add_Squad_Member_Entry) == 0x000060, "Wrong size on MPInGameInventory_C_Add_Squad_Member_Entry");
static_assert(offsetof(MPInGameInventory_C_Add_Squad_Member_Entry, SquadEntryWidget) == 0x000000, "Member 'MPInGameInventory_C_Add_Squad_Member_Entry::SquadEntryWidget' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_Add_Squad_Member_Entry, PlayerPS) == 0x000008, "Member 'MPInGameInventory_C_Add_Squad_Member_Entry::PlayerPS' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_Add_Squad_Member_Entry, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'MPInGameInventory_C_Add_Squad_Member_Entry::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_Add_Squad_Member_Entry, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'MPInGameInventory_C_Add_Squad_Member_Entry::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_Add_Squad_Member_Entry, K2Node_CreateDelegate_OutputDelegate_2) == 0x000030, "Member 'MPInGameInventory_C_Add_Squad_Member_Entry::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_Add_Squad_Member_Entry, K2Node_CreateDelegate_OutputDelegate_3) == 0x000040, "Member 'MPInGameInventory_C_Add_Squad_Member_Entry::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_Add_Squad_Member_Entry, K2Node_CreateDelegate_OutputDelegate_4) == 0x000050, "Member 'MPInGameInventory_C_Add_Squad_Member_Entry::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");

// Function MPInGameInventory.MPInGameInventory_C.AddEffect
// 0x0018 (0x0018 - 0x0000)
struct MPInGameInventory_C_AddEffect final
{
public:
	class UEffectMain_C*                          Effect;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      SurvPlayer;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UW_EffectsPanelElement_C*               Widget;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MPInGameInventory_C_AddEffect) == 0x000008, "Wrong alignment on MPInGameInventory_C_AddEffect");
static_assert(sizeof(MPInGameInventory_C_AddEffect) == 0x000018, "Wrong size on MPInGameInventory_C_AddEffect");
static_assert(offsetof(MPInGameInventory_C_AddEffect, Effect) == 0x000000, "Member 'MPInGameInventory_C_AddEffect::Effect' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_AddEffect, SurvPlayer) == 0x000008, "Member 'MPInGameInventory_C_AddEffect::SurvPlayer' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_AddEffect, Widget) == 0x000010, "Member 'MPInGameInventory_C_AddEffect::Widget' has a wrong offset!");

// Function MPInGameInventory.MPInGameInventory_C.BindLootPoint
// 0x0050 (0x0050 - 0x0000)
struct MPInGameInventory_C_BindLootPoint final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UJSI_Slot_C* Item, class UJSIContainer_C* Container)> K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMPContainerWidget_C*                   K2Node_DynamicCast_AsMPContainer_Widget;           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MPInGameInventory_C_BindLootPoint) == 0x000008, "Wrong alignment on MPInGameInventory_C_BindLootPoint");
static_assert(sizeof(MPInGameInventory_C_BindLootPoint) == 0x000050, "Wrong size on MPInGameInventory_C_BindLootPoint");
static_assert(offsetof(MPInGameInventory_C_BindLootPoint, Temp_int_Array_Index_Variable) == 0x000000, "Member 'MPInGameInventory_C_BindLootPoint::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_BindLootPoint, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'MPInGameInventory_C_BindLootPoint::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_BindLootPoint, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'MPInGameInventory_C_BindLootPoint::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_BindLootPoint, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'MPInGameInventory_C_BindLootPoint::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_BindLootPoint, CallFunc_GetAllChildren_ReturnValue) == 0x000020, "Member 'MPInGameInventory_C_BindLootPoint::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_BindLootPoint, CallFunc_Array_Get_Item) == 0x000030, "Member 'MPInGameInventory_C_BindLootPoint::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_BindLootPoint, K2Node_DynamicCast_AsMPContainer_Widget) == 0x000038, "Member 'MPInGameInventory_C_BindLootPoint::K2Node_DynamicCast_AsMPContainer_Widget' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_BindLootPoint, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'MPInGameInventory_C_BindLootPoint::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_BindLootPoint, CallFunc_Array_Length_ReturnValue) == 0x000044, "Member 'MPInGameInventory_C_BindLootPoint::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_BindLootPoint, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'MPInGameInventory_C_BindLootPoint::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function MPInGameInventory.MPInGameInventory_C.BindMainContatiner
// 0x0048 (0x0048 - 0x0000)
struct MPInGameInventory_C_BindMainContatiner final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UJSIContainer_C* Container, class UJSI_Slot_C* SlotRef, const struct FKey& Button)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJSIContainer_C*                        K2Node_DynamicCast_AsJSIContainer;                 // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MPInGameInventory_C_BindMainContatiner) == 0x000008, "Wrong alignment on MPInGameInventory_C_BindMainContatiner");
static_assert(sizeof(MPInGameInventory_C_BindMainContatiner) == 0x000048, "Wrong size on MPInGameInventory_C_BindMainContatiner");
static_assert(offsetof(MPInGameInventory_C_BindMainContatiner, Temp_int_Array_Index_Variable) == 0x000000, "Member 'MPInGameInventory_C_BindMainContatiner::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_BindMainContatiner, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'MPInGameInventory_C_BindMainContatiner::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_BindMainContatiner, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'MPInGameInventory_C_BindMainContatiner::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_BindMainContatiner, CallFunc_GetAllChildren_ReturnValue) == 0x000018, "Member 'MPInGameInventory_C_BindMainContatiner::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_BindMainContatiner, CallFunc_Array_Get_Item) == 0x000028, "Member 'MPInGameInventory_C_BindMainContatiner::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_BindMainContatiner, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'MPInGameInventory_C_BindMainContatiner::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_BindMainContatiner, K2Node_DynamicCast_AsJSIContainer) == 0x000038, "Member 'MPInGameInventory_C_BindMainContatiner::K2Node_DynamicCast_AsJSIContainer' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_BindMainContatiner, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'MPInGameInventory_C_BindMainContatiner::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_BindMainContatiner, CallFunc_Less_IntInt_ReturnValue) == 0x000041, "Member 'MPInGameInventory_C_BindMainContatiner::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_BindMainContatiner, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'MPInGameInventory_C_BindMainContatiner::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function MPInGameInventory.MPInGameInventory_C.BndEvt__MPInGameInventory_ArmorContainer_K2Node_ComponentBoundEvent_17_EventSelectItem__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct MPInGameInventory_C_BndEvt__MPInGameInventory_ArmorContainer_K2Node_ComponentBoundEvent_17_EventSelectItem__DelegateSignature final
{
public:
	class UJSI_Slot_C*                            Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJSIContainer_C*                        Container;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MPInGameInventory_C_BndEvt__MPInGameInventory_ArmorContainer_K2Node_ComponentBoundEvent_17_EventSelectItem__DelegateSignature) == 0x000008, "Wrong alignment on MPInGameInventory_C_BndEvt__MPInGameInventory_ArmorContainer_K2Node_ComponentBoundEvent_17_EventSelectItem__DelegateSignature");
static_assert(sizeof(MPInGameInventory_C_BndEvt__MPInGameInventory_ArmorContainer_K2Node_ComponentBoundEvent_17_EventSelectItem__DelegateSignature) == 0x000010, "Wrong size on MPInGameInventory_C_BndEvt__MPInGameInventory_ArmorContainer_K2Node_ComponentBoundEvent_17_EventSelectItem__DelegateSignature");
static_assert(offsetof(MPInGameInventory_C_BndEvt__MPInGameInventory_ArmorContainer_K2Node_ComponentBoundEvent_17_EventSelectItem__DelegateSignature, Item) == 0x000000, "Member 'MPInGameInventory_C_BndEvt__MPInGameInventory_ArmorContainer_K2Node_ComponentBoundEvent_17_EventSelectItem__DelegateSignature::Item' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_BndEvt__MPInGameInventory_ArmorContainer_K2Node_ComponentBoundEvent_17_EventSelectItem__DelegateSignature, Container) == 0x000008, "Member 'MPInGameInventory_C_BndEvt__MPInGameInventory_ArmorContainer_K2Node_ComponentBoundEvent_17_EventSelectItem__DelegateSignature::Container' has a wrong offset!");

// Function MPInGameInventory.MPInGameInventory_C.BndEvt__MPInGameInventory_ArmorContainer_K2Node_ComponentBoundEvent_41_OnSlotMouseButtonDown__DelegateSignature
// 0x0028 (0x0028 - 0x0000)
struct MPInGameInventory_C_BndEvt__MPInGameInventory_ArmorContainer_K2Node_ComponentBoundEvent_41_OnSlotMouseButtonDown__DelegateSignature final
{
public:
	class UJSIContainer_C*                        Container;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJSI_Slot_C*                            SlotRef;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   Button;                                            // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(MPInGameInventory_C_BndEvt__MPInGameInventory_ArmorContainer_K2Node_ComponentBoundEvent_41_OnSlotMouseButtonDown__DelegateSignature) == 0x000008, "Wrong alignment on MPInGameInventory_C_BndEvt__MPInGameInventory_ArmorContainer_K2Node_ComponentBoundEvent_41_OnSlotMouseButtonDown__DelegateSignature");
static_assert(sizeof(MPInGameInventory_C_BndEvt__MPInGameInventory_ArmorContainer_K2Node_ComponentBoundEvent_41_OnSlotMouseButtonDown__DelegateSignature) == 0x000028, "Wrong size on MPInGameInventory_C_BndEvt__MPInGameInventory_ArmorContainer_K2Node_ComponentBoundEvent_41_OnSlotMouseButtonDown__DelegateSignature");
static_assert(offsetof(MPInGameInventory_C_BndEvt__MPInGameInventory_ArmorContainer_K2Node_ComponentBoundEvent_41_OnSlotMouseButtonDown__DelegateSignature, Container) == 0x000000, "Member 'MPInGameInventory_C_BndEvt__MPInGameInventory_ArmorContainer_K2Node_ComponentBoundEvent_41_OnSlotMouseButtonDown__DelegateSignature::Container' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_BndEvt__MPInGameInventory_ArmorContainer_K2Node_ComponentBoundEvent_41_OnSlotMouseButtonDown__DelegateSignature, SlotRef) == 0x000008, "Member 'MPInGameInventory_C_BndEvt__MPInGameInventory_ArmorContainer_K2Node_ComponentBoundEvent_41_OnSlotMouseButtonDown__DelegateSignature::SlotRef' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_BndEvt__MPInGameInventory_ArmorContainer_K2Node_ComponentBoundEvent_41_OnSlotMouseButtonDown__DelegateSignature, Button) == 0x000010, "Member 'MPInGameInventory_C_BndEvt__MPInGameInventory_ArmorContainer_K2Node_ComponentBoundEvent_41_OnSlotMouseButtonDown__DelegateSignature::Button' has a wrong offset!");

// Function MPInGameInventory.MPInGameInventory_C.BndEvt__MPInGameInventory_ArmorContainer_K2Node_ComponentBoundEvent_7_DropInfo_OnItemEquippedChange__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct MPInGameInventory_C_BndEvt__MPInGameInventory_ArmorContainer_K2Node_ComponentBoundEvent_7_DropInfo_OnItemEquippedChange__DelegateSignature final
{
public:
	class UJSIContainer_C*                        FromContainer;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJSIContainer_C*                        ToContainer;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJSI_Slot_C*                            SlotRef;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Equipped_;                                         // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ToPockets_;                                        // 0x0019(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MPInGameInventory_C_BndEvt__MPInGameInventory_ArmorContainer_K2Node_ComponentBoundEvent_7_DropInfo_OnItemEquippedChange__DelegateSignature) == 0x000008, "Wrong alignment on MPInGameInventory_C_BndEvt__MPInGameInventory_ArmorContainer_K2Node_ComponentBoundEvent_7_DropInfo_OnItemEquippedChange__DelegateSignature");
static_assert(sizeof(MPInGameInventory_C_BndEvt__MPInGameInventory_ArmorContainer_K2Node_ComponentBoundEvent_7_DropInfo_OnItemEquippedChange__DelegateSignature) == 0x000020, "Wrong size on MPInGameInventory_C_BndEvt__MPInGameInventory_ArmorContainer_K2Node_ComponentBoundEvent_7_DropInfo_OnItemEquippedChange__DelegateSignature");
static_assert(offsetof(MPInGameInventory_C_BndEvt__MPInGameInventory_ArmorContainer_K2Node_ComponentBoundEvent_7_DropInfo_OnItemEquippedChange__DelegateSignature, FromContainer) == 0x000000, "Member 'MPInGameInventory_C_BndEvt__MPInGameInventory_ArmorContainer_K2Node_ComponentBoundEvent_7_DropInfo_OnItemEquippedChange__DelegateSignature::FromContainer' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_BndEvt__MPInGameInventory_ArmorContainer_K2Node_ComponentBoundEvent_7_DropInfo_OnItemEquippedChange__DelegateSignature, ToContainer) == 0x000008, "Member 'MPInGameInventory_C_BndEvt__MPInGameInventory_ArmorContainer_K2Node_ComponentBoundEvent_7_DropInfo_OnItemEquippedChange__DelegateSignature::ToContainer' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_BndEvt__MPInGameInventory_ArmorContainer_K2Node_ComponentBoundEvent_7_DropInfo_OnItemEquippedChange__DelegateSignature, SlotRef) == 0x000010, "Member 'MPInGameInventory_C_BndEvt__MPInGameInventory_ArmorContainer_K2Node_ComponentBoundEvent_7_DropInfo_OnItemEquippedChange__DelegateSignature::SlotRef' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_BndEvt__MPInGameInventory_ArmorContainer_K2Node_ComponentBoundEvent_7_DropInfo_OnItemEquippedChange__DelegateSignature, Equipped_) == 0x000018, "Member 'MPInGameInventory_C_BndEvt__MPInGameInventory_ArmorContainer_K2Node_ComponentBoundEvent_7_DropInfo_OnItemEquippedChange__DelegateSignature::Equipped_' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_BndEvt__MPInGameInventory_ArmorContainer_K2Node_ComponentBoundEvent_7_DropInfo_OnItemEquippedChange__DelegateSignature, ToPockets_) == 0x000019, "Member 'MPInGameInventory_C_BndEvt__MPInGameInventory_ArmorContainer_K2Node_ComponentBoundEvent_7_DropInfo_OnItemEquippedChange__DelegateSignature::ToPockets_' has a wrong offset!");

// Function MPInGameInventory.MPInGameInventory_C.BndEvt__MPInGameInventory_BackPackSlotContainer_K2Node_ComponentBoundEvent_12_DropInfo_OnItemEquippedChange__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct MPInGameInventory_C_BndEvt__MPInGameInventory_BackPackSlotContainer_K2Node_ComponentBoundEvent_12_DropInfo_OnItemEquippedChange__DelegateSignature final
{
public:
	class UJSIContainer_C*                        FromContainer;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJSIContainer_C*                        ToContainer;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJSI_Slot_C*                            SlotRef;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Equipped_;                                         // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ToPockets_;                                        // 0x0019(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MPInGameInventory_C_BndEvt__MPInGameInventory_BackPackSlotContainer_K2Node_ComponentBoundEvent_12_DropInfo_OnItemEquippedChange__DelegateSignature) == 0x000008, "Wrong alignment on MPInGameInventory_C_BndEvt__MPInGameInventory_BackPackSlotContainer_K2Node_ComponentBoundEvent_12_DropInfo_OnItemEquippedChange__DelegateSignature");
static_assert(sizeof(MPInGameInventory_C_BndEvt__MPInGameInventory_BackPackSlotContainer_K2Node_ComponentBoundEvent_12_DropInfo_OnItemEquippedChange__DelegateSignature) == 0x000020, "Wrong size on MPInGameInventory_C_BndEvt__MPInGameInventory_BackPackSlotContainer_K2Node_ComponentBoundEvent_12_DropInfo_OnItemEquippedChange__DelegateSignature");
static_assert(offsetof(MPInGameInventory_C_BndEvt__MPInGameInventory_BackPackSlotContainer_K2Node_ComponentBoundEvent_12_DropInfo_OnItemEquippedChange__DelegateSignature, FromContainer) == 0x000000, "Member 'MPInGameInventory_C_BndEvt__MPInGameInventory_BackPackSlotContainer_K2Node_ComponentBoundEvent_12_DropInfo_OnItemEquippedChange__DelegateSignature::FromContainer' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_BndEvt__MPInGameInventory_BackPackSlotContainer_K2Node_ComponentBoundEvent_12_DropInfo_OnItemEquippedChange__DelegateSignature, ToContainer) == 0x000008, "Member 'MPInGameInventory_C_BndEvt__MPInGameInventory_BackPackSlotContainer_K2Node_ComponentBoundEvent_12_DropInfo_OnItemEquippedChange__DelegateSignature::ToContainer' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_BndEvt__MPInGameInventory_BackPackSlotContainer_K2Node_ComponentBoundEvent_12_DropInfo_OnItemEquippedChange__DelegateSignature, SlotRef) == 0x000010, "Member 'MPInGameInventory_C_BndEvt__MPInGameInventory_BackPackSlotContainer_K2Node_ComponentBoundEvent_12_DropInfo_OnItemEquippedChange__DelegateSignature::SlotRef' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_BndEvt__MPInGameInventory_BackPackSlotContainer_K2Node_ComponentBoundEvent_12_DropInfo_OnItemEquippedChange__DelegateSignature, Equipped_) == 0x000018, "Member 'MPInGameInventory_C_BndEvt__MPInGameInventory_BackPackSlotContainer_K2Node_ComponentBoundEvent_12_DropInfo_OnItemEquippedChange__DelegateSignature::Equipped_' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_BndEvt__MPInGameInventory_BackPackSlotContainer_K2Node_ComponentBoundEvent_12_DropInfo_OnItemEquippedChange__DelegateSignature, ToPockets_) == 0x000019, "Member 'MPInGameInventory_C_BndEvt__MPInGameInventory_BackPackSlotContainer_K2Node_ComponentBoundEvent_12_DropInfo_OnItemEquippedChange__DelegateSignature::ToPockets_' has a wrong offset!");

// Function MPInGameInventory.MPInGameInventory_C.BndEvt__MPInGameInventory_BackPackSlotContainer_K2Node_ComponentBoundEvent_18_EventSelectItem__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct MPInGameInventory_C_BndEvt__MPInGameInventory_BackPackSlotContainer_K2Node_ComponentBoundEvent_18_EventSelectItem__DelegateSignature final
{
public:
	class UJSI_Slot_C*                            Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJSIContainer_C*                        Container;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MPInGameInventory_C_BndEvt__MPInGameInventory_BackPackSlotContainer_K2Node_ComponentBoundEvent_18_EventSelectItem__DelegateSignature) == 0x000008, "Wrong alignment on MPInGameInventory_C_BndEvt__MPInGameInventory_BackPackSlotContainer_K2Node_ComponentBoundEvent_18_EventSelectItem__DelegateSignature");
static_assert(sizeof(MPInGameInventory_C_BndEvt__MPInGameInventory_BackPackSlotContainer_K2Node_ComponentBoundEvent_18_EventSelectItem__DelegateSignature) == 0x000010, "Wrong size on MPInGameInventory_C_BndEvt__MPInGameInventory_BackPackSlotContainer_K2Node_ComponentBoundEvent_18_EventSelectItem__DelegateSignature");
static_assert(offsetof(MPInGameInventory_C_BndEvt__MPInGameInventory_BackPackSlotContainer_K2Node_ComponentBoundEvent_18_EventSelectItem__DelegateSignature, Item) == 0x000000, "Member 'MPInGameInventory_C_BndEvt__MPInGameInventory_BackPackSlotContainer_K2Node_ComponentBoundEvent_18_EventSelectItem__DelegateSignature::Item' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_BndEvt__MPInGameInventory_BackPackSlotContainer_K2Node_ComponentBoundEvent_18_EventSelectItem__DelegateSignature, Container) == 0x000008, "Member 'MPInGameInventory_C_BndEvt__MPInGameInventory_BackPackSlotContainer_K2Node_ComponentBoundEvent_18_EventSelectItem__DelegateSignature::Container' has a wrong offset!");

// Function MPInGameInventory.MPInGameInventory_C.BndEvt__MPInGameInventory_BackPackSlotContainer_K2Node_ComponentBoundEvent_42_OnSlotMouseButtonDown__DelegateSignature
// 0x0028 (0x0028 - 0x0000)
struct MPInGameInventory_C_BndEvt__MPInGameInventory_BackPackSlotContainer_K2Node_ComponentBoundEvent_42_OnSlotMouseButtonDown__DelegateSignature final
{
public:
	class UJSIContainer_C*                        Container;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJSI_Slot_C*                            SlotRef;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   Button;                                            // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(MPInGameInventory_C_BndEvt__MPInGameInventory_BackPackSlotContainer_K2Node_ComponentBoundEvent_42_OnSlotMouseButtonDown__DelegateSignature) == 0x000008, "Wrong alignment on MPInGameInventory_C_BndEvt__MPInGameInventory_BackPackSlotContainer_K2Node_ComponentBoundEvent_42_OnSlotMouseButtonDown__DelegateSignature");
static_assert(sizeof(MPInGameInventory_C_BndEvt__MPInGameInventory_BackPackSlotContainer_K2Node_ComponentBoundEvent_42_OnSlotMouseButtonDown__DelegateSignature) == 0x000028, "Wrong size on MPInGameInventory_C_BndEvt__MPInGameInventory_BackPackSlotContainer_K2Node_ComponentBoundEvent_42_OnSlotMouseButtonDown__DelegateSignature");
static_assert(offsetof(MPInGameInventory_C_BndEvt__MPInGameInventory_BackPackSlotContainer_K2Node_ComponentBoundEvent_42_OnSlotMouseButtonDown__DelegateSignature, Container) == 0x000000, "Member 'MPInGameInventory_C_BndEvt__MPInGameInventory_BackPackSlotContainer_K2Node_ComponentBoundEvent_42_OnSlotMouseButtonDown__DelegateSignature::Container' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_BndEvt__MPInGameInventory_BackPackSlotContainer_K2Node_ComponentBoundEvent_42_OnSlotMouseButtonDown__DelegateSignature, SlotRef) == 0x000008, "Member 'MPInGameInventory_C_BndEvt__MPInGameInventory_BackPackSlotContainer_K2Node_ComponentBoundEvent_42_OnSlotMouseButtonDown__DelegateSignature::SlotRef' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_BndEvt__MPInGameInventory_BackPackSlotContainer_K2Node_ComponentBoundEvent_42_OnSlotMouseButtonDown__DelegateSignature, Button) == 0x000010, "Member 'MPInGameInventory_C_BndEvt__MPInGameInventory_BackPackSlotContainer_K2Node_ComponentBoundEvent_42_OnSlotMouseButtonDown__DelegateSignature::Button' has a wrong offset!");

// Function MPInGameInventory.MPInGameInventory_C.BndEvt__MPInGameInventory_DropItemBackGwidget_K2Node_ComponentBoundEvent_13_ItemDropRequest__DelegateSignature
// 0x0238 (0x0238 - 0x0000)
struct MPInGameInventory_C_BndEvt__MPInGameInventory_DropItemBackGwidget_K2Node_ComponentBoundEvent_13_ItemDropRequest__DelegateSignature final
{
public:
	class UJSI_Slot_C*                            ItemRef;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFItemInfo                             ItemInfo;                                          // 0x0008(0x0220)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x0228(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJSIContainer_C*                        Container;                                         // 0x0230(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MPInGameInventory_C_BndEvt__MPInGameInventory_DropItemBackGwidget_K2Node_ComponentBoundEvent_13_ItemDropRequest__DelegateSignature) == 0x000008, "Wrong alignment on MPInGameInventory_C_BndEvt__MPInGameInventory_DropItemBackGwidget_K2Node_ComponentBoundEvent_13_ItemDropRequest__DelegateSignature");
static_assert(sizeof(MPInGameInventory_C_BndEvt__MPInGameInventory_DropItemBackGwidget_K2Node_ComponentBoundEvent_13_ItemDropRequest__DelegateSignature) == 0x000238, "Wrong size on MPInGameInventory_C_BndEvt__MPInGameInventory_DropItemBackGwidget_K2Node_ComponentBoundEvent_13_ItemDropRequest__DelegateSignature");
static_assert(offsetof(MPInGameInventory_C_BndEvt__MPInGameInventory_DropItemBackGwidget_K2Node_ComponentBoundEvent_13_ItemDropRequest__DelegateSignature, ItemRef) == 0x000000, "Member 'MPInGameInventory_C_BndEvt__MPInGameInventory_DropItemBackGwidget_K2Node_ComponentBoundEvent_13_ItemDropRequest__DelegateSignature::ItemRef' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_BndEvt__MPInGameInventory_DropItemBackGwidget_K2Node_ComponentBoundEvent_13_ItemDropRequest__DelegateSignature, ItemInfo) == 0x000008, "Member 'MPInGameInventory_C_BndEvt__MPInGameInventory_DropItemBackGwidget_K2Node_ComponentBoundEvent_13_ItemDropRequest__DelegateSignature::ItemInfo' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_BndEvt__MPInGameInventory_DropItemBackGwidget_K2Node_ComponentBoundEvent_13_ItemDropRequest__DelegateSignature, Count) == 0x000228, "Member 'MPInGameInventory_C_BndEvt__MPInGameInventory_DropItemBackGwidget_K2Node_ComponentBoundEvent_13_ItemDropRequest__DelegateSignature::Count' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_BndEvt__MPInGameInventory_DropItemBackGwidget_K2Node_ComponentBoundEvent_13_ItemDropRequest__DelegateSignature, Container) == 0x000230, "Member 'MPInGameInventory_C_BndEvt__MPInGameInventory_DropItemBackGwidget_K2Node_ComponentBoundEvent_13_ItemDropRequest__DelegateSignature::Container' has a wrong offset!");

// Function MPInGameInventory.MPInGameInventory_C.BndEvt__MPInGameInventory_DropItemBackGwidget_K2Node_ComponentBoundEvent_36_OnDropDeniedInTutorial__DelegateSignature
// 0x0002 (0x0002 - 0x0000)
struct MPInGameInventory_C_BndEvt__MPInGameInventory_DropItemBackGwidget_K2Node_ComponentBoundEvent_36_OnDropDeniedInTutorial__DelegateSignature final
{
public:
	bool                                          TutorReason;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsProtectiveCase;                                  // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MPInGameInventory_C_BndEvt__MPInGameInventory_DropItemBackGwidget_K2Node_ComponentBoundEvent_36_OnDropDeniedInTutorial__DelegateSignature) == 0x000001, "Wrong alignment on MPInGameInventory_C_BndEvt__MPInGameInventory_DropItemBackGwidget_K2Node_ComponentBoundEvent_36_OnDropDeniedInTutorial__DelegateSignature");
static_assert(sizeof(MPInGameInventory_C_BndEvt__MPInGameInventory_DropItemBackGwidget_K2Node_ComponentBoundEvent_36_OnDropDeniedInTutorial__DelegateSignature) == 0x000002, "Wrong size on MPInGameInventory_C_BndEvt__MPInGameInventory_DropItemBackGwidget_K2Node_ComponentBoundEvent_36_OnDropDeniedInTutorial__DelegateSignature");
static_assert(offsetof(MPInGameInventory_C_BndEvt__MPInGameInventory_DropItemBackGwidget_K2Node_ComponentBoundEvent_36_OnDropDeniedInTutorial__DelegateSignature, TutorReason) == 0x000000, "Member 'MPInGameInventory_C_BndEvt__MPInGameInventory_DropItemBackGwidget_K2Node_ComponentBoundEvent_36_OnDropDeniedInTutorial__DelegateSignature::TutorReason' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_BndEvt__MPInGameInventory_DropItemBackGwidget_K2Node_ComponentBoundEvent_36_OnDropDeniedInTutorial__DelegateSignature, IsProtectiveCase) == 0x000001, "Member 'MPInGameInventory_C_BndEvt__MPInGameInventory_DropItemBackGwidget_K2Node_ComponentBoundEvent_36_OnDropDeniedInTutorial__DelegateSignature::IsProtectiveCase' has a wrong offset!");

// Function MPInGameInventory.MPInGameInventory_C.BndEvt__MPInGameInventory_GlassesContainer_K2Node_ComponentBoundEvent_16_EventSelectItem__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct MPInGameInventory_C_BndEvt__MPInGameInventory_GlassesContainer_K2Node_ComponentBoundEvent_16_EventSelectItem__DelegateSignature final
{
public:
	class UJSI_Slot_C*                            Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJSIContainer_C*                        Container;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MPInGameInventory_C_BndEvt__MPInGameInventory_GlassesContainer_K2Node_ComponentBoundEvent_16_EventSelectItem__DelegateSignature) == 0x000008, "Wrong alignment on MPInGameInventory_C_BndEvt__MPInGameInventory_GlassesContainer_K2Node_ComponentBoundEvent_16_EventSelectItem__DelegateSignature");
static_assert(sizeof(MPInGameInventory_C_BndEvt__MPInGameInventory_GlassesContainer_K2Node_ComponentBoundEvent_16_EventSelectItem__DelegateSignature) == 0x000010, "Wrong size on MPInGameInventory_C_BndEvt__MPInGameInventory_GlassesContainer_K2Node_ComponentBoundEvent_16_EventSelectItem__DelegateSignature");
static_assert(offsetof(MPInGameInventory_C_BndEvt__MPInGameInventory_GlassesContainer_K2Node_ComponentBoundEvent_16_EventSelectItem__DelegateSignature, Item) == 0x000000, "Member 'MPInGameInventory_C_BndEvt__MPInGameInventory_GlassesContainer_K2Node_ComponentBoundEvent_16_EventSelectItem__DelegateSignature::Item' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_BndEvt__MPInGameInventory_GlassesContainer_K2Node_ComponentBoundEvent_16_EventSelectItem__DelegateSignature, Container) == 0x000008, "Member 'MPInGameInventory_C_BndEvt__MPInGameInventory_GlassesContainer_K2Node_ComponentBoundEvent_16_EventSelectItem__DelegateSignature::Container' has a wrong offset!");

// Function MPInGameInventory.MPInGameInventory_C.BndEvt__MPInGameInventory_GlassesContainer_K2Node_ComponentBoundEvent_43_OnSlotMouseButtonDown__DelegateSignature
// 0x0028 (0x0028 - 0x0000)
struct MPInGameInventory_C_BndEvt__MPInGameInventory_GlassesContainer_K2Node_ComponentBoundEvent_43_OnSlotMouseButtonDown__DelegateSignature final
{
public:
	class UJSIContainer_C*                        Container;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJSI_Slot_C*                            SlotRef;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   Button;                                            // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(MPInGameInventory_C_BndEvt__MPInGameInventory_GlassesContainer_K2Node_ComponentBoundEvent_43_OnSlotMouseButtonDown__DelegateSignature) == 0x000008, "Wrong alignment on MPInGameInventory_C_BndEvt__MPInGameInventory_GlassesContainer_K2Node_ComponentBoundEvent_43_OnSlotMouseButtonDown__DelegateSignature");
static_assert(sizeof(MPInGameInventory_C_BndEvt__MPInGameInventory_GlassesContainer_K2Node_ComponentBoundEvent_43_OnSlotMouseButtonDown__DelegateSignature) == 0x000028, "Wrong size on MPInGameInventory_C_BndEvt__MPInGameInventory_GlassesContainer_K2Node_ComponentBoundEvent_43_OnSlotMouseButtonDown__DelegateSignature");
static_assert(offsetof(MPInGameInventory_C_BndEvt__MPInGameInventory_GlassesContainer_K2Node_ComponentBoundEvent_43_OnSlotMouseButtonDown__DelegateSignature, Container) == 0x000000, "Member 'MPInGameInventory_C_BndEvt__MPInGameInventory_GlassesContainer_K2Node_ComponentBoundEvent_43_OnSlotMouseButtonDown__DelegateSignature::Container' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_BndEvt__MPInGameInventory_GlassesContainer_K2Node_ComponentBoundEvent_43_OnSlotMouseButtonDown__DelegateSignature, SlotRef) == 0x000008, "Member 'MPInGameInventory_C_BndEvt__MPInGameInventory_GlassesContainer_K2Node_ComponentBoundEvent_43_OnSlotMouseButtonDown__DelegateSignature::SlotRef' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_BndEvt__MPInGameInventory_GlassesContainer_K2Node_ComponentBoundEvent_43_OnSlotMouseButtonDown__DelegateSignature, Button) == 0x000010, "Member 'MPInGameInventory_C_BndEvt__MPInGameInventory_GlassesContainer_K2Node_ComponentBoundEvent_43_OnSlotMouseButtonDown__DelegateSignature::Button' has a wrong offset!");

// Function MPInGameInventory.MPInGameInventory_C.BndEvt__MPInGameInventory_GlassesContainer_K2Node_ComponentBoundEvent_5_DropInfo_OnItemEquippedChange__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct MPInGameInventory_C_BndEvt__MPInGameInventory_GlassesContainer_K2Node_ComponentBoundEvent_5_DropInfo_OnItemEquippedChange__DelegateSignature final
{
public:
	class UJSIContainer_C*                        FromContainer;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJSIContainer_C*                        ToContainer;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJSI_Slot_C*                            SlotRef;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Equipped_;                                         // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ToPockets_;                                        // 0x0019(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MPInGameInventory_C_BndEvt__MPInGameInventory_GlassesContainer_K2Node_ComponentBoundEvent_5_DropInfo_OnItemEquippedChange__DelegateSignature) == 0x000008, "Wrong alignment on MPInGameInventory_C_BndEvt__MPInGameInventory_GlassesContainer_K2Node_ComponentBoundEvent_5_DropInfo_OnItemEquippedChange__DelegateSignature");
static_assert(sizeof(MPInGameInventory_C_BndEvt__MPInGameInventory_GlassesContainer_K2Node_ComponentBoundEvent_5_DropInfo_OnItemEquippedChange__DelegateSignature) == 0x000020, "Wrong size on MPInGameInventory_C_BndEvt__MPInGameInventory_GlassesContainer_K2Node_ComponentBoundEvent_5_DropInfo_OnItemEquippedChange__DelegateSignature");
static_assert(offsetof(MPInGameInventory_C_BndEvt__MPInGameInventory_GlassesContainer_K2Node_ComponentBoundEvent_5_DropInfo_OnItemEquippedChange__DelegateSignature, FromContainer) == 0x000000, "Member 'MPInGameInventory_C_BndEvt__MPInGameInventory_GlassesContainer_K2Node_ComponentBoundEvent_5_DropInfo_OnItemEquippedChange__DelegateSignature::FromContainer' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_BndEvt__MPInGameInventory_GlassesContainer_K2Node_ComponentBoundEvent_5_DropInfo_OnItemEquippedChange__DelegateSignature, ToContainer) == 0x000008, "Member 'MPInGameInventory_C_BndEvt__MPInGameInventory_GlassesContainer_K2Node_ComponentBoundEvent_5_DropInfo_OnItemEquippedChange__DelegateSignature::ToContainer' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_BndEvt__MPInGameInventory_GlassesContainer_K2Node_ComponentBoundEvent_5_DropInfo_OnItemEquippedChange__DelegateSignature, SlotRef) == 0x000010, "Member 'MPInGameInventory_C_BndEvt__MPInGameInventory_GlassesContainer_K2Node_ComponentBoundEvent_5_DropInfo_OnItemEquippedChange__DelegateSignature::SlotRef' has a wrong offset!");
static_assert(offsetof(MPInGameInventory_C_BndEvt__MPInGameInventory_GlassesContainer_K2Node_ComponentBoundEvent_5_DropInfo_OnItemEquippedChange__DelegateSignature, Equipped_) == 0x000018, "Member 'MPInGameInventory_C_BndEvt__MPInGameInventory_GlassesContainer_K2Node_ComponentBoundEvent_5_DropInfo_OnItemEquippedChange__DelegateSignature::Equipped_' has a wrong offset!");
