#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MPMainContainerBox

#include "Basic.hpp"

#include "E_InteractType_structs.hpp"
#include "E_ActorType_structs.hpp"
#include "ContainerPickupsInfo_structs.hpp"
#include "MpContentRep_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "DefaultItemInfo_structs.hpp"
#include "FItemInfo_structs.hpp"
#include "PickupAttachments_structs.hpp"
#include "ELootTypes_structs.hpp"
#include "LootPointType_structs.hpp"
#include "Engine_structs.hpp"
#include "SlotRarity_structs.hpp"
#include "S_LootChanceModifier_structs.hpp"
#include "LG2_LootRareType_structs.hpp"
#include "ItemIdGenerateChance_structs.hpp"
#include "LootGeneratorType_structs.hpp"
#include "GeneralChanceByType_structs.hpp"
#include "CountChance_structs.hpp"
#include "ServerSlotInfo_structs.hpp"
#include "ServerSlotInfoArray_structs.hpp"


namespace SDK::Params
{

// Function MPMainContainerBox.MPMainContainerBox_C.AddContainersToDictionary
// 0x0038 (0x0038 - 0x0000)
struct MPMainContainerBox_C_AddContainersToDictionary final
{
public:
	TArray<class UJSIContainer_C*>                Containers;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJSIContainer_C*                        CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSlotMotherUID_UDID;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MPMainContainerBox_C_AddContainersToDictionary) == 0x000008, "Wrong alignment on MPMainContainerBox_C_AddContainersToDictionary");
static_assert(sizeof(MPMainContainerBox_C_AddContainersToDictionary) == 0x000038, "Wrong size on MPMainContainerBox_C_AddContainersToDictionary");
static_assert(offsetof(MPMainContainerBox_C_AddContainersToDictionary, Containers) == 0x000000, "Member 'MPMainContainerBox_C_AddContainersToDictionary::Containers' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddContainersToDictionary, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'MPMainContainerBox_C_AddContainersToDictionary::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddContainersToDictionary, Temp_int_Array_Index_Variable) == 0x000014, "Member 'MPMainContainerBox_C_AddContainersToDictionary::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddContainersToDictionary, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'MPMainContainerBox_C_AddContainersToDictionary::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddContainersToDictionary, CallFunc_Array_Get_Item) == 0x000020, "Member 'MPMainContainerBox_C_AddContainersToDictionary::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddContainersToDictionary, CallFunc_GetSlotMotherUID_UDID) == 0x000028, "Member 'MPMainContainerBox_C_AddContainersToDictionary::CallFunc_GetSlotMotherUID_UDID' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddContainersToDictionary, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'MPMainContainerBox_C_AddContainersToDictionary::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddContainersToDictionary, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'MPMainContainerBox_C_AddContainersToDictionary::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function MPMainContainerBox.MPMainContainerBox_C.AddContainerToContainer
// 0x0448 (0x0448 - 0x0000)
struct MPMainContainerBox_C_AddContainerToContainer final
{
public:
	struct FContainerPickupsInfo                  Container;                                         // 0x0000(0x0068)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FContainerPickupsInfo>          ContainerData;                                     // 0x0068(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<struct FContainerPickupsInfo>          Param_ContainerItems;                              // 0x0078(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	int32                                         ToContainerUID;                                    // 0x0088(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ToSlot;                                            // 0x008C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Rotated_;                                          // 0x0090(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NotSync;                                           // 0x0091(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ArrIndex;                                          // 0x0094(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Uid;                                               // 0x0098(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FContainerPickupsInfo                  CallFunc_Array_Get_Item;                           // 0x00E0(0x0068)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14D[0x3];                                      // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSlotDataArrIndexByUID_Index;           // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FContainerPickupsInfo                  CallFunc_Array_Get_Item_1;                         // 0x0160(0x0068)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             CallFunc_GetDataTableRowFromName_OutRow;           // 0x01D0(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x03F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0408(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0418(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0438(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x043C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0440(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MPMainContainerBox_C_AddContainerToContainer) == 0x000008, "Wrong alignment on MPMainContainerBox_C_AddContainerToContainer");
static_assert(sizeof(MPMainContainerBox_C_AddContainerToContainer) == 0x000448, "Wrong size on MPMainContainerBox_C_AddContainerToContainer");
static_assert(offsetof(MPMainContainerBox_C_AddContainerToContainer, Container) == 0x000000, "Member 'MPMainContainerBox_C_AddContainerToContainer::Container' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddContainerToContainer, ContainerData) == 0x000068, "Member 'MPMainContainerBox_C_AddContainerToContainer::ContainerData' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddContainerToContainer, Param_ContainerItems) == 0x000078, "Member 'MPMainContainerBox_C_AddContainerToContainer::Param_ContainerItems' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddContainerToContainer, ToContainerUID) == 0x000088, "Member 'MPMainContainerBox_C_AddContainerToContainer::ToContainerUID' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddContainerToContainer, ToSlot) == 0x00008C, "Member 'MPMainContainerBox_C_AddContainerToContainer::ToSlot' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddContainerToContainer, Rotated_) == 0x000090, "Member 'MPMainContainerBox_C_AddContainerToContainer::Rotated_' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddContainerToContainer, NotSync) == 0x000091, "Member 'MPMainContainerBox_C_AddContainerToContainer::NotSync' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddContainerToContainer, ArrIndex) == 0x000094, "Member 'MPMainContainerBox_C_AddContainerToContainer::ArrIndex' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddContainerToContainer, Uid) == 0x000098, "Member 'MPMainContainerBox_C_AddContainerToContainer::Uid' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddContainerToContainer, Temp_int_Array_Index_Variable) == 0x00009C, "Member 'MPMainContainerBox_C_AddContainerToContainer::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddContainerToContainer, Temp_int_Loop_Counter_Variable) == 0x0000A0, "Member 'MPMainContainerBox_C_AddContainerToContainer::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddContainerToContainer, Temp_int_Loop_Counter_Variable_1) == 0x0000A4, "Member 'MPMainContainerBox_C_AddContainerToContainer::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddContainerToContainer, CallFunc_Add_IntInt_ReturnValue) == 0x0000A8, "Member 'MPMainContainerBox_C_AddContainerToContainer::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddContainerToContainer, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000AC, "Member 'MPMainContainerBox_C_AddContainerToContainer::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddContainerToContainer, Temp_int_Array_Index_Variable_1) == 0x0000B0, "Member 'MPMainContainerBox_C_AddContainerToContainer::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddContainerToContainer, CallFunc_HasAuthority_ReturnValue) == 0x0000B4, "Member 'MPMainContainerBox_C_AddContainerToContainer::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddContainerToContainer, CallFunc_Array_Length_ReturnValue) == 0x0000B8, "Member 'MPMainContainerBox_C_AddContainerToContainer::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddContainerToContainer, CallFunc_Conv_IntToString_ReturnValue) == 0x0000C0, "Member 'MPMainContainerBox_C_AddContainerToContainer::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddContainerToContainer, CallFunc_Concat_StrStr_ReturnValue) == 0x0000D0, "Member 'MPMainContainerBox_C_AddContainerToContainer::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddContainerToContainer, CallFunc_Array_Get_Item) == 0x0000E0, "Member 'MPMainContainerBox_C_AddContainerToContainer::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddContainerToContainer, CallFunc_Array_Length_ReturnValue_1) == 0x000148, "Member 'MPMainContainerBox_C_AddContainerToContainer::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddContainerToContainer, CallFunc_Less_IntInt_ReturnValue) == 0x00014C, "Member 'MPMainContainerBox_C_AddContainerToContainer::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddContainerToContainer, CallFunc_GetSlotDataArrIndexByUID_Index) == 0x000150, "Member 'MPMainContainerBox_C_AddContainerToContainer::CallFunc_GetSlotDataArrIndexByUID_Index' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddContainerToContainer, CallFunc_Array_Add_ReturnValue) == 0x000154, "Member 'MPMainContainerBox_C_AddContainerToContainer::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddContainerToContainer, CallFunc_Array_Length_ReturnValue_2) == 0x000158, "Member 'MPMainContainerBox_C_AddContainerToContainer::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddContainerToContainer, CallFunc_Array_Get_Item_1) == 0x000160, "Member 'MPMainContainerBox_C_AddContainerToContainer::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddContainerToContainer, CallFunc_Less_IntInt_ReturnValue_1) == 0x0001C8, "Member 'MPMainContainerBox_C_AddContainerToContainer::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddContainerToContainer, CallFunc_GetDataTableRowFromName_OutRow) == 0x0001D0, "Member 'MPMainContainerBox_C_AddContainerToContainer::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddContainerToContainer, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0003F0, "Member 'MPMainContainerBox_C_AddContainerToContainer::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddContainerToContainer, CallFunc_Conv_NameToString_ReturnValue) == 0x0003F8, "Member 'MPMainContainerBox_C_AddContainerToContainer::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddContainerToContainer, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000408, "Member 'MPMainContainerBox_C_AddContainerToContainer::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddContainerToContainer, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000418, "Member 'MPMainContainerBox_C_AddContainerToContainer::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddContainerToContainer, CallFunc_BreakVector2D_X) == 0x000428, "Member 'MPMainContainerBox_C_AddContainerToContainer::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddContainerToContainer, CallFunc_BreakVector2D_Y) == 0x000430, "Member 'MPMainContainerBox_C_AddContainerToContainer::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddContainerToContainer, CallFunc_FTrunc_ReturnValue) == 0x000438, "Member 'MPMainContainerBox_C_AddContainerToContainer::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddContainerToContainer, CallFunc_FTrunc_ReturnValue_1) == 0x00043C, "Member 'MPMainContainerBox_C_AddContainerToContainer::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddContainerToContainer, CallFunc_Array_Add_ReturnValue_1) == 0x000440, "Member 'MPMainContainerBox_C_AddContainerToContainer::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");

// Function MPMainContainerBox.MPMainContainerBox_C.AddItemToContainer
// 0x05F8 (0x05F8 - 0x0000)
struct MPMainContainerBox_C_AddItemToContainer final
{
public:
	int32                                         ToContainerUID;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ToSlotIndex;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FContainerPickupsInfo                  ItemPInfo;                                         // 0x0008(0x0068)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          Rotated_;                                          // 0x0070(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallMCEvent_;                                      // 0x0071(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Added;                                             // 0x0072(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73[0x5];                                       // 0x0073(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             ItemInfo;                                          // 0x0078(0x0220)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         AddedTo;                                           // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FContainerPickupsInfo                  NewItem;                                           // 0x02A0(0x0068)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         ItemUID;                                           // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ArrIndex;                                          // 0x030C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              ItemVector;                                        // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_324[0x4];                                      // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             CallFunc_GetDataTableRowFromName_OutRow;           // 0x0328(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_549[0x7];                                      // 0x0549(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0550(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0560(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0570(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0580(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0584(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0588(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x058C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0590(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0594(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0595(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_596[0x2];                                      // 0x0596(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X;                          // 0x0598(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x05A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x05A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x05AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BlindAddNewItemToContainer_Added;         // 0x05B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B1[0x3];                                      // 0x05B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_BlindAddNewItemToContainer_ToSlotIndex;   // 0x05B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BlindAddNewItemToContainer_UniqueId;      // 0x05B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x05BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BD[0x3];                                      // 0x05BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x05C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x05C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 CallFunc_GetHostingSlots_Indexes;                  // 0x05C8(0x0010)(ReferenceParm)
	int32                                         CallFunc_GetSlotDataArrIndexByUID_Index;           // 0x05D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x05DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_1;                         // 0x05E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x05E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x05E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E9[0x3];                                      // 0x05E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x05EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x05F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MPMainContainerBox_C_AddItemToContainer) == 0x000008, "Wrong alignment on MPMainContainerBox_C_AddItemToContainer");
static_assert(sizeof(MPMainContainerBox_C_AddItemToContainer) == 0x0005F8, "Wrong size on MPMainContainerBox_C_AddItemToContainer");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer, ToContainerUID) == 0x000000, "Member 'MPMainContainerBox_C_AddItemToContainer::ToContainerUID' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer, ToSlotIndex) == 0x000004, "Member 'MPMainContainerBox_C_AddItemToContainer::ToSlotIndex' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer, ItemPInfo) == 0x000008, "Member 'MPMainContainerBox_C_AddItemToContainer::ItemPInfo' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer, Rotated_) == 0x000070, "Member 'MPMainContainerBox_C_AddItemToContainer::Rotated_' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer, CallMCEvent_) == 0x000071, "Member 'MPMainContainerBox_C_AddItemToContainer::CallMCEvent_' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer, Added) == 0x000072, "Member 'MPMainContainerBox_C_AddItemToContainer::Added' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer, ItemInfo) == 0x000078, "Member 'MPMainContainerBox_C_AddItemToContainer::ItemInfo' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer, AddedTo) == 0x000298, "Member 'MPMainContainerBox_C_AddItemToContainer::AddedTo' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer, NewItem) == 0x0002A0, "Member 'MPMainContainerBox_C_AddItemToContainer::NewItem' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer, ItemUID) == 0x000308, "Member 'MPMainContainerBox_C_AddItemToContainer::ItemUID' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer, ArrIndex) == 0x00030C, "Member 'MPMainContainerBox_C_AddItemToContainer::ArrIndex' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer, ItemVector) == 0x000310, "Member 'MPMainContainerBox_C_AddItemToContainer::ItemVector' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer, Temp_int_Array_Index_Variable) == 0x000320, "Member 'MPMainContainerBox_C_AddItemToContainer::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer, CallFunc_GetDataTableRowFromName_OutRow) == 0x000328, "Member 'MPMainContainerBox_C_AddItemToContainer::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000548, "Member 'MPMainContainerBox_C_AddItemToContainer::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer, CallFunc_Conv_NameToString_ReturnValue) == 0x000550, "Member 'MPMainContainerBox_C_AddItemToContainer::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer, CallFunc_Concat_StrStr_ReturnValue) == 0x000560, "Member 'MPMainContainerBox_C_AddItemToContainer::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000570, "Member 'MPMainContainerBox_C_AddItemToContainer::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer, Temp_int_Loop_Counter_Variable) == 0x000580, "Member 'MPMainContainerBox_C_AddItemToContainer::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer, Temp_int_Loop_Counter_Variable_1) == 0x000584, "Member 'MPMainContainerBox_C_AddItemToContainer::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer, CallFunc_Add_IntInt_ReturnValue) == 0x000588, "Member 'MPMainContainerBox_C_AddItemToContainer::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer, CallFunc_Add_IntInt_ReturnValue_1) == 0x00058C, "Member 'MPMainContainerBox_C_AddItemToContainer::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer, Temp_int_Array_Index_Variable_1) == 0x000590, "Member 'MPMainContainerBox_C_AddItemToContainer::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer, CallFunc_HasAuthority_ReturnValue) == 0x000594, "Member 'MPMainContainerBox_C_AddItemToContainer::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000595, "Member 'MPMainContainerBox_C_AddItemToContainer::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer, CallFunc_BreakVector2D_X) == 0x000598, "Member 'MPMainContainerBox_C_AddItemToContainer::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer, CallFunc_BreakVector2D_Y) == 0x0005A0, "Member 'MPMainContainerBox_C_AddItemToContainer::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer, CallFunc_FTrunc_ReturnValue) == 0x0005A8, "Member 'MPMainContainerBox_C_AddItemToContainer::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer, CallFunc_FTrunc_ReturnValue_1) == 0x0005AC, "Member 'MPMainContainerBox_C_AddItemToContainer::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer, CallFunc_BlindAddNewItemToContainer_Added) == 0x0005B0, "Member 'MPMainContainerBox_C_AddItemToContainer::CallFunc_BlindAddNewItemToContainer_Added' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer, CallFunc_BlindAddNewItemToContainer_ToSlotIndex) == 0x0005B4, "Member 'MPMainContainerBox_C_AddItemToContainer::CallFunc_BlindAddNewItemToContainer_ToSlotIndex' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer, CallFunc_BlindAddNewItemToContainer_UniqueId) == 0x0005B8, "Member 'MPMainContainerBox_C_AddItemToContainer::CallFunc_BlindAddNewItemToContainer_UniqueId' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0005BC, "Member 'MPMainContainerBox_C_AddItemToContainer::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer, CallFunc_Array_Add_ReturnValue) == 0x0005C0, "Member 'MPMainContainerBox_C_AddItemToContainer::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer, CallFunc_Array_Add_ReturnValue_1) == 0x0005C4, "Member 'MPMainContainerBox_C_AddItemToContainer::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer, CallFunc_GetHostingSlots_Indexes) == 0x0005C8, "Member 'MPMainContainerBox_C_AddItemToContainer::CallFunc_GetHostingSlots_Indexes' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer, CallFunc_GetSlotDataArrIndexByUID_Index) == 0x0005D8, "Member 'MPMainContainerBox_C_AddItemToContainer::CallFunc_GetSlotDataArrIndexByUID_Index' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer, CallFunc_Array_Get_Item) == 0x0005DC, "Member 'MPMainContainerBox_C_AddItemToContainer::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer, CallFunc_Array_Get_Item_1) == 0x0005E0, "Member 'MPMainContainerBox_C_AddItemToContainer::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer, CallFunc_Array_Length_ReturnValue) == 0x0005E4, "Member 'MPMainContainerBox_C_AddItemToContainer::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer, CallFunc_Less_IntInt_ReturnValue) == 0x0005E8, "Member 'MPMainContainerBox_C_AddItemToContainer::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer, CallFunc_Array_Length_ReturnValue_1) == 0x0005EC, "Member 'MPMainContainerBox_C_AddItemToContainer::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer, CallFunc_Less_IntInt_ReturnValue_1) == 0x0005F0, "Member 'MPMainContainerBox_C_AddItemToContainer::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function MPMainContainerBox.MPMainContainerBox_C.AddItemToContainer_NoData
// 0x01C8 (0x01C8 - 0x0000)
struct MPMainContainerBox_C_AddItemToContainer_NoData final
{
public:
	int32                                         ContainerUID;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NOfColumns;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NOfRows;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              SlotVector;                                        // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Added;                                             // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AddedTo;                                           // 0x0024(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 HostingSlots;                                      // 0x0028(0x0010)(Parm, OutParm)
	int32                                         CurrentIndex;                                      // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Y;                                                 // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         X;                                                 // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 AllUsedSlots;                                      // 0x0048(0x0010)(Edit, BlueprintVisible)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_86[0x2];                                       // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 CallFunc_GetHostingSlots_Indexes;                  // 0x0098(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Get_Item;                           // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetColumnRowBySlotIndex_Column;           // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetColumnRowBySlotIndex_Row;              // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CE[0x2];                                       // 0x00CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E6[0x2];                                       // 0x00E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FContainerPickupsInfo                  CallFunc_Array_Get_Item_1;                         // 0x00E8(0x0068)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0155(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_156[0x2];                                      // 0x0156(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FContainerPickupsInfo                  CallFunc_Array_Get_Item_2;                         // 0x0158(0x0068)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x01C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MPMainContainerBox_C_AddItemToContainer_NoData) == 0x000008, "Wrong alignment on MPMainContainerBox_C_AddItemToContainer_NoData");
static_assert(sizeof(MPMainContainerBox_C_AddItemToContainer_NoData) == 0x0001C8, "Wrong size on MPMainContainerBox_C_AddItemToContainer_NoData");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer_NoData, ContainerUID) == 0x000000, "Member 'MPMainContainerBox_C_AddItemToContainer_NoData::ContainerUID' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer_NoData, NOfColumns) == 0x000004, "Member 'MPMainContainerBox_C_AddItemToContainer_NoData::NOfColumns' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer_NoData, NOfRows) == 0x000008, "Member 'MPMainContainerBox_C_AddItemToContainer_NoData::NOfRows' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer_NoData, SlotVector) == 0x000010, "Member 'MPMainContainerBox_C_AddItemToContainer_NoData::SlotVector' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer_NoData, Added) == 0x000020, "Member 'MPMainContainerBox_C_AddItemToContainer_NoData::Added' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer_NoData, AddedTo) == 0x000024, "Member 'MPMainContainerBox_C_AddItemToContainer_NoData::AddedTo' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer_NoData, HostingSlots) == 0x000028, "Member 'MPMainContainerBox_C_AddItemToContainer_NoData::HostingSlots' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer_NoData, CurrentIndex) == 0x000038, "Member 'MPMainContainerBox_C_AddItemToContainer_NoData::CurrentIndex' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer_NoData, Y) == 0x00003C, "Member 'MPMainContainerBox_C_AddItemToContainer_NoData::Y' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer_NoData, X) == 0x000040, "Member 'MPMainContainerBox_C_AddItemToContainer_NoData::X' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer_NoData, AllUsedSlots) == 0x000048, "Member 'MPMainContainerBox_C_AddItemToContainer_NoData::AllUsedSlots' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer_NoData, CallFunc_BreakVector2D_X) == 0x000058, "Member 'MPMainContainerBox_C_AddItemToContainer_NoData::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer_NoData, CallFunc_BreakVector2D_Y) == 0x000060, "Member 'MPMainContainerBox_C_AddItemToContainer_NoData::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer_NoData, Temp_int_Loop_Counter_Variable) == 0x000068, "Member 'MPMainContainerBox_C_AddItemToContainer_NoData::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer_NoData, CallFunc_FTrunc_ReturnValue) == 0x00006C, "Member 'MPMainContainerBox_C_AddItemToContainer_NoData::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer_NoData, CallFunc_Add_IntInt_ReturnValue) == 0x000070, "Member 'MPMainContainerBox_C_AddItemToContainer_NoData::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer_NoData, CallFunc_FTrunc_ReturnValue_1) == 0x000074, "Member 'MPMainContainerBox_C_AddItemToContainer_NoData::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer_NoData, Temp_int_Loop_Counter_Variable_1) == 0x000078, "Member 'MPMainContainerBox_C_AddItemToContainer_NoData::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer_NoData, CallFunc_Add_IntInt_ReturnValue_1) == 0x00007C, "Member 'MPMainContainerBox_C_AddItemToContainer_NoData::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer_NoData, Temp_int_Array_Index_Variable) == 0x000080, "Member 'MPMainContainerBox_C_AddItemToContainer_NoData::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer_NoData, Temp_bool_Variable) == 0x000084, "Member 'MPMainContainerBox_C_AddItemToContainer_NoData::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer_NoData, CallFunc_Not_PreBool_ReturnValue) == 0x000085, "Member 'MPMainContainerBox_C_AddItemToContainer_NoData::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer_NoData, Temp_int_Loop_Counter_Variable_2) == 0x000088, "Member 'MPMainContainerBox_C_AddItemToContainer_NoData::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer_NoData, CallFunc_Add_IntInt_ReturnValue_2) == 0x00008C, "Member 'MPMainContainerBox_C_AddItemToContainer_NoData::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer_NoData, Temp_int_Array_Index_Variable_1) == 0x000090, "Member 'MPMainContainerBox_C_AddItemToContainer_NoData::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer_NoData, Temp_int_Array_Index_Variable_2) == 0x000094, "Member 'MPMainContainerBox_C_AddItemToContainer_NoData::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer_NoData, CallFunc_GetHostingSlots_Indexes) == 0x000098, "Member 'MPMainContainerBox_C_AddItemToContainer_NoData::CallFunc_GetHostingSlots_Indexes' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer_NoData, CallFunc_Array_Get_Item) == 0x0000A8, "Member 'MPMainContainerBox_C_AddItemToContainer_NoData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer_NoData, CallFunc_Array_Length_ReturnValue) == 0x0000AC, "Member 'MPMainContainerBox_C_AddItemToContainer_NoData::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer_NoData, CallFunc_Less_IntInt_ReturnValue) == 0x0000B0, "Member 'MPMainContainerBox_C_AddItemToContainer_NoData::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer_NoData, CallFunc_GetColumnRowBySlotIndex_Column) == 0x0000B4, "Member 'MPMainContainerBox_C_AddItemToContainer_NoData::CallFunc_GetColumnRowBySlotIndex_Column' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer_NoData, CallFunc_GetColumnRowBySlotIndex_Row) == 0x0000B8, "Member 'MPMainContainerBox_C_AddItemToContainer_NoData::CallFunc_GetColumnRowBySlotIndex_Row' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer_NoData, CallFunc_Array_Contains_ReturnValue) == 0x0000BC, "Member 'MPMainContainerBox_C_AddItemToContainer_NoData::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer_NoData, CallFunc_Add_IntInt_ReturnValue_3) == 0x0000C0, "Member 'MPMainContainerBox_C_AddItemToContainer_NoData::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MPMainContainerBox_C_AddItemToContainer_NoData, CallFunc_Greater_IntInt_ReturnValue) == 0x0000C4, "Member 'MPMainContainerBox_C_AddItemToContainer_NoData::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
