#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MSetQuestActive

#include "Basic.hpp"


namespace SDK::Params
{

// Function MSetQuestActive.MSetQuestActive_C.ExecuteAction
// 0x0010 (0x0010 - 0x0000)
struct MSetQuestActive_C_ExecuteAction final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAGSGraphNode*                          NodeOwner;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MSetQuestActive_C_ExecuteAction) == 0x000008, "Wrong alignment on MSetQuestActive_C_ExecuteAction");
static_assert(sizeof(MSetQuestActive_C_ExecuteAction) == 0x000010, "Wrong size on MSetQuestActive_C_ExecuteAction");
static_assert(offsetof(MSetQuestActive_C_ExecuteAction, PlayerController) == 0x000000, "Member 'MSetQuestActive_C_ExecuteAction::PlayerController' has a wrong offset!");
static_assert(offsetof(MSetQuestActive_C_ExecuteAction, NodeOwner) == 0x000008, "Member 'MSetQuestActive_C_ExecuteAction::NodeOwner' has a wrong offset!");

// Function MSetQuestActive.MSetQuestActive_C.ExecuteUbergraph_MSetQuestActive
// 0x0030 (0x0030 - 0x0000)
struct MSetQuestActive_C_ExecuteUbergraph_MSetQuestActive final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MedicShop_C*                        CallFunc_GetActorOfClass_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_Event_playerController;                     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAGSGraphNode*                          K2Node_Event_nodeOwner;                            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_MedicShop_C*                        K2Node_DynamicCast_AsBP_Medic_Shop;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MSetQuestActive_C_ExecuteUbergraph_MSetQuestActive) == 0x000008, "Wrong alignment on MSetQuestActive_C_ExecuteUbergraph_MSetQuestActive");
static_assert(sizeof(MSetQuestActive_C_ExecuteUbergraph_MSetQuestActive) == 0x000030, "Wrong size on MSetQuestActive_C_ExecuteUbergraph_MSetQuestActive");
static_assert(offsetof(MSetQuestActive_C_ExecuteUbergraph_MSetQuestActive, EntryPoint) == 0x000000, "Member 'MSetQuestActive_C_ExecuteUbergraph_MSetQuestActive::EntryPoint' has a wrong offset!");
static_assert(offsetof(MSetQuestActive_C_ExecuteUbergraph_MSetQuestActive, CallFunc_GetActorOfClass_ReturnValue) == 0x000008, "Member 'MSetQuestActive_C_ExecuteUbergraph_MSetQuestActive::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(MSetQuestActive_C_ExecuteUbergraph_MSetQuestActive, K2Node_Event_playerController) == 0x000010, "Member 'MSetQuestActive_C_ExecuteUbergraph_MSetQuestActive::K2Node_Event_playerController' has a wrong offset!");
static_assert(offsetof(MSetQuestActive_C_ExecuteUbergraph_MSetQuestActive, K2Node_Event_nodeOwner) == 0x000018, "Member 'MSetQuestActive_C_ExecuteUbergraph_MSetQuestActive::K2Node_Event_nodeOwner' has a wrong offset!");
static_assert(offsetof(MSetQuestActive_C_ExecuteUbergraph_MSetQuestActive, K2Node_DynamicCast_AsBP_Medic_Shop) == 0x000020, "Member 'MSetQuestActive_C_ExecuteUbergraph_MSetQuestActive::K2Node_DynamicCast_AsBP_Medic_Shop' has a wrong offset!");
static_assert(offsetof(MSetQuestActive_C_ExecuteUbergraph_MSetQuestActive, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'MSetQuestActive_C_ExecuteUbergraph_MSetQuestActive::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

