#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MSetQuestCompleted

#include "Basic.hpp"

#include "AGSGraphRuntime_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass MSetQuestCompleted.MSetQuestCompleted_C
// 0x0010 (0x0040 - 0x0030)
class UMSetQuestCompleted_C final : public UAGSAction
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0030(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         QuestIndex;                                        // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         ObjectiveIndex;                                    // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteAction(class APlayerController* PlayerController, class UAGSGraphNode* NodeOwner);
	void ExecuteUbergraph_MSetQuestCompleted(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MSetQuestCompleted_C">();
	}
	static class UMSetQuestCompleted_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMSetQuestCompleted_C>();
	}
};
static_assert(alignof(UMSetQuestCompleted_C) == 0x000008, "Wrong alignment on UMSetQuestCompleted_C");
static_assert(sizeof(UMSetQuestCompleted_C) == 0x000040, "Wrong size on UMSetQuestCompleted_C");
static_assert(offsetof(UMSetQuestCompleted_C, UberGraphFrame) == 0x000030, "Member 'UMSetQuestCompleted_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMSetQuestCompleted_C, QuestIndex) == 0x000038, "Member 'UMSetQuestCompleted_C::QuestIndex' has a wrong offset!");
static_assert(offsetof(UMSetQuestCompleted_C, ObjectiveIndex) == 0x00003C, "Member 'UMSetQuestCompleted_C::ObjectiveIndex' has a wrong offset!");

}

