#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_Structure

#include "Basic.hpp"

#include "E_NPC_Name_structs.hpp"


namespace SDK
{

// UserDefinedStruct NPC_Structure.NPC_Structure
// 0x0110 (0x0110 - 0x0000)
struct FNPC_Structure final
{
public:
	class UDataTable*                             DataTable_2_9FAF6160404AC0288F147FB2B4D7EB37;      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   NPC_Name_5_D2B2D5884BEDCBBA043FB299AF9F262C;       // 0x0008(0x0018)(Edit, BlueprintVisible)
	E_NPC_Name                                    NPCName_Enum_46_4003EC284B93DE371D4A1EA84FA49D3A;  // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UQuest*>                         QuestSysStruct_20_97101EAC4BC20EB59A991ABDE41C7D3A; // 0x0028(0x0010)(Edit, BlueprintVisible)
	TArray<class UQuest*>                         SpecQuests_43_0CCB9915480FC7DD7B9AFDB6B880D70A;    // 0x0038(0x0010)(Edit, BlueprintVisible)
	class FName                                   Type_19_5AC686444D9C0151B8964099ADFD7086;          // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   TypeDisplayName_23_B19F345F49F3177CA0567EACB947F882; // 0x0050(0x0018)(Edit, BlueprintVisible)
	TSoftObjectPtr<class UPaperSprite>            Portrait_50_A87ED46D41315D780ADC14BE2DA1E80E;      // 0x0068(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UPaperSprite>            Icon_51_0213283345D2DBF067FED09B0EBBAF5B;          // 0x0098(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UPaperSprite>            BigPortrait_52_2EB928B645718F079628B69B27A179A5;   // 0x00C8(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class FText                                   Tip_31_207DB78441DF05596629DB94BEB87AC6;           // 0x00F8(0x0018)(Edit, BlueprintVisible)
};
static_assert(alignof(FNPC_Structure) == 0x000008, "Wrong alignment on FNPC_Structure");
static_assert(sizeof(FNPC_Structure) == 0x000110, "Wrong size on FNPC_Structure");
static_assert(offsetof(FNPC_Structure, DataTable_2_9FAF6160404AC0288F147FB2B4D7EB37) == 0x000000, "Member 'FNPC_Structure::DataTable_2_9FAF6160404AC0288F147FB2B4D7EB37' has a wrong offset!");
static_assert(offsetof(FNPC_Structure, NPC_Name_5_D2B2D5884BEDCBBA043FB299AF9F262C) == 0x000008, "Member 'FNPC_Structure::NPC_Name_5_D2B2D5884BEDCBBA043FB299AF9F262C' has a wrong offset!");
static_assert(offsetof(FNPC_Structure, NPCName_Enum_46_4003EC284B93DE371D4A1EA84FA49D3A) == 0x000020, "Member 'FNPC_Structure::NPCName_Enum_46_4003EC284B93DE371D4A1EA84FA49D3A' has a wrong offset!");
static_assert(offsetof(FNPC_Structure, QuestSysStruct_20_97101EAC4BC20EB59A991ABDE41C7D3A) == 0x000028, "Member 'FNPC_Structure::QuestSysStruct_20_97101EAC4BC20EB59A991ABDE41C7D3A' has a wrong offset!");
static_assert(offsetof(FNPC_Structure, SpecQuests_43_0CCB9915480FC7DD7B9AFDB6B880D70A) == 0x000038, "Member 'FNPC_Structure::SpecQuests_43_0CCB9915480FC7DD7B9AFDB6B880D70A' has a wrong offset!");
static_assert(offsetof(FNPC_Structure, Type_19_5AC686444D9C0151B8964099ADFD7086) == 0x000048, "Member 'FNPC_Structure::Type_19_5AC686444D9C0151B8964099ADFD7086' has a wrong offset!");
static_assert(offsetof(FNPC_Structure, TypeDisplayName_23_B19F345F49F3177CA0567EACB947F882) == 0x000050, "Member 'FNPC_Structure::TypeDisplayName_23_B19F345F49F3177CA0567EACB947F882' has a wrong offset!");
static_assert(offsetof(FNPC_Structure, Portrait_50_A87ED46D41315D780ADC14BE2DA1E80E) == 0x000068, "Member 'FNPC_Structure::Portrait_50_A87ED46D41315D780ADC14BE2DA1E80E' has a wrong offset!");
static_assert(offsetof(FNPC_Structure, Icon_51_0213283345D2DBF067FED09B0EBBAF5B) == 0x000098, "Member 'FNPC_Structure::Icon_51_0213283345D2DBF067FED09B0EBBAF5B' has a wrong offset!");
static_assert(offsetof(FNPC_Structure, BigPortrait_52_2EB928B645718F079628B69B27A179A5) == 0x0000C8, "Member 'FNPC_Structure::BigPortrait_52_2EB928B645718F079628B69B27A179A5' has a wrong offset!");
static_assert(offsetof(FNPC_Structure, Tip_31_207DB78441DF05596629DB94BEB87AC6) == 0x0000F8, "Member 'FNPC_Structure::Tip_31_207DB78441DF05596629DB94BEB87AC6' has a wrong offset!");

}

