#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: O_ItemState

#include "Basic.hpp"


namespace SDK::Params
{

// Function O_ItemState.O_ItemState_C.CopyItem
// 0x0020 (0x0020 - 0x0000)
struct O_ItemState_C_CopyItem final
{
public:
	class AActor*                                 Owner;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UO_ItemState_C*                         CopiedItem;                                        // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UO_ItemState_C*                         L_copiedItem;                                      // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UO_ItemState_C*                         CallFunc_SpawnObject_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(O_ItemState_C_CopyItem) == 0x000008, "Wrong alignment on O_ItemState_C_CopyItem");
static_assert(sizeof(O_ItemState_C_CopyItem) == 0x000020, "Wrong size on O_ItemState_C_CopyItem");
static_assert(offsetof(O_ItemState_C_CopyItem, Owner) == 0x000000, "Member 'O_ItemState_C_CopyItem::Owner' has a wrong offset!");
static_assert(offsetof(O_ItemState_C_CopyItem, CopiedItem) == 0x000008, "Member 'O_ItemState_C_CopyItem::CopiedItem' has a wrong offset!");
static_assert(offsetof(O_ItemState_C_CopyItem, L_copiedItem) == 0x000010, "Member 'O_ItemState_C_CopyItem::L_copiedItem' has a wrong offset!");
static_assert(offsetof(O_ItemState_C_CopyItem, CallFunc_SpawnObject_ReturnValue) == 0x000018, "Member 'O_ItemState_C_CopyItem::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");

// Function O_ItemState.O_ItemState_C.ExecuteUbergraph_O_ItemState
// 0x0008 (0x0008 - 0x0000)
struct O_ItemState_C_ExecuteUbergraph_O_ItemState final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(O_ItemState_C_ExecuteUbergraph_O_ItemState) == 0x000004, "Wrong alignment on O_ItemState_C_ExecuteUbergraph_O_ItemState");
static_assert(sizeof(O_ItemState_C_ExecuteUbergraph_O_ItemState) == 0x000008, "Wrong size on O_ItemState_C_ExecuteUbergraph_O_ItemState");
static_assert(offsetof(O_ItemState_C_ExecuteUbergraph_O_ItemState, EntryPoint) == 0x000000, "Member 'O_ItemState_C_ExecuteUbergraph_O_ItemState::EntryPoint' has a wrong offset!");
static_assert(offsetof(O_ItemState_C_ExecuteUbergraph_O_ItemState, K2Node_SwitchEnum_CmpSuccess) == 0x000004, "Member 'O_ItemState_C_ExecuteUbergraph_O_ItemState::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function O_ItemState.O_ItemState_C.GetSize
// 0x0008 (0x0008 - 0x0000)
struct O_ItemState_C_GetSize final
{
public:
	int32                                         SizeX;                                             // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SizeY;                                             // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(O_ItemState_C_GetSize) == 0x000004, "Wrong alignment on O_ItemState_C_GetSize");
static_assert(sizeof(O_ItemState_C_GetSize) == 0x000008, "Wrong size on O_ItemState_C_GetSize");
static_assert(offsetof(O_ItemState_C_GetSize, SizeX) == 0x000000, "Member 'O_ItemState_C_GetSize::SizeX' has a wrong offset!");
static_assert(offsetof(O_ItemState_C_GetSize, SizeY) == 0x000004, "Member 'O_ItemState_C_GetSize::SizeY' has a wrong offset!");

}

