#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Objective

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct Objective.Objective
// 0x0040 (0x0040 - 0x0000)
struct FObjective final
{
public:
	class FText                                   ObjectiveName_2_09A97265469A499A52F4ABBAE5A10D93;  // 0x0000(0x0018)(Edit, BlueprintVisible)
	bool                                          PlaySound_5_609D5D3F437A858A8DD2338437003C4D;      // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                MarkLocation_11_8D8FAEEB4699D46CFF96779685EEE281;  // 0x0020(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Simultaneously_13_2FD87A474DC98A0DC9790192295FD0A0; // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FObjective) == 0x000008, "Wrong alignment on FObjective");
static_assert(sizeof(FObjective) == 0x000040, "Wrong size on FObjective");
static_assert(offsetof(FObjective, ObjectiveName_2_09A97265469A499A52F4ABBAE5A10D93) == 0x000000, "Member 'FObjective::ObjectiveName_2_09A97265469A499A52F4ABBAE5A10D93' has a wrong offset!");
static_assert(offsetof(FObjective, PlaySound_5_609D5D3F437A858A8DD2338437003C4D) == 0x000018, "Member 'FObjective::PlaySound_5_609D5D3F437A858A8DD2338437003C4D' has a wrong offset!");
static_assert(offsetof(FObjective, MarkLocation_11_8D8FAEEB4699D46CFF96779685EEE281) == 0x000020, "Member 'FObjective::MarkLocation_11_8D8FAEEB4699D46CFF96779685EEE281' has a wrong offset!");
static_assert(offsetof(FObjective, Simultaneously_13_2FD87A474DC98A0DC9790192295FD0A0) == 0x000038, "Member 'FObjective::Simultaneously_13_2FD87A474DC98A0DC9790192295FD0A0' has a wrong offset!");

}

