#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OnHoverTooltipWidget

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "JSItemType_structs.hpp"


namespace SDK::Params
{

// Function OnHoverTooltipWidget.OnHoverTooltipWidget_C.ExecuteUbergraph_OnHoverTooltipWidget
// 0x0650 (0x0650 - 0x0000)
struct OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJSItemType                                   Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0020(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0038(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0050(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x0068(0x0018)()
	class FText                                   Temp_text_Variable_5;                              // 0x0080(0x0018)()
	class FText                                   Temp_text_Variable_6;                              // 0x0098(0x0018)()
	class FText                                   Temp_text_Variable_7;                              // 0x00B0(0x0018)()
	class FText                                   Temp_text_Variable_8;                              // 0x00C8(0x0018)()
	class FText                                   Temp_text_Variable_9;                              // 0x00E0(0x0018)()
	class FText                                   Temp_text_Variable_10;                             // 0x00F8(0x0018)()
	class FText                                   Temp_text_Variable_11;                             // 0x0110(0x0018)()
	class FText                                   Temp_text_Variable_12;                             // 0x0128(0x0018)()
	class FText                                   Temp_text_Variable_13;                             // 0x0140(0x0018)()
	class FText                                   Temp_text_Variable_14;                             // 0x0158(0x0018)()
	class FText                                   Temp_text_Variable_15;                             // 0x0170(0x0018)()
	class FText                                   Temp_text_Variable_16;                             // 0x0188(0x0018)()
	class FText                                   Temp_text_Variable_17;                             // 0x01A0(0x0018)()
	class FText                                   Temp_text_Variable_18;                             // 0x01B8(0x0018)()
	class FText                                   Temp_text_Variable_19;                             // 0x01D0(0x0018)()
	class FText                                   Temp_text_Variable_20;                             // 0x01E8(0x0018)()
	class FText                                   Temp_text_Variable_21;                             // 0x0200(0x0018)()
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21A[0x6];                                      // 0x021A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_MakeBrushFromSprite_ReturnValue;          // 0x0220(0x00D0)()
	class UCanvasPanelSlot*                       K2Node_DynamicCast_AsCanvas_Panel_Slot;            // 0x02F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       K2Node_DynamicCast_AsCanvas_Panel_Slot_1;          // 0x0300(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X;                          // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0321(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_1;     // 0x0322(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_323[0x5];                                      // 0x0323(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0338(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0348(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_CustomEvent_IconSize;                       // 0x0358(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_CustomEvent_WidgetSize;                     // 0x0368(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_IconHeight;                     // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_2;               // 0x0380(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_2;           // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_3;               // 0x03B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_4;               // 0x03C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_3;           // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_5;               // 0x03D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x03E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EC[0x4];                                      // 0x03EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x03F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0400(0x00D0)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x04D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x04E0(0x0018)()
	uint8                                         Pad_4F8[0x8];                                      // 0x04F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_1;                    // 0x0500(0x00D0)()
	double                                        CallFunc_Multiply_IntFloat_ReturnValue_2;          // 0x05D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_4;           // 0x05D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_6;               // 0x05E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_IntFloat_ReturnValue_3;          // 0x05F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_7;               // 0x05F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x0608(0x0018)()
	struct FVector2D                              CallFunc_BreakVector2D_InVec_ImplicitCast;         // 0x0620(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast; // 0x0630(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_634[0x4];                                      // 0x0634(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0638(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0640(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget) == 0x000010, "Wrong alignment on OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget");
static_assert(sizeof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget) == 0x000650, "Wrong size on OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, EntryPoint) == 0x000000, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, Temp_byte_Variable) == 0x000004, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, Temp_text_Variable) == 0x000008, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, Temp_text_Variable_1) == 0x000020, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, Temp_text_Variable_2) == 0x000038, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, Temp_text_Variable_3) == 0x000050, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, Temp_text_Variable_4) == 0x000068, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, Temp_text_Variable_5) == 0x000080, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::Temp_text_Variable_5' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, Temp_text_Variable_6) == 0x000098, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::Temp_text_Variable_6' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, Temp_text_Variable_7) == 0x0000B0, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::Temp_text_Variable_7' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, Temp_text_Variable_8) == 0x0000C8, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::Temp_text_Variable_8' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, Temp_text_Variable_9) == 0x0000E0, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::Temp_text_Variable_9' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, Temp_text_Variable_10) == 0x0000F8, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::Temp_text_Variable_10' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, Temp_text_Variable_11) == 0x000110, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::Temp_text_Variable_11' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, Temp_text_Variable_12) == 0x000128, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::Temp_text_Variable_12' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, Temp_text_Variable_13) == 0x000140, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::Temp_text_Variable_13' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, Temp_text_Variable_14) == 0x000158, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::Temp_text_Variable_14' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, Temp_text_Variable_15) == 0x000170, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::Temp_text_Variable_15' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, Temp_text_Variable_16) == 0x000188, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::Temp_text_Variable_16' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, Temp_text_Variable_17) == 0x0001A0, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::Temp_text_Variable_17' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, Temp_text_Variable_18) == 0x0001B8, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::Temp_text_Variable_18' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, Temp_text_Variable_19) == 0x0001D0, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::Temp_text_Variable_19' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, Temp_text_Variable_20) == 0x0001E8, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::Temp_text_Variable_20' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, Temp_text_Variable_21) == 0x000200, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::Temp_text_Variable_21' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, Temp_bool_IsClosed_Variable) == 0x000218, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, Temp_bool_Has_Been_Initd_Variable) == 0x000219, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, CallFunc_MakeBrushFromSprite_ReturnValue) == 0x000220, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::CallFunc_MakeBrushFromSprite_ReturnValue' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, K2Node_DynamicCast_AsCanvas_Panel_Slot) == 0x0002F0, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::K2Node_DynamicCast_AsCanvas_Panel_Slot' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, K2Node_DynamicCast_bSuccess) == 0x0002F8, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, K2Node_DynamicCast_AsCanvas_Panel_Slot_1) == 0x000300, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::K2Node_DynamicCast_AsCanvas_Panel_Slot_1' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, K2Node_DynamicCast_bSuccess_1) == 0x000308, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, CallFunc_BreakVector2D_X) == 0x000310, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, CallFunc_BreakVector2D_Y) == 0x000318, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000320, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000321, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, CallFunc_LessEqual_DoubleDouble_ReturnValue_1) == 0x000322, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::CallFunc_LessEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000328, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, CallFunc_Multiply_IntFloat_ReturnValue_1) == 0x000330, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::CallFunc_Multiply_IntFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, CallFunc_MakeVector2D_ReturnValue) == 0x000338, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, CallFunc_MakeVector2D_ReturnValue_1) == 0x000348, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, K2Node_CustomEvent_IconSize) == 0x000358, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::K2Node_CustomEvent_IconSize' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, K2Node_CustomEvent_WidgetSize) == 0x000368, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::K2Node_CustomEvent_WidgetSize' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, K2Node_CustomEvent_IconHeight) == 0x000378, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::K2Node_CustomEvent_IconHeight' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, CallFunc_MakeVector2D_ReturnValue_2) == 0x000380, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::CallFunc_MakeVector2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000390, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000398, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x0003A0, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, CallFunc_Add_DoubleDouble_ReturnValue_2) == 0x0003A8, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::CallFunc_Add_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, CallFunc_MakeVector2D_ReturnValue_3) == 0x0003B0, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::CallFunc_MakeVector2D_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, CallFunc_MakeVector2D_ReturnValue_4) == 0x0003C0, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::CallFunc_MakeVector2D_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, CallFunc_Add_DoubleDouble_ReturnValue_3) == 0x0003D0, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::CallFunc_Add_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, CallFunc_MakeVector2D_ReturnValue_5) == 0x0003D8, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::CallFunc_MakeVector2D_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, CallFunc_FFloor_ReturnValue) == 0x0003E8, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::CallFunc_FFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, CallFunc_Conv_IntToString_ReturnValue) == 0x0003F0, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, K2Node_MakeStruct_SlateBrush) == 0x000400, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, CallFunc_Concat_StrStr_ReturnValue) == 0x0004D0, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, CallFunc_Conv_StringToText_ReturnValue) == 0x0004E0, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, K2Node_MakeStruct_SlateBrush_1) == 0x000500, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::K2Node_MakeStruct_SlateBrush_1' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, CallFunc_Multiply_IntFloat_ReturnValue_2) == 0x0005D0, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::CallFunc_Multiply_IntFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, CallFunc_Add_DoubleDouble_ReturnValue_4) == 0x0005D8, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::CallFunc_Add_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, CallFunc_MakeVector2D_ReturnValue_6) == 0x0005E0, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::CallFunc_MakeVector2D_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, CallFunc_Multiply_IntFloat_ReturnValue_3) == 0x0005F0, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::CallFunc_Multiply_IntFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, CallFunc_MakeVector2D_ReturnValue_7) == 0x0005F8, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::CallFunc_MakeVector2D_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, K2Node_Select_Default) == 0x000608, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, CallFunc_BreakVector2D_InVec_ImplicitCast) == 0x000620, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::CallFunc_BreakVector2D_InVec_ImplicitCast' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast) == 0x000630, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000638, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x000640, "Member 'OnHoverTooltipWidget_C_ExecuteUbergraph_OnHoverTooltipWidget::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function OnHoverTooltipWidget.OnHoverTooltipWidget_C.SetSizeOnHoverSlot
// 0x0028 (0x0028 - 0x0000)
struct OnHoverTooltipWidget_C_SetSizeOnHoverSlot final
{
public:
	struct FVector2D                              IconSize;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              WidgetSize;                                        // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        IconHeight;                                        // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OnHoverTooltipWidget_C_SetSizeOnHoverSlot) == 0x000008, "Wrong alignment on OnHoverTooltipWidget_C_SetSizeOnHoverSlot");
static_assert(sizeof(OnHoverTooltipWidget_C_SetSizeOnHoverSlot) == 0x000028, "Wrong size on OnHoverTooltipWidget_C_SetSizeOnHoverSlot");
static_assert(offsetof(OnHoverTooltipWidget_C_SetSizeOnHoverSlot, IconSize) == 0x000000, "Member 'OnHoverTooltipWidget_C_SetSizeOnHoverSlot::IconSize' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_SetSizeOnHoverSlot, WidgetSize) == 0x000010, "Member 'OnHoverTooltipWidget_C_SetSizeOnHoverSlot::WidgetSize' has a wrong offset!");
static_assert(offsetof(OnHoverTooltipWidget_C_SetSizeOnHoverSlot, IconHeight) == 0x000020, "Member 'OnHoverTooltipWidget_C_SetSizeOnHoverSlot::IconHeight' has a wrong offset!");

}

