#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Optimized_ABP_ZombieDeadBody

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct Optimized_ABP_ZombieDeadBody.Optimized_ABP_ZombieDeadBody_C.AnimBlueprintGeneratedConstantData
// 0x00F7 (0x00F8 - 0x0001)
struct Optimized_ABP_ZombieDeadBody::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_10;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_11;                                 // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_12;                                 // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_13;                                   // 0x0020(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_14;                                 // 0x0028(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_15;                                 // 0x0029(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_16;                                 // 0x002A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_17;                                // 0x0030(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_18;                               // 0x0040(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0060(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00E0(0x0018)()
};
static_assert(alignof(Optimized_ABP_ZombieDeadBody::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on Optimized_ABP_ZombieDeadBody::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(Optimized_ABP_ZombieDeadBody::FAnimBlueprintGeneratedConstantData) == 0x0000F8, "Wrong size on Optimized_ABP_ZombieDeadBody::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(Optimized_ABP_ZombieDeadBody::FAnimBlueprintGeneratedConstantData, __NameProperty_10) == 0x000004, "Member 'Optimized_ABP_ZombieDeadBody::FAnimBlueprintGeneratedConstantData::__NameProperty_10' has a wrong offset!");
static_assert(offsetof(Optimized_ABP_ZombieDeadBody::FAnimBlueprintGeneratedConstantData, __NameProperty_11) == 0x00000C, "Member 'Optimized_ABP_ZombieDeadBody::FAnimBlueprintGeneratedConstantData::__NameProperty_11' has a wrong offset!");
static_assert(offsetof(Optimized_ABP_ZombieDeadBody::FAnimBlueprintGeneratedConstantData, __BlendProfile_12) == 0x000018, "Member 'Optimized_ABP_ZombieDeadBody::FAnimBlueprintGeneratedConstantData::__BlendProfile_12' has a wrong offset!");
static_assert(offsetof(Optimized_ABP_ZombieDeadBody::FAnimBlueprintGeneratedConstantData, __CurveFloat_13) == 0x000020, "Member 'Optimized_ABP_ZombieDeadBody::FAnimBlueprintGeneratedConstantData::__CurveFloat_13' has a wrong offset!");
static_assert(offsetof(Optimized_ABP_ZombieDeadBody::FAnimBlueprintGeneratedConstantData, __BoolProperty_14) == 0x000028, "Member 'Optimized_ABP_ZombieDeadBody::FAnimBlueprintGeneratedConstantData::__BoolProperty_14' has a wrong offset!");
static_assert(offsetof(Optimized_ABP_ZombieDeadBody::FAnimBlueprintGeneratedConstantData, __EnumProperty_15) == 0x000029, "Member 'Optimized_ABP_ZombieDeadBody::FAnimBlueprintGeneratedConstantData::__EnumProperty_15' has a wrong offset!");
static_assert(offsetof(Optimized_ABP_ZombieDeadBody::FAnimBlueprintGeneratedConstantData, __EnumProperty_16) == 0x00002A, "Member 'Optimized_ABP_ZombieDeadBody::FAnimBlueprintGeneratedConstantData::__EnumProperty_16' has a wrong offset!");
static_assert(offsetof(Optimized_ABP_ZombieDeadBody::FAnimBlueprintGeneratedConstantData, __ArrayProperty_17) == 0x000030, "Member 'Optimized_ABP_ZombieDeadBody::FAnimBlueprintGeneratedConstantData::__ArrayProperty_17' has a wrong offset!");
static_assert(offsetof(Optimized_ABP_ZombieDeadBody::FAnimBlueprintGeneratedConstantData, __StructProperty_18) == 0x000040, "Member 'Optimized_ABP_ZombieDeadBody::FAnimBlueprintGeneratedConstantData::__StructProperty_18' has a wrong offset!");
static_assert(offsetof(Optimized_ABP_ZombieDeadBody::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000060, "Member 'Optimized_ABP_ZombieDeadBody::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(Optimized_ABP_ZombieDeadBody::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000E0, "Member 'Optimized_ABP_ZombieDeadBody::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct Optimized_ABP_ZombieDeadBody.Optimized_ABP_ZombieDeadBody_C.AnimBlueprintGeneratedMutableData
// 0x0001 (0x0002 - 0x0001)
struct Optimized_ABP_ZombieDeadBody::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Optimized_ABP_ZombieDeadBody::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on Optimized_ABP_ZombieDeadBody::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(Optimized_ABP_ZombieDeadBody::FAnimBlueprintGeneratedMutableData) == 0x000002, "Wrong size on Optimized_ABP_ZombieDeadBody::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(Optimized_ABP_ZombieDeadBody::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'Optimized_ABP_ZombieDeadBody::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");

}

