#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Optimized_ABP_ZombieDeadBody

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Optimized_ABP_ZombieDeadBody.Optimized_ABP_ZombieDeadBody_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct Optimized_ABP_ZombieDeadBody_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Optimized_ABP_ZombieDeadBody_C_AnimGraph) == 0x000008, "Wrong alignment on Optimized_ABP_ZombieDeadBody_C_AnimGraph");
static_assert(sizeof(Optimized_ABP_ZombieDeadBody_C_AnimGraph) == 0x000010, "Wrong size on Optimized_ABP_ZombieDeadBody_C_AnimGraph");
static_assert(offsetof(Optimized_ABP_ZombieDeadBody_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'Optimized_ABP_ZombieDeadBody_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function Optimized_ABP_ZombieDeadBody.Optimized_ABP_ZombieDeadBody_C.ExecuteUbergraph_Optimized_ABP_ZombieDeadBody
// 0x0030 (0x0030 - 0x0000)
struct Optimized_ABP_ZombieDeadBody_C_ExecuteUbergraph_Optimized_ABP_ZombieDeadBody final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AZombieDeadBody_C*                      K2Node_DynamicCast_AsZombie_Dead_Body;             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AZombie_C*                              K2Node_DynamicCast_AsZombie;                       // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Optimized_ABP_ZombieDeadBody_C_ExecuteUbergraph_Optimized_ABP_ZombieDeadBody) == 0x000008, "Wrong alignment on Optimized_ABP_ZombieDeadBody_C_ExecuteUbergraph_Optimized_ABP_ZombieDeadBody");
static_assert(sizeof(Optimized_ABP_ZombieDeadBody_C_ExecuteUbergraph_Optimized_ABP_ZombieDeadBody) == 0x000030, "Wrong size on Optimized_ABP_ZombieDeadBody_C_ExecuteUbergraph_Optimized_ABP_ZombieDeadBody");
static_assert(offsetof(Optimized_ABP_ZombieDeadBody_C_ExecuteUbergraph_Optimized_ABP_ZombieDeadBody, EntryPoint) == 0x000000, "Member 'Optimized_ABP_ZombieDeadBody_C_ExecuteUbergraph_Optimized_ABP_ZombieDeadBody::EntryPoint' has a wrong offset!");
static_assert(offsetof(Optimized_ABP_ZombieDeadBody_C_ExecuteUbergraph_Optimized_ABP_ZombieDeadBody, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000008, "Member 'Optimized_ABP_ZombieDeadBody_C_ExecuteUbergraph_Optimized_ABP_ZombieDeadBody::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Optimized_ABP_ZombieDeadBody_C_ExecuteUbergraph_Optimized_ABP_ZombieDeadBody, K2Node_DynamicCast_AsZombie_Dead_Body) == 0x000010, "Member 'Optimized_ABP_ZombieDeadBody_C_ExecuteUbergraph_Optimized_ABP_ZombieDeadBody::K2Node_DynamicCast_AsZombie_Dead_Body' has a wrong offset!");
static_assert(offsetof(Optimized_ABP_ZombieDeadBody_C_ExecuteUbergraph_Optimized_ABP_ZombieDeadBody, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'Optimized_ABP_ZombieDeadBody_C_ExecuteUbergraph_Optimized_ABP_ZombieDeadBody::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Optimized_ABP_ZombieDeadBody_C_ExecuteUbergraph_Optimized_ABP_ZombieDeadBody, K2Node_DynamicCast_AsZombie) == 0x000020, "Member 'Optimized_ABP_ZombieDeadBody_C_ExecuteUbergraph_Optimized_ABP_ZombieDeadBody::K2Node_DynamicCast_AsZombie' has a wrong offset!");
static_assert(offsetof(Optimized_ABP_ZombieDeadBody_C_ExecuteUbergraph_Optimized_ABP_ZombieDeadBody, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'Optimized_ABP_ZombieDeadBody_C_ExecuteUbergraph_Optimized_ABP_ZombieDeadBody::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

