#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ParentAIDetourController

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Survival_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_PerceptionType_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK::Params
{

// Function ParentAIDetourController.ParentAIDetourController_C.ActorHeared
// 0x000D (0x000D - 0x0000)
struct ParentAIDetourController_C_ActorHeared final
{
public:
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSpecialZombie_IsSpecial;                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_2;        // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_3;        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Can_Detect_Special_Zombie_CanDetect;      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_4;        // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_5;        // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ParentAIDetourController_C_ActorHeared) == 0x000001, "Wrong alignment on ParentAIDetourController_C_ActorHeared");
static_assert(sizeof(ParentAIDetourController_C_ActorHeared) == 0x00000D, "Wrong size on ParentAIDetourController_C_ActorHeared");
static_assert(offsetof(ParentAIDetourController_C_ActorHeared, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000000, "Member 'ParentAIDetourController_C_ActorHeared::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_ActorHeared, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x000001, "Member 'ParentAIDetourController_C_ActorHeared::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_ActorHeared, CallFunc_IsSpecialZombie_IsSpecial) == 0x000002, "Member 'ParentAIDetourController_C_ActorHeared::CallFunc_IsSpecialZombie_IsSpecial' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_ActorHeared, CallFunc_EqualEqual_NameName_ReturnValue_2) == 0x000003, "Member 'ParentAIDetourController_C_ActorHeared::CallFunc_EqualEqual_NameName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_ActorHeared, CallFunc_EqualEqual_NameName_ReturnValue_3) == 0x000004, "Member 'ParentAIDetourController_C_ActorHeared::CallFunc_EqualEqual_NameName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_ActorHeared, CallFunc_Can_Detect_Special_Zombie_CanDetect) == 0x000005, "Member 'ParentAIDetourController_C_ActorHeared::CallFunc_Can_Detect_Special_Zombie_CanDetect' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_ActorHeared, CallFunc_EqualEqual_NameName_ReturnValue_4) == 0x000006, "Member 'ParentAIDetourController_C_ActorHeared::CallFunc_EqualEqual_NameName_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_ActorHeared, CallFunc_EqualEqual_NameName_ReturnValue_5) == 0x000007, "Member 'ParentAIDetourController_C_ActorHeared::CallFunc_EqualEqual_NameName_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_ActorHeared, CallFunc_BooleanOR_ReturnValue) == 0x000008, "Member 'ParentAIDetourController_C_ActorHeared::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_ActorHeared, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'ParentAIDetourController_C_ActorHeared::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_ActorHeared, CallFunc_BooleanOR_ReturnValue_1) == 0x00000A, "Member 'ParentAIDetourController_C_ActorHeared::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_ActorHeared, CallFunc_BooleanOR_ReturnValue_2) == 0x00000B, "Member 'ParentAIDetourController_C_ActorHeared::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_ActorHeared, CallFunc_BooleanOR_ReturnValue_3) == 0x00000C, "Member 'ParentAIDetourController_C_ActorHeared::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");

// Function ParentAIDetourController.ParentAIDetourController_C.ActorSeen
// 0x0050 (0x0050 - 0x0000)
struct ParentAIDetourController_C_ActorSeen final
{
public:
	class AActor*                                 SeenActor;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          DamageSense;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_V2_C*                   K2Node_DynamicCast_AsSurvival_Player_V2;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AAVS_VehicleMaster_C*                   K2Node_DynamicCast_AsAVS_Vehicle_Master;           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_Target_Car_ReturnValue;                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_V2_C*                   K2Node_DynamicCast_AsSurvival_Player_V2_1;         // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckIsClosest_IsClosest;                 // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ParentAIDetourController_C_ActorSeen) == 0x000008, "Wrong alignment on ParentAIDetourController_C_ActorSeen");
static_assert(sizeof(ParentAIDetourController_C_ActorSeen) == 0x000050, "Wrong size on ParentAIDetourController_C_ActorSeen");
static_assert(offsetof(ParentAIDetourController_C_ActorSeen, SeenActor) == 0x000000, "Member 'ParentAIDetourController_C_ActorSeen::SeenActor' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_ActorSeen, DamageSense) == 0x000008, "Member 'ParentAIDetourController_C_ActorSeen::DamageSense' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_ActorSeen, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'ParentAIDetourController_C_ActorSeen::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_ActorSeen, K2Node_DynamicCast_AsSurvival_Player_V2) == 0x000010, "Member 'ParentAIDetourController_C_ActorSeen::K2Node_DynamicCast_AsSurvival_Player_V2' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_ActorSeen, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'ParentAIDetourController_C_ActorSeen::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_ActorSeen, CallFunc_IsValid_ReturnValue_1) == 0x000019, "Member 'ParentAIDetourController_C_ActorSeen::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_ActorSeen, K2Node_DynamicCast_AsAVS_Vehicle_Master) == 0x000020, "Member 'ParentAIDetourController_C_ActorSeen::K2Node_DynamicCast_AsAVS_Vehicle_Master' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_ActorSeen, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'ParentAIDetourController_C_ActorSeen::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_ActorSeen, CallFunc_Is_Target_Car_ReturnValue) == 0x000029, "Member 'ParentAIDetourController_C_ActorSeen::CallFunc_Is_Target_Car_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_ActorSeen, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'ParentAIDetourController_C_ActorSeen::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_ActorSeen, CallFunc_BooleanAND_ReturnValue) == 0x000030, "Member 'ParentAIDetourController_C_ActorSeen::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_ActorSeen, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000031, "Member 'ParentAIDetourController_C_ActorSeen::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_ActorSeen, K2Node_DynamicCast_AsSurvival_Player_V2_1) == 0x000038, "Member 'ParentAIDetourController_C_ActorSeen::K2Node_DynamicCast_AsSurvival_Player_V2_1' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_ActorSeen, K2Node_DynamicCast_bSuccess_2) == 0x000040, "Member 'ParentAIDetourController_C_ActorSeen::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_ActorSeen, CallFunc_BooleanAND_ReturnValue_1) == 0x000041, "Member 'ParentAIDetourController_C_ActorSeen::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_ActorSeen, CallFunc_CheckIsClosest_IsClosest) == 0x000042, "Member 'ParentAIDetourController_C_ActorSeen::CallFunc_CheckIsClosest_IsClosest' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_ActorSeen, CallFunc_BooleanOR_ReturnValue) == 0x000043, "Member 'ParentAIDetourController_C_ActorSeen::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_ActorSeen, CallFunc_BooleanOR_ReturnValue_1) == 0x000044, "Member 'ParentAIDetourController_C_ActorSeen::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_ActorSeen, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000045, "Member 'ParentAIDetourController_C_ActorSeen::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_ActorSeen, CallFunc_Array_Add_ReturnValue) == 0x000048, "Member 'ParentAIDetourController_C_ActorSeen::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_ActorSeen, CallFunc_Array_Contains_ReturnValue) == 0x00004C, "Member 'ParentAIDetourController_C_ActorSeen::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");

// Function ParentAIDetourController.ParentAIDetourController_C.Adjust Movement LOD
// 0x0058 (0x0058 - 0x0000)
struct ParentAIDetourController_C_Adjust_Movement_LOD final
{
public:
	int32                                         Min_LOD_index;                                     // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Map_Find_Value;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Map_Find_Value_1;                         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Map_Find_Value_2;                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_2;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSpecialZombie_IsSpecial;                // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_Map_Values_Values;                        // 0x0038(0x0010)(ReferenceParm)
	int32                                         CallFunc_MinOfIntArray_IndexOfMinValue;            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MinOfIntArray_MinValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetComponentTickInterval_TickInterval_ImplicitCast; // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ParentAIDetourController_C_Adjust_Movement_LOD) == 0x000008, "Wrong alignment on ParentAIDetourController_C_Adjust_Movement_LOD");
static_assert(sizeof(ParentAIDetourController_C_Adjust_Movement_LOD) == 0x000058, "Wrong size on ParentAIDetourController_C_Adjust_Movement_LOD");
static_assert(offsetof(ParentAIDetourController_C_Adjust_Movement_LOD, Min_LOD_index) == 0x000000, "Member 'ParentAIDetourController_C_Adjust_Movement_LOD::Min_LOD_index' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_Adjust_Movement_LOD, CallFunc_Map_Find_Value) == 0x000008, "Member 'ParentAIDetourController_C_Adjust_Movement_LOD::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_Adjust_Movement_LOD, CallFunc_Map_Find_ReturnValue) == 0x000010, "Member 'ParentAIDetourController_C_Adjust_Movement_LOD::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_Adjust_Movement_LOD, CallFunc_Map_Find_Value_1) == 0x000018, "Member 'ParentAIDetourController_C_Adjust_Movement_LOD::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_Adjust_Movement_LOD, CallFunc_Map_Find_ReturnValue_1) == 0x000020, "Member 'ParentAIDetourController_C_Adjust_Movement_LOD::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_Adjust_Movement_LOD, CallFunc_Map_Find_Value_2) == 0x000028, "Member 'ParentAIDetourController_C_Adjust_Movement_LOD::CallFunc_Map_Find_Value_2' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_Adjust_Movement_LOD, CallFunc_Map_Find_ReturnValue_2) == 0x000030, "Member 'ParentAIDetourController_C_Adjust_Movement_LOD::CallFunc_Map_Find_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_Adjust_Movement_LOD, CallFunc_IsSpecialZombie_IsSpecial) == 0x000031, "Member 'ParentAIDetourController_C_Adjust_Movement_LOD::CallFunc_IsSpecialZombie_IsSpecial' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_Adjust_Movement_LOD, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000032, "Member 'ParentAIDetourController_C_Adjust_Movement_LOD::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_Adjust_Movement_LOD, CallFunc_Map_Values_Values) == 0x000038, "Member 'ParentAIDetourController_C_Adjust_Movement_LOD::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_Adjust_Movement_LOD, CallFunc_MinOfIntArray_IndexOfMinValue) == 0x000048, "Member 'ParentAIDetourController_C_Adjust_Movement_LOD::CallFunc_MinOfIntArray_IndexOfMinValue' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_Adjust_Movement_LOD, CallFunc_MinOfIntArray_MinValue) == 0x00004C, "Member 'ParentAIDetourController_C_Adjust_Movement_LOD::CallFunc_MinOfIntArray_MinValue' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_Adjust_Movement_LOD, CallFunc_SetComponentTickInterval_TickInterval_ImplicitCast) == 0x000050, "Member 'ParentAIDetourController_C_Adjust_Movement_LOD::CallFunc_SetComponentTickInterval_TickInterval_ImplicitCast' has a wrong offset!");

// Function ParentAIDetourController.ParentAIDetourController_C.BindToDelegates
// 0x0040 (0x0040 - 0x0000)
struct ParentAIDetourController_C_BindToDelegates final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* Actor, EEndPlayReason EndPlayReason)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ParentAIDetourController_C_BindToDelegates) == 0x000008, "Wrong alignment on ParentAIDetourController_C_BindToDelegates");
static_assert(sizeof(ParentAIDetourController_C_BindToDelegates) == 0x000040, "Wrong size on ParentAIDetourController_C_BindToDelegates");
static_assert(offsetof(ParentAIDetourController_C_BindToDelegates, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'ParentAIDetourController_C_BindToDelegates::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_BindToDelegates, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'ParentAIDetourController_C_BindToDelegates::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_BindToDelegates, K2Node_DynamicCast_AsSurvival_Player) == 0x000020, "Member 'ParentAIDetourController_C_BindToDelegates::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_BindToDelegates, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'ParentAIDetourController_C_BindToDelegates::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_BindToDelegates, K2Node_CreateDelegate_OutputDelegate_2) == 0x00002C, "Member 'ParentAIDetourController_C_BindToDelegates::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");

// Function ParentAIDetourController.ParentAIDetourController_C.BndEvt__AIPerception_K2Node_ComponentBoundEvent_3_ActorPerceptionUpdatedDelegate__DelegateSignature
// 0x0060 (0x0060 - 0x0000)
struct ParentAIDetourController_C_BndEvt__AIPerception_K2Node_ComponentBoundEvent_3_ActorPerceptionUpdatedDelegate__DelegateSignature final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAIStimulus                            Stimulus;                                          // 0x0008(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(ParentAIDetourController_C_BndEvt__AIPerception_K2Node_ComponentBoundEvent_3_ActorPerceptionUpdatedDelegate__DelegateSignature) == 0x000008, "Wrong alignment on ParentAIDetourController_C_BndEvt__AIPerception_K2Node_ComponentBoundEvent_3_ActorPerceptionUpdatedDelegate__DelegateSignature");
static_assert(sizeof(ParentAIDetourController_C_BndEvt__AIPerception_K2Node_ComponentBoundEvent_3_ActorPerceptionUpdatedDelegate__DelegateSignature) == 0x000060, "Wrong size on ParentAIDetourController_C_BndEvt__AIPerception_K2Node_ComponentBoundEvent_3_ActorPerceptionUpdatedDelegate__DelegateSignature");
static_assert(offsetof(ParentAIDetourController_C_BndEvt__AIPerception_K2Node_ComponentBoundEvent_3_ActorPerceptionUpdatedDelegate__DelegateSignature, Actor) == 0x000000, "Member 'ParentAIDetourController_C_BndEvt__AIPerception_K2Node_ComponentBoundEvent_3_ActorPerceptionUpdatedDelegate__DelegateSignature::Actor' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_BndEvt__AIPerception_K2Node_ComponentBoundEvent_3_ActorPerceptionUpdatedDelegate__DelegateSignature, Stimulus) == 0x000008, "Member 'ParentAIDetourController_C_BndEvt__AIPerception_K2Node_ComponentBoundEvent_3_ActorPerceptionUpdatedDelegate__DelegateSignature::Stimulus' has a wrong offset!");

// Function ParentAIDetourController.ParentAIDetourController_C.BndEvt__ParentAIDetourController_PawnSensing_K2Node_ComponentBoundEvent_0_SeePawnDelegate__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ParentAIDetourController_C_BndEvt__ParentAIDetourController_PawnSensing_K2Node_ComponentBoundEvent_0_SeePawnDelegate__DelegateSignature final
{
public:
	class APawn*                                  Param_Pawn;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ParentAIDetourController_C_BndEvt__ParentAIDetourController_PawnSensing_K2Node_ComponentBoundEvent_0_SeePawnDelegate__DelegateSignature) == 0x000008, "Wrong alignment on ParentAIDetourController_C_BndEvt__ParentAIDetourController_PawnSensing_K2Node_ComponentBoundEvent_0_SeePawnDelegate__DelegateSignature");
static_assert(sizeof(ParentAIDetourController_C_BndEvt__ParentAIDetourController_PawnSensing_K2Node_ComponentBoundEvent_0_SeePawnDelegate__DelegateSignature) == 0x000008, "Wrong size on ParentAIDetourController_C_BndEvt__ParentAIDetourController_PawnSensing_K2Node_ComponentBoundEvent_0_SeePawnDelegate__DelegateSignature");
static_assert(offsetof(ParentAIDetourController_C_BndEvt__ParentAIDetourController_PawnSensing_K2Node_ComponentBoundEvent_0_SeePawnDelegate__DelegateSignature, Param_Pawn) == 0x000000, "Member 'ParentAIDetourController_C_BndEvt__ParentAIDetourController_PawnSensing_K2Node_ComponentBoundEvent_0_SeePawnDelegate__DelegateSignature::Param_Pawn' has a wrong offset!");

// Function ParentAIDetourController.ParentAIDetourController_C.CalculateDistance
// 0x0050 (0x0050 - 0x0000)
struct ParentAIDetourController_C_CalculateDistance final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	double                                        Distance;                                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ParentAIDetourController_C_CalculateDistance) == 0x000008, "Wrong alignment on ParentAIDetourController_C_CalculateDistance");
static_assert(sizeof(ParentAIDetourController_C_CalculateDistance) == 0x000050, "Wrong size on ParentAIDetourController_C_CalculateDistance");
static_assert(offsetof(ParentAIDetourController_C_CalculateDistance, Actor) == 0x000000, "Member 'ParentAIDetourController_C_CalculateDistance::Actor' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_CalculateDistance, Distance) == 0x000008, "Member 'ParentAIDetourController_C_CalculateDistance::Distance' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_CalculateDistance, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'ParentAIDetourController_C_CalculateDistance::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_CalculateDistance, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'ParentAIDetourController_C_CalculateDistance::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_CalculateDistance, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000030, "Member 'ParentAIDetourController_C_CalculateDistance::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_CalculateDistance, CallFunc_Vector_Distance_ReturnValue) == 0x000048, "Member 'ParentAIDetourController_C_CalculateDistance::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");

// Function ParentAIDetourController.ParentAIDetourController_C.Can Detect Special Zombie
// 0x0058 (0x0058 - 0x0000)
struct ParentAIDetourController_C_Can_Detect_Special_Zombie final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CanDetect;                                         // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSpecialZombie_IsSpecial;                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ParentAIDetourController_C_Can_Detect_Special_Zombie) == 0x000008, "Wrong alignment on ParentAIDetourController_C_Can_Detect_Special_Zombie");
static_assert(sizeof(ParentAIDetourController_C_Can_Detect_Special_Zombie) == 0x000058, "Wrong size on ParentAIDetourController_C_Can_Detect_Special_Zombie");
static_assert(offsetof(ParentAIDetourController_C_Can_Detect_Special_Zombie, Actor) == 0x000000, "Member 'ParentAIDetourController_C_Can_Detect_Special_Zombie::Actor' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_Can_Detect_Special_Zombie, CanDetect) == 0x000008, "Member 'ParentAIDetourController_C_Can_Detect_Special_Zombie::CanDetect' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_Can_Detect_Special_Zombie, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'ParentAIDetourController_C_Can_Detect_Special_Zombie::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_Can_Detect_Special_Zombie, CallFunc_IsSpecialZombie_IsSpecial) == 0x000028, "Member 'ParentAIDetourController_C_Can_Detect_Special_Zombie::CallFunc_IsSpecialZombie_IsSpecial' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_Can_Detect_Special_Zombie, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000030, "Member 'ParentAIDetourController_C_Can_Detect_Special_Zombie::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_Can_Detect_Special_Zombie, CallFunc_Vector_Distance_ReturnValue) == 0x000048, "Member 'ParentAIDetourController_C_Can_Detect_Special_Zombie::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_Can_Detect_Special_Zombie, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000050, "Member 'ParentAIDetourController_C_Can_Detect_Special_Zombie::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");

// Function ParentAIDetourController.ParentAIDetourController_C.CantHear
// 0x0001 (0x0001 - 0x0000)
struct ParentAIDetourController_C_CantHear final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ParentAIDetourController_C_CantHear) == 0x000001, "Wrong alignment on ParentAIDetourController_C_CantHear");
static_assert(sizeof(ParentAIDetourController_C_CantHear) == 0x000001, "Wrong size on ParentAIDetourController_C_CantHear");
static_assert(offsetof(ParentAIDetourController_C_CantHear, ReturnValue) == 0x000000, "Member 'ParentAIDetourController_C_CantHear::ReturnValue' has a wrong offset!");

// Function ParentAIDetourController.ParentAIDetourController_C.CantSee
// 0x0004 (0x0004 - 0x0000)
struct ParentAIDetourController_C_CantSee final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Can_Detect_Special_Zombie_CanDetect;      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ParentAIDetourController_C_CantSee) == 0x000001, "Wrong alignment on ParentAIDetourController_C_CantSee");
static_assert(sizeof(ParentAIDetourController_C_CantSee) == 0x000004, "Wrong size on ParentAIDetourController_C_CantSee");
static_assert(offsetof(ParentAIDetourController_C_CantSee, ReturnValue) == 0x000000, "Member 'ParentAIDetourController_C_CantSee::ReturnValue' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_CantSee, CallFunc_Can_Detect_Special_Zombie_CanDetect) == 0x000001, "Member 'ParentAIDetourController_C_CantSee::CallFunc_Can_Detect_Special_Zombie_CanDetect' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_CantSee, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'ParentAIDetourController_C_CantSee::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_CantSee, CallFunc_BooleanOR_ReturnValue) == 0x000003, "Member 'ParentAIDetourController_C_CantSee::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function ParentAIDetourController.ParentAIDetourController_C.CheckForClearView
// 0x0220 (0x0220 - 0x0000)
struct ParentAIDetourController_C_CheckForClearView final
{
public:
	bool                                          Clear;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 HitActor;                                          // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0010(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0060(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14B[0x1];                                      // 0x014B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ParentAIDetourController_C_CheckForClearView) == 0x000008, "Wrong alignment on ParentAIDetourController_C_CheckForClearView");
static_assert(sizeof(ParentAIDetourController_C_CheckForClearView) == 0x000220, "Wrong size on ParentAIDetourController_C_CheckForClearView");
static_assert(offsetof(ParentAIDetourController_C_CheckForClearView, Clear) == 0x000000, "Member 'ParentAIDetourController_C_CheckForClearView::Clear' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_CheckForClearView, HitActor) == 0x000008, "Member 'ParentAIDetourController_C_CheckForClearView::HitActor' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_CheckForClearView, Temp_object_Variable) == 0x000010, "Member 'ParentAIDetourController_C_CheckForClearView::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_CheckForClearView, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'ParentAIDetourController_C_CheckForClearView::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_CheckForClearView, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000028, "Member 'ParentAIDetourController_C_CheckForClearView::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_CheckForClearView, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000040, "Member 'ParentAIDetourController_C_CheckForClearView::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_CheckForClearView, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000048, "Member 'ParentAIDetourController_C_CheckForClearView::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_CheckForClearView, CallFunc_LineTraceSingle_OutHit) == 0x000060, "Member 'ParentAIDetourController_C_CheckForClearView::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_CheckForClearView, CallFunc_LineTraceSingle_ReturnValue) == 0x000148, "Member 'ParentAIDetourController_C_CheckForClearView::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_CheckForClearView, CallFunc_BreakHitResult_bBlockingHit) == 0x000149, "Member 'ParentAIDetourController_C_CheckForClearView::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_CheckForClearView, CallFunc_BreakHitResult_bInitialOverlap) == 0x00014A, "Member 'ParentAIDetourController_C_CheckForClearView::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_CheckForClearView, CallFunc_BreakHitResult_Time) == 0x00014C, "Member 'ParentAIDetourController_C_CheckForClearView::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_CheckForClearView, CallFunc_BreakHitResult_Distance) == 0x000150, "Member 'ParentAIDetourController_C_CheckForClearView::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_CheckForClearView, CallFunc_BreakHitResult_Location) == 0x000158, "Member 'ParentAIDetourController_C_CheckForClearView::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_CheckForClearView, CallFunc_BreakHitResult_ImpactPoint) == 0x000170, "Member 'ParentAIDetourController_C_CheckForClearView::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_CheckForClearView, CallFunc_BreakHitResult_Normal) == 0x000188, "Member 'ParentAIDetourController_C_CheckForClearView::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_CheckForClearView, CallFunc_BreakHitResult_ImpactNormal) == 0x0001A0, "Member 'ParentAIDetourController_C_CheckForClearView::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_CheckForClearView, CallFunc_BreakHitResult_PhysMat) == 0x0001B8, "Member 'ParentAIDetourController_C_CheckForClearView::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_CheckForClearView, CallFunc_BreakHitResult_HitActor) == 0x0001C0, "Member 'ParentAIDetourController_C_CheckForClearView::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_CheckForClearView, CallFunc_BreakHitResult_HitComponent) == 0x0001C8, "Member 'ParentAIDetourController_C_CheckForClearView::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_CheckForClearView, CallFunc_BreakHitResult_HitBoneName) == 0x0001D0, "Member 'ParentAIDetourController_C_CheckForClearView::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_CheckForClearView, CallFunc_BreakHitResult_BoneName) == 0x0001D8, "Member 'ParentAIDetourController_C_CheckForClearView::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_CheckForClearView, CallFunc_BreakHitResult_HitItem) == 0x0001E0, "Member 'ParentAIDetourController_C_CheckForClearView::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_CheckForClearView, CallFunc_BreakHitResult_ElementIndex) == 0x0001E4, "Member 'ParentAIDetourController_C_CheckForClearView::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_CheckForClearView, CallFunc_BreakHitResult_FaceIndex) == 0x0001E8, "Member 'ParentAIDetourController_C_CheckForClearView::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_CheckForClearView, CallFunc_BreakHitResult_TraceStart) == 0x0001F0, "Member 'ParentAIDetourController_C_CheckForClearView::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_CheckForClearView, CallFunc_BreakHitResult_TraceEnd) == 0x000208, "Member 'ParentAIDetourController_C_CheckForClearView::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");

// Function ParentAIDetourController.ParentAIDetourController_C.CheckIsClosest
// 0x0070 (0x0070 - 0x0000)
struct ParentAIDetourController_C_CheckIsClosest final
{
public:
	class AActor*                                 SeenActor;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	bool                                          IsClosest;                                         // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CurrentDistance;                                   // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CurrentLocalActor;                                 // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	double                                        MinDistance;                                       // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 ClosestActor;                                      // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTargetEmptyCar_Result;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_Target_Car_ReturnValue;                // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTargetEmptyCar_Result_1;                // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_Target_Car_ReturnValue_1;              // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_CalculateDIstance_Distance;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B[0x5];                                       // 0x005B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ParentAIDetourController_C_CheckIsClosest) == 0x000008, "Wrong alignment on ParentAIDetourController_C_CheckIsClosest");
static_assert(sizeof(ParentAIDetourController_C_CheckIsClosest) == 0x000070, "Wrong size on ParentAIDetourController_C_CheckIsClosest");
static_assert(offsetof(ParentAIDetourController_C_CheckIsClosest, SeenActor) == 0x000000, "Member 'ParentAIDetourController_C_CheckIsClosest::SeenActor' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_CheckIsClosest, IsClosest) == 0x000008, "Member 'ParentAIDetourController_C_CheckIsClosest::IsClosest' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_CheckIsClosest, CurrentDistance) == 0x000010, "Member 'ParentAIDetourController_C_CheckIsClosest::CurrentDistance' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_CheckIsClosest, CurrentLocalActor) == 0x000018, "Member 'ParentAIDetourController_C_CheckIsClosest::CurrentLocalActor' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_CheckIsClosest, MinDistance) == 0x000020, "Member 'ParentAIDetourController_C_CheckIsClosest::MinDistance' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_CheckIsClosest, ClosestActor) == 0x000028, "Member 'ParentAIDetourController_C_CheckIsClosest::ClosestActor' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_CheckIsClosest, CallFunc_IsTargetEmptyCar_Result) == 0x000030, "Member 'ParentAIDetourController_C_CheckIsClosest::CallFunc_IsTargetEmptyCar_Result' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_CheckIsClosest, CallFunc_Is_Target_Car_ReturnValue) == 0x000031, "Member 'ParentAIDetourController_C_CheckIsClosest::CallFunc_Is_Target_Car_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_CheckIsClosest, Temp_int_Array_Index_Variable) == 0x000034, "Member 'ParentAIDetourController_C_CheckIsClosest::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_CheckIsClosest, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'ParentAIDetourController_C_CheckIsClosest::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_CheckIsClosest, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'ParentAIDetourController_C_CheckIsClosest::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_CheckIsClosest, CallFunc_BooleanOR_ReturnValue) == 0x000040, "Member 'ParentAIDetourController_C_CheckIsClosest::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_CheckIsClosest, CallFunc_BooleanOR_ReturnValue_1) == 0x000041, "Member 'ParentAIDetourController_C_CheckIsClosest::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ParentAIDetourController_C_CheckIsClosest, CallFunc_BooleanAND_ReturnValue) == 0x000042, "Member 'ParentAIDetourController_C_CheckIsClosest::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
