#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ParentAI

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "E_AIType_structs.hpp"
#include "Engine_structs.hpp"
#include "BPE_Weapon_Type_structs.hpp"


namespace SDK::Params
{

// Function ParentAI.ParentAI_C.Activate(Render)_MULTI
// 0x0001 (0x0001 - 0x0000)
struct ParentAI_C_Activate_Render__MULTI final
{
public:
	bool                                          Activtae_;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ParentAI_C_Activate_Render__MULTI) == 0x000001, "Wrong alignment on ParentAI_C_Activate_Render__MULTI");
static_assert(sizeof(ParentAI_C_Activate_Render__MULTI) == 0x000001, "Wrong size on ParentAI_C_Activate_Render__MULTI");
static_assert(offsetof(ParentAI_C_Activate_Render__MULTI, Activtae_) == 0x000000, "Member 'ParentAI_C_Activate_Render__MULTI::Activtae_' has a wrong offset!");

// Function ParentAI.ParentAI_C.AIInteract
// 0x0010 (0x0010 - 0x0000)
struct ParentAI_C_AIInteract final
{
public:
	class ABP_Door_C*                             Door;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ParentAI_C_AIInteract) == 0x000008, "Wrong alignment on ParentAI_C_AIInteract");
static_assert(sizeof(ParentAI_C_AIInteract) == 0x000010, "Wrong size on ParentAI_C_AIInteract");
static_assert(offsetof(ParentAI_C_AIInteract, Door) == 0x000000, "Member 'ParentAI_C_AIInteract::Door' has a wrong offset!");
static_assert(offsetof(ParentAI_C_AIInteract, Arrow) == 0x000008, "Member 'ParentAI_C_AIInteract::Arrow' has a wrong offset!");

// Function ParentAI.ParentAI_C.ChangeNavFilterClass
// 0x0018 (0x0018 - 0x0000)
struct ParentAI_C_ChangeNavFilterClass final
{
public:
	class UClass*                                 DefaultNavigationFilterClass;                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          CallFunc_GetAIController_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ParentAI_C_ChangeNavFilterClass) == 0x000008, "Wrong alignment on ParentAI_C_ChangeNavFilterClass");
static_assert(sizeof(ParentAI_C_ChangeNavFilterClass) == 0x000018, "Wrong size on ParentAI_C_ChangeNavFilterClass");
static_assert(offsetof(ParentAI_C_ChangeNavFilterClass, DefaultNavigationFilterClass) == 0x000000, "Member 'ParentAI_C_ChangeNavFilterClass::DefaultNavigationFilterClass' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ChangeNavFilterClass, CallFunc_HasAuthority_ReturnValue) == 0x000008, "Member 'ParentAI_C_ChangeNavFilterClass::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ChangeNavFilterClass, CallFunc_GetAIController_ReturnValue) == 0x000010, "Member 'ParentAI_C_ChangeNavFilterClass::CallFunc_GetAIController_ReturnValue' has a wrong offset!");

// Function ParentAI.ParentAI_C.Death
// 0x0030 (0x0030 - 0x0000)
struct ParentAI_C_Death final
{
public:
	class AController*                            InstigatedBy;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        HitAngle;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation;                                       // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BoneName;                                          // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ParentAI_C_Death) == 0x000008, "Wrong alignment on ParentAI_C_Death");
static_assert(sizeof(ParentAI_C_Death) == 0x000030, "Wrong size on ParentAI_C_Death");
static_assert(offsetof(ParentAI_C_Death, InstigatedBy) == 0x000000, "Member 'ParentAI_C_Death::InstigatedBy' has a wrong offset!");
static_assert(offsetof(ParentAI_C_Death, HitAngle) == 0x000008, "Member 'ParentAI_C_Death::HitAngle' has a wrong offset!");
static_assert(offsetof(ParentAI_C_Death, HitLocation) == 0x000010, "Member 'ParentAI_C_Death::HitLocation' has a wrong offset!");
static_assert(offsetof(ParentAI_C_Death, BoneName) == 0x000028, "Member 'ParentAI_C_Death::BoneName' has a wrong offset!");

// Function ParentAI.ParentAI_C.EnableHearing
// 0x0018 (0x0018 - 0x0000)
struct ParentAI_C_EnableHearing final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          CallFunc_GetAIController_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAIPerceptionComponent*                 CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ParentAI_C_EnableHearing) == 0x000008, "Wrong alignment on ParentAI_C_EnableHearing");
static_assert(sizeof(ParentAI_C_EnableHearing) == 0x000018, "Wrong size on ParentAI_C_EnableHearing");
static_assert(offsetof(ParentAI_C_EnableHearing, bEnable) == 0x000000, "Member 'ParentAI_C_EnableHearing::bEnable' has a wrong offset!");
static_assert(offsetof(ParentAI_C_EnableHearing, CallFunc_GetAIController_ReturnValue) == 0x000008, "Member 'ParentAI_C_EnableHearing::CallFunc_GetAIController_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParentAI_C_EnableHearing, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'ParentAI_C_EnableHearing::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");

// Function ParentAI.ParentAI_C.EnableSight
// 0x0018 (0x0018 - 0x0000)
struct ParentAI_C_EnableSight final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          CallFunc_GetAIController_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAIPerceptionComponent*                 CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ParentAI_C_EnableSight) == 0x000008, "Wrong alignment on ParentAI_C_EnableSight");
static_assert(sizeof(ParentAI_C_EnableSight) == 0x000018, "Wrong size on ParentAI_C_EnableSight");
static_assert(offsetof(ParentAI_C_EnableSight, bEnable) == 0x000000, "Member 'ParentAI_C_EnableSight::bEnable' has a wrong offset!");
static_assert(offsetof(ParentAI_C_EnableSight, CallFunc_GetAIController_ReturnValue) == 0x000008, "Member 'ParentAI_C_EnableSight::CallFunc_GetAIController_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParentAI_C_EnableSight, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'ParentAI_C_EnableSight::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");

// Function ParentAI.ParentAI_C.ExecuteUbergraph_ParentAI
// 0x0410 (0x0410 - 0x0000)
struct ParentAI_C_ExecuteUbergraph_ParentAI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue;           // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_NormalizedDeltaRotator_ReturnValue;       // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76[0x2];                                       // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0078(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Door_C*                             K2Node_Event_Door;                                 // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        K2Node_Event_arrow;                                // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AController*                            K2Node_CustomEvent_InstigatedBy;                   // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_HitAngle_1;                     // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_HitLocation_1;                  // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_BoneName_1;                     // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_1;            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x00D8(0x0010)(ReferenceParm)
	class FName                                   K2Node_CustomEvent_BoneName;                       // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_HitAngle;                       // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_HitLocation;                    // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_113[0x5];                                      // 0x0113(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14A[0x2];                                      // 0x014A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetParentBone_ReturnValue;                // 0x014C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_Speed_3;                        // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Speed_2;                        // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Speed_1;                        // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Speed;                          // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent___1;                            // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent__;                              // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x01A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A3[0x1];                                      // 0x01A3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x01A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x01B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 K2Node_CustomEvent_Mesh;                           // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_CustomEvent_Montage;                        // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_WithoutServer_;                 // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                             K2Node_CustomEvent_FMODEvent;                      // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        K2Node_CustomEvent_AttachToComponent;              // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Occlusion_;                     // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFMODAudioComponent*                    CallFunc_FMODPlayEventAttached_ReturnValue;        // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x3];                                      // 0x0201(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0204(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x020C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        K2Node_CustomEvent_EmitterTemplate;                // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Location;                       // 0x0220(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_CustomEvent_Rotation;                       // 0x0238(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_CustomEvent_Scale;                          // 0x0250(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0268(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_InBlendOutTime;                 // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0278(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Stop_;                          // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_281[0x3];                                      // 0x0281(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x0284(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_294[0x4];                                      // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameMode_C>       K2Node_DynamicCast_AsBPI_Game_Mode;                // 0x02A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPawnRendered__Rendered_;                // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Activtae_;                      // 0x02B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x02B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B5[0x3];                                      // 0x02B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_Value;                          // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          CallFunc_GetAIController_ReturnValue;              // 0x02D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          CallFunc_GetAIController_ReturnValue_1;            // 0x02E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue_1;              // 0x02F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_2;            // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_3;            // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_4;            // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_5;            // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_6;            // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x0328(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x0340(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0351(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_352[0x2];                                      // 0x0352(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x0354(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x035C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x035D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_2;               // 0x035E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35F[0x1];                                      // 0x035F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue_1;         // 0x0360(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_1;        // 0x0378(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_NormalizedDeltaRotator_ReturnValue_1;     // 0x0390(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFMODAudioComponent*                    CallFunc_PlayEventWithOcclusion_FMODAudioComponent; // 0x03A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x03B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x03BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x03BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x03BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_2;                     // 0x03BF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_Pitch_R_ImplicitCast;           // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_Yaw_R_ImplicitCast;             // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_Yaw_Zombie__R_ImplicitCast;     // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x03D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_MaxWalkSpeed_ImplicitCast;      // 0x03DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_MaxWalkSpeed_ImplicitCast_1;    // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E4[0x4];                                      // 0x03E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SetMoveSpeed_MULTI_Speed_ImplicitCast;    // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_MaxWalkSpeed_ImplicitCast_2;    // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_1;            // 0x03F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetParameter_Value_ImplicitCast;          // 0x03F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FC[0x4];                                      // 0x03FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_Pitch_R_ImplicitCast_1;         // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_Yaw_R_ImplicitCast_1;           // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ParentAI_C_ExecuteUbergraph_ParentAI) == 0x000008, "Wrong alignment on ParentAI_C_ExecuteUbergraph_ParentAI");
static_assert(sizeof(ParentAI_C_ExecuteUbergraph_ParentAI) == 0x000410, "Wrong size on ParentAI_C_ExecuteUbergraph_ParentAI");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, EntryPoint) == 0x000000, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::EntryPoint' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000008, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, CallFunc_GetControlRotation_ReturnValue) == 0x000030, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::CallFunc_GetControlRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, CallFunc_NormalizedDeltaRotator_ReturnValue) == 0x000048, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::CallFunc_NormalizedDeltaRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, K2Node_CustomEvent_NotifyName_4) == 0x000060, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, CallFunc_BreakRotator_Roll) == 0x000068, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, CallFunc_BreakRotator_Pitch) == 0x00006C, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, CallFunc_BreakRotator_Yaw) == 0x000070, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, CallFunc_HasAuthority_ReturnValue) == 0x000074, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, Temp_bool_Has_Been_Initd_Variable) == 0x000075, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, K2Node_CreateDelegate_OutputDelegate_1) == 0x000078, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, K2Node_Event_Door) == 0x000088, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::K2Node_Event_Door' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, K2Node_Event_arrow) == 0x000090, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::K2Node_Event_arrow' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, K2Node_CustomEvent_InstigatedBy) == 0x000098, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::K2Node_CustomEvent_InstigatedBy' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, K2Node_CustomEvent_HitAngle_1) == 0x0000A0, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::K2Node_CustomEvent_HitAngle_1' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, K2Node_CustomEvent_HitLocation_1) == 0x0000A8, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::K2Node_CustomEvent_HitLocation_1' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, K2Node_CustomEvent_BoneName_1) == 0x0000C0, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::K2Node_CustomEvent_BoneName_1' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, CallFunc_MakeLiteralName_ReturnValue) == 0x0000C8, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, CallFunc_MakeLiteralName_ReturnValue_1) == 0x0000D0, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::CallFunc_MakeLiteralName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, K2Node_MakeArray_Array) == 0x0000D8, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, K2Node_CustomEvent_BoneName) == 0x0000E8, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::K2Node_CustomEvent_BoneName' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, K2Node_CustomEvent_HitAngle) == 0x0000F0, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::K2Node_CustomEvent_HitAngle' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, K2Node_CustomEvent_HitLocation) == 0x0000F8, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::K2Node_CustomEvent_HitLocation' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, CallFunc_Array_Contains_ReturnValue) == 0x000110, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, CallFunc_Not_PreBool_ReturnValue) == 0x000111, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, CallFunc_BooleanOR_ReturnValue) == 0x000112, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, CallFunc_GetActorForwardVector_ReturnValue) == 0x000118, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000130, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, Temp_bool_Has_Been_Initd_Variable_1) == 0x000148, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, Temp_bool_IsClosed_Variable) == 0x000149, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, CallFunc_GetParentBone_ReturnValue) == 0x00014C, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::CallFunc_GetParentBone_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, Temp_real_Variable) == 0x000158, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, Temp_real_Variable_1) == 0x000160, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, Temp_bool_Variable) == 0x000168, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, K2Node_CustomEvent_Speed_3) == 0x000170, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::K2Node_CustomEvent_Speed_3' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, K2Node_CustomEvent_Speed_2) == 0x000178, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::K2Node_CustomEvent_Speed_2' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, K2Node_CustomEvent_Speed_1) == 0x000180, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::K2Node_CustomEvent_Speed_1' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000188, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, CallFunc_RandomFloatInRange_ReturnValue) == 0x000190, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, K2Node_CustomEvent_Speed) == 0x000198, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::K2Node_CustomEvent_Speed' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, K2Node_CustomEvent___1) == 0x0001A0, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::K2Node_CustomEvent___1' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, K2Node_CustomEvent__) == 0x0001A1, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::K2Node_CustomEvent__' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, Temp_bool_IsClosed_Variable_1) == 0x0001A2, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, K2Node_Event_DeltaSeconds) == 0x0001A4, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, K2Node_CreateDelegate_OutputDelegate_2) == 0x0001A8, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0001B8, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, K2Node_CustomEvent_Mesh) == 0x0001C0, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::K2Node_CustomEvent_Mesh' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, K2Node_CustomEvent_Montage) == 0x0001C8, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::K2Node_CustomEvent_Montage' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, K2Node_CustomEvent_WithoutServer_) == 0x0001D0, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::K2Node_CustomEvent_WithoutServer_' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x0001D8, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, K2Node_CustomEvent_FMODEvent) == 0x0001E0, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::K2Node_CustomEvent_FMODEvent' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, K2Node_CustomEvent_AttachToComponent) == 0x0001E8, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::K2Node_CustomEvent_AttachToComponent' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, K2Node_CustomEvent_Occlusion_) == 0x0001F0, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::K2Node_CustomEvent_Occlusion_' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, CallFunc_FMODPlayEventAttached_ReturnValue) == 0x0001F8, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::CallFunc_FMODPlayEventAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, CallFunc_IsValid_ReturnValue) == 0x000200, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, Temp_name_Variable) == 0x000204, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, K2Node_CustomEvent_NotifyName) == 0x00020C, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, K2Node_CustomEvent_EmitterTemplate) == 0x000218, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::K2Node_CustomEvent_EmitterTemplate' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, K2Node_CustomEvent_Location) == 0x000220, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::K2Node_CustomEvent_Location' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, K2Node_CustomEvent_Rotation) == 0x000238, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::K2Node_CustomEvent_Rotation' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, K2Node_CustomEvent_Scale) == 0x000250, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::K2Node_CustomEvent_Scale' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000268, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, K2Node_CustomEvent_InBlendOutTime) == 0x000270, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::K2Node_CustomEvent_InBlendOutTime' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, CallFunc_GetBlackboard_ReturnValue) == 0x000278, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, K2Node_CustomEvent_Stop_) == 0x000280, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::K2Node_CustomEvent_Stop_' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, K2Node_CreateDelegate_OutputDelegate_3) == 0x000284, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, CallFunc_GetGameMode_ReturnValue) == 0x000298, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, K2Node_DynamicCast_AsBPI_Game_Mode) == 0x0002A0, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::K2Node_DynamicCast_AsBPI_Game_Mode' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, K2Node_DynamicCast_bSuccess) == 0x0002B0, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, CallFunc_IsPawnRendered__Rendered_) == 0x0002B1, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::CallFunc_IsPawnRendered__Rendered_' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, K2Node_CustomEvent_Activtae_) == 0x0002B2, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::K2Node_CustomEvent_Activtae_' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, CallFunc_HasAuthority_ReturnValue_1) == 0x0002B3, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, CallFunc_BooleanAND_ReturnValue) == 0x0002B4, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, K2Node_Select_Default) == 0x0002B8, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, CallFunc_Not_PreBool_ReturnValue_1) == 0x0002C0, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, K2Node_CustomEvent_Value) == 0x0002C8, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::K2Node_CustomEvent_Value' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, K2Node_CustomEvent_NotifyName_1) == 0x0002D0, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, CallFunc_GetAIController_ReturnValue) == 0x0002D8, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::CallFunc_GetAIController_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, CallFunc_IsValid_ReturnValue_1) == 0x0002E0, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, CallFunc_GetAIController_ReturnValue_1) == 0x0002E8, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::CallFunc_GetAIController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, CallFunc_IsValid_ReturnValue_2) == 0x0002F0, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, CallFunc_GetBlackboard_ReturnValue_1) == 0x0002F8, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::CallFunc_GetBlackboard_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, CallFunc_MakeLiteralName_ReturnValue_2) == 0x000300, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::CallFunc_MakeLiteralName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, CallFunc_MakeLiteralName_ReturnValue_3) == 0x000308, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::CallFunc_MakeLiteralName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, CallFunc_MakeLiteralName_ReturnValue_4) == 0x000310, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::CallFunc_MakeLiteralName_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, CallFunc_MakeLiteralName_ReturnValue_5) == 0x000318, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::CallFunc_MakeLiteralName_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, CallFunc_MakeLiteralName_ReturnValue_6) == 0x000320, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::CallFunc_MakeLiteralName_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, K2Node_CreateDelegate_OutputDelegate_4) == 0x000328, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, K2Node_CustomEvent_NotifyName_2) == 0x000338, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, K2Node_CreateDelegate_OutputDelegate_5) == 0x000340, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, CallFunc_HasAuthority_ReturnValue_2) == 0x000350, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000351, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, K2Node_CustomEvent_NotifyName_3) == 0x000354, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, CallFunc_HasAuthority_ReturnValue_3) == 0x00035C, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::CallFunc_HasAuthority_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, CallFunc_Not_PreBool_ReturnValue_2) == 0x00035D, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, Temp_bool_Has_Been_Initd_Variable_2) == 0x00035E, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::Temp_bool_Has_Been_Initd_Variable_2' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, CallFunc_GetControlRotation_ReturnValue_1) == 0x000360, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::CallFunc_GetControlRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, CallFunc_K2_GetActorRotation_ReturnValue_1) == 0x000378, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::CallFunc_K2_GetActorRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, CallFunc_NormalizedDeltaRotator_ReturnValue_1) == 0x000390, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::CallFunc_NormalizedDeltaRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, CallFunc_PlayEventWithOcclusion_FMODAudioComponent) == 0x0003A8, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::CallFunc_PlayEventWithOcclusion_FMODAudioComponent' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, CallFunc_BreakRotator_Roll_1) == 0x0003B0, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, CallFunc_BreakRotator_Pitch_1) == 0x0003B4, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, CallFunc_BreakRotator_Yaw_1) == 0x0003B8, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, CallFunc_IsValid_ReturnValue_3) == 0x0003BC, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, CallFunc_IsValid_ReturnValue_4) == 0x0003BD, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, CallFunc_IsValid_ReturnValue_5) == 0x0003BE, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, Temp_bool_IsClosed_Variable_2) == 0x0003BF, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::Temp_bool_IsClosed_Variable_2' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, K2Node_VariableSet_Pitch_R_ImplicitCast) == 0x0003C0, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::K2Node_VariableSet_Pitch_R_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, K2Node_VariableSet_Yaw_R_ImplicitCast) == 0x0003C8, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::K2Node_VariableSet_Yaw_R_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, K2Node_VariableSet_Yaw_Zombie__R_ImplicitCast) == 0x0003D0, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::K2Node_VariableSet_Yaw_Zombie__R_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, CallFunc_Delay_Duration_ImplicitCast) == 0x0003D8, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, K2Node_VariableSet_MaxWalkSpeed_ImplicitCast) == 0x0003DC, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::K2Node_VariableSet_MaxWalkSpeed_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, K2Node_VariableSet_MaxWalkSpeed_ImplicitCast_1) == 0x0003E0, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::K2Node_VariableSet_MaxWalkSpeed_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, CallFunc_SetMoveSpeed_MULTI_Speed_ImplicitCast) == 0x0003E8, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::CallFunc_SetMoveSpeed_MULTI_Speed_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, K2Node_VariableSet_MaxWalkSpeed_ImplicitCast_2) == 0x0003F0, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::K2Node_VariableSet_MaxWalkSpeed_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, CallFunc_Delay_Duration_ImplicitCast_1) == 0x0003F4, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::CallFunc_Delay_Duration_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, CallFunc_SetParameter_Value_ImplicitCast) == 0x0003F8, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::CallFunc_SetParameter_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, K2Node_VariableSet_Pitch_R_ImplicitCast_1) == 0x000400, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::K2Node_VariableSet_Pitch_R_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(ParentAI_C_ExecuteUbergraph_ParentAI, K2Node_VariableSet_Yaw_R_ImplicitCast_1) == 0x000408, "Member 'ParentAI_C_ExecuteUbergraph_ParentAI::K2Node_VariableSet_Yaw_R_ImplicitCast_1' has a wrong offset!");

// Function ParentAI.ParentAI_C.GetHitAngle
// 0x00F0 (0x00F0 - 0x0000)
struct ParentAI_C_GetHitAngle final
{
public:
