#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PawnLootZombie

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function PawnLootZombie.PawnLootZombie_C.ExecuteUbergraph_PawnLootZombie
// 0x0020 (0x0020 - 0x0000)
struct PawnLootZombie_C_ExecuteUbergraph_PawnLootZombie final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ConstParm, ReferenceParm)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PawnLootZombie_C_ExecuteUbergraph_PawnLootZombie) == 0x000008, "Wrong alignment on PawnLootZombie_C_ExecuteUbergraph_PawnLootZombie");
static_assert(sizeof(PawnLootZombie_C_ExecuteUbergraph_PawnLootZombie) == 0x000020, "Wrong size on PawnLootZombie_C_ExecuteUbergraph_PawnLootZombie");
static_assert(offsetof(PawnLootZombie_C_ExecuteUbergraph_PawnLootZombie, EntryPoint) == 0x000000, "Member 'PawnLootZombie_C_ExecuteUbergraph_PawnLootZombie::EntryPoint' has a wrong offset!");
static_assert(offsetof(PawnLootZombie_C_ExecuteUbergraph_PawnLootZombie, K2Node_MakeArray_Array) == 0x000008, "Member 'PawnLootZombie_C_ExecuteUbergraph_PawnLootZombie::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(PawnLootZombie_C_ExecuteUbergraph_PawnLootZombie, K2Node_Event_DeltaSeconds) == 0x000018, "Member 'PawnLootZombie_C_ExecuteUbergraph_PawnLootZombie::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function PawnLootZombie.PawnLootZombie_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct PawnLootZombie_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PawnLootZombie_C_ReceiveTick) == 0x000004, "Wrong alignment on PawnLootZombie_C_ReceiveTick");
static_assert(sizeof(PawnLootZombie_C_ReceiveTick) == 0x000004, "Wrong size on PawnLootZombie_C_ReceiveTick");
static_assert(offsetof(PawnLootZombie_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'PawnLootZombie_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

