#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PawnLoot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "LootPoint_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PawnLoot.PawnLoot_C
// 0x0010 (0x07C0 - 0x07B0)
class APawnLoot_C final : public ALootPoint_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_PawnLoot_C;                         // 0x07A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_Crate_01a;                                      // 0x07B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            LootPointMesh;                                     // 0x07B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PawnLoot(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PawnLoot_C">();
	}
	static class APawnLoot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APawnLoot_C>();
	}
};
static_assert(alignof(APawnLoot_C) == 0x000010, "Wrong alignment on APawnLoot_C");
static_assert(sizeof(APawnLoot_C) == 0x0007C0, "Wrong size on APawnLoot_C");
static_assert(offsetof(APawnLoot_C, UberGraphFrame_PawnLoot_C) == 0x0007A8, "Member 'APawnLoot_C::UberGraphFrame_PawnLoot_C' has a wrong offset!");
static_assert(offsetof(APawnLoot_C, SM_Crate_01a) == 0x0007B0, "Member 'APawnLoot_C::SM_Crate_01a' has a wrong offset!");
static_assert(offsetof(APawnLoot_C, LootPointMesh) == 0x0007B8, "Member 'APawnLoot_C::LootPointMesh' has a wrong offset!");

}

