#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PawnLootZombie

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "LootPoint_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PawnLootZombie.PawnLootZombie_C
// 0x0010 (0x07C0 - 0x07B0)
class APawnLootZombie_C final : public ALootPoint_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_PawnLootZombie_C;                   // 0x07A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_Crate_01a;                                      // 0x07B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            LootPointMesh;                                     // 0x07B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PawnLootZombie(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PawnLootZombie_C">();
	}
	static class APawnLootZombie_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APawnLootZombie_C>();
	}
};
static_assert(alignof(APawnLootZombie_C) == 0x000010, "Wrong alignment on APawnLootZombie_C");
static_assert(sizeof(APawnLootZombie_C) == 0x0007C0, "Wrong size on APawnLootZombie_C");
static_assert(offsetof(APawnLootZombie_C, UberGraphFrame_PawnLootZombie_C) == 0x0007A8, "Member 'APawnLootZombie_C::UberGraphFrame_PawnLootZombie_C' has a wrong offset!");
static_assert(offsetof(APawnLootZombie_C, SM_Crate_01a) == 0x0007B0, "Member 'APawnLootZombie_C::SM_Crate_01a' has a wrong offset!");
static_assert(offsetof(APawnLootZombie_C, LootPointMesh) == 0x0007B8, "Member 'APawnLootZombie_C::LootPointMesh' has a wrong offset!");

}

