#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PenetrationData

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct PenetrationData.PenetrationData
// 0x0014 (0x0014 - 0x0000)
struct FPenetrationData final
{
public:
	float                                         JoulesPerCM_10_2ED07FD049A83AD44F34E99B567A4919;   // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ImpactAngleGradient_12_43998B4A4627A12ECEB29B8818434E80; // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ImpactAngleZIntercept_13_37C5D5D742B54079A35088B7D9298EAF; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         VelocityGradient_14_B9D638714BDE75C59DA2A78E6322890E; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         VelocityZIntercept_15_5D55E60B460A74F11E480297C15ED9D4; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FPenetrationData) == 0x000004, "Wrong alignment on FPenetrationData");
static_assert(sizeof(FPenetrationData) == 0x000014, "Wrong size on FPenetrationData");
static_assert(offsetof(FPenetrationData, JoulesPerCM_10_2ED07FD049A83AD44F34E99B567A4919) == 0x000000, "Member 'FPenetrationData::JoulesPerCM_10_2ED07FD049A83AD44F34E99B567A4919' has a wrong offset!");
static_assert(offsetof(FPenetrationData, ImpactAngleGradient_12_43998B4A4627A12ECEB29B8818434E80) == 0x000004, "Member 'FPenetrationData::ImpactAngleGradient_12_43998B4A4627A12ECEB29B8818434E80' has a wrong offset!");
static_assert(offsetof(FPenetrationData, ImpactAngleZIntercept_13_37C5D5D742B54079A35088B7D9298EAF) == 0x000008, "Member 'FPenetrationData::ImpactAngleZIntercept_13_37C5D5D742B54079A35088B7D9298EAF' has a wrong offset!");
static_assert(offsetof(FPenetrationData, VelocityGradient_14_B9D638714BDE75C59DA2A78E6322890E) == 0x00000C, "Member 'FPenetrationData::VelocityGradient_14_B9D638714BDE75C59DA2A78E6322890E' has a wrong offset!");
static_assert(offsetof(FPenetrationData, VelocityZIntercept_15_5D55E60B460A74F11E480297C15ED9D4) == 0x000010, "Member 'FPenetrationData::VelocityZIntercept_15_5D55E60B460A74F11E480297C15ED9D4' has a wrong offset!");

}

