#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerDeadBodyRepl

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_InteractType_structs.hpp"
#include "DefaultItemInfo_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "DropItemEntry_structs.hpp"


namespace SDK::Params
{

// Function PlayerDeadBodyRepl.PlayerDeadBodyRepl_C.AddDeathRagdol
// 0x0038 (0x0038 - 0x0000)
struct PlayerDeadBodyRepl_C_AddDeathRagdol final
{
public:
	struct FVector                                Param_Location;                                    // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BoneName;                                          // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Direction;                                         // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerDeadBodyRepl_C_AddDeathRagdol) == 0x000008, "Wrong alignment on PlayerDeadBodyRepl_C_AddDeathRagdol");
static_assert(sizeof(PlayerDeadBodyRepl_C_AddDeathRagdol) == 0x000038, "Wrong size on PlayerDeadBodyRepl_C_AddDeathRagdol");
static_assert(offsetof(PlayerDeadBodyRepl_C_AddDeathRagdol, Param_Location) == 0x000000, "Member 'PlayerDeadBodyRepl_C_AddDeathRagdol::Param_Location' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyRepl_C_AddDeathRagdol, BoneName) == 0x000018, "Member 'PlayerDeadBodyRepl_C_AddDeathRagdol::BoneName' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyRepl_C_AddDeathRagdol, Direction) == 0x000020, "Member 'PlayerDeadBodyRepl_C_AddDeathRagdol::Direction' has a wrong offset!");

// Function PlayerDeadBodyRepl.PlayerDeadBodyRepl_C.ApplyMeshes
// 0x0008 (0x0008 - 0x0000)
struct PlayerDeadBodyRepl_C_ApplyMeshes final
{
public:
	class ASurvivalPlayer_C*                      InputPin;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerDeadBodyRepl_C_ApplyMeshes) == 0x000008, "Wrong alignment on PlayerDeadBodyRepl_C_ApplyMeshes");
static_assert(sizeof(PlayerDeadBodyRepl_C_ApplyMeshes) == 0x000008, "Wrong size on PlayerDeadBodyRepl_C_ApplyMeshes");
static_assert(offsetof(PlayerDeadBodyRepl_C_ApplyMeshes, InputPin) == 0x000000, "Member 'PlayerDeadBodyRepl_C_ApplyMeshes::InputPin' has a wrong offset!");

// Function PlayerDeadBodyRepl.PlayerDeadBodyRepl_C.ExecuteUbergraph_PlayerDeadBodyRepl
// 0x0570 (0x0570 - 0x0000)
struct PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0040(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      K2Node_CustomEvent_InputPin;                       // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_Player;                               // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          CallFunc_GetSkeletalMesh_DEPRECATED_ReturnValue;   // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          CallFunc_GetSkeletalMesh_DEPRECATED_ReturnValue_1; // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          CallFunc_GetSkeletalMesh_DEPRECATED_ReturnValue_2; // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          CallFunc_GetSkeletalMesh_DEPRECATED_ReturnValue_3; // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          CallFunc_GetSkeletalMesh_DEPRECATED_ReturnValue_4; // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          CallFunc_GetSkeletalMesh_DEPRECATED_ReturnValue_5; // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          CallFunc_GetSkeletalMesh_DEPRECATED_ReturnValue_6; // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x017D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17E[0x2];                                      // 0x017E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_Location;                       // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_BoneName;                       // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Direction;                      // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue; // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_CustomEvent_Player;                         // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FDropItemEntry>                 K2Node_CustomEvent_itemDrop;                       // 0x01D8(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x3];                                      // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDropItemEntry                         CallFunc_Array_Get_Item;                           // 0x01F8(0x0240)(ContainsInstancedReference, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDefaultItemInfo                       K2Node_MakeStruct_DefaultItemInfo;                 // 0x0440(0x0040)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0480(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_484[0x4];                                      // 0x0484(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult; // 0x0488(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl) == 0x000008, "Wrong alignment on PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl");
static_assert(sizeof(PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl) == 0x000570, "Wrong size on PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl");
static_assert(offsetof(PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl, EntryPoint) == 0x000000, "Member 'PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl::EntryPoint' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000028, "Member 'PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000040, "Member 'PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000128, "Member 'PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl, K2Node_CustomEvent_InputPin) == 0x000130, "Member 'PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl::K2Node_CustomEvent_InputPin' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl, K2Node_Event_Player) == 0x000138, "Member 'PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl::K2Node_Event_Player' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl, CallFunc_GetSkeletalMesh_DEPRECATED_ReturnValue) == 0x000140, "Member 'PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl::CallFunc_GetSkeletalMesh_DEPRECATED_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl, CallFunc_GetSkeletalMesh_DEPRECATED_ReturnValue_1) == 0x000148, "Member 'PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl::CallFunc_GetSkeletalMesh_DEPRECATED_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl, CallFunc_GetSkeletalMesh_DEPRECATED_ReturnValue_2) == 0x000150, "Member 'PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl::CallFunc_GetSkeletalMesh_DEPRECATED_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl, CallFunc_GetSkeletalMesh_DEPRECATED_ReturnValue_3) == 0x000158, "Member 'PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl::CallFunc_GetSkeletalMesh_DEPRECATED_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl, CallFunc_GetSkeletalMesh_DEPRECATED_ReturnValue_4) == 0x000160, "Member 'PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl::CallFunc_GetSkeletalMesh_DEPRECATED_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl, CallFunc_GetSkeletalMesh_DEPRECATED_ReturnValue_5) == 0x000168, "Member 'PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl::CallFunc_GetSkeletalMesh_DEPRECATED_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl, CallFunc_GetSkeletalMesh_DEPRECATED_ReturnValue_6) == 0x000170, "Member 'PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl::CallFunc_GetSkeletalMesh_DEPRECATED_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl, CallFunc_Array_Length_ReturnValue) == 0x000178, "Member 'PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl, CallFunc_Less_IntInt_ReturnValue) == 0x00017C, "Member 'PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl, CallFunc_HasAuthority_ReturnValue) == 0x00017D, "Member 'PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl, K2Node_CustomEvent_Location) == 0x000180, "Member 'PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl::K2Node_CustomEvent_Location' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl, K2Node_CustomEvent_BoneName) == 0x000198, "Member 'PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl::K2Node_CustomEvent_BoneName' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl, K2Node_CustomEvent_Direction) == 0x0001A0, "Member 'PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl::K2Node_CustomEvent_Direction' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl, CallFunc_GreaterGreater_VectorRotator_ReturnValue) == 0x0001B8, "Member 'PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl::CallFunc_GreaterGreater_VectorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl, K2Node_CustomEvent_Player) == 0x0001D0, "Member 'PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl::K2Node_CustomEvent_Player' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl, K2Node_CustomEvent_itemDrop) == 0x0001D8, "Member 'PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl::K2Node_CustomEvent_itemDrop' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl, CallFunc_IsValid_ReturnValue) == 0x0001E8, "Member 'PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl, K2Node_Event_DeltaSeconds) == 0x0001EC, "Member 'PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl, Temp_int_Array_Index_Variable) == 0x0001F0, "Member 'PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl, CallFunc_Array_Get_Item) == 0x0001F8, "Member 'PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl, CallFunc_Conv_StringToName_ReturnValue) == 0x000438, "Member 'PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl, K2Node_MakeStruct_DefaultItemInfo) == 0x000440, "Member 'PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl::K2Node_MakeStruct_DefaultItemInfo' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl, CallFunc_Array_Add_ReturnValue) == 0x000480, "Member 'PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl, CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult) == 0x000488, "Member 'PlayerDeadBodyRepl_C_ExecuteUbergraph_PlayerDeadBodyRepl::CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult' has a wrong offset!");

// Function PlayerDeadBodyRepl.PlayerDeadBodyRepl_C.FreezeRagdoll
// 0x0030 (0x0030 - 0x0000)
struct PlayerDeadBodyRepl_C_FreezeRagdoll final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetAllSocketNames_ReturnValue;            // 0x0008(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerDeadBodyRepl_C_FreezeRagdoll) == 0x000008, "Wrong alignment on PlayerDeadBodyRepl_C_FreezeRagdoll");
static_assert(sizeof(PlayerDeadBodyRepl_C_FreezeRagdoll) == 0x000030, "Wrong size on PlayerDeadBodyRepl_C_FreezeRagdoll");
static_assert(offsetof(PlayerDeadBodyRepl_C_FreezeRagdoll, Temp_int_Array_Index_Variable) == 0x000000, "Member 'PlayerDeadBodyRepl_C_FreezeRagdoll::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyRepl_C_FreezeRagdoll, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'PlayerDeadBodyRepl_C_FreezeRagdoll::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyRepl_C_FreezeRagdoll, CallFunc_GetAllSocketNames_ReturnValue) == 0x000008, "Member 'PlayerDeadBodyRepl_C_FreezeRagdoll::CallFunc_GetAllSocketNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyRepl_C_FreezeRagdoll, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'PlayerDeadBodyRepl_C_FreezeRagdoll::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyRepl_C_FreezeRagdoll, CallFunc_Array_Get_Item) == 0x00001C, "Member 'PlayerDeadBodyRepl_C_FreezeRagdoll::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyRepl_C_FreezeRagdoll, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'PlayerDeadBodyRepl_C_FreezeRagdoll::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyRepl_C_FreezeRagdoll, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'PlayerDeadBodyRepl_C_FreezeRagdoll::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function PlayerDeadBodyRepl.PlayerDeadBodyRepl_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct PlayerDeadBodyRepl_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerDeadBodyRepl_C_ReceiveTick) == 0x000004, "Wrong alignment on PlayerDeadBodyRepl_C_ReceiveTick");
static_assert(sizeof(PlayerDeadBodyRepl_C_ReceiveTick) == 0x000004, "Wrong size on PlayerDeadBodyRepl_C_ReceiveTick");
static_assert(offsetof(PlayerDeadBodyRepl_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'PlayerDeadBodyRepl_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function PlayerDeadBodyRepl.PlayerDeadBodyRepl_C.ShowBody
// 0x0018 (0x0018 - 0x0000)
struct PlayerDeadBodyRepl_C_ShowBody final
{
public:
	class ASurvivalPlayer_C*                      Param_Player;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FDropItemEntry>                 ItemDrop;                                          // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(PlayerDeadBodyRepl_C_ShowBody) == 0x000008, "Wrong alignment on PlayerDeadBodyRepl_C_ShowBody");
static_assert(sizeof(PlayerDeadBodyRepl_C_ShowBody) == 0x000018, "Wrong size on PlayerDeadBodyRepl_C_ShowBody");
static_assert(offsetof(PlayerDeadBodyRepl_C_ShowBody, Param_Player) == 0x000000, "Member 'PlayerDeadBodyRepl_C_ShowBody::Param_Player' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyRepl_C_ShowBody, ItemDrop) == 0x000008, "Member 'PlayerDeadBodyRepl_C_ShowBody::ItemDrop' has a wrong offset!");

// Function PlayerDeadBodyRepl.PlayerDeadBodyRepl_C.OnBeginInteract
// 0x0008 (0x0008 - 0x0000)
struct PlayerDeadBodyRepl_C_OnBeginInteract final
{
public:
	class APawn*                                  Param_Player;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerDeadBodyRepl_C_OnBeginInteract) == 0x000008, "Wrong alignment on PlayerDeadBodyRepl_C_OnBeginInteract");
static_assert(sizeof(PlayerDeadBodyRepl_C_OnBeginInteract) == 0x000008, "Wrong size on PlayerDeadBodyRepl_C_OnBeginInteract");
static_assert(offsetof(PlayerDeadBodyRepl_C_OnBeginInteract, Param_Player) == 0x000000, "Member 'PlayerDeadBodyRepl_C_OnBeginInteract::Param_Player' has a wrong offset!");

// Function PlayerDeadBodyRepl.PlayerDeadBodyRepl_C.OnFocused
// 0x00A8 (0x00A8 - 0x0000)
struct PlayerDeadBodyRepl_C_OnFocused final
{
public:
	class APawn*                                  Param_Player;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 HighlightActor;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UActorComponent*                        HighlightActorComponent;                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	E_InteractType                                InteractType;                                      // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        LateTime;                                          // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_AIInfo_C>           K2Node_DynamicCast_AsI_AIInfo;                     // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetComponentVelocity_ReturnValue;         // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDead__IsDead_;                          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue;      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B[0x5];                                       // 0x005B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameHUD_C>        K2Node_DynamicCast_AsBPI_Game_HUD;                 // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_PlayerMain_C*                      CallFunc_GetGUI_GUI;                               // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerDeadBodyRepl_C_OnFocused) == 0x000008, "Wrong alignment on PlayerDeadBodyRepl_C_OnFocused");
static_assert(sizeof(PlayerDeadBodyRepl_C_OnFocused) == 0x0000A8, "Wrong size on PlayerDeadBodyRepl_C_OnFocused");
static_assert(offsetof(PlayerDeadBodyRepl_C_OnFocused, Param_Player) == 0x000000, "Member 'PlayerDeadBodyRepl_C_OnFocused::Param_Player' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyRepl_C_OnFocused, HighlightActor) == 0x000008, "Member 'PlayerDeadBodyRepl_C_OnFocused::HighlightActor' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyRepl_C_OnFocused, HighlightActorComponent) == 0x000010, "Member 'PlayerDeadBodyRepl_C_OnFocused::HighlightActorComponent' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyRepl_C_OnFocused, InteractType) == 0x000018, "Member 'PlayerDeadBodyRepl_C_OnFocused::InteractType' has a wrong offset!");
