#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerCutsceneComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FMODStudio_structs.hpp"


namespace SDK::Params
{

// Function PlayerCutsceneComponent.PlayerCutsceneComponent_C.AisenMulti
// 0x0010 (0x0010 - 0x0000)
struct PlayerCutsceneComponent_C_AisenMulti final
{
public:
	bool                                          Pohui;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      Ref;                                               // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerCutsceneComponent_C_AisenMulti) == 0x000008, "Wrong alignment on PlayerCutsceneComponent_C_AisenMulti");
static_assert(sizeof(PlayerCutsceneComponent_C_AisenMulti) == 0x000010, "Wrong size on PlayerCutsceneComponent_C_AisenMulti");
static_assert(offsetof(PlayerCutsceneComponent_C_AisenMulti, Pohui) == 0x000000, "Member 'PlayerCutsceneComponent_C_AisenMulti::Pohui' has a wrong offset!");
static_assert(offsetof(PlayerCutsceneComponent_C_AisenMulti, Ref) == 0x000008, "Member 'PlayerCutsceneComponent_C_AisenMulti::Ref' has a wrong offset!");

// Function PlayerCutsceneComponent.PlayerCutsceneComponent_C.AisenServ
// 0x0010 (0x0010 - 0x0000)
struct PlayerCutsceneComponent_C_AisenServ final
{
public:
	bool                                          Pohui;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      Ref;                                               // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerCutsceneComponent_C_AisenServ) == 0x000008, "Wrong alignment on PlayerCutsceneComponent_C_AisenServ");
static_assert(sizeof(PlayerCutsceneComponent_C_AisenServ) == 0x000010, "Wrong size on PlayerCutsceneComponent_C_AisenServ");
static_assert(offsetof(PlayerCutsceneComponent_C_AisenServ, Pohui) == 0x000000, "Member 'PlayerCutsceneComponent_C_AisenServ::Pohui' has a wrong offset!");
static_assert(offsetof(PlayerCutsceneComponent_C_AisenServ, Ref) == 0x000008, "Member 'PlayerCutsceneComponent_C_AisenServ::Ref' has a wrong offset!");

// Function PlayerCutsceneComponent.PlayerCutsceneComponent_C.BenchMark
// 0x0040 (0x0040 - 0x0000)
struct PlayerCutsceneComponent_C_BenchMark final
{
public:
	struct FVector                                OriginLoc;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               OriginRot;                                         // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 Actor;                                             // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Start;                                             // 0x0038(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerCutsceneComponent_C_BenchMark) == 0x000008, "Wrong alignment on PlayerCutsceneComponent_C_BenchMark");
static_assert(sizeof(PlayerCutsceneComponent_C_BenchMark) == 0x000040, "Wrong size on PlayerCutsceneComponent_C_BenchMark");
static_assert(offsetof(PlayerCutsceneComponent_C_BenchMark, OriginLoc) == 0x000000, "Member 'PlayerCutsceneComponent_C_BenchMark::OriginLoc' has a wrong offset!");
static_assert(offsetof(PlayerCutsceneComponent_C_BenchMark, OriginRot) == 0x000018, "Member 'PlayerCutsceneComponent_C_BenchMark::OriginRot' has a wrong offset!");
static_assert(offsetof(PlayerCutsceneComponent_C_BenchMark, Actor) == 0x000030, "Member 'PlayerCutsceneComponent_C_BenchMark::Actor' has a wrong offset!");
static_assert(offsetof(PlayerCutsceneComponent_C_BenchMark, Start) == 0x000038, "Member 'PlayerCutsceneComponent_C_BenchMark::Start' has a wrong offset!");

// Function PlayerCutsceneComponent.PlayerCutsceneComponent_C.CheckBinocularsState
// 0x0038 (0x0038 - 0x0000)
struct PlayerCutsceneComponent_C_CheckBinocularsState final
{
public:
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameHUD_C>        K2Node_DynamicCast_AsBPI_Game_HUD;                 // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_PlayerMain_C*                      CallFunc_GetGUI_GUI;                               // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerCutsceneComponent_C_CheckBinocularsState) == 0x000008, "Wrong alignment on PlayerCutsceneComponent_C_CheckBinocularsState");
static_assert(sizeof(PlayerCutsceneComponent_C_CheckBinocularsState) == 0x000038, "Wrong size on PlayerCutsceneComponent_C_CheckBinocularsState");
static_assert(offsetof(PlayerCutsceneComponent_C_CheckBinocularsState, CallFunc_GetPlayerController_ReturnValue) == 0x000000, "Member 'PlayerCutsceneComponent_C_CheckBinocularsState::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerCutsceneComponent_C_CheckBinocularsState, CallFunc_GetHUD_ReturnValue) == 0x000008, "Member 'PlayerCutsceneComponent_C_CheckBinocularsState::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerCutsceneComponent_C_CheckBinocularsState, K2Node_DynamicCast_AsBPI_Game_HUD) == 0x000010, "Member 'PlayerCutsceneComponent_C_CheckBinocularsState::K2Node_DynamicCast_AsBPI_Game_HUD' has a wrong offset!");
static_assert(offsetof(PlayerCutsceneComponent_C_CheckBinocularsState, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'PlayerCutsceneComponent_C_CheckBinocularsState::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PlayerCutsceneComponent_C_CheckBinocularsState, CallFunc_GetGUI_GUI) == 0x000028, "Member 'PlayerCutsceneComponent_C_CheckBinocularsState::CallFunc_GetGUI_GUI' has a wrong offset!");
static_assert(offsetof(PlayerCutsceneComponent_C_CheckBinocularsState, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'PlayerCutsceneComponent_C_CheckBinocularsState::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function PlayerCutsceneComponent.PlayerCutsceneComponent_C.CT_FirstLaunch
// 0x0030 (0x0030 - 0x0000)
struct PlayerCutsceneComponent_C_CT_FirstLaunch final
{
public:
	struct FVector                                Pos;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rot;                                               // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerCutsceneComponent_C_CT_FirstLaunch) == 0x000008, "Wrong alignment on PlayerCutsceneComponent_C_CT_FirstLaunch");
static_assert(sizeof(PlayerCutsceneComponent_C_CT_FirstLaunch) == 0x000030, "Wrong size on PlayerCutsceneComponent_C_CT_FirstLaunch");
static_assert(offsetof(PlayerCutsceneComponent_C_CT_FirstLaunch, Pos) == 0x000000, "Member 'PlayerCutsceneComponent_C_CT_FirstLaunch::Pos' has a wrong offset!");
static_assert(offsetof(PlayerCutsceneComponent_C_CT_FirstLaunch, Rot) == 0x000018, "Member 'PlayerCutsceneComponent_C_CT_FirstLaunch::Rot' has a wrong offset!");

// Function PlayerCutsceneComponent.PlayerCutsceneComponent_C.CT_InteractWithHUBDoor
// 0x0010 (0x0010 - 0x0000)
struct PlayerCutsceneComponent_C_CT_InteractWithHUBDoor final
{
public:
	class AActor*                                 HubDoor;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULevelSequence*                         LevelSequence;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerCutsceneComponent_C_CT_InteractWithHUBDoor) == 0x000008, "Wrong alignment on PlayerCutsceneComponent_C_CT_InteractWithHUBDoor");
static_assert(sizeof(PlayerCutsceneComponent_C_CT_InteractWithHUBDoor) == 0x000010, "Wrong size on PlayerCutsceneComponent_C_CT_InteractWithHUBDoor");
static_assert(offsetof(PlayerCutsceneComponent_C_CT_InteractWithHUBDoor, HubDoor) == 0x000000, "Member 'PlayerCutsceneComponent_C_CT_InteractWithHUBDoor::HubDoor' has a wrong offset!");
static_assert(offsetof(PlayerCutsceneComponent_C_CT_InteractWithHUBDoor, LevelSequence) == 0x000008, "Member 'PlayerCutsceneComponent_C_CT_InteractWithHUBDoor::LevelSequence' has a wrong offset!");

// Function PlayerCutsceneComponent.PlayerCutsceneComponent_C.CT_PlayerRoomDoors
// 0x0010 (0x0010 - 0x0000)
struct PlayerCutsceneComponent_C_CT_PlayerRoomDoors final
{
public:
	class AActor*                                 HubDoor;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULevelSequence*                         InSequence;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerCutsceneComponent_C_CT_PlayerRoomDoors) == 0x000008, "Wrong alignment on PlayerCutsceneComponent_C_CT_PlayerRoomDoors");
static_assert(sizeof(PlayerCutsceneComponent_C_CT_PlayerRoomDoors) == 0x000010, "Wrong size on PlayerCutsceneComponent_C_CT_PlayerRoomDoors");
static_assert(offsetof(PlayerCutsceneComponent_C_CT_PlayerRoomDoors, HubDoor) == 0x000000, "Member 'PlayerCutsceneComponent_C_CT_PlayerRoomDoors::HubDoor' has a wrong offset!");
static_assert(offsetof(PlayerCutsceneComponent_C_CT_PlayerRoomDoors, InSequence) == 0x000008, "Member 'PlayerCutsceneComponent_C_CT_PlayerRoomDoors::InSequence' has a wrong offset!");

// Function PlayerCutsceneComponent.PlayerCutsceneComponent_C.CT_PlayerSofa
// 0x0008 (0x0008 - 0x0000)
struct PlayerCutsceneComponent_C_CT_PlayerSofa final
{
public:
	class AActor*                                 RoundSofa;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerCutsceneComponent_C_CT_PlayerSofa) == 0x000008, "Wrong alignment on PlayerCutsceneComponent_C_CT_PlayerSofa");
static_assert(sizeof(PlayerCutsceneComponent_C_CT_PlayerSofa) == 0x000008, "Wrong size on PlayerCutsceneComponent_C_CT_PlayerSofa");
static_assert(offsetof(PlayerCutsceneComponent_C_CT_PlayerSofa, RoundSofa) == 0x000000, "Member 'PlayerCutsceneComponent_C_CT_PlayerSofa::RoundSofa' has a wrong offset!");

// Function PlayerCutsceneComponent.PlayerCutsceneComponent_C.CT_PlayerSofaInteract
// 0x0010 (0x0010 - 0x0000)
struct PlayerCutsceneComponent_C_CT_PlayerSofaInteract final
{
public:
	class AActor*                                 Sofa;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULevelSequence*                         InSequence;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerCutsceneComponent_C_CT_PlayerSofaInteract) == 0x000008, "Wrong alignment on PlayerCutsceneComponent_C_CT_PlayerSofaInteract");
static_assert(sizeof(PlayerCutsceneComponent_C_CT_PlayerSofaInteract) == 0x000010, "Wrong size on PlayerCutsceneComponent_C_CT_PlayerSofaInteract");
static_assert(offsetof(PlayerCutsceneComponent_C_CT_PlayerSofaInteract, Sofa) == 0x000000, "Member 'PlayerCutsceneComponent_C_CT_PlayerSofaInteract::Sofa' has a wrong offset!");
static_assert(offsetof(PlayerCutsceneComponent_C_CT_PlayerSofaInteract, InSequence) == 0x000008, "Member 'PlayerCutsceneComponent_C_CT_PlayerSofaInteract::InSequence' has a wrong offset!");

// Function PlayerCutsceneComponent.PlayerCutsceneComponent_C.CT_Respawn
// 0x0030 (0x0030 - 0x0000)
struct PlayerCutsceneComponent_C_CT_Respawn final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerCutsceneComponent_C_CT_Respawn) == 0x000008, "Wrong alignment on PlayerCutsceneComponent_C_CT_Respawn");
static_assert(sizeof(PlayerCutsceneComponent_C_CT_Respawn) == 0x000030, "Wrong size on PlayerCutsceneComponent_C_CT_Respawn");
static_assert(offsetof(PlayerCutsceneComponent_C_CT_Respawn, Location) == 0x000000, "Member 'PlayerCutsceneComponent_C_CT_Respawn::Location' has a wrong offset!");
static_assert(offsetof(PlayerCutsceneComponent_C_CT_Respawn, Rotation) == 0x000018, "Member 'PlayerCutsceneComponent_C_CT_Respawn::Rotation' has a wrong offset!");

// Function PlayerCutsceneComponent.PlayerCutsceneComponent_C.CT_ReturnFromHouse
// 0x0038 (0x0038 - 0x0000)
struct PlayerCutsceneComponent_C_CT_ReturnFromHouse final
{
public:
	struct FVector                                OriginLoc;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               OriginRot;                                         // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 Actor;                                             // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerCutsceneComponent_C_CT_ReturnFromHouse) == 0x000008, "Wrong alignment on PlayerCutsceneComponent_C_CT_ReturnFromHouse");
static_assert(sizeof(PlayerCutsceneComponent_C_CT_ReturnFromHouse) == 0x000038, "Wrong size on PlayerCutsceneComponent_C_CT_ReturnFromHouse");
static_assert(offsetof(PlayerCutsceneComponent_C_CT_ReturnFromHouse, OriginLoc) == 0x000000, "Member 'PlayerCutsceneComponent_C_CT_ReturnFromHouse::OriginLoc' has a wrong offset!");
static_assert(offsetof(PlayerCutsceneComponent_C_CT_ReturnFromHouse, OriginRot) == 0x000018, "Member 'PlayerCutsceneComponent_C_CT_ReturnFromHouse::OriginRot' has a wrong offset!");
static_assert(offsetof(PlayerCutsceneComponent_C_CT_ReturnFromHouse, Actor) == 0x000030, "Member 'PlayerCutsceneComponent_C_CT_ReturnFromHouse::Actor' has a wrong offset!");

// Function PlayerCutsceneComponent.PlayerCutsceneComponent_C.CT_SaunaBegin
// 0x0018 (0x0018 - 0x0000)
struct PlayerCutsceneComponent_C_CT_SaunaBegin final
{
public:
	class AActor*                                 SaunaSpot;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Door;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Param_SaunaExit;                                   // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerCutsceneComponent_C_CT_SaunaBegin) == 0x000008, "Wrong alignment on PlayerCutsceneComponent_C_CT_SaunaBegin");
static_assert(sizeof(PlayerCutsceneComponent_C_CT_SaunaBegin) == 0x000018, "Wrong size on PlayerCutsceneComponent_C_CT_SaunaBegin");
static_assert(offsetof(PlayerCutsceneComponent_C_CT_SaunaBegin, SaunaSpot) == 0x000000, "Member 'PlayerCutsceneComponent_C_CT_SaunaBegin::SaunaSpot' has a wrong offset!");
static_assert(offsetof(PlayerCutsceneComponent_C_CT_SaunaBegin, Door) == 0x000008, "Member 'PlayerCutsceneComponent_C_CT_SaunaBegin::Door' has a wrong offset!");
static_assert(offsetof(PlayerCutsceneComponent_C_CT_SaunaBegin, Param_SaunaExit) == 0x000010, "Member 'PlayerCutsceneComponent_C_CT_SaunaBegin::Param_SaunaExit' has a wrong offset!");

// Function PlayerCutsceneComponent.PlayerCutsceneComponent_C.CT_ToHome
// 0x0038 (0x0038 - 0x0000)
struct PlayerCutsceneComponent_C_CT_ToHome final
{
public:
	struct FVector                                OriginLoc;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               OriginRot;                                         // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 Actor;                                             // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerCutsceneComponent_C_CT_ToHome) == 0x000008, "Wrong alignment on PlayerCutsceneComponent_C_CT_ToHome");
static_assert(sizeof(PlayerCutsceneComponent_C_CT_ToHome) == 0x000038, "Wrong size on PlayerCutsceneComponent_C_CT_ToHome");
static_assert(offsetof(PlayerCutsceneComponent_C_CT_ToHome, OriginLoc) == 0x000000, "Member 'PlayerCutsceneComponent_C_CT_ToHome::OriginLoc' has a wrong offset!");
static_assert(offsetof(PlayerCutsceneComponent_C_CT_ToHome, OriginRot) == 0x000018, "Member 'PlayerCutsceneComponent_C_CT_ToHome::OriginRot' has a wrong offset!");
static_assert(offsetof(PlayerCutsceneComponent_C_CT_ToHome, Actor) == 0x000030, "Member 'PlayerCutsceneComponent_C_CT_ToHome::Actor' has a wrong offset!");

// Function PlayerCutsceneComponent.PlayerCutsceneComponent_C.CT_ToHUB
// 0x0038 (0x0038 - 0x0000)
struct PlayerCutsceneComponent_C_CT_ToHUB final
{
public:
	struct FVector                                OriginLoc;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               OriginRot;                                         // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 Actor;                                             // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerCutsceneComponent_C_CT_ToHUB) == 0x000008, "Wrong alignment on PlayerCutsceneComponent_C_CT_ToHUB");
static_assert(sizeof(PlayerCutsceneComponent_C_CT_ToHUB) == 0x000038, "Wrong size on PlayerCutsceneComponent_C_CT_ToHUB");
static_assert(offsetof(PlayerCutsceneComponent_C_CT_ToHUB, OriginLoc) == 0x000000, "Member 'PlayerCutsceneComponent_C_CT_ToHUB::OriginLoc' has a wrong offset!");
static_assert(offsetof(PlayerCutsceneComponent_C_CT_ToHUB, OriginRot) == 0x000018, "Member 'PlayerCutsceneComponent_C_CT_ToHUB::OriginRot' has a wrong offset!");
static_assert(offsetof(PlayerCutsceneComponent_C_CT_ToHUB, Actor) == 0x000030, "Member 'PlayerCutsceneComponent_C_CT_ToHUB::Actor' has a wrong offset!");

// Function PlayerCutsceneComponent.PlayerCutsceneComponent_C.CT_ToWorld
// 0x0038 (0x0038 - 0x0000)
struct PlayerCutsceneComponent_C_CT_ToWorld final
{
public:
	struct FVector                                OriginLoc;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               OriginRot;                                         // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Param_Ressurect;                                   // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerCutsceneComponent_C_CT_ToWorld) == 0x000008, "Wrong alignment on PlayerCutsceneComponent_C_CT_ToWorld");
static_assert(sizeof(PlayerCutsceneComponent_C_CT_ToWorld) == 0x000038, "Wrong size on PlayerCutsceneComponent_C_CT_ToWorld");
static_assert(offsetof(PlayerCutsceneComponent_C_CT_ToWorld, OriginLoc) == 0x000000, "Member 'PlayerCutsceneComponent_C_CT_ToWorld::OriginLoc' has a wrong offset!");
static_assert(offsetof(PlayerCutsceneComponent_C_CT_ToWorld, OriginRot) == 0x000018, "Member 'PlayerCutsceneComponent_C_CT_ToWorld::OriginRot' has a wrong offset!");
static_assert(offsetof(PlayerCutsceneComponent_C_CT_ToWorld, Param_Ressurect) == 0x000030, "Member 'PlayerCutsceneComponent_C_CT_ToWorld::Param_Ressurect' has a wrong offset!");

// Function PlayerCutsceneComponent.PlayerCutsceneComponent_C.Custom Overlap
// 0x0078 (0x0078 - 0x0000)
struct PlayerCutsceneComponent_C_Custom_Overlap final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0018(0x0010)(ReferenceParm)
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors_1; // 0x0028(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHouseBox_C*                            K2Node_DynamicCast_AsHouse_Box;                    // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Interier_Toggler_C*                 K2Node_DynamicCast_AsBP_Interier_Toggler;          // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E[0x2];                                       // 0x006E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerCutsceneComponent_C_Custom_Overlap) == 0x000008, "Wrong alignment on PlayerCutsceneComponent_C_Custom_Overlap");
static_assert(sizeof(PlayerCutsceneComponent_C_Custom_Overlap) == 0x000078, "Wrong size on PlayerCutsceneComponent_C_Custom_Overlap");
static_assert(offsetof(PlayerCutsceneComponent_C_Custom_Overlap, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'PlayerCutsceneComponent_C_Custom_Overlap::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PlayerCutsceneComponent_C_Custom_Overlap, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'PlayerCutsceneComponent_C_Custom_Overlap::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerCutsceneComponent_C_Custom_Overlap, Temp_int_Array_Index_Variable) == 0x000008, "Member 'PlayerCutsceneComponent_C_Custom_Overlap::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PlayerCutsceneComponent_C_Custom_Overlap, Temp_int_Array_Index_Variable_1) == 0x00000C, "Member 'PlayerCutsceneComponent_C_Custom_Overlap::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(PlayerCutsceneComponent_C_Custom_Overlap, Temp_int_Loop_Counter_Variable_1) == 0x000010, "Member 'PlayerCutsceneComponent_C_Custom_Overlap::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(PlayerCutsceneComponent_C_Custom_Overlap, CallFunc_GetOverlappingActors_OverlappingActors) == 0x000018, "Member 'PlayerCutsceneComponent_C_Custom_Overlap::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(PlayerCutsceneComponent_C_Custom_Overlap, CallFunc_GetOverlappingActors_OverlappingActors_1) == 0x000028, "Member 'PlayerCutsceneComponent_C_Custom_Overlap::CallFunc_GetOverlappingActors_OverlappingActors_1' has a wrong offset!");
static_assert(offsetof(PlayerCutsceneComponent_C_Custom_Overlap, CallFunc_Array_Get_Item) == 0x000038, "Member 'PlayerCutsceneComponent_C_Custom_Overlap::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PlayerCutsceneComponent_C_Custom_Overlap, CallFunc_Array_Get_Item_1) == 0x000040, "Member 'PlayerCutsceneComponent_C_Custom_Overlap::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(PlayerCutsceneComponent_C_Custom_Overlap, K2Node_DynamicCast_AsHouse_Box) == 0x000048, "Member 'PlayerCutsceneComponent_C_Custom_Overlap::K2Node_DynamicCast_AsHouse_Box' has a wrong offset!");
static_assert(offsetof(PlayerCutsceneComponent_C_Custom_Overlap, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'PlayerCutsceneComponent_C_Custom_Overlap::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PlayerCutsceneComponent_C_Custom_Overlap, K2Node_DynamicCast_AsBP_Interier_Toggler) == 0x000058, "Member 'PlayerCutsceneComponent_C_Custom_Overlap::K2Node_DynamicCast_AsBP_Interier_Toggler' has a wrong offset!");
static_assert(offsetof(PlayerCutsceneComponent_C_Custom_Overlap, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'PlayerCutsceneComponent_C_Custom_Overlap::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(PlayerCutsceneComponent_C_Custom_Overlap, CallFunc_Array_Length_ReturnValue) == 0x000064, "Member 'PlayerCutsceneComponent_C_Custom_Overlap::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerCutsceneComponent_C_Custom_Overlap, CallFunc_Array_Length_ReturnValue_1) == 0x000068, "Member 'PlayerCutsceneComponent_C_Custom_Overlap::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerCutsceneComponent_C_Custom_Overlap, CallFunc_Less_IntInt_ReturnValue) == 0x00006C, "Member 'PlayerCutsceneComponent_C_Custom_Overlap::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerCutsceneComponent_C_Custom_Overlap, CallFunc_Less_IntInt_ReturnValue_1) == 0x00006D, "Member 'PlayerCutsceneComponent_C_Custom_Overlap::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerCutsceneComponent_C_Custom_Overlap, CallFunc_Add_IntInt_ReturnValue_1) == 0x000070, "Member 'PlayerCutsceneComponent_C_Custom_Overlap::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function PlayerCutsceneComponent.PlayerCutsceneComponent_C.CutsceneBegin
// 0x0001 (0x0001 - 0x0000)
struct PlayerCutsceneComponent_C_CutsceneBegin final
{
public:
	bool                                          LockingInput;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerCutsceneComponent_C_CutsceneBegin) == 0x000001, "Wrong alignment on PlayerCutsceneComponent_C_CutsceneBegin");
static_assert(sizeof(PlayerCutsceneComponent_C_CutsceneBegin) == 0x000001, "Wrong size on PlayerCutsceneComponent_C_CutsceneBegin");
static_assert(offsetof(PlayerCutsceneComponent_C_CutsceneBegin, LockingInput) == 0x000000, "Member 'PlayerCutsceneComponent_C_CutsceneBegin::LockingInput' has a wrong offset!");

// Function PlayerCutsceneComponent.PlayerCutsceneComponent_C.CutsceneFinished
// 0x0018 (0x0018 - 0x0000)
struct PlayerCutsceneComponent_C_CutsceneFinished final
{
public:
	class AActor*                                 Recipient;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 StageName;                                         // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerCutsceneComponent_C_CutsceneFinished) == 0x000008, "Wrong alignment on PlayerCutsceneComponent_C_CutsceneFinished");
static_assert(sizeof(PlayerCutsceneComponent_C_CutsceneFinished) == 0x000018, "Wrong size on PlayerCutsceneComponent_C_CutsceneFinished");
static_assert(offsetof(PlayerCutsceneComponent_C_CutsceneFinished, Recipient) == 0x000000, "Member 'PlayerCutsceneComponent_C_CutsceneFinished::Recipient' has a wrong offset!");
static_assert(offsetof(PlayerCutsceneComponent_C_CutsceneFinished, StageName) == 0x000008, "Member 'PlayerCutsceneComponent_C_CutsceneFinished::StageName' has a wrong offset!");

// Function PlayerCutsceneComponent.PlayerCutsceneComponent_C.EndLoadingScreen
// 0x0001 (0x0001 - 0x0000)
struct PlayerCutsceneComponent_C_EndLoadingScreen final
{
public:
	bool                                          OnCars;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerCutsceneComponent_C_EndLoadingScreen) == 0x000001, "Wrong alignment on PlayerCutsceneComponent_C_EndLoadingScreen");
static_assert(sizeof(PlayerCutsceneComponent_C_EndLoadingScreen) == 0x000001, "Wrong size on PlayerCutsceneComponent_C_EndLoadingScreen");
static_assert(offsetof(PlayerCutsceneComponent_C_EndLoadingScreen, OnCars) == 0x000000, "Member 'PlayerCutsceneComponent_C_EndLoadingScreen::OnCars' has a wrong offset!");

// Function PlayerCutsceneComponent.PlayerCutsceneComponent_C.EnteredWorld
// 0x0010 (0x0010 - 0x0000)
struct PlayerCutsceneComponent_C_EnteredWorld final
{
public:
	class ASurvivalPlayer_V2_C*                   K2Node_DynamicCast_AsSurvival_Player_V2;           // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerCutsceneComponent_C_EnteredWorld) == 0x000008, "Wrong alignment on PlayerCutsceneComponent_C_EnteredWorld");
static_assert(sizeof(PlayerCutsceneComponent_C_EnteredWorld) == 0x000010, "Wrong size on PlayerCutsceneComponent_C_EnteredWorld");
static_assert(offsetof(PlayerCutsceneComponent_C_EnteredWorld, K2Node_DynamicCast_AsSurvival_Player_V2) == 0x000000, "Member 'PlayerCutsceneComponent_C_EnteredWorld::K2Node_DynamicCast_AsSurvival_Player_V2' has a wrong offset!");
static_assert(offsetof(PlayerCutsceneComponent_C_EnteredWorld, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'PlayerCutsceneComponent_C_EnteredWorld::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function PlayerCutsceneComponent.PlayerCutsceneComponent_C.ExecuteUbergraph_PlayerCutsceneComponent
// 0x2360 (0x2360 - 0x0000)
struct PlayerCutsceneComponent_C_ExecuteUbergraph_PlayerCutsceneComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_2;                              // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_3;                              // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_4;                              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_5;                              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_6;                              // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_7;                              // 0x005C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_8;                              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_9;                              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_10;                             // 0x007C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_11;                             // 0x0084(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_12;                             // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_13;                             // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTDB_LevelInspectorSubsystem*           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCurrentLevelLoadedFull_ReturnValue;    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00AC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerForNextTickDelegate_ReturnValue; // 0x00C0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerForNextTickDelegate_ReturnValue_1; // 0x00C8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UWBP_FlareSequenceTutorial_C*           CallFunc_Create_ReturnValue;                       // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_7;                              // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_14;                             // 0x00DC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_15;                             // 0x00E4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x00EC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_OriginLoc_5;                    // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_CustomEvent_OriginRot_5;                    // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_Ressurect;                      // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_OriginLoc_4;                    // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_CustomEvent_OriginRot_4;                    // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_Actor_4;                        // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0170(0x0010)(ConstParm, ReferenceParm)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0180(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x01E0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalLevelSequenceActor_C*          CallFunc_FinishSpawningActor_ReturnValue;          // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalLevelSequenceActor_C*          CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue;            // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue_1;          // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array_1;                          // 0x0270(0x0010)(ConstParm, ReferenceParm)
	class FString                                 CallFunc_Conv_VectorToString_ReturnValue;          // 0x0280(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_HubDoor_1;                      // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULevelSequence*                         K2Node_CustomEvent_LevelSequence;                  // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array_2;                          // 0x02B8(0x0010)(ConstParm, ReferenceParm)
	uint8                                         Pad_2C8[0x8];                                      // 0x02C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x02D0(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x0330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_16;                             // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASurvivalLevelSequenceActor_C*          CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x0340(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue_2;          // 0x0348(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_17;                             // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_18;                             // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0360(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_8;                              // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue_3;          // 0x0378(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Pos;                            // 0x0380(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_CustomEvent_Rot;                            // 0x0398(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_9;                              // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B1[0xF];                                      // 0x03B1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_2;              // 0x03C0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_19;                             // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3; // 0x0428(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalLevelSequenceActor_C*          CallFunc_FinishSpawningActor_ReturnValue_3;        // 0x0430(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0438(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue_4;          // 0x0448(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array_3;                          // 0x0450(0x0010)(ConstParm, ReferenceParm)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0460(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_LockingInput;                   // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_469[0x7];                                      // 0x0469(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAVS_VehicleMaster_C*                   K2Node_DynamicCast_AsAVS_Vehicle_Master;           // 0x0470(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_479[0x7];                                      // 0x0479(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player_1;            // 0x0480(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_489[0x7];                                      // 0x0489(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      CallFunc_Array_Get_Item;                           // 0x0490(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_499[0x7];                                      // 0x0499(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x04A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x04A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvPC_C*                              K2Node_DynamicCast_AsSurv_PC;                      // 0x04B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x04B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B9[0x7];                                      // 0x04B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvPC_C*                              K2Node_DynamicCast_AsSurv_PC_1;                    // 0x04C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x04C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C9[0x7];                                      // 0x04C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_SurvPC_C>         CallFunc_HidePlayers_self_CastInput;               // 0x04D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SurvPC_C>         CallFunc_HidePlayers_self_CastInput_1;             // 0x04E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_20;                             // 0x04F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_10;                             // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F9[0x3];                                      // 0x04F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x04FC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50C[0x4];                                      // 0x050C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_1;              // 0x0510(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player_2;            // 0x0518(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0520(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_521[0x7];                                      // 0x0521(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_Location_1;                     // 0x0528(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_CustomEvent_Rotation_1;                     // 0x0540(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_558[0x8];                                      // 0x0558(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_3;              // 0x0560(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_4; // 0x05C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x05C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalLevelSequenceActor_C*          CallFunc_FinishSpawningActor_ReturnValue_4;        // 0x05D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue_5;          // 0x05D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array_4;                          // 0x05E0(0x0010)(ConstParm, ReferenceParm)
	class FString                                 Temp_string_Variable;                              // 0x05F0(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Location;                       // 0x0600(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_CustomEvent_Rotation;                       // 0x0618(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_NeedWithoutChar;                // 0x0630(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0631(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_632[0xE];                                      // 0x0632(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_4;              // 0x0640(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_OnCars;                         // 0x06A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A1[0x7];                                      // 0x06A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_5; // 0x06A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
