#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerInventoryCollector

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "InventoryCollector_classes.hpp"
#include "ContainerPickupsInfo_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass PlayerInventoryCollector.PlayerInventoryCollector_C
// 0x0088 (0x0130 - 0x00A8)
class UPlayerInventoryCollector_C final : public UInventoryCollector_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_PlayerInventoryCollector_C;         // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<struct FContainerPickupsInfo>          Arr;                                               // 0x00B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FContainerPickupsInfo                  Array_Element;                                     // 0x00C0(0x0068)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         MoneycountTemp;                                    // 0x0128(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bProtective;                                       // 0x012C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddCustomMoney(int32 MCount);
	void CollectInventory(TArray<class FString>* Data, TArray<struct FFItemInfo>* ContainersData, TArray<struct FFItemInfo>* ContainerItems, bool* Succes_);
	void ExecuteUbergraph_PlayerInventoryCollector(int32 EntryPoint);
	void LoadSavedItemInfo(const class FString& SourceString, const struct FFItemInfo& FItemInfo, struct FFItemInfo* UpdatedFItemInfo);
	void NewFunction();
	void PlaceInventory(TArray<class FString>& Data);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayerInventoryCollector_C">();
	}
	static class UPlayerInventoryCollector_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerInventoryCollector_C>();
	}
};
static_assert(alignof(UPlayerInventoryCollector_C) == 0x000008, "Wrong alignment on UPlayerInventoryCollector_C");
static_assert(sizeof(UPlayerInventoryCollector_C) == 0x000130, "Wrong size on UPlayerInventoryCollector_C");
static_assert(offsetof(UPlayerInventoryCollector_C, UberGraphFrame_PlayerInventoryCollector_C) == 0x0000A8, "Member 'UPlayerInventoryCollector_C::UberGraphFrame_PlayerInventoryCollector_C' has a wrong offset!");
static_assert(offsetof(UPlayerInventoryCollector_C, Arr) == 0x0000B0, "Member 'UPlayerInventoryCollector_C::Arr' has a wrong offset!");
static_assert(offsetof(UPlayerInventoryCollector_C, Array_Element) == 0x0000C0, "Member 'UPlayerInventoryCollector_C::Array_Element' has a wrong offset!");
static_assert(offsetof(UPlayerInventoryCollector_C, MoneycountTemp) == 0x000128, "Member 'UPlayerInventoryCollector_C::MoneycountTemp' has a wrong offset!");
static_assert(offsetof(UPlayerInventoryCollector_C, bProtective) == 0x00012C, "Member 'UPlayerInventoryCollector_C::bProtective' has a wrong offset!");

}

