#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerSceneLoader

#include "Basic.hpp"

#include "S_PlayersArray_structs.hpp"


namespace SDK::Params
{

// Function PlayerSceneLoader.PlayerSceneLoader_C.ExecuteUbergraph_PlayerSceneLoader
// 0x0014 (0x0014 - 0x0000)
struct PlayerSceneLoader_C_ExecuteUbergraph_PlayerSceneLoader final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_Name;                           // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_LevelName;                      // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerSceneLoader_C_ExecuteUbergraph_PlayerSceneLoader) == 0x000004, "Wrong alignment on PlayerSceneLoader_C_ExecuteUbergraph_PlayerSceneLoader");
static_assert(sizeof(PlayerSceneLoader_C_ExecuteUbergraph_PlayerSceneLoader) == 0x000014, "Wrong size on PlayerSceneLoader_C_ExecuteUbergraph_PlayerSceneLoader");
static_assert(offsetof(PlayerSceneLoader_C_ExecuteUbergraph_PlayerSceneLoader, EntryPoint) == 0x000000, "Member 'PlayerSceneLoader_C_ExecuteUbergraph_PlayerSceneLoader::EntryPoint' has a wrong offset!");
static_assert(offsetof(PlayerSceneLoader_C_ExecuteUbergraph_PlayerSceneLoader, K2Node_CustomEvent_Name) == 0x000004, "Member 'PlayerSceneLoader_C_ExecuteUbergraph_PlayerSceneLoader::K2Node_CustomEvent_Name' has a wrong offset!");
static_assert(offsetof(PlayerSceneLoader_C_ExecuteUbergraph_PlayerSceneLoader, K2Node_CustomEvent_LevelName) == 0x00000C, "Member 'PlayerSceneLoader_C_ExecuteUbergraph_PlayerSceneLoader::K2Node_CustomEvent_LevelName' has a wrong offset!");

// Function PlayerSceneLoader.PlayerSceneLoader_C.LevelLoaded
// 0x0078 (0x0078 - 0x0000)
struct PlayerSceneLoader_C_LevelLoaded final
{
public:
	class FName                                   LevelName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Player;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_PlayersArray                        StructCache;                                       // 0x0010(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<class AActor*>                         PlayersCache;                                      // 0x0020(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ReferenceParm)
	struct FS_PlayersArray                        K2Node_MakeStruct_S_PlayersArray;                  // 0x0040(0x0010)(HasGetValueTypeHash)
	class ULevelStreaming*                        CallFunc_GetStreamingLevel_ReturnValue;            // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_PlayersArray                        CallFunc_Map_Find_Value;                           // 0x0060(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerSceneLoader_C_LevelLoaded) == 0x000008, "Wrong alignment on PlayerSceneLoader_C_LevelLoaded");
static_assert(sizeof(PlayerSceneLoader_C_LevelLoaded) == 0x000078, "Wrong size on PlayerSceneLoader_C_LevelLoaded");
static_assert(offsetof(PlayerSceneLoader_C_LevelLoaded, LevelName) == 0x000000, "Member 'PlayerSceneLoader_C_LevelLoaded::LevelName' has a wrong offset!");
static_assert(offsetof(PlayerSceneLoader_C_LevelLoaded, Player) == 0x000008, "Member 'PlayerSceneLoader_C_LevelLoaded::Player' has a wrong offset!");
static_assert(offsetof(PlayerSceneLoader_C_LevelLoaded, StructCache) == 0x000010, "Member 'PlayerSceneLoader_C_LevelLoaded::StructCache' has a wrong offset!");
static_assert(offsetof(PlayerSceneLoader_C_LevelLoaded, PlayersCache) == 0x000020, "Member 'PlayerSceneLoader_C_LevelLoaded::PlayersCache' has a wrong offset!");
static_assert(offsetof(PlayerSceneLoader_C_LevelLoaded, K2Node_MakeArray_Array) == 0x000030, "Member 'PlayerSceneLoader_C_LevelLoaded::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(PlayerSceneLoader_C_LevelLoaded, K2Node_MakeStruct_S_PlayersArray) == 0x000040, "Member 'PlayerSceneLoader_C_LevelLoaded::K2Node_MakeStruct_S_PlayersArray' has a wrong offset!");
static_assert(offsetof(PlayerSceneLoader_C_LevelLoaded, CallFunc_GetStreamingLevel_ReturnValue) == 0x000050, "Member 'PlayerSceneLoader_C_LevelLoaded::CallFunc_GetStreamingLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSceneLoader_C_LevelLoaded, CallFunc_Array_Add_ReturnValue) == 0x000058, "Member 'PlayerSceneLoader_C_LevelLoaded::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSceneLoader_C_LevelLoaded, CallFunc_Map_Find_Value) == 0x000060, "Member 'PlayerSceneLoader_C_LevelLoaded::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(PlayerSceneLoader_C_LevelLoaded, CallFunc_Map_Find_ReturnValue) == 0x000070, "Member 'PlayerSceneLoader_C_LevelLoaded::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function PlayerSceneLoader.PlayerSceneLoader_C.LoadLevel
// 0x0008 (0x0008 - 0x0000)
struct PlayerSceneLoader_C_LoadLevel final
{
public:
	class FName                                   Param_Name;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerSceneLoader_C_LoadLevel) == 0x000004, "Wrong alignment on PlayerSceneLoader_C_LoadLevel");
static_assert(sizeof(PlayerSceneLoader_C_LoadLevel) == 0x000008, "Wrong size on PlayerSceneLoader_C_LoadLevel");
static_assert(offsetof(PlayerSceneLoader_C_LoadLevel, Param_Name) == 0x000000, "Member 'PlayerSceneLoader_C_LoadLevel::Param_Name' has a wrong offset!");

// Function PlayerSceneLoader.PlayerSceneLoader_C.UnloadedLevel
// 0x0008 (0x0008 - 0x0000)
struct PlayerSceneLoader_C_UnloadedLevel final
{
public:
	class FName                                   LevelName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerSceneLoader_C_UnloadedLevel) == 0x000004, "Wrong alignment on PlayerSceneLoader_C_UnloadedLevel");
static_assert(sizeof(PlayerSceneLoader_C_UnloadedLevel) == 0x000008, "Wrong size on PlayerSceneLoader_C_UnloadedLevel");
static_assert(offsetof(PlayerSceneLoader_C_UnloadedLevel, LevelName) == 0x000000, "Member 'PlayerSceneLoader_C_UnloadedLevel::LevelName' has a wrong offset!");

}

