#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerDeadBodyV2

#include "Basic.hpp"

#include "DefaultItemInfo_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "DropItemEntry_structs.hpp"
#include "EDeadBodyEnvType_structs.hpp"
#include "ContainerPickupsInfo_structs.hpp"
#include "EDeadBodyState_structs.hpp"
#include "EquipmentData_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function PlayerDeadBodyV2.PlayerDeadBodyV2_C.ActivateDeadBody
// 0x0060 (0x0060 - 0x0000)
struct PlayerDeadBodyV2_C_ActivateDeadBody final
{
public:
	TArray<struct FDropItemEntry>                 DroppedItems;                                      // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FVector                                HitVector;                                         // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OnDeathVelocity;                                   // 0x0028(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   HitBoneName;                                       // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  Param_Player;                                      // 0x0048(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  Killer;                                            // 0x0050(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          RadialDamage;                                      // 0x0058(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Animed;                                            // 0x0059(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerDeadBodyV2_C_ActivateDeadBody) == 0x000008, "Wrong alignment on PlayerDeadBodyV2_C_ActivateDeadBody");
static_assert(sizeof(PlayerDeadBodyV2_C_ActivateDeadBody) == 0x000060, "Wrong size on PlayerDeadBodyV2_C_ActivateDeadBody");
static_assert(offsetof(PlayerDeadBodyV2_C_ActivateDeadBody, DroppedItems) == 0x000000, "Member 'PlayerDeadBodyV2_C_ActivateDeadBody::DroppedItems' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_ActivateDeadBody, HitVector) == 0x000010, "Member 'PlayerDeadBodyV2_C_ActivateDeadBody::HitVector' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_ActivateDeadBody, OnDeathVelocity) == 0x000028, "Member 'PlayerDeadBodyV2_C_ActivateDeadBody::OnDeathVelocity' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_ActivateDeadBody, HitBoneName) == 0x000040, "Member 'PlayerDeadBodyV2_C_ActivateDeadBody::HitBoneName' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_ActivateDeadBody, Param_Player) == 0x000048, "Member 'PlayerDeadBodyV2_C_ActivateDeadBody::Param_Player' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_ActivateDeadBody, Killer) == 0x000050, "Member 'PlayerDeadBodyV2_C_ActivateDeadBody::Killer' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_ActivateDeadBody, RadialDamage) == 0x000058, "Member 'PlayerDeadBodyV2_C_ActivateDeadBody::RadialDamage' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_ActivateDeadBody, Animed) == 0x000059, "Member 'PlayerDeadBodyV2_C_ActivateDeadBody::Animed' has a wrong offset!");

// Function PlayerDeadBodyV2.PlayerDeadBodyV2_C.ApplyPhysics
// 0x0210 (0x0210 - 0x0000)
struct PlayerDeadBodyV2_C_ApplyPhysics final
{
public:
	struct FVector                                HitVector;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OnDeathVelocity;                                   // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   HitBoneName;                                       // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  Killer;                                            // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          RadialDamage;                                      // 0x0040(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Impulse;                                           // 0x0048(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  CallFunc_Quat_FindBetweenVectors_ReturnValue;      // 0x0080(0x0020)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakQuat_X;                              // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakQuat_Y;                              // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakQuat_Z;                              // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakQuat_W;                              // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00D0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00E8(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetImpulse_Impulse;                       // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_LimitPhysicsVelocity_ResultVelocity;      // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ClampVectorSize_ReturnValue;              // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_Normal2D_ReturnValue;              // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue; // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_X_ImplicitCast;                // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_Y_ImplicitCast;                // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_Z_ImplicitCast;                // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerDeadBodyV2_C_ApplyPhysics) == 0x000010, "Wrong alignment on PlayerDeadBodyV2_C_ApplyPhysics");
static_assert(sizeof(PlayerDeadBodyV2_C_ApplyPhysics) == 0x000210, "Wrong size on PlayerDeadBodyV2_C_ApplyPhysics");
static_assert(offsetof(PlayerDeadBodyV2_C_ApplyPhysics, HitVector) == 0x000000, "Member 'PlayerDeadBodyV2_C_ApplyPhysics::HitVector' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_ApplyPhysics, OnDeathVelocity) == 0x000018, "Member 'PlayerDeadBodyV2_C_ApplyPhysics::OnDeathVelocity' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_ApplyPhysics, HitBoneName) == 0x000030, "Member 'PlayerDeadBodyV2_C_ApplyPhysics::HitBoneName' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_ApplyPhysics, Killer) == 0x000038, "Member 'PlayerDeadBodyV2_C_ApplyPhysics::Killer' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_ApplyPhysics, RadialDamage) == 0x000040, "Member 'PlayerDeadBodyV2_C_ApplyPhysics::RadialDamage' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_ApplyPhysics, Impulse) == 0x000048, "Member 'PlayerDeadBodyV2_C_ApplyPhysics::Impulse' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_ApplyPhysics, CallFunc_GetSocketLocation_ReturnValue) == 0x000060, "Member 'PlayerDeadBodyV2_C_ApplyPhysics::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_ApplyPhysics, CallFunc_Quat_FindBetweenVectors_ReturnValue) == 0x000080, "Member 'PlayerDeadBodyV2_C_ApplyPhysics::CallFunc_Quat_FindBetweenVectors_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_ApplyPhysics, CallFunc_IsDedicatedServer_ReturnValue) == 0x0000A0, "Member 'PlayerDeadBodyV2_C_ApplyPhysics::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_ApplyPhysics, CallFunc_BreakQuat_X) == 0x0000A4, "Member 'PlayerDeadBodyV2_C_ApplyPhysics::CallFunc_BreakQuat_X' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_ApplyPhysics, CallFunc_BreakQuat_Y) == 0x0000A8, "Member 'PlayerDeadBodyV2_C_ApplyPhysics::CallFunc_BreakQuat_Y' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_ApplyPhysics, CallFunc_BreakQuat_Z) == 0x0000AC, "Member 'PlayerDeadBodyV2_C_ApplyPhysics::CallFunc_BreakQuat_Z' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_ApplyPhysics, CallFunc_BreakQuat_W) == 0x0000B0, "Member 'PlayerDeadBodyV2_C_ApplyPhysics::CallFunc_BreakQuat_W' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_ApplyPhysics, CallFunc_MakeVector_ReturnValue) == 0x0000B8, "Member 'PlayerDeadBodyV2_C_ApplyPhysics::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_ApplyPhysics, K2Node_CreateDelegate_OutputDelegate) == 0x0000D0, "Member 'PlayerDeadBodyV2_C_ApplyPhysics::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_ApplyPhysics, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x0000E0, "Member 'PlayerDeadBodyV2_C_ApplyPhysics::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_ApplyPhysics, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000E8, "Member 'PlayerDeadBodyV2_C_ApplyPhysics::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_ApplyPhysics, CallFunc_GetImpulse_Impulse) == 0x0000F0, "Member 'PlayerDeadBodyV2_C_ApplyPhysics::CallFunc_GetImpulse_Impulse' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_ApplyPhysics, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x0000F8, "Member 'PlayerDeadBodyV2_C_ApplyPhysics::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_ApplyPhysics, CallFunc_Conv_DoubleToVector_ReturnValue_1) == 0x000110, "Member 'PlayerDeadBodyV2_C_ApplyPhysics::CallFunc_Conv_DoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_ApplyPhysics, CallFunc_LimitPhysicsVelocity_ResultVelocity) == 0x000128, "Member 'PlayerDeadBodyV2_C_ApplyPhysics::CallFunc_LimitPhysicsVelocity_ResultVelocity' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_ApplyPhysics, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000140, "Member 'PlayerDeadBodyV2_C_ApplyPhysics::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_ApplyPhysics, CallFunc_ClampVectorSize_ReturnValue) == 0x000158, "Member 'PlayerDeadBodyV2_C_ApplyPhysics::CallFunc_ClampVectorSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_ApplyPhysics, CallFunc_GetSocketLocation_ReturnValue_1) == 0x000170, "Member 'PlayerDeadBodyV2_C_ApplyPhysics::CallFunc_GetSocketLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_ApplyPhysics, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000188, "Member 'PlayerDeadBodyV2_C_ApplyPhysics::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_ApplyPhysics, CallFunc_Vector_Normal2D_ReturnValue) == 0x0001A0, "Member 'PlayerDeadBodyV2_C_ApplyPhysics::CallFunc_Vector_Normal2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_ApplyPhysics, CallFunc_GreaterGreater_VectorRotator_ReturnValue) == 0x0001B8, "Member 'PlayerDeadBodyV2_C_ApplyPhysics::CallFunc_GreaterGreater_VectorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_ApplyPhysics, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x0001D0, "Member 'PlayerDeadBodyV2_C_ApplyPhysics::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_ApplyPhysics, CallFunc_MakeVector_X_ImplicitCast) == 0x0001E8, "Member 'PlayerDeadBodyV2_C_ApplyPhysics::CallFunc_MakeVector_X_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_ApplyPhysics, CallFunc_MakeVector_Y_ImplicitCast) == 0x0001F0, "Member 'PlayerDeadBodyV2_C_ApplyPhysics::CallFunc_MakeVector_Y_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_ApplyPhysics, CallFunc_MakeVector_Z_ImplicitCast) == 0x0001F8, "Member 'PlayerDeadBodyV2_C_ApplyPhysics::CallFunc_MakeVector_Z_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_ApplyPhysics, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x000200, "Member 'PlayerDeadBodyV2_C_ApplyPhysics::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");

// Function PlayerDeadBodyV2.PlayerDeadBodyV2_C.ApplyWaterFloatForce
// 0x001C (0x001C - 0x0000)
struct PlayerDeadBodyV2_C_ApplyWaterFloatForce final
{
public:
	class FName                                   Temp_name_Variable;                                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerDeadBodyV2_C_ApplyWaterFloatForce) == 0x000004, "Wrong alignment on PlayerDeadBodyV2_C_ApplyWaterFloatForce");
static_assert(sizeof(PlayerDeadBodyV2_C_ApplyWaterFloatForce) == 0x00001C, "Wrong size on PlayerDeadBodyV2_C_ApplyWaterFloatForce");
static_assert(offsetof(PlayerDeadBodyV2_C_ApplyWaterFloatForce, Temp_name_Variable) == 0x000000, "Member 'PlayerDeadBodyV2_C_ApplyWaterFloatForce::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_ApplyWaterFloatForce, Temp_name_Variable_1) == 0x000008, "Member 'PlayerDeadBodyV2_C_ApplyWaterFloatForce::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_ApplyWaterFloatForce, Temp_bool_Variable) == 0x000010, "Member 'PlayerDeadBodyV2_C_ApplyWaterFloatForce::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_ApplyWaterFloatForce, K2Node_Select_Default) == 0x000014, "Member 'PlayerDeadBodyV2_C_ApplyWaterFloatForce::K2Node_Select_Default' has a wrong offset!");

// Function PlayerDeadBodyV2.PlayerDeadBodyV2_C.BndEvt__PlayerDeadBodyV2_WaterDetectionSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct PlayerDeadBodyV2_C_BndEvt__PlayerDeadBodyV2_WaterDetectionSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(PlayerDeadBodyV2_C_BndEvt__PlayerDeadBodyV2_WaterDetectionSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on PlayerDeadBodyV2_C_BndEvt__PlayerDeadBodyV2_WaterDetectionSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(PlayerDeadBodyV2_C_BndEvt__PlayerDeadBodyV2_WaterDetectionSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on PlayerDeadBodyV2_C_BndEvt__PlayerDeadBodyV2_WaterDetectionSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(PlayerDeadBodyV2_C_BndEvt__PlayerDeadBodyV2_WaterDetectionSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'PlayerDeadBodyV2_C_BndEvt__PlayerDeadBodyV2_WaterDetectionSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_BndEvt__PlayerDeadBodyV2_WaterDetectionSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'PlayerDeadBodyV2_C_BndEvt__PlayerDeadBodyV2_WaterDetectionSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_BndEvt__PlayerDeadBodyV2_WaterDetectionSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'PlayerDeadBodyV2_C_BndEvt__PlayerDeadBodyV2_WaterDetectionSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_BndEvt__PlayerDeadBodyV2_WaterDetectionSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'PlayerDeadBodyV2_C_BndEvt__PlayerDeadBodyV2_WaterDetectionSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_BndEvt__PlayerDeadBodyV2_WaterDetectionSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'PlayerDeadBodyV2_C_BndEvt__PlayerDeadBodyV2_WaterDetectionSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_BndEvt__PlayerDeadBodyV2_WaterDetectionSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'PlayerDeadBodyV2_C_BndEvt__PlayerDeadBodyV2_WaterDetectionSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function PlayerDeadBodyV2.PlayerDeadBodyV2_C.BndEvt__PlayerDeadBodyV2_WaterDetectionSphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct PlayerDeadBodyV2_C_BndEvt__PlayerDeadBodyV2_WaterDetectionSphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerDeadBodyV2_C_BndEvt__PlayerDeadBodyV2_WaterDetectionSphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on PlayerDeadBodyV2_C_BndEvt__PlayerDeadBodyV2_WaterDetectionSphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(PlayerDeadBodyV2_C_BndEvt__PlayerDeadBodyV2_WaterDetectionSphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on PlayerDeadBodyV2_C_BndEvt__PlayerDeadBodyV2_WaterDetectionSphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(PlayerDeadBodyV2_C_BndEvt__PlayerDeadBodyV2_WaterDetectionSphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'PlayerDeadBodyV2_C_BndEvt__PlayerDeadBodyV2_WaterDetectionSphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_BndEvt__PlayerDeadBodyV2_WaterDetectionSphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'PlayerDeadBodyV2_C_BndEvt__PlayerDeadBodyV2_WaterDetectionSphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_BndEvt__PlayerDeadBodyV2_WaterDetectionSphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'PlayerDeadBodyV2_C_BndEvt__PlayerDeadBodyV2_WaterDetectionSphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_BndEvt__PlayerDeadBodyV2_WaterDetectionSphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'PlayerDeadBodyV2_C_BndEvt__PlayerDeadBodyV2_WaterDetectionSphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function PlayerDeadBodyV2.PlayerDeadBodyV2_C.BodyWaterForce
// 0x0098 (0x0098 - 0x0000)
struct PlayerDeadBodyV2_C_BodyWaterForce final
{
public:
	class FName                                   InSocketName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Force;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMass_ReturnValue;                      // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerDeadBodyV2_C_BodyWaterForce) == 0x000008, "Wrong alignment on PlayerDeadBodyV2_C_BodyWaterForce");
static_assert(sizeof(PlayerDeadBodyV2_C_BodyWaterForce) == 0x000098, "Wrong size on PlayerDeadBodyV2_C_BodyWaterForce");
static_assert(offsetof(PlayerDeadBodyV2_C_BodyWaterForce, InSocketName) == 0x000000, "Member 'PlayerDeadBodyV2_C_BodyWaterForce::InSocketName' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_BodyWaterForce, Force) == 0x000008, "Member 'PlayerDeadBodyV2_C_BodyWaterForce::Force' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_BodyWaterForce, Temp_real_Variable) == 0x000010, "Member 'PlayerDeadBodyV2_C_BodyWaterForce::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_BodyWaterForce, Temp_real_Variable_1) == 0x000018, "Member 'PlayerDeadBodyV2_C_BodyWaterForce::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_BodyWaterForce, Temp_bool_Variable) == 0x000020, "Member 'PlayerDeadBodyV2_C_BodyWaterForce::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_BodyWaterForce, CallFunc_GetMass_ReturnValue) == 0x000024, "Member 'PlayerDeadBodyV2_C_BodyWaterForce::CallFunc_GetMass_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_BodyWaterForce, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000028, "Member 'PlayerDeadBodyV2_C_BodyWaterForce::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_BodyWaterForce, K2Node_Select_Default) == 0x000030, "Member 'PlayerDeadBodyV2_C_BodyWaterForce::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_BodyWaterForce, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000038, "Member 'PlayerDeadBodyV2_C_BodyWaterForce::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_BodyWaterForce, CallFunc_MakeVector_ReturnValue) == 0x000040, "Member 'PlayerDeadBodyV2_C_BodyWaterForce::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_BodyWaterForce, CallFunc_GetSocketLocation_ReturnValue) == 0x000058, "Member 'PlayerDeadBodyV2_C_BodyWaterForce::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_BodyWaterForce, CallFunc_BreakVector_X) == 0x000070, "Member 'PlayerDeadBodyV2_C_BodyWaterForce::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_BodyWaterForce, CallFunc_BreakVector_Y) == 0x000078, "Member 'PlayerDeadBodyV2_C_BodyWaterForce::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_BodyWaterForce, CallFunc_BreakVector_Z) == 0x000080, "Member 'PlayerDeadBodyV2_C_BodyWaterForce::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_BodyWaterForce, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000088, "Member 'PlayerDeadBodyV2_C_BodyWaterForce::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_BodyWaterForce, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000090, "Member 'PlayerDeadBodyV2_C_BodyWaterForce::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function PlayerDeadBodyV2.PlayerDeadBodyV2_C.CopyMaterials
// 0x0060 (0x0060 - 0x0000)
struct PlayerDeadBodyV2_C_CopyMaterials final
{
public:
	class USkeletalMeshComponent*                 TargetMesh;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          NewMesh;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSkeletalMaterial>              CallFunc_GetMaterials_ReturnValue;                 // 0x0010(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSkeletalMaterial                      CallFunc_Array_Get_Item;                           // 0x0028(0x0028)(NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerDeadBodyV2_C_CopyMaterials) == 0x000008, "Wrong alignment on PlayerDeadBodyV2_C_CopyMaterials");
static_assert(sizeof(PlayerDeadBodyV2_C_CopyMaterials) == 0x000060, "Wrong size on PlayerDeadBodyV2_C_CopyMaterials");
static_assert(offsetof(PlayerDeadBodyV2_C_CopyMaterials, TargetMesh) == 0x000000, "Member 'PlayerDeadBodyV2_C_CopyMaterials::TargetMesh' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_CopyMaterials, NewMesh) == 0x000008, "Member 'PlayerDeadBodyV2_C_CopyMaterials::NewMesh' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_CopyMaterials, CallFunc_GetMaterials_ReturnValue) == 0x000010, "Member 'PlayerDeadBodyV2_C_CopyMaterials::CallFunc_GetMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_CopyMaterials, Temp_int_Array_Index_Variable) == 0x000020, "Member 'PlayerDeadBodyV2_C_CopyMaterials::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_CopyMaterials, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'PlayerDeadBodyV2_C_CopyMaterials::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_CopyMaterials, CallFunc_Array_Get_Item) == 0x000028, "Member 'PlayerDeadBodyV2_C_CopyMaterials::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_CopyMaterials, Temp_int_Loop_Counter_Variable) == 0x000050, "Member 'PlayerDeadBodyV2_C_CopyMaterials::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_CopyMaterials, CallFunc_Less_IntInt_ReturnValue) == 0x000054, "Member 'PlayerDeadBodyV2_C_CopyMaterials::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_CopyMaterials, CallFunc_Add_IntInt_ReturnValue) == 0x000058, "Member 'PlayerDeadBodyV2_C_CopyMaterials::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function PlayerDeadBodyV2.PlayerDeadBodyV2_C.CopyMeshes
// 0x0040 (0x0040 - 0x0000)
struct PlayerDeadBodyV2_C_CopyMeshes final
{
public:
	class APawn*                                  Param_Player;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class USkeletalMeshComponent*>         K2Node_MakeArray_Array_1;                          // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(PlayerDeadBodyV2_C_CopyMeshes) == 0x000008, "Wrong alignment on PlayerDeadBodyV2_C_CopyMeshes");
static_assert(sizeof(PlayerDeadBodyV2_C_CopyMeshes) == 0x000040, "Wrong size on PlayerDeadBodyV2_C_CopyMeshes");
static_assert(offsetof(PlayerDeadBodyV2_C_CopyMeshes, Param_Player) == 0x000000, "Member 'PlayerDeadBodyV2_C_CopyMeshes::Param_Player' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_CopyMeshes, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'PlayerDeadBodyV2_C_CopyMeshes::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_CopyMeshes, K2Node_DynamicCast_AsSurvival_Player) == 0x000010, "Member 'PlayerDeadBodyV2_C_CopyMeshes::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_CopyMeshes, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'PlayerDeadBodyV2_C_CopyMeshes::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_CopyMeshes, K2Node_MakeArray_Array) == 0x000020, "Member 'PlayerDeadBodyV2_C_CopyMeshes::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_CopyMeshes, K2Node_MakeArray_Array_1) == 0x000030, "Member 'PlayerDeadBodyV2_C_CopyMeshes::K2Node_MakeArray_Array_1' has a wrong offset!");

// Function PlayerDeadBodyV2.PlayerDeadBodyV2_C.CopySkeletal
// 0x0058 (0x0058 - 0x0000)
struct PlayerDeadBodyV2_C_CopySkeletal final
{
public:
	class USkeletalMeshComponent*                 TargetSkeletal;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 NewSkeletal;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue;                 // 0x0020(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          CallFunc_GetSkeletalMeshAsset_ReturnValue;         // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerDeadBodyV2_C_CopySkeletal) == 0x000008, "Wrong alignment on PlayerDeadBodyV2_C_CopySkeletal");
static_assert(sizeof(PlayerDeadBodyV2_C_CopySkeletal) == 0x000058, "Wrong size on PlayerDeadBodyV2_C_CopySkeletal");
static_assert(offsetof(PlayerDeadBodyV2_C_CopySkeletal, TargetSkeletal) == 0x000000, "Member 'PlayerDeadBodyV2_C_CopySkeletal::TargetSkeletal' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_CopySkeletal, NewSkeletal) == 0x000008, "Member 'PlayerDeadBodyV2_C_CopySkeletal::NewSkeletal' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_CopySkeletal, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'PlayerDeadBodyV2_C_CopySkeletal::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_CopySkeletal, Temp_int_Array_Index_Variable) == 0x000014, "Member 'PlayerDeadBodyV2_C_CopySkeletal::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_CopySkeletal, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'PlayerDeadBodyV2_C_CopySkeletal::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_CopySkeletal, CallFunc_GetMaterials_ReturnValue) == 0x000020, "Member 'PlayerDeadBodyV2_C_CopySkeletal::CallFunc_GetMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_CopySkeletal, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'PlayerDeadBodyV2_C_CopySkeletal::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_CopySkeletal, CallFunc_Array_Get_Item) == 0x000038, "Member 'PlayerDeadBodyV2_C_CopySkeletal::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_CopySkeletal, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'PlayerDeadBodyV2_C_CopySkeletal::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_CopySkeletal, CallFunc_Less_IntInt_ReturnValue) == 0x000044, "Member 'PlayerDeadBodyV2_C_CopySkeletal::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_CopySkeletal, CallFunc_GetSkeletalMeshAsset_ReturnValue) == 0x000048, "Member 'PlayerDeadBodyV2_C_CopySkeletal::CallFunc_GetSkeletalMeshAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_CopySkeletal, CallFunc_IsValid_ReturnValue_1) == 0x000050, "Member 'PlayerDeadBodyV2_C_CopySkeletal::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_CopySkeletal, CallFunc_BooleanAND_ReturnValue) == 0x000051, "Member 'PlayerDeadBodyV2_C_CopySkeletal::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function PlayerDeadBodyV2.PlayerDeadBodyV2_C.CopySkeletals
// 0x0058 (0x0058 - 0x0000)
struct PlayerDeadBodyV2_C_CopySkeletals final
{
public:
	TArray<class USkeletalMeshComponent*>         TargetSkeletal;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class USkeletalMeshComponent*>         NewSkeletal;                                       // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item_1;                         // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue_1;           // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerDeadBodyV2_C_CopySkeletals) == 0x000008, "Wrong alignment on PlayerDeadBodyV2_C_CopySkeletals");
static_assert(sizeof(PlayerDeadBodyV2_C_CopySkeletals) == 0x000058, "Wrong size on PlayerDeadBodyV2_C_CopySkeletals");
static_assert(offsetof(PlayerDeadBodyV2_C_CopySkeletals, TargetSkeletal) == 0x000000, "Member 'PlayerDeadBodyV2_C_CopySkeletals::TargetSkeletal' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_CopySkeletals, NewSkeletal) == 0x000010, "Member 'PlayerDeadBodyV2_C_CopySkeletals::NewSkeletal' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_CopySkeletals, Temp_int_Array_Index_Variable) == 0x000020, "Member 'PlayerDeadBodyV2_C_CopySkeletals::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_CopySkeletals, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'PlayerDeadBodyV2_C_CopySkeletals::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_CopySkeletals, CallFunc_Array_Get_Item) == 0x000028, "Member 'PlayerDeadBodyV2_C_CopySkeletals::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_CopySkeletals, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'PlayerDeadBodyV2_C_CopySkeletals::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_CopySkeletals, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'PlayerDeadBodyV2_C_CopySkeletals::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_CopySkeletals, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'PlayerDeadBodyV2_C_CopySkeletals::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_CopySkeletals, CallFunc_Array_Get_Item_1) == 0x000040, "Member 'PlayerDeadBodyV2_C_CopySkeletals::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_CopySkeletals, CallFunc_Array_Length_ReturnValue_1) == 0x000048, "Member 'PlayerDeadBodyV2_C_CopySkeletals::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_CopySkeletals, CallFunc_Array_Length_ReturnValue_2) == 0x00004C, "Member 'PlayerDeadBodyV2_C_CopySkeletals::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_CopySkeletals, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000050, "Member 'PlayerDeadBodyV2_C_CopySkeletals::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_CopySkeletals, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000051, "Member 'PlayerDeadBodyV2_C_CopySkeletals::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_CopySkeletals, CallFunc_Array_IsNotEmpty_ReturnValue_1) == 0x000052, "Member 'PlayerDeadBodyV2_C_CopySkeletals::CallFunc_Array_IsNotEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_CopySkeletals, CallFunc_BooleanAND_ReturnValue) == 0x000053, "Member 'PlayerDeadBodyV2_C_CopySkeletals::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDeadBodyV2_C_CopySkeletals, CallFunc_BooleanAND_ReturnValue_1) == 0x000054, "Member 'PlayerDeadBodyV2_C_CopySkeletals::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function PlayerDeadBodyV2.PlayerDeadBodyV2_C.Create Loot
// 0x03D0 (0x03D0 - 0x0000)
struct PlayerDeadBodyV2_C_Create_Loot final
{
public:
	TArray<struct FDropItemEntry>                 DroppedItems;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class APawn*                                  Param_Player;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         B;                                                 // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Rows;                                              // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             DefaultLocation;                                   // 0x0020(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FDefaultItemInfo>               DefaultItems;                                      // 0x0080(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x00B0(0x0018)(ConstParm)
	class ADeadBodyLootPoint_C*                   CallFunc_FinishSpawningActor_ReturnValue;          // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDropItemEntry                         CallFunc_Array_Get_Item;                           // 0x00D8(0x0240)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x031C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31D[0x3];                                      // 0x031D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X;                          // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33C[0x4];                                      // 0x033C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDefaultItemInfo                       K2Node_MakeStruct_DefaultItemInfo;                 // 0x0340(0x0040)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
