#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerPlaceholder

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PlayerPlaceholder.PlayerPlaceholder_C
// 0x00B8 (0x03D0 - 0x0318)
class APlayerPlaceholder_C final : public APawn
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0318(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWorldPartitionStreamingSourceComponent* WorldPartitionStreamingSource;                     // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SceneCube;                                         // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SceneCube1;                                        // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       Camera;                                            // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ALevelStreamer_C*                       LevelStreamer;                                     // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_Test_C*                 Pawn;                                              // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          NewPers;                                           // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PlayerPicked;                                      // 0x0359(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LevelsLoaded;                                      // 0x035A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35B[0x5];                                      // 0x035B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharSelector_C*                        CharSelector;                                      // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Gravity_Scale_Temp;                                // 0x0368(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36C[0x4];                                      // 0x036C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_V2_C*                   SpawnedChar;                                       // 0x0370(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSet<class FString>                           KomnataStages;                                     // 0x0378(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          LoginCompleted;                                    // 0x03C8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)

public:
	void ClientLevelLoaded(class FName LevelName);
	void ClientLevelUnloaded(class FName LevelName);
	void Collapse_Palatka(TScriptInterface<class IBPI_SurvPC_C> PC);
	void CustomEvent();
	void DelayNePashet();
	void DelayNePashetx2();
	void DestrSelfServ();
	void ExecuteUbergraph_PlayerPlaceholder(int32 EntryPoint);
	void InitPlayer(const struct FVector& PlayerPos, const struct FRotator& Spawn_Transform_Rotation);
	void InpActEvt_Alt_Two_K2Node_InputKeyEvent_0(const struct FKey& Key);
	void InpActEvt_Home_K2Node_InputKeyEvent_1(const struct FKey& Key);
	void InpActEvt_PickNewHero_K2Node_InputActionEvent_1(const struct FKey& Key);
	void InpActEvt_PickOldHero_K2Node_InputActionEvent_0(const struct FKey& Key);
	void LoadPlayerPos();
	void MoveStartPoint(const struct FVector& Location, const struct FRotator& Rotation);
	void OnLevelLoaded(class FName LevelName);
	void ONLevelsLoaded();
	void OnLevelUnloaded(class FName LevelName);
	void OnRep_LoginCompleted();
	void OnServerLoad(class ASurvPC_C* SurvPC);
	void OnServerLogin();
	void PickPlayer(bool Param_NewPers);
	void PickSpawnPoint();
	void PickSpawnPoint_Player();
	void ReceiveBeginPlay();
	void ReceiveDestroyed();
	void Serv_OnLevelsLoaded();
	void ServerCall(class APawn* InPawn, class AController* Target);
	void ServerLogin();
	void ServerLogined(class ASurvPC_C* SurvPC);
	void ServerPickSpawnPoint();
	void SetSurvLocationServ(const struct FVector& NewLocation);
	void Test(class ASurvivalPlayer_C* Target);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayerPlaceholder_C">();
	}
	static class APlayerPlaceholder_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APlayerPlaceholder_C>();
	}
};
static_assert(alignof(APlayerPlaceholder_C) == 0x000008, "Wrong alignment on APlayerPlaceholder_C");
static_assert(sizeof(APlayerPlaceholder_C) == 0x0003D0, "Wrong size on APlayerPlaceholder_C");
static_assert(offsetof(APlayerPlaceholder_C, UberGraphFrame) == 0x000318, "Member 'APlayerPlaceholder_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APlayerPlaceholder_C, WorldPartitionStreamingSource) == 0x000320, "Member 'APlayerPlaceholder_C::WorldPartitionStreamingSource' has a wrong offset!");
static_assert(offsetof(APlayerPlaceholder_C, SceneCube) == 0x000328, "Member 'APlayerPlaceholder_C::SceneCube' has a wrong offset!");
static_assert(offsetof(APlayerPlaceholder_C, SceneCube1) == 0x000330, "Member 'APlayerPlaceholder_C::SceneCube1' has a wrong offset!");
static_assert(offsetof(APlayerPlaceholder_C, Camera) == 0x000338, "Member 'APlayerPlaceholder_C::Camera' has a wrong offset!");
static_assert(offsetof(APlayerPlaceholder_C, DefaultSceneRoot) == 0x000340, "Member 'APlayerPlaceholder_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(APlayerPlaceholder_C, LevelStreamer) == 0x000348, "Member 'APlayerPlaceholder_C::LevelStreamer' has a wrong offset!");
static_assert(offsetof(APlayerPlaceholder_C, Pawn) == 0x000350, "Member 'APlayerPlaceholder_C::Pawn' has a wrong offset!");
static_assert(offsetof(APlayerPlaceholder_C, NewPers) == 0x000358, "Member 'APlayerPlaceholder_C::NewPers' has a wrong offset!");
static_assert(offsetof(APlayerPlaceholder_C, PlayerPicked) == 0x000359, "Member 'APlayerPlaceholder_C::PlayerPicked' has a wrong offset!");
static_assert(offsetof(APlayerPlaceholder_C, LevelsLoaded) == 0x00035A, "Member 'APlayerPlaceholder_C::LevelsLoaded' has a wrong offset!");
static_assert(offsetof(APlayerPlaceholder_C, CharSelector) == 0x000360, "Member 'APlayerPlaceholder_C::CharSelector' has a wrong offset!");
static_assert(offsetof(APlayerPlaceholder_C, Gravity_Scale_Temp) == 0x000368, "Member 'APlayerPlaceholder_C::Gravity_Scale_Temp' has a wrong offset!");
static_assert(offsetof(APlayerPlaceholder_C, SpawnedChar) == 0x000370, "Member 'APlayerPlaceholder_C::SpawnedChar' has a wrong offset!");
static_assert(offsetof(APlayerPlaceholder_C, KomnataStages) == 0x000378, "Member 'APlayerPlaceholder_C::KomnataStages' has a wrong offset!");
static_assert(offsetof(APlayerPlaceholder_C, LoginCompleted) == 0x0003C8, "Member 'APlayerPlaceholder_C::LoginCompleted' has a wrong offset!");

}

