#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerInventoryCollector

#include "Basic.hpp"

#include "FItemInfo_structs.hpp"
#include "AttachmentInfo_structs.hpp"
#include "PickupAttachments_structs.hpp"
#include "ContainerPickupsInfo_structs.hpp"


namespace SDK::Params
{

// Function PlayerInventoryCollector.PlayerInventoryCollector_C.AddCustomMoney
// 0x0004 (0x0004 - 0x0000)
struct PlayerInventoryCollector_C_AddCustomMoney final
{
public:
	int32                                         MCount;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerInventoryCollector_C_AddCustomMoney) == 0x000004, "Wrong alignment on PlayerInventoryCollector_C_AddCustomMoney");
static_assert(sizeof(PlayerInventoryCollector_C_AddCustomMoney) == 0x000004, "Wrong size on PlayerInventoryCollector_C_AddCustomMoney");
static_assert(offsetof(PlayerInventoryCollector_C_AddCustomMoney, MCount) == 0x000000, "Member 'PlayerInventoryCollector_C_AddCustomMoney::MCount' has a wrong offset!");

// Function PlayerInventoryCollector.PlayerInventoryCollector_C.CollectInventory
// 0x0658 (0x0658 - 0x0000)
struct PlayerInventoryCollector_C_CollectInventory final
{
public:
	TArray<class FString>                         Data;                                              // 0x0000(0x0010)(Parm, OutParm)
	TArray<struct FFItemInfo>                     ContainersData;                                    // 0x0010(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<struct FFItemInfo>                     ContainerItems;                                    // 0x0020(0x0010)(Parm, OutParm, ContainsInstancedReference)
	bool                                          Succes_;                                           // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Suc_;                                              // 0x0031(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFItemInfo>                     CItems;                                            // 0x0038(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	TArray<struct FFItemInfo>                     CData;                                             // 0x0048(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	TArray<class FString>                         Result;                                            // 0x0058(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWithEditor_ReturnValue;                 // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_CollectInventory_Data;                    // 0x0090(0x0010)(ReferenceParm)
	TArray<struct FFItemInfo>                     CallFunc_CollectInventory_ContainersData;          // 0x00A0(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<struct FFItemInfo>                     CallFunc_CollectInventory_ContainerItems;          // 0x00B0(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_CollectInventory_Succes_;                 // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FContainerPickupsInfo>          CallFunc_getItemsInventory_ContainerItems;         // 0x00D8(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<struct FContainerPickupsInfo>          CallFunc_getItemsInventory_ContainersData;         // 0x00E8(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FContainerPickupsInfo                  CallFunc_Array_Get_Item;                           // 0x00F8(0x0068)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             CallFunc_ConvertPickupItemToItemInfoFunc_ItemInfo; // 0x0168(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_389[0x3];                                      // 0x0389(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_StructArrayToStringList_Result;           // 0x0390(0x0010)(ReferenceParm)
	struct FContainerPickupsInfo                  CallFunc_Array_Get_Item_1;                         // 0x03A0(0x0068)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FFItemInfo                             CallFunc_ConvertPickupItemToItemInfoFunc_ItemInfo_1; // 0x0408(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_StructArrayToStringList_Result_1;         // 0x0628(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0638(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x063C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0640(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_641[0x7];                                      // 0x0641(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_ProtectiveToString_str;                   // 0x0648(0x0010)(ReferenceParm)
};
static_assert(alignof(PlayerInventoryCollector_C_CollectInventory) == 0x000008, "Wrong alignment on PlayerInventoryCollector_C_CollectInventory");
static_assert(sizeof(PlayerInventoryCollector_C_CollectInventory) == 0x000658, "Wrong size on PlayerInventoryCollector_C_CollectInventory");
static_assert(offsetof(PlayerInventoryCollector_C_CollectInventory, Data) == 0x000000, "Member 'PlayerInventoryCollector_C_CollectInventory::Data' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_CollectInventory, ContainersData) == 0x000010, "Member 'PlayerInventoryCollector_C_CollectInventory::ContainersData' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_CollectInventory, ContainerItems) == 0x000020, "Member 'PlayerInventoryCollector_C_CollectInventory::ContainerItems' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_CollectInventory, Succes_) == 0x000030, "Member 'PlayerInventoryCollector_C_CollectInventory::Succes_' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_CollectInventory, Suc_) == 0x000031, "Member 'PlayerInventoryCollector_C_CollectInventory::Suc_' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_CollectInventory, CItems) == 0x000038, "Member 'PlayerInventoryCollector_C_CollectInventory::CItems' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_CollectInventory, CData) == 0x000048, "Member 'PlayerInventoryCollector_C_CollectInventory::CData' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_CollectInventory, Result) == 0x000058, "Member 'PlayerInventoryCollector_C_CollectInventory::Result' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_CollectInventory, Temp_int_Loop_Counter_Variable) == 0x000068, "Member 'PlayerInventoryCollector_C_CollectInventory::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_CollectInventory, CallFunc_Add_IntInt_ReturnValue) == 0x00006C, "Member 'PlayerInventoryCollector_C_CollectInventory::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_CollectInventory, Temp_int_Array_Index_Variable) == 0x000070, "Member 'PlayerInventoryCollector_C_CollectInventory::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_CollectInventory, CallFunc_IsWithEditor_ReturnValue) == 0x000074, "Member 'PlayerInventoryCollector_C_CollectInventory::CallFunc_IsWithEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_CollectInventory, Temp_int_Loop_Counter_Variable_1) == 0x000078, "Member 'PlayerInventoryCollector_C_CollectInventory::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_CollectInventory, CallFunc_Add_IntInt_ReturnValue_1) == 0x00007C, "Member 'PlayerInventoryCollector_C_CollectInventory::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_CollectInventory, Temp_int_Array_Index_Variable_1) == 0x000080, "Member 'PlayerInventoryCollector_C_CollectInventory::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_CollectInventory, CallFunc_GetOwner_ReturnValue) == 0x000088, "Member 'PlayerInventoryCollector_C_CollectInventory::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_CollectInventory, CallFunc_CollectInventory_Data) == 0x000090, "Member 'PlayerInventoryCollector_C_CollectInventory::CallFunc_CollectInventory_Data' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_CollectInventory, CallFunc_CollectInventory_ContainersData) == 0x0000A0, "Member 'PlayerInventoryCollector_C_CollectInventory::CallFunc_CollectInventory_ContainersData' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_CollectInventory, CallFunc_CollectInventory_ContainerItems) == 0x0000B0, "Member 'PlayerInventoryCollector_C_CollectInventory::CallFunc_CollectInventory_ContainerItems' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_CollectInventory, CallFunc_CollectInventory_Succes_) == 0x0000C0, "Member 'PlayerInventoryCollector_C_CollectInventory::CallFunc_CollectInventory_Succes_' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_CollectInventory, K2Node_DynamicCast_AsSurvival_Player) == 0x0000C8, "Member 'PlayerInventoryCollector_C_CollectInventory::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_CollectInventory, K2Node_DynamicCast_bSuccess) == 0x0000D0, "Member 'PlayerInventoryCollector_C_CollectInventory::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_CollectInventory, CallFunc_getItemsInventory_ContainerItems) == 0x0000D8, "Member 'PlayerInventoryCollector_C_CollectInventory::CallFunc_getItemsInventory_ContainerItems' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_CollectInventory, CallFunc_getItemsInventory_ContainersData) == 0x0000E8, "Member 'PlayerInventoryCollector_C_CollectInventory::CallFunc_getItemsInventory_ContainersData' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_CollectInventory, CallFunc_Array_Get_Item) == 0x0000F8, "Member 'PlayerInventoryCollector_C_CollectInventory::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_CollectInventory, CallFunc_Array_Length_ReturnValue) == 0x000160, "Member 'PlayerInventoryCollector_C_CollectInventory::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_CollectInventory, CallFunc_ConvertPickupItemToItemInfoFunc_ItemInfo) == 0x000168, "Member 'PlayerInventoryCollector_C_CollectInventory::CallFunc_ConvertPickupItemToItemInfoFunc_ItemInfo' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_CollectInventory, CallFunc_Less_IntInt_ReturnValue) == 0x000388, "Member 'PlayerInventoryCollector_C_CollectInventory::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_CollectInventory, CallFunc_Array_Add_ReturnValue) == 0x00038C, "Member 'PlayerInventoryCollector_C_CollectInventory::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_CollectInventory, CallFunc_StructArrayToStringList_Result) == 0x000390, "Member 'PlayerInventoryCollector_C_CollectInventory::CallFunc_StructArrayToStringList_Result' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_CollectInventory, CallFunc_Array_Get_Item_1) == 0x0003A0, "Member 'PlayerInventoryCollector_C_CollectInventory::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_CollectInventory, CallFunc_ConvertPickupItemToItemInfoFunc_ItemInfo_1) == 0x000408, "Member 'PlayerInventoryCollector_C_CollectInventory::CallFunc_ConvertPickupItemToItemInfoFunc_ItemInfo_1' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_CollectInventory, CallFunc_StructArrayToStringList_Result_1) == 0x000628, "Member 'PlayerInventoryCollector_C_CollectInventory::CallFunc_StructArrayToStringList_Result_1' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_CollectInventory, CallFunc_Array_Add_ReturnValue_1) == 0x000638, "Member 'PlayerInventoryCollector_C_CollectInventory::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_CollectInventory, CallFunc_Array_Length_ReturnValue_1) == 0x00063C, "Member 'PlayerInventoryCollector_C_CollectInventory::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_CollectInventory, CallFunc_Less_IntInt_ReturnValue_1) == 0x000640, "Member 'PlayerInventoryCollector_C_CollectInventory::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_CollectInventory, CallFunc_ProtectiveToString_str) == 0x000648, "Member 'PlayerInventoryCollector_C_CollectInventory::CallFunc_ProtectiveToString_str' has a wrong offset!");

// Function PlayerInventoryCollector.PlayerInventoryCollector_C.ExecuteUbergraph_PlayerInventoryCollector
// 0x0CE0 (0x0CE0 - 0x0000)
struct PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         K2Node_Event_Data;                                 // 0x0018(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSlotMotherUID_UDID;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player_1;            // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player_2;            // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Split_LeftS;                              // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_RightS;                             // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Split_ReturnValue;                        // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FContainerPickupsInfo>          CallFunc_getItemsInventory_ContainerItems;         // 0x00D0(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<struct FContainerPickupsInfo>          CallFunc_getItemsInventory_ContainersData;         // 0x00E0(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FContainerPickupsInfo                  CallFunc_Array_Get_Item_1;                         // 0x00F0(0x0068)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15D[0x3];                                      // 0x015D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_172[0x6];                                      // 0x0172(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SelectString_ReturnValue_1;               // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_LeftS_1;                            // 0x0188(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_RightS_1;                           // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Split_ReturnValue_1;                      // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AA[0x6];                                      // 0x01AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Split_LeftS_2;                            // 0x01B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_RightS_2;                           // 0x01C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Split_ReturnValue_2;                      // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x3];                                      // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SelectString_ReturnValue_2;               // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SelectString_ReturnValue_3;               // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue_1;           // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0200(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0218(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0230(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFItemInfo                             CallFunc_GetDataTableRowFromName_OutRow;           // 0x0240(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_461[0x7];                                      // 0x0461(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0468(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0478(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFItemInfo                             K2Node_SetFieldsInStruct_StructOut;                // 0x0488(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x06A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFItemInfo                             CallFunc_LoadSavedItemInfo_UpdatedFItemInfo;       // 0x06B8(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x08D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_7;              // 0x08E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FContainerPickupsInfo                  K2Node_MakeStruct_ContainerPickupsInfo;            // 0x08F8(0x0068)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FContainerPickupsInfo                  K2Node_SetFieldsInStruct_StructOut_1;              // 0x0960(0x0068)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_JSAddItem_Ad;                             // 0x09C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C9[0x3];                                      // 0x09C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x09CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x09D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFItemInfo                             CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x09D8(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0BF8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BF9[0x7];                                      // 0x0BF9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0C00(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_8;              // 0x0C10(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_JSAddItem_Ad_1;                           // 0x0C20(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C21[0x3];                                      // 0x0C21(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_MCount;                         // 0x0C24(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0C28(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0C38(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C3C[0x4];                                      // 0x0C3C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_9;              // 0x0C40(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0C50(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C54[0x4];                                      // 0x0C54(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_10;             // 0x0C58(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FContainerPickupsInfo                  K2Node_SetFieldsInStruct_StructOut_2;              // 0x0C68(0x0068)(ContainsInstancedReference, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_11;             // 0x0CD0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector) == 0x000008, "Wrong alignment on PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector");
static_assert(sizeof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector) == 0x000CE0, "Wrong size on PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, EntryPoint) == 0x000000, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::EntryPoint' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, Temp_int_Array_Index_Variable) == 0x000004, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_SelectString_ReturnValue) == 0x000008, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, K2Node_Event_Data) == 0x000018, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::K2Node_Event_Data' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_GetOwner_ReturnValue) == 0x000028, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, K2Node_DynamicCast_AsSurvival_Player) == 0x000038, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, Temp_int_Loop_Counter_Variable) == 0x000044, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, Temp_bool_True_if_break_was_hit_Variable) == 0x000050, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_GetSlotMotherUID_UDID) == 0x000054, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_GetSlotMotherUID_UDID' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_Not_PreBool_ReturnValue) == 0x000058, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_GetOwner_ReturnValue_1) == 0x000060, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, K2Node_DynamicCast_AsSurvival_Player_1) == 0x000068, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::K2Node_DynamicCast_AsSurvival_Player_1' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, K2Node_DynamicCast_bSuccess_1) == 0x000070, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, Temp_int_Loop_Counter_Variable_1) == 0x000074, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_Add_IntInt_ReturnValue_1) == 0x000078, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, Temp_int_Array_Index_Variable_1) == 0x00007C, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_GetOwner_ReturnValue_2) == 0x000080, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_GetOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_Array_Get_Item) == 0x000088, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, K2Node_DynamicCast_AsSurvival_Player_2) == 0x000098, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::K2Node_DynamicCast_AsSurvival_Player_2' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, K2Node_DynamicCast_bSuccess_2) == 0x0000A0, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_Split_LeftS) == 0x0000A8, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_Split_LeftS' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_Split_RightS) == 0x0000B8, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_Split_RightS' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_Split_ReturnValue) == 0x0000C8, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_Split_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_getItemsInventory_ContainerItems) == 0x0000D0, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_getItemsInventory_ContainerItems' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_getItemsInventory_ContainersData) == 0x0000E0, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_getItemsInventory_ContainersData' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_Array_Get_Item_1) == 0x0000F0, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_Array_Length_ReturnValue_1) == 0x000158, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_Less_IntInt_ReturnValue_1) == 0x00015C, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_Conv_IntToString_ReturnValue) == 0x000160, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_BooleanAND_ReturnValue) == 0x000170, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000171, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_SelectString_ReturnValue_1) == 0x000178, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_SelectString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_Split_LeftS_1) == 0x000188, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_Split_LeftS_1' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_Split_RightS_1) == 0x000198, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_Split_RightS_1' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_Split_ReturnValue_1) == 0x0001A8, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_Split_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_Contains_ReturnValue) == 0x0001A9, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_Split_LeftS_2) == 0x0001B0, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_Split_LeftS_2' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_Split_RightS_2) == 0x0001C0, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_Split_RightS_2' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_Split_ReturnValue_2) == 0x0001D0, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_Split_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_Conv_StringToInt_ReturnValue) == 0x0001D4, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_Conv_StringToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_SelectString_ReturnValue_2) == 0x0001D8, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_SelectString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_SelectString_ReturnValue_3) == 0x0001E8, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_SelectString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_Conv_StringToInt_ReturnValue_1) == 0x0001F8, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_Conv_StringToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_Concat_StrStr_ReturnValue) == 0x000200, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_SelectInt_ReturnValue) == 0x000210, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_SelectInt_ReturnValue_1) == 0x000214, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_SelectInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000218, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_Conv_StringToName_ReturnValue) == 0x000228, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000230, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_GetDataTableRowFromName_OutRow) == 0x000240, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000460, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000468, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000478, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, K2Node_SetFieldsInStruct_StructOut) == 0x000488, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_Concat_StrStr_ReturnValue_5) == 0x0006A8, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_LoadSavedItemInfo_UpdatedFItemInfo) == 0x0006B8, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_LoadSavedItemInfo_UpdatedFItemInfo' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_Concat_StrStr_ReturnValue_6) == 0x0008D8, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_Concat_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_Concat_StrStr_ReturnValue_7) == 0x0008E8, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_Concat_StrStr_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, K2Node_MakeStruct_ContainerPickupsInfo) == 0x0008F8, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::K2Node_MakeStruct_ContainerPickupsInfo' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, K2Node_SetFieldsInStruct_StructOut_1) == 0x000960, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::K2Node_SetFieldsInStruct_StructOut_1' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_JSAddItem_Ad) == 0x0009C8, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_JSAddItem_Ad' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_Array_Add_ReturnValue) == 0x0009CC, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_Conv_StringToName_ReturnValue_1) == 0x0009D0, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x0009D8, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000BF8, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_Conv_NameToString_ReturnValue) == 0x000C00, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_Concat_StrStr_ReturnValue_8) == 0x000C10, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_Concat_StrStr_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_JSAddItem_Ad_1) == 0x000C20, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_JSAddItem_Ad_1' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, K2Node_CustomEvent_MCount) == 0x000C24, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::K2Node_CustomEvent_MCount' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000C28, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_Add_IntInt_ReturnValue_2) == 0x000C38, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_Concat_StrStr_ReturnValue_9) == 0x000C40, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_Concat_StrStr_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_Max_ReturnValue) == 0x000C50, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_Concat_StrStr_ReturnValue_10) == 0x000C58, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_Concat_StrStr_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, K2Node_SetFieldsInStruct_StructOut_2) == 0x000C68, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::K2Node_SetFieldsInStruct_StructOut_2' has a wrong offset!");
static_assert(offsetof(PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector, CallFunc_Concat_StrStr_ReturnValue_11) == 0x000CD0, "Member 'PlayerInventoryCollector_C_ExecuteUbergraph_PlayerInventoryCollector::CallFunc_Concat_StrStr_ReturnValue_11' has a wrong offset!");

// Function PlayerInventoryCollector.PlayerInventoryCollector_C.LoadSavedItemInfo
// 0x07D0 (0x07D0 - 0x0000)
struct PlayerInventoryCollector_C_LoadSavedItemInfo final
{
public:
	class FString                                 SourceString;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FFItemInfo                             FItemInfo;                                         // 0x0010(0x0220)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
	struct FFItemInfo                             UpdatedFItemInfo;                                  // 0x0230(0x0220)(Parm, OutParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FAttachmentInfo>                TempArray;                                         // 0x0450(0x0010)(Edit, BlueprintVisible)
	int32                                         AmmoCount;                                         // 0x0460(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_464[0x4];                                      // 0x0464(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         StringArray;                                       // 0x0468(0x0010)(Edit, BlueprintVisible)
	struct FFItemInfo                             TempInfo;                                          // 0x0478(0x0220)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FAttachmentInfo>                Attachments;                                       // 0x0698(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         CallFunc_ParseIntoArray_ReturnValue;               // 0x06A8(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x06B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6BC[0x4];                                      // 0x06BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPickupAttachments                     K2Node_MakeStruct_PickupAttachments;               // 0x06C0(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x06D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x06D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x06D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x06D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
