#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PositionDummy

#include "Basic.hpp"


namespace SDK::Params
{

// Function PositionDummy.PositionDummy_C.ExecuteUbergraph_PositionDummy
// 0x0008 (0x0008 - 0x0000)
struct PositionDummy_C_ExecuteUbergraph_PositionDummy final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PositionDummy_C_ExecuteUbergraph_PositionDummy) == 0x000004, "Wrong alignment on PositionDummy_C_ExecuteUbergraph_PositionDummy");
static_assert(sizeof(PositionDummy_C_ExecuteUbergraph_PositionDummy) == 0x000008, "Wrong size on PositionDummy_C_ExecuteUbergraph_PositionDummy");
static_assert(offsetof(PositionDummy_C_ExecuteUbergraph_PositionDummy, EntryPoint) == 0x000000, "Member 'PositionDummy_C_ExecuteUbergraph_PositionDummy::EntryPoint' has a wrong offset!");
static_assert(offsetof(PositionDummy_C_ExecuteUbergraph_PositionDummy, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'PositionDummy_C_ExecuteUbergraph_PositionDummy::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function PositionDummy.PositionDummy_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct PositionDummy_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PositionDummy_C_ReceiveTick) == 0x000004, "Wrong alignment on PositionDummy_C_ReceiveTick");
static_assert(sizeof(PositionDummy_C_ReceiveTick) == 0x000004, "Wrong size on PositionDummy_C_ReceiveTick");
static_assert(offsetof(PositionDummy_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'PositionDummy_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

