#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Posobie

#include "Basic.hpp"


namespace SDK::Params
{

// Function Posobie.Posobie_C.ExecuteAction
// 0x0010 (0x0010 - 0x0000)
struct Posobie_C_ExecuteAction final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAGSGraphNode*                          NodeOwner;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Posobie_C_ExecuteAction) == 0x000008, "Wrong alignment on Posobie_C_ExecuteAction");
static_assert(sizeof(Posobie_C_ExecuteAction) == 0x000010, "Wrong size on Posobie_C_ExecuteAction");
static_assert(offsetof(Posobie_C_ExecuteAction, PlayerController) == 0x000000, "Member 'Posobie_C_ExecuteAction::PlayerController' has a wrong offset!");
static_assert(offsetof(Posobie_C_ExecuteAction, NodeOwner) == 0x000008, "Member 'Posobie_C_ExecuteAction::NodeOwner' has a wrong offset!");

// Function Posobie.Posobie_C.ExecuteUbergraph_Posobie
// 0x0038 (0x0038 - 0x0000)
struct Posobie_C_ExecuteUbergraph_Posobie final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_Event_playerController;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAGSGraphNode*                          K2Node_Event_nodeOwner;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTotalMoneyCount_ReturnedCount;         // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Posobie_C_ExecuteUbergraph_Posobie) == 0x000008, "Wrong alignment on Posobie_C_ExecuteUbergraph_Posobie");
static_assert(sizeof(Posobie_C_ExecuteUbergraph_Posobie) == 0x000038, "Wrong size on Posobie_C_ExecuteUbergraph_Posobie");
static_assert(offsetof(Posobie_C_ExecuteUbergraph_Posobie, EntryPoint) == 0x000000, "Member 'Posobie_C_ExecuteUbergraph_Posobie::EntryPoint' has a wrong offset!");
static_assert(offsetof(Posobie_C_ExecuteUbergraph_Posobie, K2Node_Event_playerController) == 0x000008, "Member 'Posobie_C_ExecuteUbergraph_Posobie::K2Node_Event_playerController' has a wrong offset!");
static_assert(offsetof(Posobie_C_ExecuteUbergraph_Posobie, K2Node_Event_nodeOwner) == 0x000010, "Member 'Posobie_C_ExecuteUbergraph_Posobie::K2Node_Event_nodeOwner' has a wrong offset!");
static_assert(offsetof(Posobie_C_ExecuteUbergraph_Posobie, CallFunc_K2_GetPawn_ReturnValue) == 0x000018, "Member 'Posobie_C_ExecuteUbergraph_Posobie::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Posobie_C_ExecuteUbergraph_Posobie, K2Node_DynamicCast_AsSurvival_Player) == 0x000020, "Member 'Posobie_C_ExecuteUbergraph_Posobie::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(Posobie_C_ExecuteUbergraph_Posobie, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'Posobie_C_ExecuteUbergraph_Posobie::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Posobie_C_ExecuteUbergraph_Posobie, CallFunc_GetTotalMoneyCount_ReturnedCount) == 0x00002C, "Member 'Posobie_C_ExecuteUbergraph_Posobie::CallFunc_GetTotalMoneyCount_ReturnedCount' has a wrong offset!");
static_assert(offsetof(Posobie_C_ExecuteUbergraph_Posobie, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'Posobie_C_ExecuteUbergraph_Posobie::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Posobie_C_ExecuteUbergraph_Posobie, CallFunc_IsValid_ReturnValue) == 0x000034, "Member 'Posobie_C_ExecuteUbergraph_Posobie::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

