#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PP_Effects

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "StatType_structs.hpp"


namespace SDK::Params
{

// Function PP_Effects.PP_Effects_C.AbberationPregress
// 0x0058 (0x0058 - 0x0000)
struct PP_Effects_C_AbberationPregress final
{
public:
	double                                        UpdateTimeFrq;                                     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            TimeCurv;                                          // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue;   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FInterpTo_ReturnValue;                    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_InTime_ImplicitCast;        // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FInterpTo_Current_ImplicitCast;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_Target_ImplicitCast;            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PP_Effects_C_AbberationPregress) == 0x000008, "Wrong alignment on PP_Effects_C_AbberationPregress");
static_assert(sizeof(PP_Effects_C_AbberationPregress) == 0x000058, "Wrong size on PP_Effects_C_AbberationPregress");
static_assert(offsetof(PP_Effects_C_AbberationPregress, UpdateTimeFrq) == 0x000000, "Member 'PP_Effects_C_AbberationPregress::UpdateTimeFrq' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_AbberationPregress, TimeCurv) == 0x000008, "Member 'PP_Effects_C_AbberationPregress::TimeCurv' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_AbberationPregress, CallFunc_K2_GetScalarParameterValue_ReturnValue) == 0x000010, "Member 'PP_Effects_C_AbberationPregress::CallFunc_K2_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_AbberationPregress, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000018, "Member 'PP_Effects_C_AbberationPregress::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_AbberationPregress, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000020, "Member 'PP_Effects_C_AbberationPregress::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_AbberationPregress, CallFunc_GetFloatValue_ReturnValue) == 0x000028, "Member 'PP_Effects_C_AbberationPregress::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_AbberationPregress, CallFunc_FInterpTo_ReturnValue) == 0x000030, "Member 'PP_Effects_C_AbberationPregress::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_AbberationPregress, CallFunc_GetFloatValue_InTime_ImplicitCast) == 0x000038, "Member 'PP_Effects_C_AbberationPregress::CallFunc_GetFloatValue_InTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_AbberationPregress, CallFunc_FInterpTo_Current_ImplicitCast) == 0x000040, "Member 'PP_Effects_C_AbberationPregress::CallFunc_FInterpTo_Current_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_AbberationPregress, CallFunc_FInterpTo_Target_ImplicitCast) == 0x000048, "Member 'PP_Effects_C_AbberationPregress::CallFunc_FInterpTo_Target_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_AbberationPregress, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000050, "Member 'PP_Effects_C_AbberationPregress::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function PP_Effects.PP_Effects_C.AbberationStart
// 0x0040 (0x0040 - 0x0000)
struct PP_Effects_C_AbberationStart final
{
public:
	float                                         AbberTimeStop;                                     // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AbberTimUpdate;                                    // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PP_Effects_C_AbberationStart) == 0x000008, "Wrong alignment on PP_Effects_C_AbberationStart");
static_assert(sizeof(PP_Effects_C_AbberationStart) == 0x000040, "Wrong size on PP_Effects_C_AbberationStart");
static_assert(offsetof(PP_Effects_C_AbberationStart, AbberTimeStop) == 0x000000, "Member 'PP_Effects_C_AbberationStart::AbberTimeStop' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_AbberationStart, AbberTimUpdate) == 0x000004, "Member 'PP_Effects_C_AbberationStart::AbberTimUpdate' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_AbberationStart, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'PP_Effects_C_AbberationStart::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_AbberationStart, CallFunc_Array_AddUnique_ReturnValue) == 0x000018, "Member 'PP_Effects_C_AbberationStart::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_AbberationStart, K2Node_CreateDelegate_OutputDelegate_1) == 0x00001C, "Member 'PP_Effects_C_AbberationStart::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_AbberationStart, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000030, "Member 'PP_Effects_C_AbberationStart::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_AbberationStart, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000038, "Member 'PP_Effects_C_AbberationStart::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");

// Function PP_Effects.PP_Effects_C.Apply Death Effect
// 0x0028 (0x0028 - 0x0000)
struct PP_Effects_C_Apply_Death_Effect final
{
public:
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PP_Effects_C_Apply_Death_Effect) == 0x000008, "Wrong alignment on PP_Effects_C_Apply_Death_Effect");
static_assert(sizeof(PP_Effects_C_Apply_Death_Effect) == 0x000028, "Wrong size on PP_Effects_C_Apply_Death_Effect");
static_assert(offsetof(PP_Effects_C_Apply_Death_Effect, CallFunc_Array_AddUnique_ReturnValue) == 0x000000, "Member 'PP_Effects_C_Apply_Death_Effect::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_Apply_Death_Effect, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'PP_Effects_C_Apply_Death_Effect::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_Apply_Death_Effect, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'PP_Effects_C_Apply_Death_Effect::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_Apply_Death_Effect, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x000020, "Member 'PP_Effects_C_Apply_Death_Effect::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");

// Function PP_Effects.PP_Effects_C.ApplyEffects
// 0x0018 (0x0018 - 0x0000)
struct PP_Effects_C_ApplyEffects final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWeightedBlendables                    K2Node_MakeStruct_WeightedBlendables;              // 0x0008(0x0010)()
};
static_assert(alignof(PP_Effects_C_ApplyEffects) == 0x000008, "Wrong alignment on PP_Effects_C_ApplyEffects");
static_assert(sizeof(PP_Effects_C_ApplyEffects) == 0x000018, "Wrong size on PP_Effects_C_ApplyEffects");
static_assert(offsetof(PP_Effects_C_ApplyEffects, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'PP_Effects_C_ApplyEffects::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_ApplyEffects, K2Node_MakeStruct_WeightedBlendables) == 0x000008, "Member 'PP_Effects_C_ApplyEffects::K2Node_MakeStruct_WeightedBlendables' has a wrong offset!");

// Function PP_Effects.PP_Effects_C.BleedingEffect
// 0x0020 (0x0020 - 0x0000)
struct PP_Effects_C_BleedingEffect final
{
public:
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_InTime_ImplicitCast;        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PP_Effects_C_BleedingEffect) == 0x000008, "Wrong alignment on PP_Effects_C_BleedingEffect");
static_assert(sizeof(PP_Effects_C_BleedingEffect) == 0x000020, "Wrong size on PP_Effects_C_BleedingEffect");
static_assert(offsetof(PP_Effects_C_BleedingEffect, CallFunc_GetFloatValue_ReturnValue) == 0x000000, "Member 'PP_Effects_C_BleedingEffect::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_BleedingEffect, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000004, "Member 'PP_Effects_C_BleedingEffect::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_BleedingEffect, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000008, "Member 'PP_Effects_C_BleedingEffect::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_BleedingEffect, CallFunc_GetFloatValue_InTime_ImplicitCast) == 0x000010, "Member 'PP_Effects_C_BleedingEffect::CallFunc_GetFloatValue_InTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_BleedingEffect, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x000018, "Member 'PP_Effects_C_BleedingEffect::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function PP_Effects.PP_Effects_C.BleedingEffectCallback
// 0x0028 (0x0028 - 0x0000)
struct PP_Effects_C_BleedingEffectCallback final
{
public:
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetBleedingEffectParameterName_ParameterName; // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PP_Effects_C_BleedingEffectCallback) == 0x000008, "Wrong alignment on PP_Effects_C_BleedingEffectCallback");
static_assert(sizeof(PP_Effects_C_BleedingEffectCallback) == 0x000028, "Wrong size on PP_Effects_C_BleedingEffectCallback");
static_assert(offsetof(PP_Effects_C_BleedingEffectCallback, CallFunc_Array_AddUnique_ReturnValue) == 0x000000, "Member 'PP_Effects_C_BleedingEffectCallback::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_BleedingEffectCallback, CallFunc_GetBleedingEffectParameterName_ParameterName) == 0x000004, "Member 'PP_Effects_C_BleedingEffectCallback::CallFunc_GetBleedingEffectParameterName_ParameterName' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_BleedingEffectCallback, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'PP_Effects_C_BleedingEffectCallback::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_BleedingEffectCallback, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'PP_Effects_C_BleedingEffectCallback::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function PP_Effects.PP_Effects_C.BleedingEffectEnabled
// 0x0001 (0x0001 - 0x0000)
struct PP_Effects_C_BleedingEffectEnabled final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PP_Effects_C_BleedingEffectEnabled) == 0x000001, "Wrong alignment on PP_Effects_C_BleedingEffectEnabled");
static_assert(sizeof(PP_Effects_C_BleedingEffectEnabled) == 0x000001, "Wrong size on PP_Effects_C_BleedingEffectEnabled");
static_assert(offsetof(PP_Effects_C_BleedingEffectEnabled, Enabled) == 0x000000, "Member 'PP_Effects_C_BleedingEffectEnabled::Enabled' has a wrong offset!");

// Function PP_Effects.PP_Effects_C.BloodFirstEffect
// 0x0050 (0x0050 - 0x0000)
struct PP_Effects_C_BloodFirstEffect final
{
public:
	class FName                                   SecondParameterName;                               // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   FirstParameterName;                                // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue_1;              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_B_ImplicitCast;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_FirstBloodEffectTime_ImplicitCast; // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PP_Effects_C_BloodFirstEffect) == 0x000008, "Wrong alignment on PP_Effects_C_BloodFirstEffect");
static_assert(sizeof(PP_Effects_C_BloodFirstEffect) == 0x000050, "Wrong size on PP_Effects_C_BloodFirstEffect");
static_assert(offsetof(PP_Effects_C_BloodFirstEffect, SecondParameterName) == 0x000000, "Member 'PP_Effects_C_BloodFirstEffect::SecondParameterName' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_BloodFirstEffect, FirstParameterName) == 0x000008, "Member 'PP_Effects_C_BloodFirstEffect::FirstParameterName' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_BloodFirstEffect, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000010, "Member 'PP_Effects_C_BloodFirstEffect::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_BloodFirstEffect, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000018, "Member 'PP_Effects_C_BloodFirstEffect::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_BloodFirstEffect, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000020, "Member 'PP_Effects_C_BloodFirstEffect::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_BloodFirstEffect, CallFunc_GetFloatValue_ReturnValue) == 0x000028, "Member 'PP_Effects_C_BloodFirstEffect::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_BloodFirstEffect, CallFunc_GetFloatValue_ReturnValue_1) == 0x00002C, "Member 'PP_Effects_C_BloodFirstEffect::CallFunc_GetFloatValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_BloodFirstEffect, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000030, "Member 'PP_Effects_C_BloodFirstEffect::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_BloodFirstEffect, CallFunc_Greater_DoubleDouble_B_ImplicitCast) == 0x000038, "Member 'PP_Effects_C_BloodFirstEffect::CallFunc_Greater_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_BloodFirstEffect, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000040, "Member 'PP_Effects_C_BloodFirstEffect::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_BloodFirstEffect, K2Node_VariableSet_FirstBloodEffectTime_ImplicitCast) == 0x000048, "Member 'PP_Effects_C_BloodFirstEffect::K2Node_VariableSet_FirstBloodEffectTime_ImplicitCast' has a wrong offset!");

// Function PP_Effects.PP_Effects_C.BloodSecondEffect
// 0x0050 (0x0050 - 0x0000)
struct PP_Effects_C_BloodSecondEffect final
{
public:
	class FName                                   SecondParameterName;                               // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   FirstParameterName;                                // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue_1;              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_B_ImplicitCast;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_SecondBloodEffectTime_ImplicitCast; // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PP_Effects_C_BloodSecondEffect) == 0x000008, "Wrong alignment on PP_Effects_C_BloodSecondEffect");
static_assert(sizeof(PP_Effects_C_BloodSecondEffect) == 0x000050, "Wrong size on PP_Effects_C_BloodSecondEffect");
static_assert(offsetof(PP_Effects_C_BloodSecondEffect, SecondParameterName) == 0x000000, "Member 'PP_Effects_C_BloodSecondEffect::SecondParameterName' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_BloodSecondEffect, FirstParameterName) == 0x000008, "Member 'PP_Effects_C_BloodSecondEffect::FirstParameterName' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_BloodSecondEffect, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000010, "Member 'PP_Effects_C_BloodSecondEffect::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_BloodSecondEffect, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000018, "Member 'PP_Effects_C_BloodSecondEffect::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_BloodSecondEffect, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000020, "Member 'PP_Effects_C_BloodSecondEffect::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_BloodSecondEffect, CallFunc_GetFloatValue_ReturnValue) == 0x000028, "Member 'PP_Effects_C_BloodSecondEffect::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_BloodSecondEffect, CallFunc_GetFloatValue_ReturnValue_1) == 0x00002C, "Member 'PP_Effects_C_BloodSecondEffect::CallFunc_GetFloatValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_BloodSecondEffect, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000030, "Member 'PP_Effects_C_BloodSecondEffect::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_BloodSecondEffect, CallFunc_Greater_DoubleDouble_B_ImplicitCast) == 0x000038, "Member 'PP_Effects_C_BloodSecondEffect::CallFunc_Greater_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_BloodSecondEffect, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000040, "Member 'PP_Effects_C_BloodSecondEffect::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_BloodSecondEffect, K2Node_VariableSet_SecondBloodEffectTime_ImplicitCast) == 0x000048, "Member 'PP_Effects_C_BloodSecondEffect::K2Node_VariableSet_SecondBloodEffectTime_ImplicitCast' has a wrong offset!");

// Function PP_Effects.PP_Effects_C.BloodThirdEffect
// 0x0050 (0x0050 - 0x0000)
struct PP_Effects_C_BloodThirdEffect final
{
public:
	class FName                                   FirstParameterName;                                // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SecondParameterName;                               // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue_1;              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_B_ImplicitCast;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_ThirdBloodEffectTime_ImplicitCast; // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PP_Effects_C_BloodThirdEffect) == 0x000008, "Wrong alignment on PP_Effects_C_BloodThirdEffect");
static_assert(sizeof(PP_Effects_C_BloodThirdEffect) == 0x000050, "Wrong size on PP_Effects_C_BloodThirdEffect");
static_assert(offsetof(PP_Effects_C_BloodThirdEffect, FirstParameterName) == 0x000000, "Member 'PP_Effects_C_BloodThirdEffect::FirstParameterName' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_BloodThirdEffect, SecondParameterName) == 0x000008, "Member 'PP_Effects_C_BloodThirdEffect::SecondParameterName' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_BloodThirdEffect, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000010, "Member 'PP_Effects_C_BloodThirdEffect::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_BloodThirdEffect, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000018, "Member 'PP_Effects_C_BloodThirdEffect::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_BloodThirdEffect, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000020, "Member 'PP_Effects_C_BloodThirdEffect::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_BloodThirdEffect, CallFunc_GetFloatValue_ReturnValue) == 0x000028, "Member 'PP_Effects_C_BloodThirdEffect::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_BloodThirdEffect, CallFunc_GetFloatValue_ReturnValue_1) == 0x00002C, "Member 'PP_Effects_C_BloodThirdEffect::CallFunc_GetFloatValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_BloodThirdEffect, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000030, "Member 'PP_Effects_C_BloodThirdEffect::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_BloodThirdEffect, CallFunc_Greater_DoubleDouble_B_ImplicitCast) == 0x000038, "Member 'PP_Effects_C_BloodThirdEffect::CallFunc_Greater_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_BloodThirdEffect, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000040, "Member 'PP_Effects_C_BloodThirdEffect::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_BloodThirdEffect, K2Node_VariableSet_ThirdBloodEffectTime_ImplicitCast) == 0x000048, "Member 'PP_Effects_C_BloodThirdEffect::K2Node_VariableSet_ThirdBloodEffectTime_ImplicitCast' has a wrong offset!");

// Function PP_Effects.PP_Effects_C.CalculateHealthModifier
// 0x0028 (0x0028 - 0x0000)
struct PP_Effects_C_CalculateHealthModifier final
{
public:
	bool                                          AngleIsPositive;                                   // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        AbsoluteAngle;                                     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetStat_Value;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetStat_Value_1;                          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PP_Effects_C_CalculateHealthModifier) == 0x000008, "Wrong alignment on PP_Effects_C_CalculateHealthModifier");
static_assert(sizeof(PP_Effects_C_CalculateHealthModifier) == 0x000028, "Wrong size on PP_Effects_C_CalculateHealthModifier");
static_assert(offsetof(PP_Effects_C_CalculateHealthModifier, AngleIsPositive) == 0x000000, "Member 'PP_Effects_C_CalculateHealthModifier::AngleIsPositive' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_CalculateHealthModifier, AbsoluteAngle) == 0x000008, "Member 'PP_Effects_C_CalculateHealthModifier::AbsoluteAngle' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_CalculateHealthModifier, CallFunc_GetStat_Value) == 0x000010, "Member 'PP_Effects_C_CalculateHealthModifier::CallFunc_GetStat_Value' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_CalculateHealthModifier, CallFunc_GetStat_Value_1) == 0x000018, "Member 'PP_Effects_C_CalculateHealthModifier::CallFunc_GetStat_Value_1' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_CalculateHealthModifier, CallFunc_MapRangeClamped_ReturnValue) == 0x000020, "Member 'PP_Effects_C_CalculateHealthModifier::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");

// Function PP_Effects.PP_Effects_C.ClearAllEffects
// 0x0058 (0x0058 - 0x0000)
struct PP_Effects_C_ClearAllEffects final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWeightedBlendable                     CallFunc_Array_Get_Item_1;                         // 0x0030(0x0010)(NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               K2Node_DynamicCast_AsMaterial_Instance_Dynamic;    // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PP_Effects_C_ClearAllEffects) == 0x000008, "Wrong alignment on PP_Effects_C_ClearAllEffects");
static_assert(sizeof(PP_Effects_C_ClearAllEffects) == 0x000058, "Wrong size on PP_Effects_C_ClearAllEffects");
static_assert(offsetof(PP_Effects_C_ClearAllEffects, Temp_int_Array_Index_Variable) == 0x000000, "Member 'PP_Effects_C_ClearAllEffects::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_ClearAllEffects, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'PP_Effects_C_ClearAllEffects::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_ClearAllEffects, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'PP_Effects_C_ClearAllEffects::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_ClearAllEffects, Temp_int_Array_Index_Variable_1) == 0x00000C, "Member 'PP_Effects_C_ClearAllEffects::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_ClearAllEffects, Temp_int_Loop_Counter_Variable_1) == 0x000010, "Member 'PP_Effects_C_ClearAllEffects::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_ClearAllEffects, CallFunc_Array_Get_Item) == 0x000018, "Member 'PP_Effects_C_ClearAllEffects::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_ClearAllEffects, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'PP_Effects_C_ClearAllEffects::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_ClearAllEffects, CallFunc_Less_IntInt_ReturnValue) == 0x000024, "Member 'PP_Effects_C_ClearAllEffects::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_ClearAllEffects, CallFunc_Add_IntInt_ReturnValue_1) == 0x000028, "Member 'PP_Effects_C_ClearAllEffects::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_ClearAllEffects, CallFunc_Array_Length_ReturnValue_1) == 0x00002C, "Member 'PP_Effects_C_ClearAllEffects::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_ClearAllEffects, CallFunc_Array_Get_Item_1) == 0x000030, "Member 'PP_Effects_C_ClearAllEffects::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_ClearAllEffects, CallFunc_Less_IntInt_ReturnValue_1) == 0x000040, "Member 'PP_Effects_C_ClearAllEffects::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_ClearAllEffects, K2Node_DynamicCast_AsMaterial_Instance_Dynamic) == 0x000048, "Member 'PP_Effects_C_ClearAllEffects::K2Node_DynamicCast_AsMaterial_Instance_Dynamic' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_ClearAllEffects, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'PP_Effects_C_ClearAllEffects::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function PP_Effects.PP_Effects_C.Death Effect Progress
// 0x0038 (0x0038 - 0x0000)
struct PP_Effects_C_Death_Effect_Progress final
{
public:
	double                                        CurveValue;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue;                         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_InTime_ImplicitCast;        // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_CurveValue_ImplicitCast;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PP_Effects_C_Death_Effect_Progress) == 0x000008, "Wrong alignment on PP_Effects_C_Death_Effect_Progress");
static_assert(sizeof(PP_Effects_C_Death_Effect_Progress) == 0x000038, "Wrong size on PP_Effects_C_Death_Effect_Progress");
static_assert(offsetof(PP_Effects_C_Death_Effect_Progress, CurveValue) == 0x000000, "Member 'PP_Effects_C_Death_Effect_Progress::CurveValue' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_Death_Effect_Progress, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000008, "Member 'PP_Effects_C_Death_Effect_Progress::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_Death_Effect_Progress, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000010, "Member 'PP_Effects_C_Death_Effect_Progress::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_Death_Effect_Progress, CallFunc_FMin_ReturnValue) == 0x000018, "Member 'PP_Effects_C_Death_Effect_Progress::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_Death_Effect_Progress, CallFunc_GetFloatValue_ReturnValue) == 0x000020, "Member 'PP_Effects_C_Death_Effect_Progress::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_Death_Effect_Progress, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000024, "Member 'PP_Effects_C_Death_Effect_Progress::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_Death_Effect_Progress, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x000028, "Member 'PP_Effects_C_Death_Effect_Progress::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_Death_Effect_Progress, CallFunc_GetFloatValue_InTime_ImplicitCast) == 0x00002C, "Member 'PP_Effects_C_Death_Effect_Progress::CallFunc_GetFloatValue_InTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_Death_Effect_Progress, K2Node_VariableSet_CurveValue_ImplicitCast) == 0x000030, "Member 'PP_Effects_C_Death_Effect_Progress::K2Node_VariableSet_CurveValue_ImplicitCast' has a wrong offset!");

// Function PP_Effects.PP_Effects_C.DirtFirstEffect
// 0x0050 (0x0050 - 0x0000)
struct PP_Effects_C_DirtFirstEffect final
{
public:
	class FName                                   ThirdParameterName;                                // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SecondParameterName;                               // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   FirstParameterName;                                // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue_1;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue_2;              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_B_ImplicitCast;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_FirstDirtEffectTime_ImplicitCast; // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PP_Effects_C_DirtFirstEffect) == 0x000008, "Wrong alignment on PP_Effects_C_DirtFirstEffect");
static_assert(sizeof(PP_Effects_C_DirtFirstEffect) == 0x000050, "Wrong size on PP_Effects_C_DirtFirstEffect");
static_assert(offsetof(PP_Effects_C_DirtFirstEffect, ThirdParameterName) == 0x000000, "Member 'PP_Effects_C_DirtFirstEffect::ThirdParameterName' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_DirtFirstEffect, SecondParameterName) == 0x000008, "Member 'PP_Effects_C_DirtFirstEffect::SecondParameterName' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_DirtFirstEffect, FirstParameterName) == 0x000010, "Member 'PP_Effects_C_DirtFirstEffect::FirstParameterName' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_DirtFirstEffect, CallFunc_GetFloatValue_ReturnValue) == 0x000018, "Member 'PP_Effects_C_DirtFirstEffect::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_DirtFirstEffect, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x00001C, "Member 'PP_Effects_C_DirtFirstEffect::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_DirtFirstEffect, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000020, "Member 'PP_Effects_C_DirtFirstEffect::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_DirtFirstEffect, CallFunc_GetFloatValue_ReturnValue_1) == 0x000028, "Member 'PP_Effects_C_DirtFirstEffect::CallFunc_GetFloatValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_DirtFirstEffect, CallFunc_GetFloatValue_ReturnValue_2) == 0x00002C, "Member 'PP_Effects_C_DirtFirstEffect::CallFunc_GetFloatValue_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_DirtFirstEffect, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000030, "Member 'PP_Effects_C_DirtFirstEffect::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_DirtFirstEffect, CallFunc_Greater_DoubleDouble_B_ImplicitCast) == 0x000038, "Member 'PP_Effects_C_DirtFirstEffect::CallFunc_Greater_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_DirtFirstEffect, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000040, "Member 'PP_Effects_C_DirtFirstEffect::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_DirtFirstEffect, K2Node_VariableSet_FirstDirtEffectTime_ImplicitCast) == 0x000048, "Member 'PP_Effects_C_DirtFirstEffect::K2Node_VariableSet_FirstDirtEffectTime_ImplicitCast' has a wrong offset!");

// Function PP_Effects.PP_Effects_C.DirtSecondEffect
// 0x0050 (0x0050 - 0x0000)
struct PP_Effects_C_DirtSecondEffect final
{
public:
	class FName                                   ThirdParameterName;                                // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SecondParameterName;                               // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   FirstParameterName;                                // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue_1;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue_2;              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_B_ImplicitCast;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_SecondDirtEffectTime_ImplicitCast; // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PP_Effects_C_DirtSecondEffect) == 0x000008, "Wrong alignment on PP_Effects_C_DirtSecondEffect");
static_assert(sizeof(PP_Effects_C_DirtSecondEffect) == 0x000050, "Wrong size on PP_Effects_C_DirtSecondEffect");
static_assert(offsetof(PP_Effects_C_DirtSecondEffect, ThirdParameterName) == 0x000000, "Member 'PP_Effects_C_DirtSecondEffect::ThirdParameterName' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_DirtSecondEffect, SecondParameterName) == 0x000008, "Member 'PP_Effects_C_DirtSecondEffect::SecondParameterName' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_DirtSecondEffect, FirstParameterName) == 0x000010, "Member 'PP_Effects_C_DirtSecondEffect::FirstParameterName' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_DirtSecondEffect, CallFunc_GetFloatValue_ReturnValue) == 0x000018, "Member 'PP_Effects_C_DirtSecondEffect::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_DirtSecondEffect, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x00001C, "Member 'PP_Effects_C_DirtSecondEffect::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_DirtSecondEffect, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000020, "Member 'PP_Effects_C_DirtSecondEffect::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_DirtSecondEffect, CallFunc_GetFloatValue_ReturnValue_1) == 0x000028, "Member 'PP_Effects_C_DirtSecondEffect::CallFunc_GetFloatValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_DirtSecondEffect, CallFunc_GetFloatValue_ReturnValue_2) == 0x00002C, "Member 'PP_Effects_C_DirtSecondEffect::CallFunc_GetFloatValue_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_DirtSecondEffect, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000030, "Member 'PP_Effects_C_DirtSecondEffect::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_DirtSecondEffect, CallFunc_Greater_DoubleDouble_B_ImplicitCast) == 0x000038, "Member 'PP_Effects_C_DirtSecondEffect::CallFunc_Greater_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_DirtSecondEffect, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000040, "Member 'PP_Effects_C_DirtSecondEffect::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_DirtSecondEffect, K2Node_VariableSet_SecondDirtEffectTime_ImplicitCast) == 0x000048, "Member 'PP_Effects_C_DirtSecondEffect::K2Node_VariableSet_SecondDirtEffectTime_ImplicitCast' has a wrong offset!");

// Function PP_Effects.PP_Effects_C.DisableBleedingEffect
// 0x0048 (0x0048 - 0x0000)
struct PP_Effects_C_DisableBleedingEffect final
{
public:
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue_1;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_InTime_ImplicitCast;        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_VignetteOnStopValue_ImplicitCast; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_InTime_ImplicitCast_1;      // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_BleedingEffectOnStopValue_ImplicitCast; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PP_Effects_C_DisableBleedingEffect) == 0x000008, "Wrong alignment on PP_Effects_C_DisableBleedingEffect");
static_assert(sizeof(PP_Effects_C_DisableBleedingEffect) == 0x000048, "Wrong size on PP_Effects_C_DisableBleedingEffect");
static_assert(offsetof(PP_Effects_C_DisableBleedingEffect, CallFunc_Array_AddUnique_ReturnValue) == 0x000000, "Member 'PP_Effects_C_DisableBleedingEffect::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_DisableBleedingEffect, CallFunc_GetFloatValue_ReturnValue) == 0x000004, "Member 'PP_Effects_C_DisableBleedingEffect::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_DisableBleedingEffect, CallFunc_GetFloatValue_ReturnValue_1) == 0x000008, "Member 'PP_Effects_C_DisableBleedingEffect::CallFunc_GetFloatValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_DisableBleedingEffect, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'PP_Effects_C_DisableBleedingEffect::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_DisableBleedingEffect, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'PP_Effects_C_DisableBleedingEffect::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_DisableBleedingEffect, CallFunc_GetFloatValue_InTime_ImplicitCast) == 0x000028, "Member 'PP_Effects_C_DisableBleedingEffect::CallFunc_GetFloatValue_InTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_DisableBleedingEffect, K2Node_VariableSet_VignetteOnStopValue_ImplicitCast) == 0x000030, "Member 'PP_Effects_C_DisableBleedingEffect::K2Node_VariableSet_VignetteOnStopValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_DisableBleedingEffect, CallFunc_GetFloatValue_InTime_ImplicitCast_1) == 0x000038, "Member 'PP_Effects_C_DisableBleedingEffect::CallFunc_GetFloatValue_InTime_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(PP_Effects_C_DisableBleedingEffect, K2Node_VariableSet_BleedingEffectOnStopValue_ImplicitCast) == 0x000040, "Member 'PP_Effects_C_DisableBleedingEffect::K2Node_VariableSet_BleedingEffectOnStopValue_ImplicitCast' has a wrong offset!");

