#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuestV2

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass QuestV2.QuestV2_C
// 0x0060 (0x0088 - 0x0028)
class UQuestV2_C : public UObject
{
public:
	int32                                         ID;                                                // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Hint;                                              // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          Completed;                                         // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IQuestListener_C>      Listener;                                          // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 TriggerEvent;                                      // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      Player;                                            // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLocalTrigger;                                    // 0x0070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasMarker;                                         // 0x0071(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        Positions;                                         // 0x0078(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Finish();
	void Initialize(const struct FQuestData& Data);
	void IsMyQuestEvent(const class FString& QuestEvent, int32 CurrentQuestIndex, bool* Result);
	void OnQuestEvent(const class FString& QuestEvent, int32 CurrentQuestIndex);
	void ProcessLocalTrigger(const class FString& Trigger, int32 QuestID, bool* Result);
	void QuestActivated();
	void QuestDeactivated();
	void SetListener(TScriptInterface<class IQuestListener_C> Param_Listener);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"QuestV2_C">();
	}
	static class UQuestV2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQuestV2_C>();
	}
};
static_assert(alignof(UQuestV2_C) == 0x000008, "Wrong alignment on UQuestV2_C");
static_assert(sizeof(UQuestV2_C) == 0x000088, "Wrong size on UQuestV2_C");
static_assert(offsetof(UQuestV2_C, ID) == 0x000028, "Member 'UQuestV2_C::ID' has a wrong offset!");
static_assert(offsetof(UQuestV2_C, Hint) == 0x000030, "Member 'UQuestV2_C::Hint' has a wrong offset!");
static_assert(offsetof(UQuestV2_C, Completed) == 0x000040, "Member 'UQuestV2_C::Completed' has a wrong offset!");
static_assert(offsetof(UQuestV2_C, Listener) == 0x000048, "Member 'UQuestV2_C::Listener' has a wrong offset!");
static_assert(offsetof(UQuestV2_C, TriggerEvent) == 0x000058, "Member 'UQuestV2_C::TriggerEvent' has a wrong offset!");
static_assert(offsetof(UQuestV2_C, Player) == 0x000068, "Member 'UQuestV2_C::Player' has a wrong offset!");
static_assert(offsetof(UQuestV2_C, IsLocalTrigger) == 0x000070, "Member 'UQuestV2_C::IsLocalTrigger' has a wrong offset!");
static_assert(offsetof(UQuestV2_C, HasMarker) == 0x000071, "Member 'UQuestV2_C::HasMarker' has a wrong offset!");
static_assert(offsetof(UQuestV2_C, Positions) == 0x000078, "Member 'UQuestV2_C::Positions' has a wrong offset!");

}

