#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuestData_0

#include "Basic.hpp"

#include "QuestType_structs.hpp"
#include "CustomQuestData_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct QuestData.QuestData
// 0x0058 (0x0058 - 0x0000)
struct FQuestData final
{
public:
	int32                                         ID_2_151043174ED423111262AE8D19B0F389;             // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Hint_6_53781C2244DE841CAD23F7AD5AEED911;           // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 TriggerEvent_8_C6C481634F9338FD77F54588C8B3D21F;   // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	EQuestType                                    Type_11_38227A3D41A20FBC971CAC9DAAACDDB4;          // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCustomQuestData>               CustomData_17_7967CD0544B37E69DFEAF6A5D1E7D048;    // 0x0030(0x0010)(Edit, BlueprintVisible)
	bool                                          HasMarker_19_01F5F5CF4E172D3F541F5F93CC493C2C;     // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        Positions_25_5B73C80A4A3061B7EF3D7A84C5368990;     // 0x0048(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(FQuestData) == 0x000008, "Wrong alignment on FQuestData");
static_assert(sizeof(FQuestData) == 0x000058, "Wrong size on FQuestData");
static_assert(offsetof(FQuestData, ID_2_151043174ED423111262AE8D19B0F389) == 0x000000, "Member 'FQuestData::ID_2_151043174ED423111262AE8D19B0F389' has a wrong offset!");
static_assert(offsetof(FQuestData, Hint_6_53781C2244DE841CAD23F7AD5AEED911) == 0x000008, "Member 'FQuestData::Hint_6_53781C2244DE841CAD23F7AD5AEED911' has a wrong offset!");
static_assert(offsetof(FQuestData, TriggerEvent_8_C6C481634F9338FD77F54588C8B3D21F) == 0x000018, "Member 'FQuestData::TriggerEvent_8_C6C481634F9338FD77F54588C8B3D21F' has a wrong offset!");
static_assert(offsetof(FQuestData, Type_11_38227A3D41A20FBC971CAC9DAAACDDB4) == 0x000028, "Member 'FQuestData::Type_11_38227A3D41A20FBC971CAC9DAAACDDB4' has a wrong offset!");
static_assert(offsetof(FQuestData, CustomData_17_7967CD0544B37E69DFEAF6A5D1E7D048) == 0x000030, "Member 'FQuestData::CustomData_17_7967CD0544B37E69DFEAF6A5D1E7D048' has a wrong offset!");
static_assert(offsetof(FQuestData, HasMarker_19_01F5F5CF4E172D3F541F5F93CC493C2C) == 0x000040, "Member 'FQuestData::HasMarker_19_01F5F5CF4E172D3F541F5F93CC493C2C' has a wrong offset!");
static_assert(offsetof(FQuestData, Positions_25_5B73C80A4A3061B7EF3D7A84C5368990) == 0x000048, "Member 'FQuestData::Positions_25_5B73C80A4A3061B7EF3D7A84C5368990' has a wrong offset!");

}

