#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuestSystemComp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "S_Quest_structs.hpp"
#include "FItemInfo_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass QuestSystemComp.QuestSystemComp_C
// 0x0298 (0x0338 - 0x00A0)
class UQuestSystemComp_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<struct FS_Quest>                       Quests;                                            // 0x00A8(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnInstance)
	TMap<int32, struct FVector>                   ItemLocation;                                      // 0x00B8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FFItemInfo                             ContainerPickUpInfo;                               // 0x0108(0x0220)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	class FString                                 NewVar_0;                                          // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void AddQuest(const class FString& QuestName, int32 QuestItemID, class ABP_QuestItemOld_C* QuestItem);
	void ExecuteUbergraph_QuestSystemComp(int32 EntryPoint);
	void RemoveQuest(int32 UniqItemID);
	void ResetQuest();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"QuestSystemComp_C">();
	}
	static class UQuestSystemComp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQuestSystemComp_C>();
	}
};
static_assert(alignof(UQuestSystemComp_C) == 0x000008, "Wrong alignment on UQuestSystemComp_C");
static_assert(sizeof(UQuestSystemComp_C) == 0x000338, "Wrong size on UQuestSystemComp_C");
static_assert(offsetof(UQuestSystemComp_C, UberGraphFrame) == 0x0000A0, "Member 'UQuestSystemComp_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UQuestSystemComp_C, Quests) == 0x0000A8, "Member 'UQuestSystemComp_C::Quests' has a wrong offset!");
static_assert(offsetof(UQuestSystemComp_C, ItemLocation) == 0x0000B8, "Member 'UQuestSystemComp_C::ItemLocation' has a wrong offset!");
static_assert(offsetof(UQuestSystemComp_C, ContainerPickUpInfo) == 0x000108, "Member 'UQuestSystemComp_C::ContainerPickUpInfo' has a wrong offset!");
static_assert(offsetof(UQuestSystemComp_C, NewVar_0) == 0x000328, "Member 'UQuestSystemComp_C::NewVar_0' has a wrong offset!");

}

