#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuestCanBePassed

#include "Basic.hpp"

#include "QuestFramework_structs.hpp"
#include "NPC_Structure_structs.hpp"


namespace SDK::Params
{

// Function QuestCanBePassed.QuestCanBePassed_C.VerifyCondition
// 0x0278 (0x0278 - 0x0000)
struct QuestCanBePassed_C_VerifyCondition final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvPC_C*                              SurvPC;                                            // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	bool                                          FindQuest;                                         // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShopActive;                                        // 0x0019(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_Dialogue_C*                          Wbp_Dialogue;                                      // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvPC_C*                              K2Node_DynamicCast_AsSurv_PC;                      // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_Dialogue_C*                          CallFunc_GetCachedDialogueWidget_CachedDialogueWidget; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsBeginner_IsBeginner;                 // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQuest*                                 CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UQuestContext*                          CallFunc_FindFirstActiveQuestContext_ReturnValue;  // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UQuestCustomData*                 CallFunc_GetCustomData_ReturnValue;                // 0x0090(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UQuestData_C*                     K2Node_DynamicCast_AsQuest_Data;                   // 0x00A0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AB[0x5];                                       // 0x00AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	const class UQuestCustomData*                 CallFunc_GetCustomData_ReturnValue_1;              // 0x00B0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 CallFunc_Map_Values_Values;                        // 0x00B8(0x0010)(ReferenceParm)
	const class UQuestData_C*                     K2Node_DynamicCast_AsQuest_Data_1;                 // 0x00C8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Get_Item_1;                         // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_Map_Keys_Keys;                            // 0x00D8(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Array_Get_Item_2;                         // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00FC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemCountByName_ReturnedCount;         // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_122[0x2];                                      // 0x0122(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12B[0x5];                                      // 0x012B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNPC_Structure                         CallFunc_GetDataTableRowFromName_OutRow;           // 0x0130(0x0110)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x0242(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_243[0x5];                                      // 0x0243(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_Dialogue_C*                          K2Node_Select_Default;                             // 0x0248(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FQuestVariable                         K2Node_MakeStruct_QuestVariable;                   // 0x0250(0x000C)(NoDestructor)
	struct FQuestVariable                         K2Node_MakeStruct_QuestVariable_1;                 // 0x025C(0x000C)(NoDestructor)
	int32                                         CallFunc_GetQuestVariableValueAsInteger_ReturnValue; // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetQuestVariableValueAsInteger_ReturnValue_1; // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_2;        // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_3;        // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestCanBePassed_C_VerifyCondition) == 0x000008, "Wrong alignment on QuestCanBePassed_C_VerifyCondition");
static_assert(sizeof(QuestCanBePassed_C_VerifyCondition) == 0x000278, "Wrong size on QuestCanBePassed_C_VerifyCondition");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, PlayerController) == 0x000000, "Member 'QuestCanBePassed_C_VerifyCondition::PlayerController' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, ReturnValue) == 0x000008, "Member 'QuestCanBePassed_C_VerifyCondition::ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, SurvPC) == 0x000010, "Member 'QuestCanBePassed_C_VerifyCondition::SurvPC' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, FindQuest) == 0x000018, "Member 'QuestCanBePassed_C_VerifyCondition::FindQuest' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, ShopActive) == 0x000019, "Member 'QuestCanBePassed_C_VerifyCondition::ShopActive' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, Wbp_Dialogue) == 0x000020, "Member 'QuestCanBePassed_C_VerifyCondition::Wbp_Dialogue' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, Temp_bool_True_if_break_was_hit_Variable) == 0x000028, "Member 'QuestCanBePassed_C_VerifyCondition::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, K2Node_DynamicCast_AsSurv_PC) == 0x000030, "Member 'QuestCanBePassed_C_VerifyCondition::K2Node_DynamicCast_AsSurv_PC' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'QuestCanBePassed_C_VerifyCondition::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, CallFunc_IsValid_ReturnValue) == 0x000039, "Member 'QuestCanBePassed_C_VerifyCondition::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, CallFunc_IsValid_ReturnValue_1) == 0x00003A, "Member 'QuestCanBePassed_C_VerifyCondition::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, CallFunc_GetCachedDialogueWidget_CachedDialogueWidget) == 0x000040, "Member 'QuestCanBePassed_C_VerifyCondition::CallFunc_GetCachedDialogueWidget_CachedDialogueWidget' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, CallFunc_K2_GetPawn_ReturnValue) == 0x000048, "Member 'QuestCanBePassed_C_VerifyCondition::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'QuestCanBePassed_C_VerifyCondition::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, K2Node_DynamicCast_AsSurvival_Player) == 0x000058, "Member 'QuestCanBePassed_C_VerifyCondition::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'QuestCanBePassed_C_VerifyCondition::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, CallFunc_Not_PreBool_ReturnValue) == 0x000061, "Member 'QuestCanBePassed_C_VerifyCondition::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, Temp_int_Loop_Counter_Variable) == 0x000064, "Member 'QuestCanBePassed_C_VerifyCondition::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, CallFunc_Add_IntInt_ReturnValue) == 0x000068, "Member 'QuestCanBePassed_C_VerifyCondition::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, Temp_int_Array_Index_Variable) == 0x00006C, "Member 'QuestCanBePassed_C_VerifyCondition::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000070, "Member 'QuestCanBePassed_C_VerifyCondition::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, CallFunc_GetIsBeginner_IsBeginner) == 0x000071, "Member 'QuestCanBePassed_C_VerifyCondition::CallFunc_GetIsBeginner_IsBeginner' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, Temp_int_Array_Index_Variable_1) == 0x000074, "Member 'QuestCanBePassed_C_VerifyCondition::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, CallFunc_Array_Get_Item) == 0x000078, "Member 'QuestCanBePassed_C_VerifyCondition::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, CallFunc_FindFirstActiveQuestContext_ReturnValue) == 0x000080, "Member 'QuestCanBePassed_C_VerifyCondition::CallFunc_FindFirstActiveQuestContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, CallFunc_Array_Length_ReturnValue_1) == 0x000088, "Member 'QuestCanBePassed_C_VerifyCondition::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, CallFunc_GetCustomData_ReturnValue) == 0x000090, "Member 'QuestCanBePassed_C_VerifyCondition::CallFunc_GetCustomData_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000098, "Member 'QuestCanBePassed_C_VerifyCondition::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, K2Node_DynamicCast_AsQuest_Data) == 0x0000A0, "Member 'QuestCanBePassed_C_VerifyCondition::K2Node_DynamicCast_AsQuest_Data' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, K2Node_DynamicCast_bSuccess_2) == 0x0000A8, "Member 'QuestCanBePassed_C_VerifyCondition::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000A9, "Member 'QuestCanBePassed_C_VerifyCondition::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, K2Node_SwitchEnum_CmpSuccess) == 0x0000AA, "Member 'QuestCanBePassed_C_VerifyCondition::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, CallFunc_GetCustomData_ReturnValue_1) == 0x0000B0, "Member 'QuestCanBePassed_C_VerifyCondition::CallFunc_GetCustomData_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, CallFunc_Map_Values_Values) == 0x0000B8, "Member 'QuestCanBePassed_C_VerifyCondition::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, K2Node_DynamicCast_AsQuest_Data_1) == 0x0000C8, "Member 'QuestCanBePassed_C_VerifyCondition::K2Node_DynamicCast_AsQuest_Data_1' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, K2Node_DynamicCast_bSuccess_3) == 0x0000D0, "Member 'QuestCanBePassed_C_VerifyCondition::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, CallFunc_Array_Get_Item_1) == 0x0000D4, "Member 'QuestCanBePassed_C_VerifyCondition::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, CallFunc_Map_Keys_Keys) == 0x0000D8, "Member 'QuestCanBePassed_C_VerifyCondition::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, CallFunc_Array_Get_Item_2) == 0x0000E8, "Member 'QuestCanBePassed_C_VerifyCondition::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, CallFunc_Array_Length_ReturnValue_2) == 0x0000F8, "Member 'QuestCanBePassed_C_VerifyCondition::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, CallFunc_Conv_StringToName_ReturnValue) == 0x0000FC, "Member 'QuestCanBePassed_C_VerifyCondition::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, CallFunc_Less_IntInt_ReturnValue) == 0x000104, "Member 'QuestCanBePassed_C_VerifyCondition::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, CallFunc_Conv_NameToString_ReturnValue) == 0x000108, "Member 'QuestCanBePassed_C_VerifyCondition::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, CallFunc_GetItemCountByName_ReturnedCount) == 0x000118, "Member 'QuestCanBePassed_C_VerifyCondition::CallFunc_GetItemCountByName_ReturnedCount' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, Temp_int_Loop_Counter_Variable_1) == 0x00011C, "Member 'QuestCanBePassed_C_VerifyCondition::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x000120, "Member 'QuestCanBePassed_C_VerifyCondition::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, CallFunc_Less_IntInt_ReturnValue_1) == 0x000121, "Member 'QuestCanBePassed_C_VerifyCondition::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, CallFunc_Add_IntInt_ReturnValue_1) == 0x000124, "Member 'QuestCanBePassed_C_VerifyCondition::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, CallFunc_BooleanAND_ReturnValue) == 0x000128, "Member 'QuestCanBePassed_C_VerifyCondition::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, Temp_bool_Variable) == 0x000129, "Member 'QuestCanBePassed_C_VerifyCondition::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00012A, "Member 'QuestCanBePassed_C_VerifyCondition::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, CallFunc_GetDataTableRowFromName_OutRow) == 0x000130, "Member 'QuestCanBePassed_C_VerifyCondition::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000240, "Member 'QuestCanBePassed_C_VerifyCondition::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, CallFunc_BooleanAND_ReturnValue_1) == 0x000241, "Member 'QuestCanBePassed_C_VerifyCondition::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x000242, "Member 'QuestCanBePassed_C_VerifyCondition::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, K2Node_Select_Default) == 0x000248, "Member 'QuestCanBePassed_C_VerifyCondition::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, K2Node_MakeStruct_QuestVariable) == 0x000250, "Member 'QuestCanBePassed_C_VerifyCondition::K2Node_MakeStruct_QuestVariable' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, K2Node_MakeStruct_QuestVariable_1) == 0x00025C, "Member 'QuestCanBePassed_C_VerifyCondition::K2Node_MakeStruct_QuestVariable_1' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, CallFunc_GetQuestVariableValueAsInteger_ReturnValue) == 0x000268, "Member 'QuestCanBePassed_C_VerifyCondition::CallFunc_GetQuestVariableValueAsInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, CallFunc_GetQuestVariableValueAsInteger_ReturnValue_1) == 0x00026C, "Member 'QuestCanBePassed_C_VerifyCondition::CallFunc_GetQuestVariableValueAsInteger_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, CallFunc_GreaterEqual_IntInt_ReturnValue_2) == 0x000270, "Member 'QuestCanBePassed_C_VerifyCondition::CallFunc_GreaterEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(QuestCanBePassed_C_VerifyCondition, CallFunc_GreaterEqual_IntInt_ReturnValue_3) == 0x000271, "Member 'QuestCanBePassed_C_VerifyCondition::CallFunc_GreaterEqual_IntInt_ReturnValue_3' has a wrong offset!");

}

