#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RespawnArea

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass RespawnArea.RespawnArea_C
// 0x0020 (0x02B0 - 0x0290)
class ARespawnArea_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   SpawnPoint;                                        // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_RespawnArea(int32 EntryPoint);
	void OnFillCarFuel();
	void OnImproveCar();
	void OnInventoryUpdated();
	void OnKillNPC();
	void OnPlaceBonfire();
	void OnPlayerDead(class ASurvivalPlayer_C* Player);
	void ProcessActorBeginOverlap(class AActor* Actor);
	void ProcessActorEndOverlap(class AActor* Actor);
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void ReceiveActorEndOverlap(class AActor* OtherActor);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RespawnArea_C">();
	}
	static class ARespawnArea_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARespawnArea_C>();
	}
};
static_assert(alignof(ARespawnArea_C) == 0x000008, "Wrong alignment on ARespawnArea_C");
static_assert(sizeof(ARespawnArea_C) == 0x0002B0, "Wrong size on ARespawnArea_C");
static_assert(offsetof(ARespawnArea_C, UberGraphFrame) == 0x000290, "Member 'ARespawnArea_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ARespawnArea_C, Box) == 0x000298, "Member 'ARespawnArea_C::Box' has a wrong offset!");
static_assert(offsetof(ARespawnArea_C, SpawnPoint) == 0x0002A0, "Member 'ARespawnArea_C::SpawnPoint' has a wrong offset!");
static_assert(offsetof(ARespawnArea_C, DefaultSceneRoot) == 0x0002A8, "Member 'ARespawnArea_C::DefaultSceneRoot' has a wrong offset!");

}

