#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RoomItemBaseBP

#include "Basic.hpp"

#include "BuildingInfo_Struct_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass RoomItemBaseBP.RoomItemBaseBP_C
// 0x00F0 (0x0380 - 0x0290)
class ARoomItemBaseBP_C final : public AActor
{
public:
	class UBoxComponent*                          BuildZone;                                         // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FBuildingInfo_Struct                   ItemInfo;                                          // 0x02A8(0x00D8)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RoomItemBaseBP_C">();
	}
	static class ARoomItemBaseBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARoomItemBaseBP_C>();
	}
};
static_assert(alignof(ARoomItemBaseBP_C) == 0x000008, "Wrong alignment on ARoomItemBaseBP_C");
static_assert(sizeof(ARoomItemBaseBP_C) == 0x000380, "Wrong size on ARoomItemBaseBP_C");
static_assert(offsetof(ARoomItemBaseBP_C, BuildZone) == 0x000290, "Member 'ARoomItemBaseBP_C::BuildZone' has a wrong offset!");
static_assert(offsetof(ARoomItemBaseBP_C, StaticMesh) == 0x000298, "Member 'ARoomItemBaseBP_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ARoomItemBaseBP_C, DefaultSceneRoot) == 0x0002A0, "Member 'ARoomItemBaseBP_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ARoomItemBaseBP_C, ItemInfo) == 0x0002A8, "Member 'ARoomItemBaseBP_C::ItemInfo' has a wrong offset!");

}

