#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RoomSpawnPBP

#include "Basic.hpp"

#include "E_InteractType_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "E_ActorType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass RoomSpawnPBP.RoomSpawnPBP_C
// 0x0018 (0x02A8 - 0x0290)
class ARoomSpawnPBP_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        Scene;                                             // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void DestroyInteractable();
	void ExecuteUbergraph_RoomSpawnPBP(int32 EntryPoint);
	void GetActorType(E_ActorType* ActorType);
	void IsLocked_(bool* Result);
	void OnBeginInteract(class APawn* Player);
	void OnFocused(class APawn* Player, class AActor* HighlightActor, class UActorComponent* HighlightActorComponent, E_InteractType* InteractType, double* LateTime);
	void OnInteract(class APawn* Player);
	void OnInteract2(class APawn* Player);
	void OnInteract3(class APawn* Player);
	void OnInteractVehicle(class APawn* Player, int32 SitIndex, bool SkipAnimation);
	void OnLocalInteract(class APawn* Player);
	void OnLostFocus(class APawn* Player);
	void OnSeen(class APawn* Player);
	void OnSquadCheckComplete();
	void OnStopInteract(class APawn* Player);
	void Run_Lockpicking();
	void Set3DWidgetVisibility(bool Visible);
	void SetTutorial3DWidgetVisibility(bool Visible);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RoomSpawnPBP_C">();
	}
	static class ARoomSpawnPBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARoomSpawnPBP_C>();
	}
};
static_assert(alignof(ARoomSpawnPBP_C) == 0x000008, "Wrong alignment on ARoomSpawnPBP_C");
static_assert(sizeof(ARoomSpawnPBP_C) == 0x0002A8, "Wrong size on ARoomSpawnPBP_C");
static_assert(offsetof(ARoomSpawnPBP_C, UberGraphFrame) == 0x000290, "Member 'ARoomSpawnPBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ARoomSpawnPBP_C, Scene) == 0x000298, "Member 'ARoomSpawnPBP_C::Scene' has a wrong offset!");
static_assert(offsetof(ARoomSpawnPBP_C, DefaultSceneRoot) == 0x0002A0, "Member 'ARoomSpawnPBP_C::DefaultSceneRoot' has a wrong offset!");

}

