#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_AttachmentDependency

#include "Basic.hpp"

#include "E_TypesOfModes_structs.hpp"
#include "E_DependenciesRule_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_AttachmentDependency.S_AttachmentDependency
// 0x0003 (0x0003 - 0x0000)
struct FS_AttachmentDependency final
{
public:
	bool                                          Enabled_1_C3584ECB46984C57A63B99A8A86C628B;        // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_TypesOfModes                                AttachmentType_10_269964A84F2D73527200389D650ED2A0; // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_DependenciesRule                            Rule_13_7D4AB6CF467CCBF57406909F5469CEA0;          // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_AttachmentDependency) == 0x000001, "Wrong alignment on FS_AttachmentDependency");
static_assert(sizeof(FS_AttachmentDependency) == 0x000003, "Wrong size on FS_AttachmentDependency");
static_assert(offsetof(FS_AttachmentDependency, Enabled_1_C3584ECB46984C57A63B99A8A86C628B) == 0x000000, "Member 'FS_AttachmentDependency::Enabled_1_C3584ECB46984C57A63B99A8A86C628B' has a wrong offset!");
static_assert(offsetof(FS_AttachmentDependency, AttachmentType_10_269964A84F2D73527200389D650ED2A0) == 0x000001, "Member 'FS_AttachmentDependency::AttachmentType_10_269964A84F2D73527200389D650ED2A0' has a wrong offset!");
static_assert(offsetof(FS_AttachmentDependency, Rule_13_7D4AB6CF467CCBF57406909F5469CEA0) == 0x000002, "Member 'FS_AttachmentDependency::Rule_13_7D4AB6CF467CCBF57406909F5469CEA0' has a wrong offset!");

}

