#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_AttachmentDependencies

#include "Basic.hpp"

#include "E_AttachmentDependencyTypes_structs.hpp"
#include "E_TypesOfModes_structs.hpp"
#include "S_AttachmentDependency_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_AttachmentDependencies.S_AttachmentDependencies
// 0x0028 (0x0028 - 0x0000)
struct FS_AttachmentDependencies final
{
public:
	E_TypesOfModes                                AttachmentType_8_87AC1E48408E41A748A8F18FC8E2C432; // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_AttachmentDependencyTypes                   DependencyType_11_F3DB2E6F451E4F82D7C79E88E2D8D9C1; // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FS_AttachmentDependency>        Dependencies_6_D975ED7442AE7E092571F59D206F577A;   // 0x0008(0x0010)(Edit, BlueprintVisible)
	TArray<int32>                                 ListOfItemsIDs_18_871BEC3F4ED2F432122120AAD8CEDA39; // 0x0018(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(FS_AttachmentDependencies) == 0x000008, "Wrong alignment on FS_AttachmentDependencies");
static_assert(sizeof(FS_AttachmentDependencies) == 0x000028, "Wrong size on FS_AttachmentDependencies");
static_assert(offsetof(FS_AttachmentDependencies, AttachmentType_8_87AC1E48408E41A748A8F18FC8E2C432) == 0x000000, "Member 'FS_AttachmentDependencies::AttachmentType_8_87AC1E48408E41A748A8F18FC8E2C432' has a wrong offset!");
static_assert(offsetof(FS_AttachmentDependencies, DependencyType_11_F3DB2E6F451E4F82D7C79E88E2D8D9C1) == 0x000001, "Member 'FS_AttachmentDependencies::DependencyType_11_F3DB2E6F451E4F82D7C79E88E2D8D9C1' has a wrong offset!");
static_assert(offsetof(FS_AttachmentDependencies, Dependencies_6_D975ED7442AE7E092571F59D206F577A) == 0x000008, "Member 'FS_AttachmentDependencies::Dependencies_6_D975ED7442AE7E092571F59D206F577A' has a wrong offset!");
static_assert(offsetof(FS_AttachmentDependencies, ListOfItemsIDs_18_871BEC3F4ED2F432122120AAD8CEDA39) == 0x000018, "Member 'FS_AttachmentDependencies::ListOfItemsIDs_18_871BEC3F4ED2F432122120AAD8CEDA39' has a wrong offset!");

}

