#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_CharacterClasses

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct S_CharacterClasses.S_CharacterClasses
// 0x0040 (0x0040 - 0x0000)
struct FS_CharacterClasses final
{
public:
	class FText                                   DisplayName_2_5E5E96964C97C9E4549D6CB7DDC147DC;    // 0x0000(0x0018)(Edit, BlueprintVisible)
	class FText                                   Description_4_E22D100347DBBDC13025A9B426AA329D;    // 0x0018(0x0018)(Edit, BlueprintVisible)
	TArray<class FName>                           Perks_8_13B810684F3EF44B89177C9B889113F5;          // 0x0030(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(FS_CharacterClasses) == 0x000008, "Wrong alignment on FS_CharacterClasses");
static_assert(sizeof(FS_CharacterClasses) == 0x000040, "Wrong size on FS_CharacterClasses");
static_assert(offsetof(FS_CharacterClasses, DisplayName_2_5E5E96964C97C9E4549D6CB7DDC147DC) == 0x000000, "Member 'FS_CharacterClasses::DisplayName_2_5E5E96964C97C9E4549D6CB7DDC147DC' has a wrong offset!");
static_assert(offsetof(FS_CharacterClasses, Description_4_E22D100347DBBDC13025A9B426AA329D) == 0x000018, "Member 'FS_CharacterClasses::Description_4_E22D100347DBBDC13025A9B426AA329D' has a wrong offset!");
static_assert(offsetof(FS_CharacterClasses, Perks_8_13B810684F3EF44B89177C9B889113F5) == 0x000030, "Member 'FS_CharacterClasses::Perks_8_13B810684F3EF44B89177C9B889113F5' has a wrong offset!");

}

