#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_EatPlayerInformation

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct S_EatPlayerInformation.S_EatPlayerInformation
// 0x02B8 (0x02B8 - 0x0000)
struct FS_EatPlayerInformation final
{
public:
	TSoftObjectPtr<class UAnimSequence>           Animation_40_5BA14CE146508A06025EC79471A8D6FD;     // 0x0000(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimSequence>           FemAnimation_41_5B4F47F84442246A0DC67F86CF5A1A73;  // 0x0030(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimSequence>           StandAnimation_42_47F648054DA91685B496F88858B9DB67; // 0x0060(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimSequence>           FemStandAnimation_43_CCBC014B4496A099DF89358753E66C44; // 0x0090(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	double                                        AnimationDuration_5_48F72B22467B29226AFE28A58084F2C0; // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanMove_8_192C062B4034A4CBE53946A8A11C95D9;        // 0x00C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasStandAnimation_16_EB67433B440D00E77AEEE9B2DF86B44C; // 0x00C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WepNotHiding_21_CA00BB5841283534A01FBD9E087D4A0F;  // 0x00CA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CB[0x5];                                       // 0x00CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UAnimSequence>           WithWepAnimation_44_C5A22354487FAF6621CB5BA91BA4CC20; // 0x00D0(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimSequence>           FemWithWepAnimation_45_726ACE484036B7895168A09C734EF04A; // 0x0100(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimSequence>           StandWithWepAnimation_46_2D47ED704CDD1870738110921ED493DD; // 0x0130(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimSequence>           FemStandWithWepAnimation_47_B7595A3F40B956E88C5BB7B288442137; // 0x0160(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimSequence>           WithPistolAnimation_48_0AEB19724FBA3740EEA2E19B5EBB86CF; // 0x0190(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimSequence>           FemWithPistolAnimation_49_A0C2F6A947FED878A35BAABB71E74E69; // 0x01C0(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimSequence>           StandWithPistolAnimation_50_5FF7F9194B61E29956DF549F01D23871; // 0x01F0(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimSequence>           FemStandWithPistolAnimation_51_A29E86364CB2372D9230F5A1BB52D19E; // 0x0220(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimSequence>           InventoryAnim_54_67D4D36947ED9C7244447FA1FB76CE96; // 0x0250(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimSequence>           FemInventoryAnim_56_34CCE51E4702DFFEBFA09F995EE52B0C; // 0x0280(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          HasInventoryAnim_58_8FDF416449C0ABEDDFEC7FBD00165A1F; // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_EatPlayerInformation) == 0x000008, "Wrong alignment on FS_EatPlayerInformation");
static_assert(sizeof(FS_EatPlayerInformation) == 0x0002B8, "Wrong size on FS_EatPlayerInformation");
static_assert(offsetof(FS_EatPlayerInformation, Animation_40_5BA14CE146508A06025EC79471A8D6FD) == 0x000000, "Member 'FS_EatPlayerInformation::Animation_40_5BA14CE146508A06025EC79471A8D6FD' has a wrong offset!");
static_assert(offsetof(FS_EatPlayerInformation, FemAnimation_41_5B4F47F84442246A0DC67F86CF5A1A73) == 0x000030, "Member 'FS_EatPlayerInformation::FemAnimation_41_5B4F47F84442246A0DC67F86CF5A1A73' has a wrong offset!");
static_assert(offsetof(FS_EatPlayerInformation, StandAnimation_42_47F648054DA91685B496F88858B9DB67) == 0x000060, "Member 'FS_EatPlayerInformation::StandAnimation_42_47F648054DA91685B496F88858B9DB67' has a wrong offset!");
static_assert(offsetof(FS_EatPlayerInformation, FemStandAnimation_43_CCBC014B4496A099DF89358753E66C44) == 0x000090, "Member 'FS_EatPlayerInformation::FemStandAnimation_43_CCBC014B4496A099DF89358753E66C44' has a wrong offset!");
static_assert(offsetof(FS_EatPlayerInformation, AnimationDuration_5_48F72B22467B29226AFE28A58084F2C0) == 0x0000C0, "Member 'FS_EatPlayerInformation::AnimationDuration_5_48F72B22467B29226AFE28A58084F2C0' has a wrong offset!");
static_assert(offsetof(FS_EatPlayerInformation, CanMove_8_192C062B4034A4CBE53946A8A11C95D9) == 0x0000C8, "Member 'FS_EatPlayerInformation::CanMove_8_192C062B4034A4CBE53946A8A11C95D9' has a wrong offset!");
static_assert(offsetof(FS_EatPlayerInformation, HasStandAnimation_16_EB67433B440D00E77AEEE9B2DF86B44C) == 0x0000C9, "Member 'FS_EatPlayerInformation::HasStandAnimation_16_EB67433B440D00E77AEEE9B2DF86B44C' has a wrong offset!");
static_assert(offsetof(FS_EatPlayerInformation, WepNotHiding_21_CA00BB5841283534A01FBD9E087D4A0F) == 0x0000CA, "Member 'FS_EatPlayerInformation::WepNotHiding_21_CA00BB5841283534A01FBD9E087D4A0F' has a wrong offset!");
static_assert(offsetof(FS_EatPlayerInformation, WithWepAnimation_44_C5A22354487FAF6621CB5BA91BA4CC20) == 0x0000D0, "Member 'FS_EatPlayerInformation::WithWepAnimation_44_C5A22354487FAF6621CB5BA91BA4CC20' has a wrong offset!");
static_assert(offsetof(FS_EatPlayerInformation, FemWithWepAnimation_45_726ACE484036B7895168A09C734EF04A) == 0x000100, "Member 'FS_EatPlayerInformation::FemWithWepAnimation_45_726ACE484036B7895168A09C734EF04A' has a wrong offset!");
static_assert(offsetof(FS_EatPlayerInformation, StandWithWepAnimation_46_2D47ED704CDD1870738110921ED493DD) == 0x000130, "Member 'FS_EatPlayerInformation::StandWithWepAnimation_46_2D47ED704CDD1870738110921ED493DD' has a wrong offset!");
static_assert(offsetof(FS_EatPlayerInformation, FemStandWithWepAnimation_47_B7595A3F40B956E88C5BB7B288442137) == 0x000160, "Member 'FS_EatPlayerInformation::FemStandWithWepAnimation_47_B7595A3F40B956E88C5BB7B288442137' has a wrong offset!");
static_assert(offsetof(FS_EatPlayerInformation, WithPistolAnimation_48_0AEB19724FBA3740EEA2E19B5EBB86CF) == 0x000190, "Member 'FS_EatPlayerInformation::WithPistolAnimation_48_0AEB19724FBA3740EEA2E19B5EBB86CF' has a wrong offset!");
static_assert(offsetof(FS_EatPlayerInformation, FemWithPistolAnimation_49_A0C2F6A947FED878A35BAABB71E74E69) == 0x0001C0, "Member 'FS_EatPlayerInformation::FemWithPistolAnimation_49_A0C2F6A947FED878A35BAABB71E74E69' has a wrong offset!");
static_assert(offsetof(FS_EatPlayerInformation, StandWithPistolAnimation_50_5FF7F9194B61E29956DF549F01D23871) == 0x0001F0, "Member 'FS_EatPlayerInformation::StandWithPistolAnimation_50_5FF7F9194B61E29956DF549F01D23871' has a wrong offset!");
static_assert(offsetof(FS_EatPlayerInformation, FemStandWithPistolAnimation_51_A29E86364CB2372D9230F5A1BB52D19E) == 0x000220, "Member 'FS_EatPlayerInformation::FemStandWithPistolAnimation_51_A29E86364CB2372D9230F5A1BB52D19E' has a wrong offset!");
static_assert(offsetof(FS_EatPlayerInformation, InventoryAnim_54_67D4D36947ED9C7244447FA1FB76CE96) == 0x000250, "Member 'FS_EatPlayerInformation::InventoryAnim_54_67D4D36947ED9C7244447FA1FB76CE96' has a wrong offset!");
static_assert(offsetof(FS_EatPlayerInformation, FemInventoryAnim_56_34CCE51E4702DFFEBFA09F995EE52B0C) == 0x000280, "Member 'FS_EatPlayerInformation::FemInventoryAnim_56_34CCE51E4702DFFEBFA09F995EE52B0C' has a wrong offset!");
static_assert(offsetof(FS_EatPlayerInformation, HasInventoryAnim_58_8FDF416449C0ABEDDFEC7FBD00165A1F) == 0x0002B0, "Member 'FS_EatPlayerInformation::HasInventoryAnim_58_8FDF416449C0ABEDDFEC7FBD00165A1F' has a wrong offset!");

}

