#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_EffectInfo

#include "Basic.hpp"

#include "Survival_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_EffectInfo.S_EffectInfo
// 0x0040 (0x0040 - 0x0000)
struct FS_EffectInfo final
{
public:
	class FText                                   Name_3_9D9AAB1D4386CD9080C7F782190E097F;           // 0x0000(0x0018)(Edit, BlueprintVisible)
	class FText                                   Description_5_20712618428252FCDE5B99AF8C666297;    // 0x0018(0x0018)(Edit, BlueprintVisible)
	class UPaperSprite*                           Icon_10_C13BCEA944CA44F9774627B0BC4E7B4A;          // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EUNegativeEffectType                          UNegativeEffectType_16_DA6D28544A4934F66DE10DA062B024C3; // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_EffectInfo) == 0x000008, "Wrong alignment on FS_EffectInfo");
static_assert(sizeof(FS_EffectInfo) == 0x000040, "Wrong size on FS_EffectInfo");
static_assert(offsetof(FS_EffectInfo, Name_3_9D9AAB1D4386CD9080C7F782190E097F) == 0x000000, "Member 'FS_EffectInfo::Name_3_9D9AAB1D4386CD9080C7F782190E097F' has a wrong offset!");
static_assert(offsetof(FS_EffectInfo, Description_5_20712618428252FCDE5B99AF8C666297) == 0x000018, "Member 'FS_EffectInfo::Description_5_20712618428252FCDE5B99AF8C666297' has a wrong offset!");
static_assert(offsetof(FS_EffectInfo, Icon_10_C13BCEA944CA44F9774627B0BC4E7B4A) == 0x000030, "Member 'FS_EffectInfo::Icon_10_C13BCEA944CA44F9774627B0BC4E7B4A' has a wrong offset!");
static_assert(offsetof(FS_EffectInfo, UNegativeEffectType_16_DA6D28544A4934F66DE10DA062B024C3) == 0x000038, "Member 'FS_EffectInfo::UNegativeEffectType_16_DA6D28544A4934F66DE10DA062B024C3' has a wrong offset!");

}

