#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_Item

#include "Basic.hpp"

#include "Survival_structs.hpp"
#include "EffectContructor_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_Item.S_Item
// 0x0090 (0x0090 - 0x0000)
struct FS_Item final
{
public:
	class FName                                   ItemID_2_3354D4B349662F28138C2B860CBFEC7A;         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemType                                     ItemType_37_48EBD9FF46EE3B76DFD01B920C322940;      // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FEffectContructor>              Effects_8_8A9CB89A4CABDC38DA660A8D31431946;        // 0x0010(0x0010)(Edit, BlueprintVisible)
	int32                                         SizeX_14_2ED1155346EAE18A57FE1F982B6A0999;         // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SizeY_13_712469094E57F819B2E50CA4C6C90CF2;         // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxStack_19_682FCDCB4A39944E5F933790C7E8E7C7;      // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsUsable_28_D820291D4B1BF3DCCFD78AAA5178AC16;      // 0x002C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEquipable_29_49541037484B56B0F64A3980781CB927;   // 0x002D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UPaperSprite>            Icon_39_B543B9644F6931A12C3EFE88A4E95B24;          // 0x0030(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UStaticMesh>             Mesh_40_54D4CCE04E9FD087217CAD9CBF7C3F98;          // 0x0060(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
static_assert(alignof(FS_Item) == 0x000008, "Wrong alignment on FS_Item");
static_assert(sizeof(FS_Item) == 0x000090, "Wrong size on FS_Item");
static_assert(offsetof(FS_Item, ItemID_2_3354D4B349662F28138C2B860CBFEC7A) == 0x000000, "Member 'FS_Item::ItemID_2_3354D4B349662F28138C2B860CBFEC7A' has a wrong offset!");
static_assert(offsetof(FS_Item, ItemType_37_48EBD9FF46EE3B76DFD01B920C322940) == 0x000008, "Member 'FS_Item::ItemType_37_48EBD9FF46EE3B76DFD01B920C322940' has a wrong offset!");
static_assert(offsetof(FS_Item, Effects_8_8A9CB89A4CABDC38DA660A8D31431946) == 0x000010, "Member 'FS_Item::Effects_8_8A9CB89A4CABDC38DA660A8D31431946' has a wrong offset!");
static_assert(offsetof(FS_Item, SizeX_14_2ED1155346EAE18A57FE1F982B6A0999) == 0x000020, "Member 'FS_Item::SizeX_14_2ED1155346EAE18A57FE1F982B6A0999' has a wrong offset!");
static_assert(offsetof(FS_Item, SizeY_13_712469094E57F819B2E50CA4C6C90CF2) == 0x000024, "Member 'FS_Item::SizeY_13_712469094E57F819B2E50CA4C6C90CF2' has a wrong offset!");
static_assert(offsetof(FS_Item, MaxStack_19_682FCDCB4A39944E5F933790C7E8E7C7) == 0x000028, "Member 'FS_Item::MaxStack_19_682FCDCB4A39944E5F933790C7E8E7C7' has a wrong offset!");
static_assert(offsetof(FS_Item, IsUsable_28_D820291D4B1BF3DCCFD78AAA5178AC16) == 0x00002C, "Member 'FS_Item::IsUsable_28_D820291D4B1BF3DCCFD78AAA5178AC16' has a wrong offset!");
static_assert(offsetof(FS_Item, IsEquipable_29_49541037484B56B0F64A3980781CB927) == 0x00002D, "Member 'FS_Item::IsEquipable_29_49541037484B56B0F64A3980781CB927' has a wrong offset!");
static_assert(offsetof(FS_Item, Icon_39_B543B9644F6931A12C3EFE88A4E95B24) == 0x000030, "Member 'FS_Item::Icon_39_B543B9644F6931A12C3EFE88A4E95B24' has a wrong offset!");
static_assert(offsetof(FS_Item, Mesh_40_54D4CCE04E9FD087217CAD9CBF7C3F98) == 0x000060, "Member 'FS_Item::Mesh_40_54D4CCE04E9FD087217CAD9CBF7C3F98' has a wrong offset!");

}

