#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_ItemsToCraft

#include "Basic.hpp"

#include "EDismantleType_structs.hpp"
#include "CraftItemCategories_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_ItemsToCraft.S_ItemsToCraft
// 0x0150 (0x0150 - 0x0000)
struct FS_ItemsToCraft final
{
public:
	int32                                         Level_44_49E792FB4F021382BE4AC8B8316BF938;         // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPaperSprite*                           CraftedItemIcon_60_D790C16C4C8449963F0FCCAB788C675F; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TMap<EDismantleType, int32>                   CraftResources_100_C6BBB2E64B05694A27B5D99E0286629E; // 0x0010(0x0050)(Edit, BlueprintVisible)
	double                                        XP_63_BDADE38E44810FD6EF5DD18E8BEF3679;            // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Count_73_17205592448F61C533D6B69FD516A6E0;         // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECraftItemCategories                          CategoryIs_76_969B1C194B9376B5A2C6FFA2BA05AFF5;    // 0x006C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPaperSprite*                           BlackAndWhiteIcon_79_2EB79F4F41BD96F628035FA538DE9F8A; // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPaperSprite*                           CantCraftIcon_82_A9B37B7D4E254E603BEE62B373690EEF; // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            ImageRender_89_3ED2E6904AE9951D605536BCFA2A1CCC;   // 0x0080(0x00D0)(Edit, BlueprintVisible)
};
static_assert(alignof(FS_ItemsToCraft) == 0x000010, "Wrong alignment on FS_ItemsToCraft");
static_assert(sizeof(FS_ItemsToCraft) == 0x000150, "Wrong size on FS_ItemsToCraft");
static_assert(offsetof(FS_ItemsToCraft, Level_44_49E792FB4F021382BE4AC8B8316BF938) == 0x000000, "Member 'FS_ItemsToCraft::Level_44_49E792FB4F021382BE4AC8B8316BF938' has a wrong offset!");
static_assert(offsetof(FS_ItemsToCraft, CraftedItemIcon_60_D790C16C4C8449963F0FCCAB788C675F) == 0x000008, "Member 'FS_ItemsToCraft::CraftedItemIcon_60_D790C16C4C8449963F0FCCAB788C675F' has a wrong offset!");
static_assert(offsetof(FS_ItemsToCraft, CraftResources_100_C6BBB2E64B05694A27B5D99E0286629E) == 0x000010, "Member 'FS_ItemsToCraft::CraftResources_100_C6BBB2E64B05694A27B5D99E0286629E' has a wrong offset!");
static_assert(offsetof(FS_ItemsToCraft, XP_63_BDADE38E44810FD6EF5DD18E8BEF3679) == 0x000060, "Member 'FS_ItemsToCraft::XP_63_BDADE38E44810FD6EF5DD18E8BEF3679' has a wrong offset!");
static_assert(offsetof(FS_ItemsToCraft, Count_73_17205592448F61C533D6B69FD516A6E0) == 0x000068, "Member 'FS_ItemsToCraft::Count_73_17205592448F61C533D6B69FD516A6E0' has a wrong offset!");
static_assert(offsetof(FS_ItemsToCraft, CategoryIs_76_969B1C194B9376B5A2C6FFA2BA05AFF5) == 0x00006C, "Member 'FS_ItemsToCraft::CategoryIs_76_969B1C194B9376B5A2C6FFA2BA05AFF5' has a wrong offset!");
static_assert(offsetof(FS_ItemsToCraft, BlackAndWhiteIcon_79_2EB79F4F41BD96F628035FA538DE9F8A) == 0x000070, "Member 'FS_ItemsToCraft::BlackAndWhiteIcon_79_2EB79F4F41BD96F628035FA538DE9F8A' has a wrong offset!");
static_assert(offsetof(FS_ItemsToCraft, CantCraftIcon_82_A9B37B7D4E254E603BEE62B373690EEF) == 0x000078, "Member 'FS_ItemsToCraft::CantCraftIcon_82_A9B37B7D4E254E603BEE62B373690EEF' has a wrong offset!");
static_assert(offsetof(FS_ItemsToCraft, ImageRender_89_3ED2E6904AE9951D605536BCFA2A1CCC) == 0x000080, "Member 'FS_ItemsToCraft::ImageRender_89_3ED2E6904AE9951D605536BCFA2A1CCC' has a wrong offset!");

}

