#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_LootChanceModifier

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct S_LootChanceModifier.S_LootChanceModifier
// 0x0009 (0x0009 - 0x0000)
struct FS_LootChanceModifier final
{
public:
	bool                                          IncreaseFood_3_C01F50E149B504C1EDEBCA9A75D58C51;   // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IncreaseDrink_4_7E33BDA441F405DB7EEA5FB36A38C6D1;  // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IncreaseAid_5_570FB3D5419A2E3963F756A18B7262F4;    // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DecreasePistol_9_E7F8BFEA48B69A39092E4B985FC9037D; // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DecreaseRifle_10_74CF55A144872FF9261A31899E191547; // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DecreaseShotgun_15_396B9D35439AB2D7577DDBAADB788D78; // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DecreaseBackpack_11_1E572B934C15C364801FBC9D570188CF; // 0x0006(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DecreaseAid_13_33DA96434C4DE6DE459238B91F01EB16;   // 0x0007(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DecreaseMelee_17_5CB48088489A531823132298E05616C6; // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_LootChanceModifier) == 0x000001, "Wrong alignment on FS_LootChanceModifier");
static_assert(sizeof(FS_LootChanceModifier) == 0x000009, "Wrong size on FS_LootChanceModifier");
static_assert(offsetof(FS_LootChanceModifier, IncreaseFood_3_C01F50E149B504C1EDEBCA9A75D58C51) == 0x000000, "Member 'FS_LootChanceModifier::IncreaseFood_3_C01F50E149B504C1EDEBCA9A75D58C51' has a wrong offset!");
static_assert(offsetof(FS_LootChanceModifier, IncreaseDrink_4_7E33BDA441F405DB7EEA5FB36A38C6D1) == 0x000001, "Member 'FS_LootChanceModifier::IncreaseDrink_4_7E33BDA441F405DB7EEA5FB36A38C6D1' has a wrong offset!");
static_assert(offsetof(FS_LootChanceModifier, IncreaseAid_5_570FB3D5419A2E3963F756A18B7262F4) == 0x000002, "Member 'FS_LootChanceModifier::IncreaseAid_5_570FB3D5419A2E3963F756A18B7262F4' has a wrong offset!");
static_assert(offsetof(FS_LootChanceModifier, DecreasePistol_9_E7F8BFEA48B69A39092E4B985FC9037D) == 0x000003, "Member 'FS_LootChanceModifier::DecreasePistol_9_E7F8BFEA48B69A39092E4B985FC9037D' has a wrong offset!");
static_assert(offsetof(FS_LootChanceModifier, DecreaseRifle_10_74CF55A144872FF9261A31899E191547) == 0x000004, "Member 'FS_LootChanceModifier::DecreaseRifle_10_74CF55A144872FF9261A31899E191547' has a wrong offset!");
static_assert(offsetof(FS_LootChanceModifier, DecreaseShotgun_15_396B9D35439AB2D7577DDBAADB788D78) == 0x000005, "Member 'FS_LootChanceModifier::DecreaseShotgun_15_396B9D35439AB2D7577DDBAADB788D78' has a wrong offset!");
static_assert(offsetof(FS_LootChanceModifier, DecreaseBackpack_11_1E572B934C15C364801FBC9D570188CF) == 0x000006, "Member 'FS_LootChanceModifier::DecreaseBackpack_11_1E572B934C15C364801FBC9D570188CF' has a wrong offset!");
static_assert(offsetof(FS_LootChanceModifier, DecreaseAid_13_33DA96434C4DE6DE459238B91F01EB16) == 0x000007, "Member 'FS_LootChanceModifier::DecreaseAid_13_33DA96434C4DE6DE459238B91F01EB16' has a wrong offset!");
static_assert(offsetof(FS_LootChanceModifier, DecreaseMelee_17_5CB48088489A531823132298E05616C6) == 0x000008, "Member 'FS_LootChanceModifier::DecreaseMelee_17_5CB48088489A531823132298E05616C6' has a wrong offset!");

}

