#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_NeedItems

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct S_NeedItems.S_NeedItems
// 0x0020 (0x0020 - 0x0000)
struct FS_NeedItems final
{
public:
	class FString                                 ItemName_11_6C57248C47344E545B556CA8C0CD94C2;      // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class UPaperSprite*                           ResourceItemIcon_9_64D6BEF4416095CABC4B8CB7066ACFBA; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPaperSprite*                           HasNoItemIcon_14_DDFF16874F2E11C8DCEB10B5AD707054; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_NeedItems) == 0x000008, "Wrong alignment on FS_NeedItems");
static_assert(sizeof(FS_NeedItems) == 0x000020, "Wrong size on FS_NeedItems");
static_assert(offsetof(FS_NeedItems, ItemName_11_6C57248C47344E545B556CA8C0CD94C2) == 0x000000, "Member 'FS_NeedItems::ItemName_11_6C57248C47344E545B556CA8C0CD94C2' has a wrong offset!");
static_assert(offsetof(FS_NeedItems, ResourceItemIcon_9_64D6BEF4416095CABC4B8CB7066ACFBA) == 0x000010, "Member 'FS_NeedItems::ResourceItemIcon_9_64D6BEF4416095CABC4B8CB7066ACFBA' has a wrong offset!");
static_assert(offsetof(FS_NeedItems, HasNoItemIcon_14_DDFF16874F2E11C8DCEB10B5AD707054) == 0x000018, "Member 'FS_NeedItems::HasNoItemIcon_14_DDFF16874F2E11C8DCEB10B5AD707054' has a wrong offset!");

}

