#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_PerkData

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct S_PerkData.S_PerkData
// 0x0100 (0x0100 - 0x0000)
struct FS_PerkData final
{
public:
	class FName                                   ID_30_53638C514DD973C3E6B3EC87460482FD;            // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   DisplayName_2_24FCE5024E56F948F7A509A28D42C3A6;    // 0x0008(0x0018)(Edit, BlueprintVisible)
	class FText                                   Description_27_B761D08B40DEE5316DF6C9A978AAB0EB;   // 0x0020(0x0018)(Edit, BlueprintVisible)
	bool                                          Achievable_5_12BDB9364FB7AF259D251DAE0851ACB6;     // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, float>                    AchieveCondition_22_CEA8F66F48FAB2C109E5C394278C6091; // 0x0040(0x0050)(Edit, BlueprintVisible)
	class FName                                   BlockedPerkID_14_09662DC04F99B340F88E5D82BA14C07E; // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   ObjectRef_18_04DBD0E24F9773B870E727AF3D7ABBF2;     // 0x0098(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UPaperSprite>            Sprite_15_5B89E3D346840D0204368F88D96F5247;        // 0x00C8(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          IsActive_32_00DAF5CC44AC64ED173BFC84CB7D54FF;      // 0x00F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_PerkData) == 0x000008, "Wrong alignment on FS_PerkData");
static_assert(sizeof(FS_PerkData) == 0x000100, "Wrong size on FS_PerkData");
static_assert(offsetof(FS_PerkData, ID_30_53638C514DD973C3E6B3EC87460482FD) == 0x000000, "Member 'FS_PerkData::ID_30_53638C514DD973C3E6B3EC87460482FD' has a wrong offset!");
static_assert(offsetof(FS_PerkData, DisplayName_2_24FCE5024E56F948F7A509A28D42C3A6) == 0x000008, "Member 'FS_PerkData::DisplayName_2_24FCE5024E56F948F7A509A28D42C3A6' has a wrong offset!");
static_assert(offsetof(FS_PerkData, Description_27_B761D08B40DEE5316DF6C9A978AAB0EB) == 0x000020, "Member 'FS_PerkData::Description_27_B761D08B40DEE5316DF6C9A978AAB0EB' has a wrong offset!");
static_assert(offsetof(FS_PerkData, Achievable_5_12BDB9364FB7AF259D251DAE0851ACB6) == 0x000038, "Member 'FS_PerkData::Achievable_5_12BDB9364FB7AF259D251DAE0851ACB6' has a wrong offset!");
static_assert(offsetof(FS_PerkData, AchieveCondition_22_CEA8F66F48FAB2C109E5C394278C6091) == 0x000040, "Member 'FS_PerkData::AchieveCondition_22_CEA8F66F48FAB2C109E5C394278C6091' has a wrong offset!");
static_assert(offsetof(FS_PerkData, BlockedPerkID_14_09662DC04F99B340F88E5D82BA14C07E) == 0x000090, "Member 'FS_PerkData::BlockedPerkID_14_09662DC04F99B340F88E5D82BA14C07E' has a wrong offset!");
static_assert(offsetof(FS_PerkData, ObjectRef_18_04DBD0E24F9773B870E727AF3D7ABBF2) == 0x000098, "Member 'FS_PerkData::ObjectRef_18_04DBD0E24F9773B870E727AF3D7ABBF2' has a wrong offset!");
static_assert(offsetof(FS_PerkData, Sprite_15_5B89E3D346840D0204368F88D96F5247) == 0x0000C8, "Member 'FS_PerkData::Sprite_15_5B89E3D346840D0204368F88D96F5247' has a wrong offset!");
static_assert(offsetof(FS_PerkData, IsActive_32_00DAF5CC44AC64ED173BFC84CB7D54FF) == 0x0000F8, "Member 'FS_PerkData::IsActive_32_00DAF5CC44AC64ED173BFC84CB7D54FF' has a wrong offset!");

}

