#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_PlayerWeaponAnim

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct S_PlayerWeaponAnim.S_PlayerWeaponAnim
// 0x0088 (0x0088 - 0x0000)
struct FS_PlayerWeaponAnim final
{
public:
	class UWeaponAnimAsset*                       AnimAssets_22_9669AF974F6D0C4811EA44BAF99C48D0;    // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWeaponAnimAsset*                       AnimAssetsFemale_47_AAFC39464DC9BDB2FF803E96CE1CE0A9; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          FP_Idle_25_6F8CC9264247592EBD64718F2B03602B;       // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          FP_Equip_27_30678BB44539AF3593DE1E8135EE7C7D;      // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          FP_Move_35_1AAD25DF48D06375478CFAAB182FE9AB;       // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          FP_Unequip_29_622C4DD14C92F146243331B7B41D422C;    // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           FP_Fire_32_C2AF309847FD87AD0E02418DE7425207;       // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           FP_FingerIdle_67_01C57D3243C408CB6E40B5A9022A0B37; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          FP_WallOffset_Up_40_48C525AA4778BA9716BAD0B04E195B8D; // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          FP_WallOffset_Down_41_89AC23C74811CB9B70659681C8F6D854; // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBPDA_WeaponGripType_C*                 TacticalGripTypes_44_A6407E7F4480842324643A8AD0020DEA; // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBPDA_WeaponGripType_C*                 TacticalGripTypesFemale_51_CC140D184AC10946FC511FB5C07EDE49; // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          FP_Idle_Fem_54_392CC1CA4AFB83DF179DCDA3B93826E2;   // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          FP_Equip_Fem_56_B6D94F024BB84A29335582A43A6B7852;  // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          FP_Move_Fem_58_81DA974848AAD338ACB2B6AA41C0210A;   // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           FP_Fire_Fem_61_DF0FB8C64C473F788329E8BA5138438F;   // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           FP_FingerIdle_Fem_68_A4534E93443B3F288099CBB6A5043BD2; // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_PlayerWeaponAnim) == 0x000008, "Wrong alignment on FS_PlayerWeaponAnim");
static_assert(sizeof(FS_PlayerWeaponAnim) == 0x000088, "Wrong size on FS_PlayerWeaponAnim");
static_assert(offsetof(FS_PlayerWeaponAnim, AnimAssets_22_9669AF974F6D0C4811EA44BAF99C48D0) == 0x000000, "Member 'FS_PlayerWeaponAnim::AnimAssets_22_9669AF974F6D0C4811EA44BAF99C48D0' has a wrong offset!");
static_assert(offsetof(FS_PlayerWeaponAnim, AnimAssetsFemale_47_AAFC39464DC9BDB2FF803E96CE1CE0A9) == 0x000008, "Member 'FS_PlayerWeaponAnim::AnimAssetsFemale_47_AAFC39464DC9BDB2FF803E96CE1CE0A9' has a wrong offset!");
static_assert(offsetof(FS_PlayerWeaponAnim, FP_Idle_25_6F8CC9264247592EBD64718F2B03602B) == 0x000010, "Member 'FS_PlayerWeaponAnim::FP_Idle_25_6F8CC9264247592EBD64718F2B03602B' has a wrong offset!");
static_assert(offsetof(FS_PlayerWeaponAnim, FP_Equip_27_30678BB44539AF3593DE1E8135EE7C7D) == 0x000018, "Member 'FS_PlayerWeaponAnim::FP_Equip_27_30678BB44539AF3593DE1E8135EE7C7D' has a wrong offset!");
static_assert(offsetof(FS_PlayerWeaponAnim, FP_Move_35_1AAD25DF48D06375478CFAAB182FE9AB) == 0x000020, "Member 'FS_PlayerWeaponAnim::FP_Move_35_1AAD25DF48D06375478CFAAB182FE9AB' has a wrong offset!");
static_assert(offsetof(FS_PlayerWeaponAnim, FP_Unequip_29_622C4DD14C92F146243331B7B41D422C) == 0x000028, "Member 'FS_PlayerWeaponAnim::FP_Unequip_29_622C4DD14C92F146243331B7B41D422C' has a wrong offset!");
static_assert(offsetof(FS_PlayerWeaponAnim, FP_Fire_32_C2AF309847FD87AD0E02418DE7425207) == 0x000030, "Member 'FS_PlayerWeaponAnim::FP_Fire_32_C2AF309847FD87AD0E02418DE7425207' has a wrong offset!");
static_assert(offsetof(FS_PlayerWeaponAnim, FP_FingerIdle_67_01C57D3243C408CB6E40B5A9022A0B37) == 0x000038, "Member 'FS_PlayerWeaponAnim::FP_FingerIdle_67_01C57D3243C408CB6E40B5A9022A0B37' has a wrong offset!");
static_assert(offsetof(FS_PlayerWeaponAnim, FP_WallOffset_Up_40_48C525AA4778BA9716BAD0B04E195B8D) == 0x000040, "Member 'FS_PlayerWeaponAnim::FP_WallOffset_Up_40_48C525AA4778BA9716BAD0B04E195B8D' has a wrong offset!");
static_assert(offsetof(FS_PlayerWeaponAnim, FP_WallOffset_Down_41_89AC23C74811CB9B70659681C8F6D854) == 0x000048, "Member 'FS_PlayerWeaponAnim::FP_WallOffset_Down_41_89AC23C74811CB9B70659681C8F6D854' has a wrong offset!");
static_assert(offsetof(FS_PlayerWeaponAnim, TacticalGripTypes_44_A6407E7F4480842324643A8AD0020DEA) == 0x000050, "Member 'FS_PlayerWeaponAnim::TacticalGripTypes_44_A6407E7F4480842324643A8AD0020DEA' has a wrong offset!");
static_assert(offsetof(FS_PlayerWeaponAnim, TacticalGripTypesFemale_51_CC140D184AC10946FC511FB5C07EDE49) == 0x000058, "Member 'FS_PlayerWeaponAnim::TacticalGripTypesFemale_51_CC140D184AC10946FC511FB5C07EDE49' has a wrong offset!");
static_assert(offsetof(FS_PlayerWeaponAnim, FP_Idle_Fem_54_392CC1CA4AFB83DF179DCDA3B93826E2) == 0x000060, "Member 'FS_PlayerWeaponAnim::FP_Idle_Fem_54_392CC1CA4AFB83DF179DCDA3B93826E2' has a wrong offset!");
static_assert(offsetof(FS_PlayerWeaponAnim, FP_Equip_Fem_56_B6D94F024BB84A29335582A43A6B7852) == 0x000068, "Member 'FS_PlayerWeaponAnim::FP_Equip_Fem_56_B6D94F024BB84A29335582A43A6B7852' has a wrong offset!");
static_assert(offsetof(FS_PlayerWeaponAnim, FP_Move_Fem_58_81DA974848AAD338ACB2B6AA41C0210A) == 0x000070, "Member 'FS_PlayerWeaponAnim::FP_Move_Fem_58_81DA974848AAD338ACB2B6AA41C0210A' has a wrong offset!");
static_assert(offsetof(FS_PlayerWeaponAnim, FP_Fire_Fem_61_DF0FB8C64C473F788329E8BA5138438F) == 0x000078, "Member 'FS_PlayerWeaponAnim::FP_Fire_Fem_61_DF0FB8C64C473F788329E8BA5138438F' has a wrong offset!");
static_assert(offsetof(FS_PlayerWeaponAnim, FP_FingerIdle_Fem_68_A4534E93443B3F288099CBB6A5043BD2) == 0x000080, "Member 'FS_PlayerWeaponAnim::FP_FingerIdle_Fem_68_A4534E93443B3F288099CBB6A5043BD2' has a wrong offset!");

}

