#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_PointerHintInfo

#include "Basic.hpp"

#include "CardinalDirections_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_PointerHintInfo.S_PointerHintInfo
// 0x0028 (0x0028 - 0x0000)
struct FS_PointerHintInfo final
{
public:
	class FText                                   Text_2_7CD5D1574D6FD701D465DAA0D9D03128;           // 0x0000(0x0018)(Edit, BlueprintVisible)
	class UPaperSprite*                           Image_5_C39020A5457A1FF4C1EEE7BF50B75843;          // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECardinalDirections                           ArrowOrientation_23_0EB4DDE24C52F5A03D74D197FCB3E6BC; // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_PointerHintInfo) == 0x000008, "Wrong alignment on FS_PointerHintInfo");
static_assert(sizeof(FS_PointerHintInfo) == 0x000028, "Wrong size on FS_PointerHintInfo");
static_assert(offsetof(FS_PointerHintInfo, Text_2_7CD5D1574D6FD701D465DAA0D9D03128) == 0x000000, "Member 'FS_PointerHintInfo::Text_2_7CD5D1574D6FD701D465DAA0D9D03128' has a wrong offset!");
static_assert(offsetof(FS_PointerHintInfo, Image_5_C39020A5457A1FF4C1EEE7BF50B75843) == 0x000018, "Member 'FS_PointerHintInfo::Image_5_C39020A5457A1FF4C1EEE7BF50B75843' has a wrong offset!");
static_assert(offsetof(FS_PointerHintInfo, ArrowOrientation_23_0EB4DDE24C52F5A03D74D197FCB3E6BC) == 0x000020, "Member 'FS_PointerHintInfo::ArrowOrientation_23_0EB4DDE24C52F5A03D74D197FCB3E6BC' has a wrong offset!");

}

