#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_Quest

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct S_Quest.S_Quest
// 0x0020 (0x0020 - 0x0000)
struct FS_Quest final
{
public:
	class FString                                 QuestName_2_5AC68AB742A6716AD1072293206E9017;      // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         QuestItemID_5_8098E5E84C57F96DE2AD28B3E28961DB;    // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_QuestItemOld_C*                     QuestItem_10_B3A0D72C4AED93DF277060A5603F449E;     // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_Quest) == 0x000008, "Wrong alignment on FS_Quest");
static_assert(sizeof(FS_Quest) == 0x000020, "Wrong size on FS_Quest");
static_assert(offsetof(FS_Quest, QuestName_2_5AC68AB742A6716AD1072293206E9017) == 0x000000, "Member 'FS_Quest::QuestName_2_5AC68AB742A6716AD1072293206E9017' has a wrong offset!");
static_assert(offsetof(FS_Quest, QuestItemID_5_8098E5E84C57F96DE2AD28B3E28961DB) == 0x000010, "Member 'FS_Quest::QuestItemID_5_8098E5E84C57F96DE2AD28B3E28961DB' has a wrong offset!");
static_assert(offsetof(FS_Quest, QuestItem_10_B3A0D72C4AED93DF277060A5603F449E) == 0x000018, "Member 'FS_Quest::QuestItem_10_B3A0D72C4AED93DF277060A5603F449E' has a wrong offset!");

}

