#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_SaveStructure

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_SaveStructure.S_SaveStructure
// 0x01B0 (0x01B0 - 0x0000)
struct FS_SaveStructure final
{
public:
	class USkeletalMesh*                          Face_17_84A25235429B7D1844F39EB4777FC471;          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          Beard_18_328C6CC44A2D6F5C87DE2093B8CE17B0;         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          Body_19_CA09A0EC401C30EEE051268AEFF0182C;          // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          Hair_20_8B0BD0754F1E5FAC6411C188037A968A;          // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          Legs_21_AEE22FB844A875069F31199B547B64A0;          // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           EyeColor_15_986BFE2341E4D18B64C585A1060ADBB7;      // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           HairColor_16_58DC3FB4429347BEBAD00DA67BF22423;     // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      Head_27_4C3E49C74C0F9C553E21CEB8C142C906;          // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      BodyLegs_28_416CD7C147C686FD852970BF988B5DAF;      // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterial*                              RHand_32_DD7ECD424F14E09A3CEA628E2772BA58;         // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterial*                              Lhand_33_44FB03374A36B8DD036515B985BFE0FC;         // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Woman_35_9A83B10C450E4185AE0E519953CF7C98;         // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Black_37_C5422CC44ED0B39317C799BDC50EBD99;         // 0x0069(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SkinTone_40_1DA8C6E44725FA5F147B7BB0E1CC381B;      // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        UseMakeup_43_F75559E0439C88524B88A5AB4FA8A84F;     // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ScalarMakeupSelector_45_BC39796541267BE9165B4284FE4E685A; // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ScalarTexture_47_BF8CFA1C4290D6B792CC098C6911C46B; // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ScarSelector_49_A671FA2B4D5DAC24BA9ABF8F5908652C;  // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ScalarUseScar_51_8595D82F43BD409063750A99C637E67A; // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           SelectedTraits_63_4168252445B15AD0C248B3B391303283; // 0x00A0(0x0010)(Edit, BlueprintVisible)
	class FString                                 HouseArray_64_C2F210CC485A9D5F974D2281938243D9;    // 0x00B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         PlayerStatus_68_EC6BCD2F4A95692CAD157C832A1C8C0E;  // 0x00C0(0x0010)(Edit, BlueprintVisible)
	double                                        Age_72_4F3577D1404D763E0924BB8BBEE7C5B6;           // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Freckles_74_F1999D004869CFF85C93C5B810F76A35;      // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TattoDepth_76_F672499D43935EB3FED823BF7168FEF5;    // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MakeupDepth_78_C08EE2DB410B549E625C0C99A6D36863;   // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MakeupMetallic_80_C56E15774887EBA8FD61A3A16FA8F619; // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MakeupGloss_82_8EC143734FBF7E68E491C2B9382DF495;   // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LipsDepth_84_19951262423E08679CB9F4AD7C16F482;     // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LipsMetallic_86_32D6F63A40BFE6F5A8C33FACE60912EA;  // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LipsGloss_88_6D26ACAF4C16CF17468F24A83D91E785;     // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Tattoo_91_56E54F624DA7D534F28FB48561613402;        // 0x0118(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Makeup_92_8C05390C41146778C0542F8120124B14;        // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TattooColor_95_6011B10C420ED4AF236395B22B2A04E4;   // 0x0128(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           BeardColor_99_B441E3CB424F732290A55C86D83C9F8F;    // 0x0138(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           LipsColor_100_0B134CC04771D44C4B8C249D8A1FD24C;    // 0x0148(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           MakeupColor_101_D65CA9444F4F844BBD33ECA41CDB8246;  // 0x0158(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Class_104_80F23A9B4F910BF5A7097AA2ADF85316;        // 0x0168(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	double                                        FmodIndex_107_089C767D454D0C256B1859B2BB88EA20;    // 0x0178(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CCS_Helmet_110_DCCA494F4B7E00BB5E4FF7BBD501DD5E;   // 0x0180(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CCS_Armor_112_159E978F470DD71E8C34CA9FDEAD841F;    // 0x0188(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CCS_Rukzak_114_45336E4346FE0844D69F3480921B2853;   // 0x0190(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CCS_Body_117_E78DFD19448329D822C55AB19DA9100F;     // 0x0198(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CCS_Pants_118_A13BF06641C33DDA67D2A4A7F6EF34D6;    // 0x01A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        IntensityMask_121_C3B067CE46F20ECF844E57A139F8C638; // 0x01A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_SaveStructure) == 0x000008, "Wrong alignment on FS_SaveStructure");
static_assert(sizeof(FS_SaveStructure) == 0x0001B0, "Wrong size on FS_SaveStructure");
static_assert(offsetof(FS_SaveStructure, Face_17_84A25235429B7D1844F39EB4777FC471) == 0x000000, "Member 'FS_SaveStructure::Face_17_84A25235429B7D1844F39EB4777FC471' has a wrong offset!");
static_assert(offsetof(FS_SaveStructure, Beard_18_328C6CC44A2D6F5C87DE2093B8CE17B0) == 0x000008, "Member 'FS_SaveStructure::Beard_18_328C6CC44A2D6F5C87DE2093B8CE17B0' has a wrong offset!");
static_assert(offsetof(FS_SaveStructure, Body_19_CA09A0EC401C30EEE051268AEFF0182C) == 0x000010, "Member 'FS_SaveStructure::Body_19_CA09A0EC401C30EEE051268AEFF0182C' has a wrong offset!");
static_assert(offsetof(FS_SaveStructure, Hair_20_8B0BD0754F1E5FAC6411C188037A968A) == 0x000018, "Member 'FS_SaveStructure::Hair_20_8B0BD0754F1E5FAC6411C188037A968A' has a wrong offset!");
static_assert(offsetof(FS_SaveStructure, Legs_21_AEE22FB844A875069F31199B547B64A0) == 0x000020, "Member 'FS_SaveStructure::Legs_21_AEE22FB844A875069F31199B547B64A0' has a wrong offset!");
static_assert(offsetof(FS_SaveStructure, EyeColor_15_986BFE2341E4D18B64C585A1060ADBB7) == 0x000028, "Member 'FS_SaveStructure::EyeColor_15_986BFE2341E4D18B64C585A1060ADBB7' has a wrong offset!");
static_assert(offsetof(FS_SaveStructure, HairColor_16_58DC3FB4429347BEBAD00DA67BF22423) == 0x000038, "Member 'FS_SaveStructure::HairColor_16_58DC3FB4429347BEBAD00DA67BF22423' has a wrong offset!");
static_assert(offsetof(FS_SaveStructure, Head_27_4C3E49C74C0F9C553E21CEB8C142C906) == 0x000048, "Member 'FS_SaveStructure::Head_27_4C3E49C74C0F9C553E21CEB8C142C906' has a wrong offset!");
static_assert(offsetof(FS_SaveStructure, BodyLegs_28_416CD7C147C686FD852970BF988B5DAF) == 0x000050, "Member 'FS_SaveStructure::BodyLegs_28_416CD7C147C686FD852970BF988B5DAF' has a wrong offset!");
static_assert(offsetof(FS_SaveStructure, RHand_32_DD7ECD424F14E09A3CEA628E2772BA58) == 0x000058, "Member 'FS_SaveStructure::RHand_32_DD7ECD424F14E09A3CEA628E2772BA58' has a wrong offset!");
static_assert(offsetof(FS_SaveStructure, Lhand_33_44FB03374A36B8DD036515B985BFE0FC) == 0x000060, "Member 'FS_SaveStructure::Lhand_33_44FB03374A36B8DD036515B985BFE0FC' has a wrong offset!");
static_assert(offsetof(FS_SaveStructure, Woman_35_9A83B10C450E4185AE0E519953CF7C98) == 0x000068, "Member 'FS_SaveStructure::Woman_35_9A83B10C450E4185AE0E519953CF7C98' has a wrong offset!");
static_assert(offsetof(FS_SaveStructure, Black_37_C5422CC44ED0B39317C799BDC50EBD99) == 0x000069, "Member 'FS_SaveStructure::Black_37_C5422CC44ED0B39317C799BDC50EBD99' has a wrong offset!");
static_assert(offsetof(FS_SaveStructure, SkinTone_40_1DA8C6E44725FA5F147B7BB0E1CC381B) == 0x000070, "Member 'FS_SaveStructure::SkinTone_40_1DA8C6E44725FA5F147B7BB0E1CC381B' has a wrong offset!");
static_assert(offsetof(FS_SaveStructure, UseMakeup_43_F75559E0439C88524B88A5AB4FA8A84F) == 0x000078, "Member 'FS_SaveStructure::UseMakeup_43_F75559E0439C88524B88A5AB4FA8A84F' has a wrong offset!");
static_assert(offsetof(FS_SaveStructure, ScalarMakeupSelector_45_BC39796541267BE9165B4284FE4E685A) == 0x000080, "Member 'FS_SaveStructure::ScalarMakeupSelector_45_BC39796541267BE9165B4284FE4E685A' has a wrong offset!");
static_assert(offsetof(FS_SaveStructure, ScalarTexture_47_BF8CFA1C4290D6B792CC098C6911C46B) == 0x000088, "Member 'FS_SaveStructure::ScalarTexture_47_BF8CFA1C4290D6B792CC098C6911C46B' has a wrong offset!");
static_assert(offsetof(FS_SaveStructure, ScarSelector_49_A671FA2B4D5DAC24BA9ABF8F5908652C) == 0x000090, "Member 'FS_SaveStructure::ScarSelector_49_A671FA2B4D5DAC24BA9ABF8F5908652C' has a wrong offset!");
static_assert(offsetof(FS_SaveStructure, ScalarUseScar_51_8595D82F43BD409063750A99C637E67A) == 0x000098, "Member 'FS_SaveStructure::ScalarUseScar_51_8595D82F43BD409063750A99C637E67A' has a wrong offset!");
static_assert(offsetof(FS_SaveStructure, SelectedTraits_63_4168252445B15AD0C248B3B391303283) == 0x0000A0, "Member 'FS_SaveStructure::SelectedTraits_63_4168252445B15AD0C248B3B391303283' has a wrong offset!");
static_assert(offsetof(FS_SaveStructure, HouseArray_64_C2F210CC485A9D5F974D2281938243D9) == 0x0000B0, "Member 'FS_SaveStructure::HouseArray_64_C2F210CC485A9D5F974D2281938243D9' has a wrong offset!");
static_assert(offsetof(FS_SaveStructure, PlayerStatus_68_EC6BCD2F4A95692CAD157C832A1C8C0E) == 0x0000C0, "Member 'FS_SaveStructure::PlayerStatus_68_EC6BCD2F4A95692CAD157C832A1C8C0E' has a wrong offset!");
static_assert(offsetof(FS_SaveStructure, Age_72_4F3577D1404D763E0924BB8BBEE7C5B6) == 0x0000D0, "Member 'FS_SaveStructure::Age_72_4F3577D1404D763E0924BB8BBEE7C5B6' has a wrong offset!");
static_assert(offsetof(FS_SaveStructure, Freckles_74_F1999D004869CFF85C93C5B810F76A35) == 0x0000D8, "Member 'FS_SaveStructure::Freckles_74_F1999D004869CFF85C93C5B810F76A35' has a wrong offset!");
static_assert(offsetof(FS_SaveStructure, TattoDepth_76_F672499D43935EB3FED823BF7168FEF5) == 0x0000E0, "Member 'FS_SaveStructure::TattoDepth_76_F672499D43935EB3FED823BF7168FEF5' has a wrong offset!");
static_assert(offsetof(FS_SaveStructure, MakeupDepth_78_C08EE2DB410B549E625C0C99A6D36863) == 0x0000E8, "Member 'FS_SaveStructure::MakeupDepth_78_C08EE2DB410B549E625C0C99A6D36863' has a wrong offset!");
static_assert(offsetof(FS_SaveStructure, MakeupMetallic_80_C56E15774887EBA8FD61A3A16FA8F619) == 0x0000F0, "Member 'FS_SaveStructure::MakeupMetallic_80_C56E15774887EBA8FD61A3A16FA8F619' has a wrong offset!");
static_assert(offsetof(FS_SaveStructure, MakeupGloss_82_8EC143734FBF7E68E491C2B9382DF495) == 0x0000F8, "Member 'FS_SaveStructure::MakeupGloss_82_8EC143734FBF7E68E491C2B9382DF495' has a wrong offset!");
static_assert(offsetof(FS_SaveStructure, LipsDepth_84_19951262423E08679CB9F4AD7C16F482) == 0x000100, "Member 'FS_SaveStructure::LipsDepth_84_19951262423E08679CB9F4AD7C16F482' has a wrong offset!");
static_assert(offsetof(FS_SaveStructure, LipsMetallic_86_32D6F63A40BFE6F5A8C33FACE60912EA) == 0x000108, "Member 'FS_SaveStructure::LipsMetallic_86_32D6F63A40BFE6F5A8C33FACE60912EA' has a wrong offset!");
static_assert(offsetof(FS_SaveStructure, LipsGloss_88_6D26ACAF4C16CF17468F24A83D91E785) == 0x000110, "Member 'FS_SaveStructure::LipsGloss_88_6D26ACAF4C16CF17468F24A83D91E785' has a wrong offset!");
static_assert(offsetof(FS_SaveStructure, Tattoo_91_56E54F624DA7D534F28FB48561613402) == 0x000118, "Member 'FS_SaveStructure::Tattoo_91_56E54F624DA7D534F28FB48561613402' has a wrong offset!");
static_assert(offsetof(FS_SaveStructure, Makeup_92_8C05390C41146778C0542F8120124B14) == 0x000120, "Member 'FS_SaveStructure::Makeup_92_8C05390C41146778C0542F8120124B14' has a wrong offset!");
static_assert(offsetof(FS_SaveStructure, TattooColor_95_6011B10C420ED4AF236395B22B2A04E4) == 0x000128, "Member 'FS_SaveStructure::TattooColor_95_6011B10C420ED4AF236395B22B2A04E4' has a wrong offset!");
static_assert(offsetof(FS_SaveStructure, BeardColor_99_B441E3CB424F732290A55C86D83C9F8F) == 0x000138, "Member 'FS_SaveStructure::BeardColor_99_B441E3CB424F732290A55C86D83C9F8F' has a wrong offset!");
static_assert(offsetof(FS_SaveStructure, LipsColor_100_0B134CC04771D44C4B8C249D8A1FD24C) == 0x000148, "Member 'FS_SaveStructure::LipsColor_100_0B134CC04771D44C4B8C249D8A1FD24C' has a wrong offset!");
static_assert(offsetof(FS_SaveStructure, MakeupColor_101_D65CA9444F4F844BBD33ECA41CDB8246) == 0x000158, "Member 'FS_SaveStructure::MakeupColor_101_D65CA9444F4F844BBD33ECA41CDB8246' has a wrong offset!");
static_assert(offsetof(FS_SaveStructure, Class_104_80F23A9B4F910BF5A7097AA2ADF85316) == 0x000168, "Member 'FS_SaveStructure::Class_104_80F23A9B4F910BF5A7097AA2ADF85316' has a wrong offset!");
static_assert(offsetof(FS_SaveStructure, FmodIndex_107_089C767D454D0C256B1859B2BB88EA20) == 0x000178, "Member 'FS_SaveStructure::FmodIndex_107_089C767D454D0C256B1859B2BB88EA20' has a wrong offset!");
static_assert(offsetof(FS_SaveStructure, CCS_Helmet_110_DCCA494F4B7E00BB5E4FF7BBD501DD5E) == 0x000180, "Member 'FS_SaveStructure::CCS_Helmet_110_DCCA494F4B7E00BB5E4FF7BBD501DD5E' has a wrong offset!");
static_assert(offsetof(FS_SaveStructure, CCS_Armor_112_159E978F470DD71E8C34CA9FDEAD841F) == 0x000188, "Member 'FS_SaveStructure::CCS_Armor_112_159E978F470DD71E8C34CA9FDEAD841F' has a wrong offset!");
static_assert(offsetof(FS_SaveStructure, CCS_Rukzak_114_45336E4346FE0844D69F3480921B2853) == 0x000190, "Member 'FS_SaveStructure::CCS_Rukzak_114_45336E4346FE0844D69F3480921B2853' has a wrong offset!");
static_assert(offsetof(FS_SaveStructure, CCS_Body_117_E78DFD19448329D822C55AB19DA9100F) == 0x000198, "Member 'FS_SaveStructure::CCS_Body_117_E78DFD19448329D822C55AB19DA9100F' has a wrong offset!");
static_assert(offsetof(FS_SaveStructure, CCS_Pants_118_A13BF06641C33DDA67D2A4A7F6EF34D6) == 0x0001A0, "Member 'FS_SaveStructure::CCS_Pants_118_A13BF06641C33DDA67D2A4A7F6EF34D6' has a wrong offset!");
static_assert(offsetof(FS_SaveStructure, IntensityMask_121_C3B067CE46F20ECF844E57A139F8C638) == 0x0001A8, "Member 'FS_SaveStructure::IntensityMask_121_C3B067CE46F20ECF844E57A139F8C638' has a wrong offset!");

}

