#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_SettingDescriptionData

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct S_SettingDescriptionData.S_SettingDescriptionData
// 0x0048 (0x0048 - 0x0000)
struct FS_SettingDescriptionData final
{
public:
	class FName                                   SettingName_2_C920880841904B828E97488FE683D5FD;    // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   SettingDisplayName_5_17860A094122B508B9963DB644E34A0F; // 0x0008(0x0018)(Edit, BlueprintVisible)
	class FText                                   SettingDescription_7_5085755D44BE4E5B89E9ADBB75C23578; // 0x0020(0x0018)(Edit, BlueprintVisible)
	TArray<class FText>                           Values_11_E9C95DAF4A78DB97178E0DBEC1986667;        // 0x0038(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(FS_SettingDescriptionData) == 0x000008, "Wrong alignment on FS_SettingDescriptionData");
static_assert(sizeof(FS_SettingDescriptionData) == 0x000048, "Wrong size on FS_SettingDescriptionData");
static_assert(offsetof(FS_SettingDescriptionData, SettingName_2_C920880841904B828E97488FE683D5FD) == 0x000000, "Member 'FS_SettingDescriptionData::SettingName_2_C920880841904B828E97488FE683D5FD' has a wrong offset!");
static_assert(offsetof(FS_SettingDescriptionData, SettingDisplayName_5_17860A094122B508B9963DB644E34A0F) == 0x000008, "Member 'FS_SettingDescriptionData::SettingDisplayName_5_17860A094122B508B9963DB644E34A0F' has a wrong offset!");
static_assert(offsetof(FS_SettingDescriptionData, SettingDescription_7_5085755D44BE4E5B89E9ADBB75C23578) == 0x000020, "Member 'FS_SettingDescriptionData::SettingDescription_7_5085755D44BE4E5B89E9ADBB75C23578' has a wrong offset!");
static_assert(offsetof(FS_SettingDescriptionData, Values_11_E9C95DAF4A78DB97178E0DBEC1986667) == 0x000038, "Member 'FS_SettingDescriptionData::Values_11_E9C95DAF4A78DB97178E0DBEC1986667' has a wrong offset!");

}

