#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_SimplifiedHitInfo

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_SimplifiedHitInfo.S_SimplifiedHitInfo
// 0x0080 (0x0080 - 0x0000)
struct FS_SimplifiedHitInfo final
{
public:
	struct FVector                                ImpactPoint_2_FA1B6837460E74A889FECC867CD9D967;    // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ImpactNormal_4_A681D7E6454AAC70E50121A441358752;   // 0x0018(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TraceStart_6_0DD7EACD4CA50814363E82AB16290B59;     // 0x0030(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      Physmat_11_9DDFD7714C62CFA091B35E9142443A3C;       // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    HitComponent_16_6A0AF89C46CBB65EC12B029860B45068;  // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   BoneName_19_012D4953479C309C7449438D1C9FBAD5;      // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocalPoint_22_AC41EC8645B8ED308304158C72F001AE;    // 0x0060(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NeedFX_25_14214B714C2B661978EA65B9EFFBF0D6;        // 0x0078(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_SimplifiedHitInfo) == 0x000008, "Wrong alignment on FS_SimplifiedHitInfo");
static_assert(sizeof(FS_SimplifiedHitInfo) == 0x000080, "Wrong size on FS_SimplifiedHitInfo");
static_assert(offsetof(FS_SimplifiedHitInfo, ImpactPoint_2_FA1B6837460E74A889FECC867CD9D967) == 0x000000, "Member 'FS_SimplifiedHitInfo::ImpactPoint_2_FA1B6837460E74A889FECC867CD9D967' has a wrong offset!");
static_assert(offsetof(FS_SimplifiedHitInfo, ImpactNormal_4_A681D7E6454AAC70E50121A441358752) == 0x000018, "Member 'FS_SimplifiedHitInfo::ImpactNormal_4_A681D7E6454AAC70E50121A441358752' has a wrong offset!");
static_assert(offsetof(FS_SimplifiedHitInfo, TraceStart_6_0DD7EACD4CA50814363E82AB16290B59) == 0x000030, "Member 'FS_SimplifiedHitInfo::TraceStart_6_0DD7EACD4CA50814363E82AB16290B59' has a wrong offset!");
static_assert(offsetof(FS_SimplifiedHitInfo, Physmat_11_9DDFD7714C62CFA091B35E9142443A3C) == 0x000048, "Member 'FS_SimplifiedHitInfo::Physmat_11_9DDFD7714C62CFA091B35E9142443A3C' has a wrong offset!");
static_assert(offsetof(FS_SimplifiedHitInfo, HitComponent_16_6A0AF89C46CBB65EC12B029860B45068) == 0x000050, "Member 'FS_SimplifiedHitInfo::HitComponent_16_6A0AF89C46CBB65EC12B029860B45068' has a wrong offset!");
static_assert(offsetof(FS_SimplifiedHitInfo, BoneName_19_012D4953479C309C7449438D1C9FBAD5) == 0x000058, "Member 'FS_SimplifiedHitInfo::BoneName_19_012D4953479C309C7449438D1C9FBAD5' has a wrong offset!");
static_assert(offsetof(FS_SimplifiedHitInfo, LocalPoint_22_AC41EC8645B8ED308304158C72F001AE) == 0x000060, "Member 'FS_SimplifiedHitInfo::LocalPoint_22_AC41EC8645B8ED308304158C72F001AE' has a wrong offset!");
static_assert(offsetof(FS_SimplifiedHitInfo, NeedFX_25_14214B714C2B661978EA65B9EFFBF0D6) == 0x000078, "Member 'FS_SimplifiedHitInfo::NeedFX_25_14214B714C2B661978EA65B9EFFBF0D6' has a wrong offset!");

}

