#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_StatInfo

#include "Basic.hpp"

#include "E_TrainStatType_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_StatInfo.S_StatInfo
// 0x0040 (0x0040 - 0x0000)
struct FS_StatInfo final
{
public:
	class FText                                   Name_4_9CC169E343DDE43BB9FB188AF9834948;           // 0x0000(0x0018)(Edit, BlueprintVisible)
	class FText                                   Description_5_0AAF8C724BE0EEC15A7BF3B91CC45EF4;    // 0x0018(0x0018)(Edit, BlueprintVisible)
	class UPaperSprite*                           Icon_8_C287EA47447035B83A2F3FA9171082EE;           // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	E_TrainStatType                               Type_11_27E0B4C948D3E6CF7351F5B5A3CAD263;          // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ClassAbility_13_EFB72DB84D2CD7687A3553A1AB8E5F52;  // 0x0039(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_StatInfo) == 0x000008, "Wrong alignment on FS_StatInfo");
static_assert(sizeof(FS_StatInfo) == 0x000040, "Wrong size on FS_StatInfo");
static_assert(offsetof(FS_StatInfo, Name_4_9CC169E343DDE43BB9FB188AF9834948) == 0x000000, "Member 'FS_StatInfo::Name_4_9CC169E343DDE43BB9FB188AF9834948' has a wrong offset!");
static_assert(offsetof(FS_StatInfo, Description_5_0AAF8C724BE0EEC15A7BF3B91CC45EF4) == 0x000018, "Member 'FS_StatInfo::Description_5_0AAF8C724BE0EEC15A7BF3B91CC45EF4' has a wrong offset!");
static_assert(offsetof(FS_StatInfo, Icon_8_C287EA47447035B83A2F3FA9171082EE) == 0x000030, "Member 'FS_StatInfo::Icon_8_C287EA47447035B83A2F3FA9171082EE' has a wrong offset!");
static_assert(offsetof(FS_StatInfo, Type_11_27E0B4C948D3E6CF7351F5B5A3CAD263) == 0x000038, "Member 'FS_StatInfo::Type_11_27E0B4C948D3E6CF7351F5B5A3CAD263' has a wrong offset!");
static_assert(offsetof(FS_StatInfo, ClassAbility_13_EFB72DB84D2CD7687A3553A1AB8E5F52) == 0x000039, "Member 'FS_StatInfo::ClassAbility_13_EFB72DB84D2CD7687A3553A1AB8E5F52' has a wrong offset!");

}

