#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_TauntStruct

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct S_TauntStruct.S_TauntStruct
// 0x0098 (0x0098 - 0x0000)
struct FS_TauntStruct final
{
public:
	TSoftObjectPtr<class UAnimMontage>            Start_15_9C5C83E44AC6C17ABC11C69DEABBBBFB;         // 0x0000(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            Loop_16_D0F33C27454A6F9FE164DEA6433EFE1E;          // 0x0030(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            End_17_FBCE097048AF6362C93D5998726D65D8;           // 0x0060(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          OneAnim__14_5B6F99E54706DB5FB747C9890714E654;      // 0x0090(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_TauntStruct) == 0x000008, "Wrong alignment on FS_TauntStruct");
static_assert(sizeof(FS_TauntStruct) == 0x000098, "Wrong size on FS_TauntStruct");
static_assert(offsetof(FS_TauntStruct, Start_15_9C5C83E44AC6C17ABC11C69DEABBBBFB) == 0x000000, "Member 'FS_TauntStruct::Start_15_9C5C83E44AC6C17ABC11C69DEABBBBFB' has a wrong offset!");
static_assert(offsetof(FS_TauntStruct, Loop_16_D0F33C27454A6F9FE164DEA6433EFE1E) == 0x000030, "Member 'FS_TauntStruct::Loop_16_D0F33C27454A6F9FE164DEA6433EFE1E' has a wrong offset!");
static_assert(offsetof(FS_TauntStruct, End_17_FBCE097048AF6362C93D5998726D65D8) == 0x000060, "Member 'FS_TauntStruct::End_17_FBCE097048AF6362C93D5998726D65D8' has a wrong offset!");
static_assert(offsetof(FS_TauntStruct, OneAnim__14_5B6F99E54706DB5FB747C9890714E654) == 0x000090, "Member 'FS_TauntStruct::OneAnim__14_5B6F99E54706DB5FB747C9890714E654' has a wrong offset!");

}

