#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_WeaponShakeInfo

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct S_WeaponShakeInfo.S_WeaponShakeInfo
// 0x0020 (0x0020 - 0x0000)
struct FS_WeaponShakeInfo final
{
public:
	TArray<TSoftClassPtr<class UClass>>           ShakeClass_10_AA022F944B8A895DF198C19C2A298ED3;    // 0x0000(0x0010)(Edit, BlueprintVisible)
	double                                        MinScale_5_B6717EA0488C79E5ECD2BCBA9C12E6F7;       // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxScale_8_B15BFA964BC584F479FB2FA599013A74;       // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_WeaponShakeInfo) == 0x000008, "Wrong alignment on FS_WeaponShakeInfo");
static_assert(sizeof(FS_WeaponShakeInfo) == 0x000020, "Wrong size on FS_WeaponShakeInfo");
static_assert(offsetof(FS_WeaponShakeInfo, ShakeClass_10_AA022F944B8A895DF198C19C2A298ED3) == 0x000000, "Member 'FS_WeaponShakeInfo::ShakeClass_10_AA022F944B8A895DF198C19C2A298ED3' has a wrong offset!");
static_assert(offsetof(FS_WeaponShakeInfo, MinScale_5_B6717EA0488C79E5ECD2BCBA9C12E6F7) == 0x000010, "Member 'FS_WeaponShakeInfo::MinScale_5_B6717EA0488C79E5ECD2BCBA9C12E6F7' has a wrong offset!");
static_assert(offsetof(FS_WeaponShakeInfo, MaxScale_8_B15BFA964BC584F479FB2FA599013A74) == 0x000018, "Member 'FS_WeaponShakeInfo::MaxScale_8_B15BFA964BC584F479FB2FA599013A74' has a wrong offset!");

}

