#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_WeaponAccuracy

#include "Basic.hpp"

#include "BPE_Weapon_Type_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_WeaponAccuracy.S_WeaponAccuracy
// 0x000C (0x000C - 0x0000)
struct FS_WeaponAccuracy final
{
public:
	EBPE_Weapon_Type                              Weapon_4_E57A75644FBDBBCFD555CFBED20B7D36;         // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SpreadPitch_9_2B091AC54E262EA6B2AEB8AEBA8D7926;    // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Spreadyaw_13_940500F8486AB91B701885A76E6507B9;     // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_WeaponAccuracy) == 0x000004, "Wrong alignment on FS_WeaponAccuracy");
static_assert(sizeof(FS_WeaponAccuracy) == 0x00000C, "Wrong size on FS_WeaponAccuracy");
static_assert(offsetof(FS_WeaponAccuracy, Weapon_4_E57A75644FBDBBCFD555CFBED20B7D36) == 0x000000, "Member 'FS_WeaponAccuracy::Weapon_4_E57A75644FBDBBCFD555CFBED20B7D36' has a wrong offset!");
static_assert(offsetof(FS_WeaponAccuracy, SpreadPitch_9_2B091AC54E262EA6B2AEB8AEBA8D7926) == 0x000004, "Member 'FS_WeaponAccuracy::SpreadPitch_9_2B091AC54E262EA6B2AEB8AEBA8D7926' has a wrong offset!");
static_assert(offsetof(FS_WeaponAccuracy, Spreadyaw_13_940500F8486AB91B701885A76E6507B9) == 0x000008, "Member 'FS_WeaponAccuracy::Spreadyaw_13_940500F8486AB91B701885A76E6507B9' has a wrong offset!");

}

