#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_WeaponGripTypeOffset

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_WeaponGripTypeOffset.S_WeaponGripTypeOffset
// 0x0190 (0x0190 - 0x0000)
struct FS_WeaponGripTypeOffset final
{
public:
	TMap<class FString, struct FTransform>        GripTypeIdle_17_58B8ED2F41475C87A5BACCB445C946E3;  // 0x0000(0x0050)(Edit, BlueprintVisible)
	TMap<class FString, struct FTransform>        GripTypeAim_18_E9AEB01C4BCD3883DEA09A8337E4BF90;   // 0x0050(0x0050)(Edit, BlueprintVisible)
	TMap<class FString, struct FTransform>        GripCrouchTypeIdle_19_E7B67AA84A1B9405DC99839899CF3834; // 0x00A0(0x0050)(Edit, BlueprintVisible)
	TMap<class FString, struct FTransform>        GripCrouchTypeAim_20_0DD312CF4590B9F37E0F5CA2519DAC9B; // 0x00F0(0x0050)(Edit, BlueprintVisible)
	TMap<class FString, struct FTransform>        GripTypeFP_21_BD709BAA49AF7BE17F5B6BB89ADE7373;    // 0x0140(0x0050)(Edit, BlueprintVisible)
};
static_assert(alignof(FS_WeaponGripTypeOffset) == 0x000008, "Wrong alignment on FS_WeaponGripTypeOffset");
static_assert(sizeof(FS_WeaponGripTypeOffset) == 0x000190, "Wrong size on FS_WeaponGripTypeOffset");
static_assert(offsetof(FS_WeaponGripTypeOffset, GripTypeIdle_17_58B8ED2F41475C87A5BACCB445C946E3) == 0x000000, "Member 'FS_WeaponGripTypeOffset::GripTypeIdle_17_58B8ED2F41475C87A5BACCB445C946E3' has a wrong offset!");
static_assert(offsetof(FS_WeaponGripTypeOffset, GripTypeAim_18_E9AEB01C4BCD3883DEA09A8337E4BF90) == 0x000050, "Member 'FS_WeaponGripTypeOffset::GripTypeAim_18_E9AEB01C4BCD3883DEA09A8337E4BF90' has a wrong offset!");
static_assert(offsetof(FS_WeaponGripTypeOffset, GripCrouchTypeIdle_19_E7B67AA84A1B9405DC99839899CF3834) == 0x0000A0, "Member 'FS_WeaponGripTypeOffset::GripCrouchTypeIdle_19_E7B67AA84A1B9405DC99839899CF3834' has a wrong offset!");
static_assert(offsetof(FS_WeaponGripTypeOffset, GripCrouchTypeAim_20_0DD312CF4590B9F37E0F5CA2519DAC9B) == 0x0000F0, "Member 'FS_WeaponGripTypeOffset::GripCrouchTypeAim_20_0DD312CF4590B9F37E0F5CA2519DAC9B' has a wrong offset!");
static_assert(offsetof(FS_WeaponGripTypeOffset, GripTypeFP_21_BD709BAA49AF7BE17F5B6BB89ADE7373) == 0x000140, "Member 'FS_WeaponGripTypeOffset::GripTypeFP_21_BD709BAA49AF7BE17F5B6BB89ADE7373' has a wrong offset!");

}

