#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_WorkbenchCraftCategory

#include "Basic.hpp"

#include "CraftItemCategories_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_WorkbenchCraftCategory.S_WorkbenchCraftCategory
// 0x0040 (0x0040 - 0x0000)
struct FS_WorkbenchCraftCategory final
{
public:
	class FText                                   Name_2_10F5F97F49B6223B598F369BBB278D6B;           // 0x0000(0x0018)(Edit, BlueprintVisible)
	class UPaperSprite*                           IconDefault_12_E4FCC44B4C41E12A5BB932989A2F9E37;   // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPaperSprite*                           IconSelected_15_719E51664025D66B752C588E18D51866;  // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<ECraftItemCategories>                  Categories_11_233BD62D431DE06F715608B96E29B5E3;    // 0x0028(0x0010)(Edit, BlueprintVisible)
	class UPaperSprite*                           IconCategory_18_1EFC6AC8491B688ABC72969861E7B663;  // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_WorkbenchCraftCategory) == 0x000008, "Wrong alignment on FS_WorkbenchCraftCategory");
static_assert(sizeof(FS_WorkbenchCraftCategory) == 0x000040, "Wrong size on FS_WorkbenchCraftCategory");
static_assert(offsetof(FS_WorkbenchCraftCategory, Name_2_10F5F97F49B6223B598F369BBB278D6B) == 0x000000, "Member 'FS_WorkbenchCraftCategory::Name_2_10F5F97F49B6223B598F369BBB278D6B' has a wrong offset!");
static_assert(offsetof(FS_WorkbenchCraftCategory, IconDefault_12_E4FCC44B4C41E12A5BB932989A2F9E37) == 0x000018, "Member 'FS_WorkbenchCraftCategory::IconDefault_12_E4FCC44B4C41E12A5BB932989A2F9E37' has a wrong offset!");
static_assert(offsetof(FS_WorkbenchCraftCategory, IconSelected_15_719E51664025D66B752C588E18D51866) == 0x000020, "Member 'FS_WorkbenchCraftCategory::IconSelected_15_719E51664025D66B752C588E18D51866' has a wrong offset!");
static_assert(offsetof(FS_WorkbenchCraftCategory, Categories_11_233BD62D431DE06F715608B96E29B5E3) == 0x000028, "Member 'FS_WorkbenchCraftCategory::Categories_11_233BD62D431DE06F715608B96E29B5E3' has a wrong offset!");
static_assert(offsetof(FS_WorkbenchCraftCategory, IconCategory_18_1EFC6AC8491B688ABC72969861E7B663) == 0x000038, "Member 'FS_WorkbenchCraftCategory::IconCategory_18_1EFC6AC8491B688ABC72969861E7B663' has a wrong offset!");

}

