#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SaveRoom

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass SaveRoom.SaveRoom_C
// 0x0038 (0x0060 - 0x0028)
class USaveRoom_C final : public USaveGame
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0028(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class UClass*>                         Items_Inside;                                      // 0x0030(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FTransform>                     Items_Inside_Transform;                            // 0x0040(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FString>                         ID;                                                // 0x0050(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_SaveRoom(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SaveRoom_C">();
	}
	static class USaveRoom_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USaveRoom_C>();
	}
};
static_assert(alignof(USaveRoom_C) == 0x000008, "Wrong alignment on USaveRoom_C");
static_assert(sizeof(USaveRoom_C) == 0x000060, "Wrong size on USaveRoom_C");
static_assert(offsetof(USaveRoom_C, UberGraphFrame) == 0x000028, "Member 'USaveRoom_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USaveRoom_C, Items_Inside) == 0x000030, "Member 'USaveRoom_C::Items_Inside' has a wrong offset!");
static_assert(offsetof(USaveRoom_C, Items_Inside_Transform) == 0x000040, "Member 'USaveRoom_C::Items_Inside_Transform' has a wrong offset!");
static_assert(offsetof(USaveRoom_C, ID) == 0x000050, "Member 'USaveRoom_C::ID' has a wrong offset!");

}

