#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SBP_ItemsData

#include "Basic.hpp"

#include "EBP_ItemsTypes_structs.hpp"


namespace SDK
{

// UserDefinedStruct SBP_ItemsData.SBP_ItemsData
// 0x0058 (0x0058 - 0x0000)
struct FSBP_ItemsData final
{
public:
	class FString                                 Name_3_AFEA6C1E4A077863A3166CB266427161;           // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	EBP_ItemsTypes                                Type_21_DE7AD7ED4A156DB74377B58AA7A2AEED;          // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Count_9_2D5C237C474D43AEE7BF76A80BD60EEF;          // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Stackable_12_290333A7449F2C3A52B4C39DC64EACD2;     // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               Icon_17_AF314C534D0C01D6903095BB60C22629;          // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Class_25_5AB3996243864CA7B9E14883D46ED48A;         // 0x0028(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
static_assert(alignof(FSBP_ItemsData) == 0x000008, "Wrong alignment on FSBP_ItemsData");
static_assert(sizeof(FSBP_ItemsData) == 0x000058, "Wrong size on FSBP_ItemsData");
static_assert(offsetof(FSBP_ItemsData, Name_3_AFEA6C1E4A077863A3166CB266427161) == 0x000000, "Member 'FSBP_ItemsData::Name_3_AFEA6C1E4A077863A3166CB266427161' has a wrong offset!");
static_assert(offsetof(FSBP_ItemsData, Type_21_DE7AD7ED4A156DB74377B58AA7A2AEED) == 0x000010, "Member 'FSBP_ItemsData::Type_21_DE7AD7ED4A156DB74377B58AA7A2AEED' has a wrong offset!");
static_assert(offsetof(FSBP_ItemsData, Count_9_2D5C237C474D43AEE7BF76A80BD60EEF) == 0x000014, "Member 'FSBP_ItemsData::Count_9_2D5C237C474D43AEE7BF76A80BD60EEF' has a wrong offset!");
static_assert(offsetof(FSBP_ItemsData, Stackable_12_290333A7449F2C3A52B4C39DC64EACD2) == 0x000018, "Member 'FSBP_ItemsData::Stackable_12_290333A7449F2C3A52B4C39DC64EACD2' has a wrong offset!");
static_assert(offsetof(FSBP_ItemsData, Icon_17_AF314C534D0C01D6903095BB60C22629) == 0x000020, "Member 'FSBP_ItemsData::Icon_17_AF314C534D0C01D6903095BB60C22629' has a wrong offset!");
static_assert(offsetof(FSBP_ItemsData, Class_25_5AB3996243864CA7B9E14883D46ED48A) == 0x000028, "Member 'FSBP_ItemsData::Class_25_5AB3996243864CA7B9E14883D46ED48A' has a wrong offset!");

}

