#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SC_BaseWeaponAttachment

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SC_BaseWeaponAttachment.SC_BaseWeaponAttachment_C.CustomEvent_0
// 0x0008 (0x0008 - 0x0000)
struct SC_BaseWeaponAttachment_C_CustomEvent_0 final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SC_BaseWeaponAttachment_C_CustomEvent_0) == 0x000008, "Wrong alignment on SC_BaseWeaponAttachment_C_CustomEvent_0");
static_assert(sizeof(SC_BaseWeaponAttachment_C_CustomEvent_0) == 0x000008, "Wrong size on SC_BaseWeaponAttachment_C_CustomEvent_0");
static_assert(offsetof(SC_BaseWeaponAttachment_C_CustomEvent_0, DestroyedActor) == 0x000000, "Member 'SC_BaseWeaponAttachment_C_CustomEvent_0::DestroyedActor' has a wrong offset!");

// Function SC_BaseWeaponAttachment.SC_BaseWeaponAttachment_C.ExecuteUbergraph_SC_BaseWeaponAttachment
// 0x0040 (0x0040 - 0x0000)
struct SC_BaseWeaponAttachment_C_ExecuteUbergraph_SC_BaseWeaponAttachment final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* DestroyedActor)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AWeaponPlaceholder_C*                   K2Node_DynamicCast_AsWeapon_Placeholder;           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DestroyedActor;                 // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SC_BaseWeaponAttachment_C_ExecuteUbergraph_SC_BaseWeaponAttachment) == 0x000008, "Wrong alignment on SC_BaseWeaponAttachment_C_ExecuteUbergraph_SC_BaseWeaponAttachment");
static_assert(sizeof(SC_BaseWeaponAttachment_C_ExecuteUbergraph_SC_BaseWeaponAttachment) == 0x000040, "Wrong size on SC_BaseWeaponAttachment_C_ExecuteUbergraph_SC_BaseWeaponAttachment");
static_assert(offsetof(SC_BaseWeaponAttachment_C_ExecuteUbergraph_SC_BaseWeaponAttachment, EntryPoint) == 0x000000, "Member 'SC_BaseWeaponAttachment_C_ExecuteUbergraph_SC_BaseWeaponAttachment::EntryPoint' has a wrong offset!");
static_assert(offsetof(SC_BaseWeaponAttachment_C_ExecuteUbergraph_SC_BaseWeaponAttachment, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'SC_BaseWeaponAttachment_C_ExecuteUbergraph_SC_BaseWeaponAttachment::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SC_BaseWeaponAttachment_C_ExecuteUbergraph_SC_BaseWeaponAttachment, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'SC_BaseWeaponAttachment_C_ExecuteUbergraph_SC_BaseWeaponAttachment::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SC_BaseWeaponAttachment_C_ExecuteUbergraph_SC_BaseWeaponAttachment, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'SC_BaseWeaponAttachment_C_ExecuteUbergraph_SC_BaseWeaponAttachment::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(SC_BaseWeaponAttachment_C_ExecuteUbergraph_SC_BaseWeaponAttachment, K2Node_DynamicCast_AsWeapon_Placeholder) == 0x000020, "Member 'SC_BaseWeaponAttachment_C_ExecuteUbergraph_SC_BaseWeaponAttachment::K2Node_DynamicCast_AsWeapon_Placeholder' has a wrong offset!");
static_assert(offsetof(SC_BaseWeaponAttachment_C_ExecuteUbergraph_SC_BaseWeaponAttachment, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'SC_BaseWeaponAttachment_C_ExecuteUbergraph_SC_BaseWeaponAttachment::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SC_BaseWeaponAttachment_C_ExecuteUbergraph_SC_BaseWeaponAttachment, K2Node_CustomEvent_DestroyedActor) == 0x000030, "Member 'SC_BaseWeaponAttachment_C_ExecuteUbergraph_SC_BaseWeaponAttachment::K2Node_CustomEvent_DestroyedActor' has a wrong offset!");
static_assert(offsetof(SC_BaseWeaponAttachment_C_ExecuteUbergraph_SC_BaseWeaponAttachment, CallFunc_IsValid_ReturnValue_1) == 0x000038, "Member 'SC_BaseWeaponAttachment_C_ExecuteUbergraph_SC_BaseWeaponAttachment::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function SC_BaseWeaponAttachment.SC_BaseWeaponAttachment_C.SetAttachment
// 0x0080 (0x0080 - 0x0000)
struct SC_BaseWeaponAttachment_C_SetAttachment final
{
public:
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0000(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_BaseAttachment_C*                   K2Node_DynamicCast_AsBP_Base_Attachment;           // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SC_BaseWeaponAttachment_C_SetAttachment) == 0x000010, "Wrong alignment on SC_BaseWeaponAttachment_C_SetAttachment");
static_assert(sizeof(SC_BaseWeaponAttachment_C_SetAttachment) == 0x000080, "Wrong size on SC_BaseWeaponAttachment_C_SetAttachment");
static_assert(offsetof(SC_BaseWeaponAttachment_C_SetAttachment, CallFunc_MakeTransform_ReturnValue) == 0x000000, "Member 'SC_BaseWeaponAttachment_C_SetAttachment::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(SC_BaseWeaponAttachment_C_SetAttachment, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000060, "Member 'SC_BaseWeaponAttachment_C_SetAttachment::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(SC_BaseWeaponAttachment_C_SetAttachment, CallFunc_FinishSpawningActor_ReturnValue) == 0x000068, "Member 'SC_BaseWeaponAttachment_C_SetAttachment::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(SC_BaseWeaponAttachment_C_SetAttachment, K2Node_DynamicCast_AsBP_Base_Attachment) == 0x000070, "Member 'SC_BaseWeaponAttachment_C_SetAttachment::K2Node_DynamicCast_AsBP_Base_Attachment' has a wrong offset!");
static_assert(offsetof(SC_BaseWeaponAttachment_C_SetAttachment, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'SC_BaseWeaponAttachment_C_SetAttachment::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SC_BaseWeaponAttachment_C_SetAttachment, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000079, "Member 'SC_BaseWeaponAttachment_C_SetAttachment::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");

}

