#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SellerNPC_AnimBP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct SellerNPC_AnimBP.SellerNPC_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x01E7 (0x01E8 - 0x0001)
struct SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_167;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_168;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_169;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_170;                               // 0x0018(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_171;                               // 0x0028(0x0010)(BlueprintVisible)
	class FName                                   __NameProperty_172;                                // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_173;                                 // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_174;                               // 0x0048(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_175;                               // 0x0058(0x0010)(BlueprintVisible)
	class FName                                   __NameProperty_176;                                // 0x0068(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_177;                                 // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_178;                               // 0x0078(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_179;                               // 0x0088(0x0010)(BlueprintVisible)
	class FName                                   __NameProperty_180;                                // 0x0098(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_181;                                 // 0x00A0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_182;                                // 0x00A4(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_183;                               // 0x00A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_184;                              // 0x00AC(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_185;                               // 0x00D8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_186;                                // 0x00DC(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_187;                                // 0x00DD(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DE[0x2];                                       // 0x00DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_188;                                // 0x00E0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_189;                                  // 0x00E8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_190;                                // 0x00F0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_191;                                // 0x00F1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_192;                                // 0x00F2(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F3[0x5];                                       // 0x00F3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_193;                               // 0x00F8(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_194;                               // 0x0108(0x0010)(BlueprintVisible)
	class FName                                   __NameProperty_195;                                // 0x0118(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_196;                                // 0x0120(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_197;                                 // 0x0128(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_198;                              // 0x0130(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0150(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x01D0(0x0018)()
};
static_assert(alignof(SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x0001E8, "Wrong size on SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_167) == 0x000004, "Member 'SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_167' has a wrong offset!");
static_assert(offsetof(SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_168) == 0x00000C, "Member 'SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_168' has a wrong offset!");
static_assert(offsetof(SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_169) == 0x000014, "Member 'SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_169' has a wrong offset!");
static_assert(offsetof(SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_170) == 0x000018, "Member 'SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_170' has a wrong offset!");
static_assert(offsetof(SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_171) == 0x000028, "Member 'SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_171' has a wrong offset!");
static_assert(offsetof(SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_172) == 0x000038, "Member 'SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_172' has a wrong offset!");
static_assert(offsetof(SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_173) == 0x000040, "Member 'SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_173' has a wrong offset!");
static_assert(offsetof(SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_174) == 0x000048, "Member 'SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_174' has a wrong offset!");
static_assert(offsetof(SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_175) == 0x000058, "Member 'SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_175' has a wrong offset!");
static_assert(offsetof(SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_176) == 0x000068, "Member 'SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_176' has a wrong offset!");
static_assert(offsetof(SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_177) == 0x000070, "Member 'SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_177' has a wrong offset!");
static_assert(offsetof(SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_178) == 0x000078, "Member 'SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_178' has a wrong offset!");
static_assert(offsetof(SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_179) == 0x000088, "Member 'SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_179' has a wrong offset!");
static_assert(offsetof(SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_180) == 0x000098, "Member 'SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_180' has a wrong offset!");
static_assert(offsetof(SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_181) == 0x0000A0, "Member 'SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_181' has a wrong offset!");
static_assert(offsetof(SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_182) == 0x0000A4, "Member 'SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_182' has a wrong offset!");
static_assert(offsetof(SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_183) == 0x0000A8, "Member 'SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_183' has a wrong offset!");
static_assert(offsetof(SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_184) == 0x0000AC, "Member 'SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_184' has a wrong offset!");
static_assert(offsetof(SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_185) == 0x0000D8, "Member 'SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_185' has a wrong offset!");
static_assert(offsetof(SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_186) == 0x0000DC, "Member 'SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_186' has a wrong offset!");
static_assert(offsetof(SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_187) == 0x0000DD, "Member 'SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_187' has a wrong offset!");
static_assert(offsetof(SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_188) == 0x0000E0, "Member 'SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_188' has a wrong offset!");
static_assert(offsetof(SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_189) == 0x0000E8, "Member 'SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_189' has a wrong offset!");
static_assert(offsetof(SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_190) == 0x0000F0, "Member 'SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_190' has a wrong offset!");
static_assert(offsetof(SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_191) == 0x0000F1, "Member 'SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_191' has a wrong offset!");
static_assert(offsetof(SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_192) == 0x0000F2, "Member 'SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_192' has a wrong offset!");
static_assert(offsetof(SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_193) == 0x0000F8, "Member 'SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_193' has a wrong offset!");
static_assert(offsetof(SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_194) == 0x000108, "Member 'SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_194' has a wrong offset!");
static_assert(offsetof(SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_195) == 0x000118, "Member 'SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_195' has a wrong offset!");
static_assert(offsetof(SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_196) == 0x000120, "Member 'SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_196' has a wrong offset!");
static_assert(offsetof(SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_197) == 0x000128, "Member 'SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_197' has a wrong offset!");
static_assert(offsetof(SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_198) == 0x000130, "Member 'SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_198' has a wrong offset!");
static_assert(offsetof(SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000150, "Member 'SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0001D0, "Member 'SellerNPC_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct SellerNPC_AnimBP.SellerNPC_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x0004 (0x0005 - 0x0001)
struct SellerNPC_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         __ByteProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_0;                                  // 0x0002(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_1;                                  // 0x0003(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_2;                                  // 0x0004(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SellerNPC_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on SellerNPC_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(SellerNPC_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000005, "Wrong size on SellerNPC_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(SellerNPC_AnimBP::FAnimBlueprintGeneratedMutableData, __ByteProperty) == 0x000001, "Member 'SellerNPC_AnimBP::FAnimBlueprintGeneratedMutableData::__ByteProperty' has a wrong offset!");
static_assert(offsetof(SellerNPC_AnimBP::FAnimBlueprintGeneratedMutableData, __ByteProperty_0) == 0x000002, "Member 'SellerNPC_AnimBP::FAnimBlueprintGeneratedMutableData::__ByteProperty_0' has a wrong offset!");
static_assert(offsetof(SellerNPC_AnimBP::FAnimBlueprintGeneratedMutableData, __ByteProperty_1) == 0x000003, "Member 'SellerNPC_AnimBP::FAnimBlueprintGeneratedMutableData::__ByteProperty_1' has a wrong offset!");
static_assert(offsetof(SellerNPC_AnimBP::FAnimBlueprintGeneratedMutableData, __ByteProperty_2) == 0x000004, "Member 'SellerNPC_AnimBP::FAnimBlueprintGeneratedMutableData::__ByteProperty_2' has a wrong offset!");

}

