#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Service_IsEnemyClose

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Service_IsEnemyClose.Service_IsEnemyClose_C
// 0x0038 (0x00D0 - 0x0098)
class UService_IsEnemyClose_C final : public UBTService_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0098(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 BBKey;                                             // 0x00A0(0x0028)(Edit, BlueprintVisible)
	double                                        DistanceToUncover;                                 // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Service_IsEnemyClose(int32 EntryPoint);
	void ReceiveTickAI(class AAIController* OwnerController, class APawn* ControlledPawn, float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Service_IsEnemyClose_C">();
	}
	static class UService_IsEnemyClose_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UService_IsEnemyClose_C>();
	}
};
static_assert(alignof(UService_IsEnemyClose_C) == 0x000008, "Wrong alignment on UService_IsEnemyClose_C");
static_assert(sizeof(UService_IsEnemyClose_C) == 0x0000D0, "Wrong size on UService_IsEnemyClose_C");
static_assert(offsetof(UService_IsEnemyClose_C, UberGraphFrame) == 0x000098, "Member 'UService_IsEnemyClose_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UService_IsEnemyClose_C, BBKey) == 0x0000A0, "Member 'UService_IsEnemyClose_C::BBKey' has a wrong offset!");
static_assert(offsetof(UService_IsEnemyClose_C, DistanceToUncover) == 0x0000C8, "Member 'UService_IsEnemyClose_C::DistanceToUncover' has a wrong offset!");

}

