#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Service_Bandit_ShouldShoot

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Service_Bandit_ShouldShoot.Service_Bandit_ShouldShoot_C.ExecuteUbergraph_Service_Bandit_ShouldShoot
// 0x0260 (0x0260 - 0x0000)
struct Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetBlackboardValueAsVector_ReturnValue;   // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_1;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainBanditAI_C*                        K2Node_DynamicCast_AsMain_Bandit_AI;               // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue_1;              // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0080(0x0010)(ConstParm, ReferenceParm)
	struct FHitResult                             CallFunc_SphereTraceSingle_OutHit;                 // 0x0090(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingle_ReturnValue;            // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x017A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17B[0x1];                                      // 0x017B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0220(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0238(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance2D_ReturnValue;            // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot) == 0x000008, "Wrong alignment on Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot");
static_assert(sizeof(Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot) == 0x000260, "Wrong size on Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot");
static_assert(offsetof(Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot, EntryPoint) == 0x000000, "Member 'Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot::EntryPoint' has a wrong offset!");
static_assert(offsetof(Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot, CallFunc_MakeLiteralName_ReturnValue) == 0x000004, "Member 'Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot, CallFunc_GetBlackboardValueAsVector_ReturnValue) == 0x000010, "Member 'Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot::CallFunc_GetBlackboardValueAsVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot, CallFunc_MakeLiteralName_ReturnValue_1) == 0x000028, "Member 'Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot::CallFunc_MakeLiteralName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot, K2Node_Event_OwnerController) == 0x000030, "Member 'Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot, K2Node_Event_ControlledPawn) == 0x000038, "Member 'Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot, K2Node_Event_DeltaSeconds) == 0x000040, "Member 'Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot, K2Node_DynamicCast_AsMain_Bandit_AI) == 0x000048, "Member 'Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot::K2Node_DynamicCast_AsMain_Bandit_AI' has a wrong offset!");
static_assert(offsetof(Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot, CallFunc_GetBlackboard_ReturnValue) == 0x000058, "Member 'Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot, CallFunc_GetSocketLocation_ReturnValue) == 0x000060, "Member 'Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot, CallFunc_GetBlackboard_ReturnValue_1) == 0x000078, "Member 'Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot::CallFunc_GetBlackboard_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot, Temp_object_Variable) == 0x000080, "Member 'Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot, CallFunc_SphereTraceSingle_OutHit) == 0x000090, "Member 'Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot::CallFunc_SphereTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot, CallFunc_SphereTraceSingle_ReturnValue) == 0x000178, "Member 'Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot::CallFunc_SphereTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot, CallFunc_BreakHitResult_bBlockingHit) == 0x000179, "Member 'Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot, CallFunc_BreakHitResult_bInitialOverlap) == 0x00017A, "Member 'Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot, CallFunc_BreakHitResult_Time) == 0x00017C, "Member 'Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot, CallFunc_BreakHitResult_Distance) == 0x000180, "Member 'Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot, CallFunc_BreakHitResult_Location) == 0x000188, "Member 'Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot, CallFunc_BreakHitResult_ImpactPoint) == 0x0001A0, "Member 'Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot, CallFunc_BreakHitResult_Normal) == 0x0001B8, "Member 'Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot, CallFunc_BreakHitResult_ImpactNormal) == 0x0001D0, "Member 'Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot, CallFunc_BreakHitResult_PhysMat) == 0x0001E8, "Member 'Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot, CallFunc_BreakHitResult_HitActor) == 0x0001F0, "Member 'Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot, CallFunc_BreakHitResult_HitComponent) == 0x0001F8, "Member 'Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot, CallFunc_BreakHitResult_HitBoneName) == 0x000200, "Member 'Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot, CallFunc_BreakHitResult_BoneName) == 0x000208, "Member 'Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot, CallFunc_BreakHitResult_HitItem) == 0x000210, "Member 'Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot, CallFunc_BreakHitResult_ElementIndex) == 0x000214, "Member 'Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot, CallFunc_BreakHitResult_FaceIndex) == 0x000218, "Member 'Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot, CallFunc_BreakHitResult_TraceStart) == 0x000220, "Member 'Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot, CallFunc_BreakHitResult_TraceEnd) == 0x000238, "Member 'Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot, CallFunc_Vector_Distance2D_ReturnValue) == 0x000250, "Member 'Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot::CallFunc_Vector_Distance2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000258, "Member 'Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot, CallFunc_BooleanAND_ReturnValue) == 0x000259, "Member 'Service_Bandit_ShouldShoot_C_ExecuteUbergraph_Service_Bandit_ShouldShoot::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function Service_Bandit_ShouldShoot.Service_Bandit_ShouldShoot_C.ReceiveTickAI
// 0x0018 (0x0018 - 0x0000)
struct Service_Bandit_ShouldShoot_C_ReceiveTickAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Service_Bandit_ShouldShoot_C_ReceiveTickAI) == 0x000008, "Wrong alignment on Service_Bandit_ShouldShoot_C_ReceiveTickAI");
static_assert(sizeof(Service_Bandit_ShouldShoot_C_ReceiveTickAI) == 0x000018, "Wrong size on Service_Bandit_ShouldShoot_C_ReceiveTickAI");
static_assert(offsetof(Service_Bandit_ShouldShoot_C_ReceiveTickAI, OwnerController) == 0x000000, "Member 'Service_Bandit_ShouldShoot_C_ReceiveTickAI::OwnerController' has a wrong offset!");
static_assert(offsetof(Service_Bandit_ShouldShoot_C_ReceiveTickAI, ControlledPawn) == 0x000008, "Member 'Service_Bandit_ShouldShoot_C_ReceiveTickAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(Service_Bandit_ShouldShoot_C_ReceiveTickAI, DeltaSeconds) == 0x000010, "Member 'Service_Bandit_ShouldShoot_C_ReceiveTickAI::DeltaSeconds' has a wrong offset!");

}

