#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SetTentVisibility

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "QuestFramework_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SetTentVisibility.SetTentVisibility_C
// 0x0018 (0x0050 - 0x0038)
class USetTentVisibility_C final : public UQuestEvent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0038(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AGameStateBase*                         GameState;                                         // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Hide;                                              // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteEvent(class UQuestContext* Context, const struct FQuestEventPayload& Payload);
	void ExecuteUbergraph_SetTentVisibility(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SetTentVisibility_C">();
	}
	static class USetTentVisibility_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USetTentVisibility_C>();
	}
};
static_assert(alignof(USetTentVisibility_C) == 0x000008, "Wrong alignment on USetTentVisibility_C");
static_assert(sizeof(USetTentVisibility_C) == 0x000050, "Wrong size on USetTentVisibility_C");
static_assert(offsetof(USetTentVisibility_C, UberGraphFrame) == 0x000038, "Member 'USetTentVisibility_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USetTentVisibility_C, GameState) == 0x000040, "Member 'USetTentVisibility_C::GameState' has a wrong offset!");
static_assert(offsetof(USetTentVisibility_C, Hide) == 0x000048, "Member 'USetTentVisibility_C::Hide' has a wrong offset!");

}

