#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SetTentVisibility

#include "Basic.hpp"

#include "QuestFramework_structs.hpp"


namespace SDK::Params
{

// Function SetTentVisibility.SetTentVisibility_C.ExecuteEvent
// 0x0028 (0x0028 - 0x0000)
struct SetTentVisibility_C_ExecuteEvent final
{
public:
	class UQuestContext*                          Context;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FQuestEventPayload                     Payload;                                           // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(SetTentVisibility_C_ExecuteEvent) == 0x000008, "Wrong alignment on SetTentVisibility_C_ExecuteEvent");
static_assert(sizeof(SetTentVisibility_C_ExecuteEvent) == 0x000028, "Wrong size on SetTentVisibility_C_ExecuteEvent");
static_assert(offsetof(SetTentVisibility_C_ExecuteEvent, Context) == 0x000000, "Member 'SetTentVisibility_C_ExecuteEvent::Context' has a wrong offset!");
static_assert(offsetof(SetTentVisibility_C_ExecuteEvent, Payload) == 0x000008, "Member 'SetTentVisibility_C_ExecuteEvent::Payload' has a wrong offset!");

// Function SetTentVisibility.SetTentVisibility_C.ExecuteUbergraph_SetTentVisibility
// 0x0060 (0x0060 - 0x0000)
struct SetTentVisibility_C_ExecuteUbergraph_SetTentVisibility final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UQuestContext*                          K2Node_Event_Context;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FQuestEventPayload                     K2Node_Event_Payload;                              // 0x0010(0x0020)(ConstParm, NoDestructor)
	TScriptInterface<class IBPI_GS_TDB_C>         K2Node_DynamicCast_AsBPI_GS_TDB;                   // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetQuestActor_Actor;                      // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ATutorialTent_C*                        K2Node_DynamicCast_AsTutorial_Tent;                // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SetTentVisibility_C_ExecuteUbergraph_SetTentVisibility) == 0x000008, "Wrong alignment on SetTentVisibility_C_ExecuteUbergraph_SetTentVisibility");
static_assert(sizeof(SetTentVisibility_C_ExecuteUbergraph_SetTentVisibility) == 0x000060, "Wrong size on SetTentVisibility_C_ExecuteUbergraph_SetTentVisibility");
static_assert(offsetof(SetTentVisibility_C_ExecuteUbergraph_SetTentVisibility, EntryPoint) == 0x000000, "Member 'SetTentVisibility_C_ExecuteUbergraph_SetTentVisibility::EntryPoint' has a wrong offset!");
static_assert(offsetof(SetTentVisibility_C_ExecuteUbergraph_SetTentVisibility, K2Node_Event_Context) == 0x000008, "Member 'SetTentVisibility_C_ExecuteUbergraph_SetTentVisibility::K2Node_Event_Context' has a wrong offset!");
static_assert(offsetof(SetTentVisibility_C_ExecuteUbergraph_SetTentVisibility, K2Node_Event_Payload) == 0x000010, "Member 'SetTentVisibility_C_ExecuteUbergraph_SetTentVisibility::K2Node_Event_Payload' has a wrong offset!");
static_assert(offsetof(SetTentVisibility_C_ExecuteUbergraph_SetTentVisibility, K2Node_DynamicCast_AsBPI_GS_TDB) == 0x000030, "Member 'SetTentVisibility_C_ExecuteUbergraph_SetTentVisibility::K2Node_DynamicCast_AsBPI_GS_TDB' has a wrong offset!");
static_assert(offsetof(SetTentVisibility_C_ExecuteUbergraph_SetTentVisibility, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'SetTentVisibility_C_ExecuteUbergraph_SetTentVisibility::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SetTentVisibility_C_ExecuteUbergraph_SetTentVisibility, CallFunc_GetQuestActor_Actor) == 0x000048, "Member 'SetTentVisibility_C_ExecuteUbergraph_SetTentVisibility::CallFunc_GetQuestActor_Actor' has a wrong offset!");
static_assert(offsetof(SetTentVisibility_C_ExecuteUbergraph_SetTentVisibility, K2Node_DynamicCast_AsTutorial_Tent) == 0x000050, "Member 'SetTentVisibility_C_ExecuteUbergraph_SetTentVisibility::K2Node_DynamicCast_AsTutorial_Tent' has a wrong offset!");
static_assert(offsetof(SetTentVisibility_C_ExecuteUbergraph_SetTentVisibility, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'SetTentVisibility_C_ExecuteUbergraph_SetTentVisibility::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

