#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SFlashInstance

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct SFlashInstance.SFlashInstance
// 0x0020 (0x0020 - 0x0000)
struct FSFlashInstance final
{
public:
	float                                         Distance_10_7F0728D54C663E4D0561D1BEA6AAFCFE;      // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Angle_9_B5302DEA47596C570F9B97A165537135;          // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Screenposition_8_20C098BE4A4F22D2ECACAF826C611C26; // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bISBehindPlayer_7_A372F1E84D24EB568CC93380D16288B3; // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSFlashInstance) == 0x000008, "Wrong alignment on FSFlashInstance");
static_assert(sizeof(FSFlashInstance) == 0x000020, "Wrong size on FSFlashInstance");
static_assert(offsetof(FSFlashInstance, Distance_10_7F0728D54C663E4D0561D1BEA6AAFCFE) == 0x000000, "Member 'FSFlashInstance::Distance_10_7F0728D54C663E4D0561D1BEA6AAFCFE' has a wrong offset!");
static_assert(offsetof(FSFlashInstance, Angle_9_B5302DEA47596C570F9B97A165537135) == 0x000004, "Member 'FSFlashInstance::Angle_9_B5302DEA47596C570F9B97A165537135' has a wrong offset!");
static_assert(offsetof(FSFlashInstance, Screenposition_8_20C098BE4A4F22D2ECACAF826C611C26) == 0x000008, "Member 'FSFlashInstance::Screenposition_8_20C098BE4A4F22D2ECACAF826C611C26' has a wrong offset!");
static_assert(offsetof(FSFlashInstance, bISBehindPlayer_7_A372F1E84D24EB568CC93380D16288B3) == 0x000018, "Member 'FSFlashInstance::bISBehindPlayer_7_A372F1E84D24EB568CC93380D16288B3' has a wrong offset!");

}

