#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SFlashbangSettings

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct SFlashbangSettings.SFlashbangSettings
// 0x0048 (0x0048 - 0x0000)
struct FSFlashbangSettings final
{
public:
	float                                         InitialSpeed_13_6909645A4B5B549F6946F2BCD73FC85B;  // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FuseDuration_14_EC2D44F745249B67EFC93B8B22BC35F6;  // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LightDuration_15_CD0403874149FBB84A4B97AD615B3CC8; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinimumSfxVelocity_16_033753D84F984A235A5402B72084D499; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CameraShakeRadius_17_F7CA7C1148D31686253159AA7FB2EFD3; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              MaterialHorizontalOffset_18_6BA5372644EE622D9CF236A845AAE76B; // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              MaterialVerticalOffset_19_CF7DE826449A3FC167D41C88087A962C; // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ScorchMarkSize_20_632D44FF4CA85D97BA2559BC65595FD9; // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ScorchMarkFadeDuration_21_255286EA4760ADC36C8E659F44AD9630; // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ExplosionRadius_22_B90748C3405DD43449782BB6E00E70EF; // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSFlashbangSettings) == 0x000008, "Wrong alignment on FSFlashbangSettings");
static_assert(sizeof(FSFlashbangSettings) == 0x000048, "Wrong size on FSFlashbangSettings");
static_assert(offsetof(FSFlashbangSettings, InitialSpeed_13_6909645A4B5B549F6946F2BCD73FC85B) == 0x000000, "Member 'FSFlashbangSettings::InitialSpeed_13_6909645A4B5B549F6946F2BCD73FC85B' has a wrong offset!");
static_assert(offsetof(FSFlashbangSettings, FuseDuration_14_EC2D44F745249B67EFC93B8B22BC35F6) == 0x000004, "Member 'FSFlashbangSettings::FuseDuration_14_EC2D44F745249B67EFC93B8B22BC35F6' has a wrong offset!");
static_assert(offsetof(FSFlashbangSettings, LightDuration_15_CD0403874149FBB84A4B97AD615B3CC8) == 0x000008, "Member 'FSFlashbangSettings::LightDuration_15_CD0403874149FBB84A4B97AD615B3CC8' has a wrong offset!");
static_assert(offsetof(FSFlashbangSettings, MinimumSfxVelocity_16_033753D84F984A235A5402B72084D499) == 0x00000C, "Member 'FSFlashbangSettings::MinimumSfxVelocity_16_033753D84F984A235A5402B72084D499' has a wrong offset!");
static_assert(offsetof(FSFlashbangSettings, CameraShakeRadius_17_F7CA7C1148D31686253159AA7FB2EFD3) == 0x000010, "Member 'FSFlashbangSettings::CameraShakeRadius_17_F7CA7C1148D31686253159AA7FB2EFD3' has a wrong offset!");
static_assert(offsetof(FSFlashbangSettings, MaterialHorizontalOffset_18_6BA5372644EE622D9CF236A845AAE76B) == 0x000018, "Member 'FSFlashbangSettings::MaterialHorizontalOffset_18_6BA5372644EE622D9CF236A845AAE76B' has a wrong offset!");
static_assert(offsetof(FSFlashbangSettings, MaterialVerticalOffset_19_CF7DE826449A3FC167D41C88087A962C) == 0x000028, "Member 'FSFlashbangSettings::MaterialVerticalOffset_19_CF7DE826449A3FC167D41C88087A962C' has a wrong offset!");
static_assert(offsetof(FSFlashbangSettings, ScorchMarkSize_20_632D44FF4CA85D97BA2559BC65595FD9) == 0x000038, "Member 'FSFlashbangSettings::ScorchMarkSize_20_632D44FF4CA85D97BA2559BC65595FD9' has a wrong offset!");
static_assert(offsetof(FSFlashbangSettings, ScorchMarkFadeDuration_21_255286EA4760ADC36C8E659F44AD9630) == 0x00003C, "Member 'FSFlashbangSettings::ScorchMarkFadeDuration_21_255286EA4760ADC36C8E659F44AD9630' has a wrong offset!");
static_assert(offsetof(FSFlashbangSettings, ExplosionRadius_22_B90748C3405DD43449782BB6E00E70EF) == 0x000040, "Member 'FSFlashbangSettings::ExplosionRadius_22_B90748C3405DD43449782BB6E00E70EF' has a wrong offset!");

}

