#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SG_FakeLogin

#include "Basic.hpp"


namespace SDK::Params
{

// Function SG_FakeLogin.SG_FakeLogin_C.GetLogin
// 0x0010 (0x0010 - 0x0000)
struct SG_FakeLogin_C_GetLogin final
{
public:
	class FString                                 Param_Login;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(SG_FakeLogin_C_GetLogin) == 0x000008, "Wrong alignment on SG_FakeLogin_C_GetLogin");
static_assert(sizeof(SG_FakeLogin_C_GetLogin) == 0x000010, "Wrong size on SG_FakeLogin_C_GetLogin");
static_assert(offsetof(SG_FakeLogin_C_GetLogin, Param_Login) == 0x000000, "Member 'SG_FakeLogin_C_GetLogin::Param_Login' has a wrong offset!");

// Function SG_FakeLogin.SG_FakeLogin_C.SetLogin
// 0x0010 (0x0010 - 0x0000)
struct SG_FakeLogin_C_SetLogin final
{
public:
	class FString                                 Param_Login;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(SG_FakeLogin_C_SetLogin) == 0x000008, "Wrong alignment on SG_FakeLogin_C_SetLogin");
static_assert(sizeof(SG_FakeLogin_C_SetLogin) == 0x000010, "Wrong size on SG_FakeLogin_C_SetLogin");
static_assert(offsetof(SG_FakeLogin_C_SetLogin, Param_Login) == 0x000000, "Member 'SG_FakeLogin_C_SetLogin::Param_Login' has a wrong offset!");

}

