#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SG_Tutorial

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SG_Tutorial.SG_Tutorial_C
// 0x0008 (0x0030 - 0x0028)
class USG_Tutorial_C final : public USaveGame
{
public:
	bool                                          IsCompleted;                                       // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsStashTutorialDone;                               // 0x0029(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFirstStart;                                     // 0x002A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsBeginSceneCompleted;                             // 0x002B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void IsFirstStart(bool* Param_bIsFirstStart);
	void SetCompleted(bool Completed);
	void SetFirstStart(bool Param_IsFirstStart);
	void SetStashTutorialCompited(bool Done);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SG_Tutorial_C">();
	}
	static class USG_Tutorial_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USG_Tutorial_C>();
	}
};
static_assert(alignof(USG_Tutorial_C) == 0x000008, "Wrong alignment on USG_Tutorial_C");
static_assert(sizeof(USG_Tutorial_C) == 0x000030, "Wrong size on USG_Tutorial_C");
static_assert(offsetof(USG_Tutorial_C, IsCompleted) == 0x000028, "Member 'USG_Tutorial_C::IsCompleted' has a wrong offset!");
static_assert(offsetof(USG_Tutorial_C, IsStashTutorialDone) == 0x000029, "Member 'USG_Tutorial_C::IsStashTutorialDone' has a wrong offset!");
static_assert(offsetof(USG_Tutorial_C, bIsFirstStart) == 0x00002A, "Member 'USG_Tutorial_C::bIsFirstStart' has a wrong offset!");
static_assert(offsetof(USG_Tutorial_C, IsBeginSceneCompleted) == 0x00002B, "Member 'USG_Tutorial_C::IsBeginSceneCompleted' has a wrong offset!");

}

