#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SG_Tutorial

#include "Basic.hpp"


namespace SDK::Params
{

// Function SG_Tutorial.SG_Tutorial_C.IsFirstStart
// 0x0001 (0x0001 - 0x0000)
struct SG_Tutorial_C_IsFirstStart final
{
public:
	bool                                          Param_bIsFirstStart;                               // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SG_Tutorial_C_IsFirstStart) == 0x000001, "Wrong alignment on SG_Tutorial_C_IsFirstStart");
static_assert(sizeof(SG_Tutorial_C_IsFirstStart) == 0x000001, "Wrong size on SG_Tutorial_C_IsFirstStart");
static_assert(offsetof(SG_Tutorial_C_IsFirstStart, Param_bIsFirstStart) == 0x000000, "Member 'SG_Tutorial_C_IsFirstStart::Param_bIsFirstStart' has a wrong offset!");

// Function SG_Tutorial.SG_Tutorial_C.SetCompleted
// 0x0001 (0x0001 - 0x0000)
struct SG_Tutorial_C_SetCompleted final
{
public:
	bool                                          Completed;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SG_Tutorial_C_SetCompleted) == 0x000001, "Wrong alignment on SG_Tutorial_C_SetCompleted");
static_assert(sizeof(SG_Tutorial_C_SetCompleted) == 0x000001, "Wrong size on SG_Tutorial_C_SetCompleted");
static_assert(offsetof(SG_Tutorial_C_SetCompleted, Completed) == 0x000000, "Member 'SG_Tutorial_C_SetCompleted::Completed' has a wrong offset!");

// Function SG_Tutorial.SG_Tutorial_C.SetFirstStart
// 0x0001 (0x0001 - 0x0000)
struct SG_Tutorial_C_SetFirstStart final
{
public:
	bool                                          Param_IsFirstStart;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SG_Tutorial_C_SetFirstStart) == 0x000001, "Wrong alignment on SG_Tutorial_C_SetFirstStart");
static_assert(sizeof(SG_Tutorial_C_SetFirstStart) == 0x000001, "Wrong size on SG_Tutorial_C_SetFirstStart");
static_assert(offsetof(SG_Tutorial_C_SetFirstStart, Param_IsFirstStart) == 0x000000, "Member 'SG_Tutorial_C_SetFirstStart::Param_IsFirstStart' has a wrong offset!");

// Function SG_Tutorial.SG_Tutorial_C.SetStashTutorialCompited
// 0x0001 (0x0001 - 0x0000)
struct SG_Tutorial_C_SetStashTutorialCompited final
{
public:
	bool                                          Done;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SG_Tutorial_C_SetStashTutorialCompited) == 0x000001, "Wrong alignment on SG_Tutorial_C_SetStashTutorialCompited");
static_assert(sizeof(SG_Tutorial_C_SetStashTutorialCompited) == 0x000001, "Wrong size on SG_Tutorial_C_SetStashTutorialCompited");
static_assert(offsetof(SG_Tutorial_C_SetStashTutorialCompited, Done) == 0x000000, "Member 'SG_Tutorial_C_SetStashTutorialCompited::Done' has a wrong offset!");

}

