#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SGInventoryWorker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "InventoryWorker_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass SGInventoryWorker.SGInventoryWorker_C
// 0x0038 (0x0150 - 0x0118)
class USGInventoryWorker_C final : public UInventoryWorker_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_SGInventoryWorker_C;                // 0x0118(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          TutorialPlayer;                                    // 0x0120(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TempLoad;                                          // 0x0121(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BCustomFetcher;                                    // 0x0122(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_123[0x5];                                      // 0x0123(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              ServTime;                                          // 0x0128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              ServTimeP;                                         // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             TimeReady;                                         // 0x0138(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bRealTimeGet;                                      // 0x0148(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BEditorFetch;                                      // 0x0149(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddGuideItems(bool* Result);
	void ExecuteUbergraph_SGInventoryWorker(int32 EntryPoint);
	void FetchCustom();
	void FetchInventory();
	void IsSGStashExist(bool* Exist);
	void PastServerTimeLocal(const struct FDateTime& TimeP);
	void PushInventory(class UTDBJsonObject* Json, const TArray<class FString>& StrAr);
	void RealServerTime();
	void RealServerTimeLocal(const struct FDateTime& Time);
	void RealServerTimeServ();
	void ReceiveBeginPlay();
	void ServTimeUpload();
	void StashPlayerInventory(TArray<class FString>* Param_Arr);
	void TimeCashReady_(bool* Rdy_);
	void TimeReady__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SGInventoryWorker_C">();
	}
	static class USGInventoryWorker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USGInventoryWorker_C>();
	}
};
static_assert(alignof(USGInventoryWorker_C) == 0x000008, "Wrong alignment on USGInventoryWorker_C");
static_assert(sizeof(USGInventoryWorker_C) == 0x000150, "Wrong size on USGInventoryWorker_C");
static_assert(offsetof(USGInventoryWorker_C, UberGraphFrame_SGInventoryWorker_C) == 0x000118, "Member 'USGInventoryWorker_C::UberGraphFrame_SGInventoryWorker_C' has a wrong offset!");
static_assert(offsetof(USGInventoryWorker_C, TutorialPlayer) == 0x000120, "Member 'USGInventoryWorker_C::TutorialPlayer' has a wrong offset!");
static_assert(offsetof(USGInventoryWorker_C, TempLoad) == 0x000121, "Member 'USGInventoryWorker_C::TempLoad' has a wrong offset!");
static_assert(offsetof(USGInventoryWorker_C, BCustomFetcher) == 0x000122, "Member 'USGInventoryWorker_C::BCustomFetcher' has a wrong offset!");
static_assert(offsetof(USGInventoryWorker_C, ServTime) == 0x000128, "Member 'USGInventoryWorker_C::ServTime' has a wrong offset!");
static_assert(offsetof(USGInventoryWorker_C, ServTimeP) == 0x000130, "Member 'USGInventoryWorker_C::ServTimeP' has a wrong offset!");
static_assert(offsetof(USGInventoryWorker_C, TimeReady) == 0x000138, "Member 'USGInventoryWorker_C::TimeReady' has a wrong offset!");
static_assert(offsetof(USGInventoryWorker_C, bRealTimeGet) == 0x000148, "Member 'USGInventoryWorker_C::bRealTimeGet' has a wrong offset!");
static_assert(offsetof(USGInventoryWorker_C, BEditorFetch) == 0x000149, "Member 'USGInventoryWorker_C::BEditorFetch' has a wrong offset!");

}

