#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShopShake

#include "Basic.hpp"


namespace SDK::Params
{

// Function ShopShake.ShopShake_C.ExecuteUbergraph_ShopShake
// 0x0008 (0x0008 - 0x0000)
struct ShopShake_C_ExecuteUbergraph_ShopShake final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Scale;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShopShake_C_ExecuteUbergraph_ShopShake) == 0x000004, "Wrong alignment on ShopShake_C_ExecuteUbergraph_ShopShake");
static_assert(sizeof(ShopShake_C_ExecuteUbergraph_ShopShake) == 0x000008, "Wrong size on ShopShake_C_ExecuteUbergraph_ShopShake");
static_assert(offsetof(ShopShake_C_ExecuteUbergraph_ShopShake, EntryPoint) == 0x000000, "Member 'ShopShake_C_ExecuteUbergraph_ShopShake::EntryPoint' has a wrong offset!");
static_assert(offsetof(ShopShake_C_ExecuteUbergraph_ShopShake, K2Node_Event_Scale) == 0x000004, "Member 'ShopShake_C_ExecuteUbergraph_ShopShake::K2Node_Event_Scale' has a wrong offset!");

// Function ShopShake.ShopShake_C.ReceivePlayShake_2
// 0x0004 (0x0004 - 0x0000)
struct ShopShake_C_ReceivePlayShake_2 final
{
public:
	float                                         Scale;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShopShake_C_ReceivePlayShake_2) == 0x000004, "Wrong alignment on ShopShake_C_ReceivePlayShake_2");
static_assert(sizeof(ShopShake_C_ReceivePlayShake_2) == 0x000004, "Wrong size on ShopShake_C_ReceivePlayShake_2");
static_assert(offsetof(ShopShake_C_ReceivePlayShake_2, Scale) == 0x000000, "Member 'ShopShake_C_ReceivePlayShake_2::Scale' has a wrong offset!");

}

