#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SimpleQuestWithHighlightActors

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "QuestV2_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SimpleQuestWithHighlightActors.SimpleQuestWithHighlightActors_C
// 0x0028 (0x00B0 - 0x0088)
class USimpleQuestWithHighlightActors_C final : public UQuestV2_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0088(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FString                                 Tag;                                               // 0x0090(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<TScriptInterface<class II_Highlightable_C>> Highlightables;                                    // 0x00A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_SimpleQuestWithHighlightActors(int32 EntryPoint);
	void Initialize(const struct FQuestData& Data);
	void QuestActivated();
	void QuestDeactivated();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SimpleQuestWithHighlightActors_C">();
	}
	static class USimpleQuestWithHighlightActors_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimpleQuestWithHighlightActors_C>();
	}
};
static_assert(alignof(USimpleQuestWithHighlightActors_C) == 0x000008, "Wrong alignment on USimpleQuestWithHighlightActors_C");
static_assert(sizeof(USimpleQuestWithHighlightActors_C) == 0x0000B0, "Wrong size on USimpleQuestWithHighlightActors_C");
static_assert(offsetof(USimpleQuestWithHighlightActors_C, UberGraphFrame) == 0x000088, "Member 'USimpleQuestWithHighlightActors_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USimpleQuestWithHighlightActors_C, Tag) == 0x000090, "Member 'USimpleQuestWithHighlightActors_C::Tag' has a wrong offset!");
static_assert(offsetof(USimpleQuestWithHighlightActors_C, Highlightables) == 0x0000A0, "Member 'USimpleQuestWithHighlightActors_C::Highlightables' has a wrong offset!");

}

