#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SkylightModifier

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SkylightModifier.SkylightModifier_C
// 0x0028 (0x02B8 - 0x0290)
class ASkylightModifier_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AUltra_Dynamic_Sky_C*                   UDSky;                                             // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        SkyLightOffset;                                    // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Scattering;                                        // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__SkylightModifier_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__SkylightModifier_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void ExecuteUbergraph_SkylightModifier(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SkylightModifier_C">();
	}
	static class ASkylightModifier_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASkylightModifier_C>();
	}
};
static_assert(alignof(ASkylightModifier_C) == 0x000008, "Wrong alignment on ASkylightModifier_C");
static_assert(sizeof(ASkylightModifier_C) == 0x0002B8, "Wrong size on ASkylightModifier_C");
static_assert(offsetof(ASkylightModifier_C, UberGraphFrame) == 0x000290, "Member 'ASkylightModifier_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ASkylightModifier_C, Box) == 0x000298, "Member 'ASkylightModifier_C::Box' has a wrong offset!");
static_assert(offsetof(ASkylightModifier_C, UDSky) == 0x0002A0, "Member 'ASkylightModifier_C::UDSky' has a wrong offset!");
static_assert(offsetof(ASkylightModifier_C, SkyLightOffset) == 0x0002A8, "Member 'ASkylightModifier_C::SkyLightOffset' has a wrong offset!");
static_assert(offsetof(ASkylightModifier_C, Scattering) == 0x0002B0, "Member 'ASkylightModifier_C::Scattering' has a wrong offset!");

}

