#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpawnManagerChild

#include "Basic.hpp"

#include "E_AIType_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_SpawnGroup_structs.hpp"


namespace SDK::Params
{

// Function SpawnManagerChild.SpawnManagerChild_C.CheckNearPlayers
// 0x0018 (0x0018 - 0x0000)
struct SpawnManagerChild_C_CheckNearPlayers final
{
public:
	struct FVector                                Param_SpawnLocation;                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpawnManagerChild_C_CheckNearPlayers) == 0x000008, "Wrong alignment on SpawnManagerChild_C_CheckNearPlayers");
static_assert(sizeof(SpawnManagerChild_C_CheckNearPlayers) == 0x000018, "Wrong size on SpawnManagerChild_C_CheckNearPlayers");
static_assert(offsetof(SpawnManagerChild_C_CheckNearPlayers, Param_SpawnLocation) == 0x000000, "Member 'SpawnManagerChild_C_CheckNearPlayers::Param_SpawnLocation' has a wrong offset!");

// Function SpawnManagerChild.SpawnManagerChild_C.SetGroupSize
// 0x0004 (0x0004 - 0x0000)
struct SpawnManagerChild_C_SetGroupSize final
{
public:
	E_SpawnGroup                                  GroupType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_AIType                                      Param_AIType;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_AIType                                      AIT;                                               // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_SpawnGroup                                  GroupT;                                            // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpawnManagerChild_C_SetGroupSize) == 0x000001, "Wrong alignment on SpawnManagerChild_C_SetGroupSize");
static_assert(sizeof(SpawnManagerChild_C_SetGroupSize) == 0x000004, "Wrong size on SpawnManagerChild_C_SetGroupSize");
static_assert(offsetof(SpawnManagerChild_C_SetGroupSize, GroupType) == 0x000000, "Member 'SpawnManagerChild_C_SetGroupSize::GroupType' has a wrong offset!");
static_assert(offsetof(SpawnManagerChild_C_SetGroupSize, Param_AIType) == 0x000001, "Member 'SpawnManagerChild_C_SetGroupSize::Param_AIType' has a wrong offset!");
static_assert(offsetof(SpawnManagerChild_C_SetGroupSize, AIT) == 0x000002, "Member 'SpawnManagerChild_C_SetGroupSize::AIT' has a wrong offset!");
static_assert(offsetof(SpawnManagerChild_C_SetGroupSize, GroupT) == 0x000003, "Member 'SpawnManagerChild_C_SetGroupSize::GroupT' has a wrong offset!");

}

