#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Sportcar_SkeletalMesh_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "FGearPlugin_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Sportcar_SkeletalMesh_Skeleton_AnimBlueprint.Sportcar_SkeletalMesh_Skeleton_AnimBlueprint_C
// 0x0C70 (0x0FD0 - 0x0360)
class USportcar_SkeletalMesh_Skeleton_AnimBlueprint_C final : public UFGearAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0368(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0370(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0378(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x0398(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x04C0(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x05E8(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0710(0x0128)()
	struct FAnimNode_MeshSpaceRefPose             AnimGraphNode_MeshRefPose;                         // 0x0838(0x0010)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x0848(0x0048)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0890(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x08B0(0x0108)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x09B8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x09E0(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x0A08(0x00E0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0AE8(0x0048)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_1;                            // 0x0B30(0x0250)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt;                              // 0x0D80(0x0250)()

public:
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Sportcar_SkeletalMesh_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_2F92832A4E56F68175588BA71BE060E8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Sportcar_SkeletalMesh_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_48C1725A42F39A5E226FAC9F3152E632();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Sportcar_SkeletalMesh_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_5F699D4F4BE825A8E41DCB84DC6AD5FB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Sportcar_SkeletalMesh_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_AE70E7CA45D18AAB1F6375B6DB0BF0C5();
	void ExecuteUbergraph_Sportcar_SkeletalMesh_Skeleton_AnimBlueprint(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Sportcar_SkeletalMesh_Skeleton_AnimBlueprint_C">();
	}
	static class USportcar_SkeletalMesh_Skeleton_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USportcar_SkeletalMesh_Skeleton_AnimBlueprint_C>();
	}
};
static_assert(alignof(USportcar_SkeletalMesh_Skeleton_AnimBlueprint_C) == 0x000010, "Wrong alignment on USportcar_SkeletalMesh_Skeleton_AnimBlueprint_C");
static_assert(sizeof(USportcar_SkeletalMesh_Skeleton_AnimBlueprint_C) == 0x000FD0, "Wrong size on USportcar_SkeletalMesh_Skeleton_AnimBlueprint_C");
static_assert(offsetof(USportcar_SkeletalMesh_Skeleton_AnimBlueprint_C, UberGraphFrame) == 0x000360, "Member 'USportcar_SkeletalMesh_Skeleton_AnimBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USportcar_SkeletalMesh_Skeleton_AnimBlueprint_C, AnimBlueprintExtension_PropertyAccess) == 0x000368, "Member 'USportcar_SkeletalMesh_Skeleton_AnimBlueprint_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(USportcar_SkeletalMesh_Skeleton_AnimBlueprint_C, AnimBlueprintExtension_Base) == 0x000370, "Member 'USportcar_SkeletalMesh_Skeleton_AnimBlueprint_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(USportcar_SkeletalMesh_Skeleton_AnimBlueprint_C, AnimGraphNode_Root) == 0x000378, "Member 'USportcar_SkeletalMesh_Skeleton_AnimBlueprint_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(USportcar_SkeletalMesh_Skeleton_AnimBlueprint_C, AnimGraphNode_ModifyBone_3) == 0x000398, "Member 'USportcar_SkeletalMesh_Skeleton_AnimBlueprint_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(USportcar_SkeletalMesh_Skeleton_AnimBlueprint_C, AnimGraphNode_ModifyBone_2) == 0x0004C0, "Member 'USportcar_SkeletalMesh_Skeleton_AnimBlueprint_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(USportcar_SkeletalMesh_Skeleton_AnimBlueprint_C, AnimGraphNode_ModifyBone_1) == 0x0005E8, "Member 'USportcar_SkeletalMesh_Skeleton_AnimBlueprint_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(USportcar_SkeletalMesh_Skeleton_AnimBlueprint_C, AnimGraphNode_ModifyBone) == 0x000710, "Member 'USportcar_SkeletalMesh_Skeleton_AnimBlueprint_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(USportcar_SkeletalMesh_Skeleton_AnimBlueprint_C, AnimGraphNode_MeshRefPose) == 0x000838, "Member 'USportcar_SkeletalMesh_Skeleton_AnimBlueprint_C::AnimGraphNode_MeshRefPose' has a wrong offset!");
static_assert(offsetof(USportcar_SkeletalMesh_Skeleton_AnimBlueprint_C, AnimGraphNode_Slot_1) == 0x000848, "Member 'USportcar_SkeletalMesh_Skeleton_AnimBlueprint_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(USportcar_SkeletalMesh_Skeleton_AnimBlueprint_C, AnimGraphNode_ComponentToLocalSpace) == 0x000890, "Member 'USportcar_SkeletalMesh_Skeleton_AnimBlueprint_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(USportcar_SkeletalMesh_Skeleton_AnimBlueprint_C, AnimGraphNode_SaveCachedPose) == 0x0008B0, "Member 'USportcar_SkeletalMesh_Skeleton_AnimBlueprint_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(USportcar_SkeletalMesh_Skeleton_AnimBlueprint_C, AnimGraphNode_UseCachedPose_1) == 0x0009B8, "Member 'USportcar_SkeletalMesh_Skeleton_AnimBlueprint_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(USportcar_SkeletalMesh_Skeleton_AnimBlueprint_C, AnimGraphNode_UseCachedPose) == 0x0009E0, "Member 'USportcar_SkeletalMesh_Skeleton_AnimBlueprint_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(USportcar_SkeletalMesh_Skeleton_AnimBlueprint_C, AnimGraphNode_LayeredBoneBlend) == 0x000A08, "Member 'USportcar_SkeletalMesh_Skeleton_AnimBlueprint_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(USportcar_SkeletalMesh_Skeleton_AnimBlueprint_C, AnimGraphNode_Slot) == 0x000AE8, "Member 'USportcar_SkeletalMesh_Skeleton_AnimBlueprint_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(USportcar_SkeletalMesh_Skeleton_AnimBlueprint_C, AnimGraphNode_LookAt_1) == 0x000B30, "Member 'USportcar_SkeletalMesh_Skeleton_AnimBlueprint_C::AnimGraphNode_LookAt_1' has a wrong offset!");
static_assert(offsetof(USportcar_SkeletalMesh_Skeleton_AnimBlueprint_C, AnimGraphNode_LookAt) == 0x000D80, "Member 'USportcar_SkeletalMesh_Skeleton_AnimBlueprint_C::AnimGraphNode_LookAt' has a wrong offset!");

}

