#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Square_lamp_Blueprint

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Square_lamp_Blueprint.Square_lamp_Blueprint_C.ExecuteUbergraph_Square_lamp_Blueprint
// 0x0014 (0x0014 - 0x0000)
struct Square_lamp_Blueprint_C_ExecuteUbergraph_Square_lamp_Blueprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_CustomEvent_Color;                          // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Square_lamp_Blueprint_C_ExecuteUbergraph_Square_lamp_Blueprint) == 0x000004, "Wrong alignment on Square_lamp_Blueprint_C_ExecuteUbergraph_Square_lamp_Blueprint");
static_assert(sizeof(Square_lamp_Blueprint_C_ExecuteUbergraph_Square_lamp_Blueprint) == 0x000014, "Wrong size on Square_lamp_Blueprint_C_ExecuteUbergraph_Square_lamp_Blueprint");
static_assert(offsetof(Square_lamp_Blueprint_C_ExecuteUbergraph_Square_lamp_Blueprint, EntryPoint) == 0x000000, "Member 'Square_lamp_Blueprint_C_ExecuteUbergraph_Square_lamp_Blueprint::EntryPoint' has a wrong offset!");
static_assert(offsetof(Square_lamp_Blueprint_C_ExecuteUbergraph_Square_lamp_Blueprint, K2Node_CustomEvent_Color) == 0x000004, "Member 'Square_lamp_Blueprint_C_ExecuteUbergraph_Square_lamp_Blueprint::K2Node_CustomEvent_Color' has a wrong offset!");

// Function Square_lamp_Blueprint.Square_lamp_Blueprint_C.SetLightColor
// 0x0010 (0x0010 - 0x0000)
struct Square_lamp_Blueprint_C_SetLightColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Square_lamp_Blueprint_C_SetLightColor) == 0x000004, "Wrong alignment on Square_lamp_Blueprint_C_SetLightColor");
static_assert(sizeof(Square_lamp_Blueprint_C_SetLightColor) == 0x000010, "Wrong size on Square_lamp_Blueprint_C_SetLightColor");
static_assert(offsetof(Square_lamp_Blueprint_C_SetLightColor, Color) == 0x000000, "Member 'Square_lamp_Blueprint_C_SetLightColor::Color' has a wrong offset!");

}

