#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_WeaponMaxValue

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct ST_WeaponMaxValue.ST_WeaponMaxValue
// 0x0020 (0x0020 - 0x0000)
struct FST_WeaponMaxValue final
{
public:
	double                                        Power_8_928EBA39408F8EC22731F7A8B6F7D1B5;          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        EffectiveRange_9_2230E40A4B1EF7F57AC341931051DFC2; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Stability_10_609562294DAEE739C9F616B0FD2E96BA;     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FiringRate_11_8F5090AE4F77D1C8950AC3B17A820792;    // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FST_WeaponMaxValue) == 0x000008, "Wrong alignment on FST_WeaponMaxValue");
static_assert(sizeof(FST_WeaponMaxValue) == 0x000020, "Wrong size on FST_WeaponMaxValue");
static_assert(offsetof(FST_WeaponMaxValue, Power_8_928EBA39408F8EC22731F7A8B6F7D1B5) == 0x000000, "Member 'FST_WeaponMaxValue::Power_8_928EBA39408F8EC22731F7A8B6F7D1B5' has a wrong offset!");
static_assert(offsetof(FST_WeaponMaxValue, EffectiveRange_9_2230E40A4B1EF7F57AC341931051DFC2) == 0x000008, "Member 'FST_WeaponMaxValue::EffectiveRange_9_2230E40A4B1EF7F57AC341931051DFC2' has a wrong offset!");
static_assert(offsetof(FST_WeaponMaxValue, Stability_10_609562294DAEE739C9F616B0FD2E96BA) == 0x000010, "Member 'FST_WeaponMaxValue::Stability_10_609562294DAEE739C9F616B0FD2E96BA' has a wrong offset!");
static_assert(offsetof(FST_WeaponMaxValue, FiringRate_11_8F5090AE4F77D1C8950AC3B17A820792) == 0x000018, "Member 'FST_WeaponMaxValue::FiringRate_11_8F5090AE4F77D1C8950AC3B17A820792' has a wrong offset!");

}

