#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StartQuestAction

#include "Basic.hpp"

#include "AGSGraphRuntime_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass StartQuestAction.StartQuestAction_C
// 0x0018 (0x0048 - 0x0030)
class UStartQuestAction_C final : public UAGSAction
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0030(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UQuest*                                 Quest;                                             // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Questgiver;                                        // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteAction(class APlayerController* PlayerController, class UAGSGraphNode* NodeOwner);
	void ExecuteUbergraph_StartQuestAction(int32 EntryPoint);
	void StartEvent(class UObject* Object);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"StartQuestAction_C">();
	}
	static class UStartQuestAction_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStartQuestAction_C>();
	}
};
static_assert(alignof(UStartQuestAction_C) == 0x000008, "Wrong alignment on UStartQuestAction_C");
static_assert(sizeof(UStartQuestAction_C) == 0x000048, "Wrong size on UStartQuestAction_C");
static_assert(offsetof(UStartQuestAction_C, UberGraphFrame) == 0x000030, "Member 'UStartQuestAction_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UStartQuestAction_C, Quest) == 0x000038, "Member 'UStartQuestAction_C::Quest' has a wrong offset!");
static_assert(offsetof(UStartQuestAction_C, Questgiver) == 0x000040, "Member 'UStartQuestAction_C::Questgiver' has a wrong offset!");

}

