#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StatsStruct

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct StatsStruct.StatsStruct
// 0x0040 (0x0040 - 0x0000)
struct FStatsStruct final
{
public:
	int32                                         SurvivingTimeSeconds_4_4FDFC31B40E1003FFE1FB7988A8C1AEC; // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PlayersKilled_6_953670B446DEEC33FB1B32B66EC2EAE9;  // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ZombiesKilled_8_2574650E4D7F3F7E10DE78999D002842;  // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DamageDealt_27_763FA48F4FCA170BD429988FDEA232D1;   // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DamageTaken_28_6EA8BCC24778E104C634FA90647CFBFF;   // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LongestHeadshot_29_5777EDA44719C18939A506812854E376; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Accuracy_17_3215E800444F1AA261E3DA95888E3FA4;      // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         WalkedDistance_20_472D93EC4D0AB88DCE5D07ACED8C4DFB; // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MedsUsed_22_D68EAE934FECDBA7CB469E99E69E6F55;      // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DrinksUsed_24_23866E1A4B32B05D643012A1A8A3ECFB;    // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FoodUsed_26_13322EFF49B9ED3FB11003B87D119BBB;      // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FStatsStruct) == 0x000008, "Wrong alignment on FStatsStruct");
static_assert(sizeof(FStatsStruct) == 0x000040, "Wrong size on FStatsStruct");
static_assert(offsetof(FStatsStruct, SurvivingTimeSeconds_4_4FDFC31B40E1003FFE1FB7988A8C1AEC) == 0x000000, "Member 'FStatsStruct::SurvivingTimeSeconds_4_4FDFC31B40E1003FFE1FB7988A8C1AEC' has a wrong offset!");
static_assert(offsetof(FStatsStruct, PlayersKilled_6_953670B446DEEC33FB1B32B66EC2EAE9) == 0x000004, "Member 'FStatsStruct::PlayersKilled_6_953670B446DEEC33FB1B32B66EC2EAE9' has a wrong offset!");
static_assert(offsetof(FStatsStruct, ZombiesKilled_8_2574650E4D7F3F7E10DE78999D002842) == 0x000008, "Member 'FStatsStruct::ZombiesKilled_8_2574650E4D7F3F7E10DE78999D002842' has a wrong offset!");
static_assert(offsetof(FStatsStruct, DamageDealt_27_763FA48F4FCA170BD429988FDEA232D1) == 0x000010, "Member 'FStatsStruct::DamageDealt_27_763FA48F4FCA170BD429988FDEA232D1' has a wrong offset!");
static_assert(offsetof(FStatsStruct, DamageTaken_28_6EA8BCC24778E104C634FA90647CFBFF) == 0x000018, "Member 'FStatsStruct::DamageTaken_28_6EA8BCC24778E104C634FA90647CFBFF' has a wrong offset!");
static_assert(offsetof(FStatsStruct, LongestHeadshot_29_5777EDA44719C18939A506812854E376) == 0x000020, "Member 'FStatsStruct::LongestHeadshot_29_5777EDA44719C18939A506812854E376' has a wrong offset!");
static_assert(offsetof(FStatsStruct, Accuracy_17_3215E800444F1AA261E3DA95888E3FA4) == 0x000028, "Member 'FStatsStruct::Accuracy_17_3215E800444F1AA261E3DA95888E3FA4' has a wrong offset!");
static_assert(offsetof(FStatsStruct, WalkedDistance_20_472D93EC4D0AB88DCE5D07ACED8C4DFB) == 0x000030, "Member 'FStatsStruct::WalkedDistance_20_472D93EC4D0AB88DCE5D07ACED8C4DFB' has a wrong offset!");
static_assert(offsetof(FStatsStruct, MedsUsed_22_D68EAE934FECDBA7CB469E99E69E6F55) == 0x000034, "Member 'FStatsStruct::MedsUsed_22_D68EAE934FECDBA7CB469E99E69E6F55' has a wrong offset!");
static_assert(offsetof(FStatsStruct, DrinksUsed_24_23866E1A4B32B05D643012A1A8A3ECFB) == 0x000038, "Member 'FStatsStruct::DrinksUsed_24_23866E1A4B32B05D643012A1A8A3ECFB' has a wrong offset!");
static_assert(offsetof(FStatsStruct, FoodUsed_26_13322EFF49B9ED3FB11003B87D119BBB) == 0x00003C, "Member 'FStatsStruct::FoodUsed_26_13322EFF49B9ED3FB11003B87D119BBB' has a wrong offset!");

}

