#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Step_Notif

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Step_Notif.Step_Notif_C.PlayNotif
// 0x0028 (0x0028 - 0x0000)
struct Step_Notif_C_PlayNotif final
{
public:
	class USkeletalMeshComponent*                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_Steps_C>            K2Node_DynamicCast_AsI_Steps;                      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Step_Notif_C_PlayNotif) == 0x000008, "Wrong alignment on Step_Notif_C_PlayNotif");
static_assert(sizeof(Step_Notif_C_PlayNotif) == 0x000028, "Wrong size on Step_Notif_C_PlayNotif");
static_assert(offsetof(Step_Notif_C_PlayNotif, Target) == 0x000000, "Member 'Step_Notif_C_PlayNotif::Target' has a wrong offset!");
static_assert(offsetof(Step_Notif_C_PlayNotif, CallFunc_GetAnimInstance_ReturnValue) == 0x000008, "Member 'Step_Notif_C_PlayNotif::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Step_Notif_C_PlayNotif, K2Node_DynamicCast_AsI_Steps) == 0x000010, "Member 'Step_Notif_C_PlayNotif::K2Node_DynamicCast_AsI_Steps' has a wrong offset!");
static_assert(offsetof(Step_Notif_C_PlayNotif, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'Step_Notif_C_PlayNotif::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function Step_Notif.Step_Notif_C.Received_Notify
// 0x0040 (0x0040 - 0x0000)
struct Step_Notif_C_Received_Notify final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimNotifyEventReference              EventReference;                                    // 0x0010(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Step_Notif_C_Received_Notify) == 0x000008, "Wrong alignment on Step_Notif_C_Received_Notify");
static_assert(sizeof(Step_Notif_C_Received_Notify) == 0x000040, "Wrong size on Step_Notif_C_Received_Notify");
static_assert(offsetof(Step_Notif_C_Received_Notify, MeshComp) == 0x000000, "Member 'Step_Notif_C_Received_Notify::MeshComp' has a wrong offset!");
static_assert(offsetof(Step_Notif_C_Received_Notify, Animation) == 0x000008, "Member 'Step_Notif_C_Received_Notify::Animation' has a wrong offset!");
static_assert(offsetof(Step_Notif_C_Received_Notify, EventReference) == 0x000010, "Member 'Step_Notif_C_Received_Notify::EventReference' has a wrong offset!");
static_assert(offsetof(Step_Notif_C_Received_Notify, ReturnValue) == 0x000038, "Member 'Step_Notif_C_Received_Notify::ReturnValue' has a wrong offset!");

}

