#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StreamingLevelEventHandler

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass StreamingLevelEventHandler.StreamingLevelEventHandler_C
// 0x0038 (0x0060 - 0x0028)
class UStreamingLevelEventHandler_C final : public UObject
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0028(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	FMulticastInlineDelegateProperty_             OnLevelLoaded;                                     // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnLevelUnloaded;                                   // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FName                                   LevelName;                                         // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class ULevelStreaming*                        StreamedLevel;                                     // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_StreamingLevelEventHandler(int32 EntryPoint);
	void Init();
	void OnLevelLoaded__DelegateSignature(class FName Param_Name);
	void OnLevelUnloaded__DelegateSignature(class FName Param_Name);
	void OnLoaded();
	void OnUnloaded();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"StreamingLevelEventHandler_C">();
	}
	static class UStreamingLevelEventHandler_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStreamingLevelEventHandler_C>();
	}
};
static_assert(alignof(UStreamingLevelEventHandler_C) == 0x000008, "Wrong alignment on UStreamingLevelEventHandler_C");
static_assert(sizeof(UStreamingLevelEventHandler_C) == 0x000060, "Wrong size on UStreamingLevelEventHandler_C");
static_assert(offsetof(UStreamingLevelEventHandler_C, UberGraphFrame) == 0x000028, "Member 'UStreamingLevelEventHandler_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UStreamingLevelEventHandler_C, OnLevelLoaded) == 0x000030, "Member 'UStreamingLevelEventHandler_C::OnLevelLoaded' has a wrong offset!");
static_assert(offsetof(UStreamingLevelEventHandler_C, OnLevelUnloaded) == 0x000040, "Member 'UStreamingLevelEventHandler_C::OnLevelUnloaded' has a wrong offset!");
static_assert(offsetof(UStreamingLevelEventHandler_C, LevelName) == 0x000050, "Member 'UStreamingLevelEventHandler_C::LevelName' has a wrong offset!");
static_assert(offsetof(UStreamingLevelEventHandler_C, StreamedLevel) == 0x000058, "Member 'UStreamingLevelEventHandler_C::StreamedLevel' has a wrong offset!");

}

