#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StreamingLevelEventHandler

#include "Basic.hpp"


namespace SDK::Params
{

// Function StreamingLevelEventHandler.StreamingLevelEventHandler_C.ExecuteUbergraph_StreamingLevelEventHandler
// 0x0024 (0x0024 - 0x0000)
struct StreamingLevelEventHandler_C_ExecuteUbergraph_StreamingLevelEventHandler final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StreamingLevelEventHandler_C_ExecuteUbergraph_StreamingLevelEventHandler) == 0x000004, "Wrong alignment on StreamingLevelEventHandler_C_ExecuteUbergraph_StreamingLevelEventHandler");
static_assert(sizeof(StreamingLevelEventHandler_C_ExecuteUbergraph_StreamingLevelEventHandler) == 0x000024, "Wrong size on StreamingLevelEventHandler_C_ExecuteUbergraph_StreamingLevelEventHandler");
static_assert(offsetof(StreamingLevelEventHandler_C_ExecuteUbergraph_StreamingLevelEventHandler, EntryPoint) == 0x000000, "Member 'StreamingLevelEventHandler_C_ExecuteUbergraph_StreamingLevelEventHandler::EntryPoint' has a wrong offset!");
static_assert(offsetof(StreamingLevelEventHandler_C_ExecuteUbergraph_StreamingLevelEventHandler, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'StreamingLevelEventHandler_C_ExecuteUbergraph_StreamingLevelEventHandler::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(StreamingLevelEventHandler_C_ExecuteUbergraph_StreamingLevelEventHandler, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'StreamingLevelEventHandler_C_ExecuteUbergraph_StreamingLevelEventHandler::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function StreamingLevelEventHandler.StreamingLevelEventHandler_C.OnLevelLoaded__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct StreamingLevelEventHandler_C_OnLevelLoaded__DelegateSignature final
{
public:
	class FName                                   Param_Name;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StreamingLevelEventHandler_C_OnLevelLoaded__DelegateSignature) == 0x000004, "Wrong alignment on StreamingLevelEventHandler_C_OnLevelLoaded__DelegateSignature");
static_assert(sizeof(StreamingLevelEventHandler_C_OnLevelLoaded__DelegateSignature) == 0x000008, "Wrong size on StreamingLevelEventHandler_C_OnLevelLoaded__DelegateSignature");
static_assert(offsetof(StreamingLevelEventHandler_C_OnLevelLoaded__DelegateSignature, Param_Name) == 0x000000, "Member 'StreamingLevelEventHandler_C_OnLevelLoaded__DelegateSignature::Param_Name' has a wrong offset!");

// Function StreamingLevelEventHandler.StreamingLevelEventHandler_C.OnLevelUnloaded__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct StreamingLevelEventHandler_C_OnLevelUnloaded__DelegateSignature final
{
public:
	class FName                                   Param_Name;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StreamingLevelEventHandler_C_OnLevelUnloaded__DelegateSignature) == 0x000004, "Wrong alignment on StreamingLevelEventHandler_C_OnLevelUnloaded__DelegateSignature");
static_assert(sizeof(StreamingLevelEventHandler_C_OnLevelUnloaded__DelegateSignature) == 0x000008, "Wrong size on StreamingLevelEventHandler_C_OnLevelUnloaded__DelegateSignature");
static_assert(offsetof(StreamingLevelEventHandler_C_OnLevelUnloaded__DelegateSignature, Param_Name) == 0x000000, "Member 'StreamingLevelEventHandler_C_OnLevelUnloaded__DelegateSignature::Param_Name' has a wrong offset!");

}

