#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Surv_Male_FullRig_Skeleton_CtrlRig1

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ControlRig_structs.hpp"
#include "ControlRig_classes.hpp"
#include "RigVM_structs.hpp"
#include "RigVM_classes.hpp"


namespace SDK
{

// ControlRigBlueprintGeneratedClass Surv_Male_FullRig_Skeleton_CtrlRig1.Surv_Male_FullRig_Skeleton_CtrlRig1_C
// 0x0028 (0x0420 - 0x03F8)
class USurv_Male_FullRig_Skeleton_CtrlRig1_C final : public UControlRig
{
public:
	struct FVector                                TargetLocation;                                    // 0x03F8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        IKWeight;                                          // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CurveName;                                         // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Surv_Male_FullRig_Skeleton_CtrlRig1_C">();
	}
	static class USurv_Male_FullRig_Skeleton_CtrlRig1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USurv_Male_FullRig_Skeleton_CtrlRig1_C>();
	}
};
static_assert(alignof(USurv_Male_FullRig_Skeleton_CtrlRig1_C) == 0x000008, "Wrong alignment on USurv_Male_FullRig_Skeleton_CtrlRig1_C");
static_assert(sizeof(USurv_Male_FullRig_Skeleton_CtrlRig1_C) == 0x000420, "Wrong size on USurv_Male_FullRig_Skeleton_CtrlRig1_C");
static_assert(offsetof(USurv_Male_FullRig_Skeleton_CtrlRig1_C, TargetLocation) == 0x0003F8, "Member 'USurv_Male_FullRig_Skeleton_CtrlRig1_C::TargetLocation' has a wrong offset!");
static_assert(offsetof(USurv_Male_FullRig_Skeleton_CtrlRig1_C, IKWeight) == 0x000410, "Member 'USurv_Male_FullRig_Skeleton_CtrlRig1_C::IKWeight' has a wrong offset!");
static_assert(offsetof(USurv_Male_FullRig_Skeleton_CtrlRig1_C, CurveName) == 0x000418, "Member 'USurv_Male_FullRig_Skeleton_CtrlRig1_C::CurveName' has a wrong offset!");

// RigVMMemoryStorageGeneratorClass Surv_Male_FullRig_Skeleton_CtrlRig1.RigVMMemory_Literal
// 0x04F8 (0x0520 - 0x0028)
class Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal final : public URigVMMemoryStorage
{
public:
	struct FRigElementKey                         RigVMModel___RigUnit_SetTransform_Item__Const;     // 0x0028(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          RigVMModel___RigUnit_SetTransform_Space__Const;    // 0x0034(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___RigUnit_SetTransform_bInitial__Const; // 0x0035(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36[0xA];                                       // 0x0036(0x000A)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_SetTransform_Value__Const;    // 0x0040(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___RigUnit_SetTransform_Weight__Const;   // 0x00A0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___RigUnit_SetTransform_bPropagateToChildren__Const; // 0x00A4(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___TwoBoneIKSimplePerItem_3_ItemA__Const; // 0x00A8(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___TwoBoneIKSimplePerItem_3_ItemB__Const; // 0x00B4(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___TwoBoneIKSimplePerItem_3_EffectorItem__Const; // 0x00C0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_3_Item__Const;   // 0x00CC(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___TwoBoneIKSimplePerItem_3_PrimaryAxis__Const; // 0x00D8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___TwoBoneIKSimplePerItem_3_SecondaryAxis__Const; // 0x00F0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_2_1_1_1_Item__Const;     // 0x0108(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EControlRigVectorKind                         RigVMModel___TwoBoneIKSimplePerItem_3_PoleVectorKind__Const; // 0x0114(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___TwoBoneIKSimplePerItem_3_PoleVectorSpace__Const; // 0x0118(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___TwoBoneIKSimplePerItem_3_StretchStartRatio__Const; // 0x0124(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___TwoBoneIKSimplePerItem_3_StretchMaximumRatio__Const; // 0x0128(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___TwoBoneIKSimplePerItem_3_ItemALength__Const; // 0x012C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigUnit_TwoBoneIKSimple_DebugSettings RigVMModel___TwoBoneIKSimplePerItem_3_DebugSettings__Const; // 0x0130(0x0070)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FRigUnit_AimItem_Target                RigVMModel___AimItem_Primary__Const;               // 0x01A0(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FRigUnit_AimItem_Target                RigVMModel___AimItem_Secondary__Const;             // 0x01E8(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FRigUnit_AimBone_DebugSettings         RigVMModel___AimItem_DebugSettings__Const;         // 0x0230(0x0070)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FRigElementKey                         RigVMModel___SetTransform_3_Item__Const;           // 0x02A0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___ProjectTransformToNewParent_2_OldParent__Const; // 0x02AC(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetTransform_3_1_Item__Const;         // 0x02B8(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_4_Item__Const;           // 0x02C4(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetTransform_1_1_2_Item__Const;       // 0x02D0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_1_1_2_Item__Const;       // 0x02DC(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetTransform_1_1_1_2_Item__Const;     // 0x02E8(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_1_1_1_2_Item__Const;     // 0x02F4(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetTransform_1_1_1_1_2_Item__Const;   // 0x0300(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_1_1_1_1_2_Item__Const;   // 0x030C(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetTransform_1_1_1_1_1_2_Item__Const; // 0x0318(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_1_1_1_1_1_2_Item__Const; // 0x0324(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetTransform_1_1_1_1_1_1_1_Item__Const; // 0x0330(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_1_1_1_1_1_1_1_Item__Const; // 0x033C(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetTransform_2_2_Item__Const;         // 0x0348(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_2_3_Item__Const;         // 0x0354(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetTransform_2_2_1_Item__Const;       // 0x0360(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetTransform_2_2_3_Item__Const;       // 0x036C(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_2_3_2_Item__Const;       // 0x0378(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetTransform_2_2_1_3_Item__Const;     // 0x0384(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_2_1_2_2_Item__Const;     // 0x0390(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetTransform_2_2_2_Item__Const;       // 0x039C(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_2_3_1_Item__Const;       // 0x03A8(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetTransform_2_2_1_1_Item__Const;     // 0x03B4(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_2_1_2_1_Item__Const;     // 0x03C0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetTransform_2_2_1_2_1_Item__Const;   // 0x03CC(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___ProjectTransformToNewParent_3_1_OldParent__Const; // 0x03D8(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetTransform_2_2_3_1_Item__Const;     // 0x03E4(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_2_3_2_1_Item__Const;     // 0x03F0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetTransform_2_2_1_3_1_Item__Const;   // 0x03FC(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_2_1_2_2_1_Item__Const;   // 0x0408(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_3_Item__Const;            // 0x0414(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___ProjectTransformToNewParent_1_1_OldParent__Const; // 0x0420(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetTransform_4_Item__Const;           // 0x042C(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetTransform_4_1_Item__Const;         // 0x0438(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___ProjectTransformToNewParent_4_1_OldParent__Const; // 0x0444(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetTransform_2_2_3_1_1_Item__Const;   // 0x0450(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_2_3_2_1_1_Item__Const;   // 0x045C(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetTransform_2_2_1_3_1_1_Item__Const; // 0x0468(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_2_1_2_2_1_1_Item__Const; // 0x0474(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_3_1_Item__Const;          // 0x0480(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___ProjectTransformToNewParent_1_1_1_OldParent__Const; // 0x048C(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetTransform_4_2_Item__Const;         // 0x0498(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetTransform_4_1_1_Item__Const;       // 0x04A4(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___ProjectTransformToNewParent_4_1_1_OldParent__Const; // 0x04B0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetTransform_2_2_3_1_1_1_Item__Const; // 0x04BC(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_2_3_2_1_1_1_Item__Const; // 0x04C8(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetTransform_2_2_1_3_1_1_1_Item__Const; // 0x04D4(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_2_1_2_2_1_1_1_Item__Const; // 0x04E0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetTransform_5_1_Item__Const;         // 0x04EC(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___NameConcat_1_B__Const;                // 0x04F8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigElementType                               RigVMModel___CollectionChildren_1_TypeToSearch__Const; // 0x0500(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_501[0x3];                                      // 0x0501(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   RigVMModel___CollectionReplaceItems_1_Old__Const;  // 0x0504(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___CollectionReplaceItems_1_New__Const;  // 0x050C(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RigVMMemoryStorageGeneratorClass Surv_Male_FullRig_Skeleton_CtrlRig1.RigVMMemory_Literal", true>();
	}
	static class Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal* GetDefaultObj()
	{
		return GetDefaultObjImpl<Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal>();
	}
};
static_assert(alignof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal) == 0x000010, "Wrong alignment on Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal");
static_assert(sizeof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal) == 0x000520, "Wrong size on Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___RigUnit_SetTransform_Item__Const) == 0x000028, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___RigUnit_SetTransform_Item__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___RigUnit_SetTransform_Space__Const) == 0x000034, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___RigUnit_SetTransform_Space__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___RigUnit_SetTransform_bInitial__Const) == 0x000035, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___RigUnit_SetTransform_bInitial__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___RigUnit_SetTransform_Value__Const) == 0x000040, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___RigUnit_SetTransform_Value__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___RigUnit_SetTransform_Weight__Const) == 0x0000A0, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___RigUnit_SetTransform_Weight__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___RigUnit_SetTransform_bPropagateToChildren__Const) == 0x0000A4, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___RigUnit_SetTransform_bPropagateToChildren__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___TwoBoneIKSimplePerItem_3_ItemA__Const) == 0x0000A8, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___TwoBoneIKSimplePerItem_3_ItemA__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___TwoBoneIKSimplePerItem_3_ItemB__Const) == 0x0000B4, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___TwoBoneIKSimplePerItem_3_ItemB__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___TwoBoneIKSimplePerItem_3_EffectorItem__Const) == 0x0000C0, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___TwoBoneIKSimplePerItem_3_EffectorItem__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___RigUnit_GetTransform_3_Item__Const) == 0x0000CC, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___RigUnit_GetTransform_3_Item__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___TwoBoneIKSimplePerItem_3_PrimaryAxis__Const) == 0x0000D8, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___TwoBoneIKSimplePerItem_3_PrimaryAxis__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___TwoBoneIKSimplePerItem_3_SecondaryAxis__Const) == 0x0000F0, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___TwoBoneIKSimplePerItem_3_SecondaryAxis__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___GetTransform_2_1_1_1_Item__Const) == 0x000108, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___GetTransform_2_1_1_1_Item__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___TwoBoneIKSimplePerItem_3_PoleVectorKind__Const) == 0x000114, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___TwoBoneIKSimplePerItem_3_PoleVectorKind__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___TwoBoneIKSimplePerItem_3_PoleVectorSpace__Const) == 0x000118, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___TwoBoneIKSimplePerItem_3_PoleVectorSpace__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___TwoBoneIKSimplePerItem_3_StretchStartRatio__Const) == 0x000124, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___TwoBoneIKSimplePerItem_3_StretchStartRatio__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___TwoBoneIKSimplePerItem_3_StretchMaximumRatio__Const) == 0x000128, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___TwoBoneIKSimplePerItem_3_StretchMaximumRatio__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___TwoBoneIKSimplePerItem_3_ItemALength__Const) == 0x00012C, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___TwoBoneIKSimplePerItem_3_ItemALength__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___TwoBoneIKSimplePerItem_3_DebugSettings__Const) == 0x000130, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___TwoBoneIKSimplePerItem_3_DebugSettings__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___AimItem_Primary__Const) == 0x0001A0, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___AimItem_Primary__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___AimItem_Secondary__Const) == 0x0001E8, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___AimItem_Secondary__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___AimItem_DebugSettings__Const) == 0x000230, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___AimItem_DebugSettings__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___SetTransform_3_Item__Const) == 0x0002A0, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___SetTransform_3_Item__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___ProjectTransformToNewParent_2_OldParent__Const) == 0x0002AC, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___ProjectTransformToNewParent_2_OldParent__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___SetTransform_3_1_Item__Const) == 0x0002B8, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___SetTransform_3_1_Item__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___GetTransform_4_Item__Const) == 0x0002C4, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___GetTransform_4_Item__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___SetTransform_1_1_2_Item__Const) == 0x0002D0, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___SetTransform_1_1_2_Item__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___GetTransform_1_1_2_Item__Const) == 0x0002DC, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___GetTransform_1_1_2_Item__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___SetTransform_1_1_1_2_Item__Const) == 0x0002E8, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___SetTransform_1_1_1_2_Item__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___GetTransform_1_1_1_2_Item__Const) == 0x0002F4, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___GetTransform_1_1_1_2_Item__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___SetTransform_1_1_1_1_2_Item__Const) == 0x000300, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___SetTransform_1_1_1_1_2_Item__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___GetTransform_1_1_1_1_2_Item__Const) == 0x00030C, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___GetTransform_1_1_1_1_2_Item__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___SetTransform_1_1_1_1_1_2_Item__Const) == 0x000318, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___SetTransform_1_1_1_1_1_2_Item__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___GetTransform_1_1_1_1_1_2_Item__Const) == 0x000324, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___GetTransform_1_1_1_1_1_2_Item__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___SetTransform_1_1_1_1_1_1_1_Item__Const) == 0x000330, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___SetTransform_1_1_1_1_1_1_1_Item__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___GetTransform_1_1_1_1_1_1_1_Item__Const) == 0x00033C, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___GetTransform_1_1_1_1_1_1_1_Item__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___SetTransform_2_2_Item__Const) == 0x000348, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___SetTransform_2_2_Item__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___GetTransform_2_3_Item__Const) == 0x000354, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___GetTransform_2_3_Item__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___SetTransform_2_2_1_Item__Const) == 0x000360, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___SetTransform_2_2_1_Item__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___SetTransform_2_2_3_Item__Const) == 0x00036C, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___SetTransform_2_2_3_Item__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___GetTransform_2_3_2_Item__Const) == 0x000378, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___GetTransform_2_3_2_Item__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___SetTransform_2_2_1_3_Item__Const) == 0x000384, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___SetTransform_2_2_1_3_Item__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___GetTransform_2_1_2_2_Item__Const) == 0x000390, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___GetTransform_2_1_2_2_Item__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___SetTransform_2_2_2_Item__Const) == 0x00039C, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___SetTransform_2_2_2_Item__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___GetTransform_2_3_1_Item__Const) == 0x0003A8, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___GetTransform_2_3_1_Item__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___SetTransform_2_2_1_1_Item__Const) == 0x0003B4, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___SetTransform_2_2_1_1_Item__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___GetTransform_2_1_2_1_Item__Const) == 0x0003C0, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___GetTransform_2_1_2_1_Item__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___SetTransform_2_2_1_2_1_Item__Const) == 0x0003CC, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___SetTransform_2_2_1_2_1_Item__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___ProjectTransformToNewParent_3_1_OldParent__Const) == 0x0003D8, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___ProjectTransformToNewParent_3_1_OldParent__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___SetTransform_2_2_3_1_Item__Const) == 0x0003E4, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___SetTransform_2_2_3_1_Item__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___GetTransform_2_3_2_1_Item__Const) == 0x0003F0, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___GetTransform_2_3_2_1_Item__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___SetTransform_2_2_1_3_1_Item__Const) == 0x0003FC, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___SetTransform_2_2_1_3_1_Item__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___GetTransform_2_1_2_2_1_Item__Const) == 0x000408, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___GetTransform_2_1_2_2_1_Item__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___SetRotation_3_Item__Const) == 0x000414, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___SetRotation_3_Item__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___ProjectTransformToNewParent_1_1_OldParent__Const) == 0x000420, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___ProjectTransformToNewParent_1_1_OldParent__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___SetTransform_4_Item__Const) == 0x00042C, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___SetTransform_4_Item__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___SetTransform_4_1_Item__Const) == 0x000438, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___SetTransform_4_1_Item__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___ProjectTransformToNewParent_4_1_OldParent__Const) == 0x000444, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___ProjectTransformToNewParent_4_1_OldParent__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___SetTransform_2_2_3_1_1_Item__Const) == 0x000450, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___SetTransform_2_2_3_1_1_Item__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___GetTransform_2_3_2_1_1_Item__Const) == 0x00045C, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___GetTransform_2_3_2_1_1_Item__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___SetTransform_2_2_1_3_1_1_Item__Const) == 0x000468, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___SetTransform_2_2_1_3_1_1_Item__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___GetTransform_2_1_2_2_1_1_Item__Const) == 0x000474, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___GetTransform_2_1_2_2_1_1_Item__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___SetRotation_3_1_Item__Const) == 0x000480, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___SetRotation_3_1_Item__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___ProjectTransformToNewParent_1_1_1_OldParent__Const) == 0x00048C, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___ProjectTransformToNewParent_1_1_1_OldParent__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___SetTransform_4_2_Item__Const) == 0x000498, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___SetTransform_4_2_Item__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___SetTransform_4_1_1_Item__Const) == 0x0004A4, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___SetTransform_4_1_1_Item__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___ProjectTransformToNewParent_4_1_1_OldParent__Const) == 0x0004B0, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___ProjectTransformToNewParent_4_1_1_OldParent__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___SetTransform_2_2_3_1_1_1_Item__Const) == 0x0004BC, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___SetTransform_2_2_3_1_1_1_Item__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___GetTransform_2_3_2_1_1_1_Item__Const) == 0x0004C8, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___GetTransform_2_3_2_1_1_1_Item__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___SetTransform_2_2_1_3_1_1_1_Item__Const) == 0x0004D4, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___SetTransform_2_2_1_3_1_1_1_Item__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___GetTransform_2_1_2_2_1_1_1_Item__Const) == 0x0004E0, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___GetTransform_2_1_2_2_1_1_1_Item__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___SetTransform_5_1_Item__Const) == 0x0004EC, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___SetTransform_5_1_Item__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___NameConcat_1_B__Const) == 0x0004F8, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___NameConcat_1_B__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___CollectionChildren_1_TypeToSearch__Const) == 0x000500, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___CollectionChildren_1_TypeToSearch__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___CollectionReplaceItems_1_Old__Const) == 0x000504, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___CollectionReplaceItems_1_Old__Const' has a wrong offset!");
static_assert(offsetof(Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal, RigVMModel___CollectionReplaceItems_1_New__Const) == 0x00050C, "Member 'Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Literal::RigVMModel___CollectionReplaceItems_1_New__Const' has a wrong offset!");

// RigVMMemoryStorageGeneratorClass Surv_Male_FullRig_Skeleton_CtrlRig1.RigVMMemory_Work
// 0x1328 (0x1350 - 0x0028)
class Surv_Male_FullRig_Skeleton_CtrlRig1::URigVMMemory_Work final : public URigVMMemoryStorage
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_SetTransform_Value__IO;       // 0x0030(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetTransform_CachedIndex;     // 0x0090(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_4_Transform;     // 0x00A0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_4_CachedIndex;   // 0x0100(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_3_Transform;     // 0x0110(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_3_CachedIndex;   // 0x0170(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___TwoBoneIKSimplePerItem_3_Effector__IO; // 0x0180(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigVMModel___GetTransform_2_1_1_1_Transform;       // 0x01E0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_2_1_1_1_CachedIndex;     // 0x0240(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                RigVMModel___TwoBoneIKSimplePerItem_3_PoleVector;  // 0x0250(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___TwoBoneIKSimplePerItem_3_Weight;      // 0x0268(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              RigVMModel___TwoBoneIKSimplePerItem_3_CachedItemAIndex; // 0x0270(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___TwoBoneIKSimplePerItem_3_CachedItemBIndex; // 0x0280(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___TwoBoneIKSimplePerItem_3_CachedEffectorItemIndex; // 0x0290(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___TwoBoneIKSimplePerItem_3_CachedPoleVectorSpaceIndex; // 0x02A0(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_3_1_Transform;   // 0x02B0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_3_1_CachedIndex; // 0x0310(0x0010)(Edit, EditConst, NonTransactional)
	struct FRigUnit_AimItem_Target                RigVMModel___AimItem_Primary__IO;                  // 0x0320(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	float                                         RigVMModel___AimItem_Weight;                       // 0x0368(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36C[0x4];                                      // 0x036C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              RigVMModel___AimItem_CachedItem;                   // 0x0370(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___AimItem_PrimaryCachedSpace;           // 0x0380(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___AimItem_SecondaryCachedSpace;         // 0x0390(0x0010)(Edit, EditConst, NonTransactional)
	TArray<bool>                                  RigVMModel___AimItem_bIsInitialized;               // 0x03A0(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___ProjectTransformToNewParent_2_Transform; // 0x03B0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___ProjectTransformToNewParent_2_CachedChild; // 0x0410(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___ProjectTransformToNewParent_2_CachedOldParent; // 0x0420(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___ProjectTransformToNewParent_2_CachedNewParent; // 0x0430(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___SetTransform_3_CachedIndex;           // 0x0440(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___GetTransform_4_Transform;             // 0x0450(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_4_CachedIndex;           // 0x04B0(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___SetTransform_3_1_CachedIndex;         // 0x04C0(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___GetTransform_1_1_2_Transform;         // 0x04D0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_1_1_2_CachedIndex;       // 0x0530(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___SetTransform_1_1_2_CachedIndex;       // 0x0540(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___GetTransform_1_1_1_2_Transform;       // 0x0550(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_1_1_1_2_CachedIndex;     // 0x05B0(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___SetTransform_1_1_1_2_CachedIndex;     // 0x05C0(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___GetTransform_1_1_1_1_2_Transform;     // 0x05D0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_1_1_1_1_2_CachedIndex;   // 0x0630(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___SetTransform_1_1_1_1_2_CachedIndex;   // 0x0640(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___GetTransform_1_1_1_1_1_2_Transform;   // 0x0650(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_1_1_1_1_1_2_CachedIndex; // 0x06B0(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___SetTransform_1_1_1_1_1_2_CachedIndex; // 0x06C0(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___GetTransform_1_1_1_1_1_1_1_Transform; // 0x06D0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_1_1_1_1_1_1_1_CachedIndex; // 0x0730(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___SetTransform_1_1_1_1_1_1_1_CachedIndex; // 0x0740(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___GetTransform_2_3_Transform;           // 0x0750(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_2_3_CachedIndex;         // 0x07B0(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___SetTransform_2_2_CachedIndex;         // 0x07C0(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___GetTransform_2_1_2_Transform;         // 0x07D0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_2_1_2_CachedIndex;       // 0x0830(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___SetTransform_2_2_1_CachedIndex;       // 0x0840(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___ProjectTransformToNewParent_3_Transform; // 0x0850(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___ProjectTransformToNewParent_3_CachedChild; // 0x08B0(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___ProjectTransformToNewParent_3_CachedOldParent; // 0x08C0(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___ProjectTransformToNewParent_3_CachedNewParent; // 0x08D0(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___SetTransform_2_2_1_2_CachedIndex;     // 0x08E0(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___GetTransform_2_3_2_Transform;         // 0x08F0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_2_3_2_CachedIndex;       // 0x0950(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___SetTransform_2_2_3_CachedIndex;       // 0x0960(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___GetTransform_2_1_2_2_Transform;       // 0x0970(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_2_1_2_2_CachedIndex;     // 0x09D0(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___SetTransform_2_2_1_3_CachedIndex;     // 0x09E0(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___GetTransform_2_3_1_Transform;         // 0x09F0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_2_3_1_CachedIndex;       // 0x0A50(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___SetTransform_2_2_2_CachedIndex;       // 0x0A60(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___GetTransform_2_1_2_1_Transform;       // 0x0A70(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_2_1_2_1_CachedIndex;     // 0x0AD0(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___SetTransform_2_2_1_1_CachedIndex;     // 0x0AE0(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___ProjectTransformToNewParent_3_1_Transform; // 0x0AF0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___ProjectTransformToNewParent_3_1_CachedChild; // 0x0B50(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___ProjectTransformToNewParent_3_1_CachedOldParent; // 0x0B60(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___ProjectTransformToNewParent_3_1_CachedNewParent; // 0x0B70(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___SetTransform_2_2_1_2_1_CachedIndex;   // 0x0B80(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___GetTransform_2_3_2_1_Transform;       // 0x0B90(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_2_3_2_1_CachedIndex;     // 0x0BF0(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___SetTransform_2_2_3_1_CachedIndex;     // 0x0C00(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___GetTransform_2_1_2_2_1_Transform;     // 0x0C10(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_2_1_2_2_1_CachedIndex;   // 0x0C70(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___SetTransform_2_2_1_3_1_CachedIndex;   // 0x0C80(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___ProjectTransformToNewParent_1_1_Transform; // 0x0C90(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___ProjectTransformToNewParent_1_1_CachedChild; // 0x0CF0(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___ProjectTransformToNewParent_1_1_CachedOldParent; // 0x0D00(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___ProjectTransformToNewParent_1_1_CachedNewParent; // 0x0D10(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  RigVMModel___SetRotation_3_Value;                  // 0x0D20(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___SetRotation_3_CachedIndex;            // 0x0D40(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___GetTransform_5_Transform;             // 0x0D50(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_5_CachedIndex;           // 0x0DB0(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___SetTransform_4_CachedIndex;           // 0x0DC0(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___ProjectTransformToNewParent_4_1_Transform; // 0x0DD0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___ProjectTransformToNewParent_4_1_CachedChild; // 0x0E30(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___ProjectTransformToNewParent_4_1_CachedOldParent; // 0x0E40(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___ProjectTransformToNewParent_4_1_CachedNewParent; // 0x0E50(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___SetTransform_4_1_CachedIndex;         // 0x0E60(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___GetTransform_2_3_2_1_1_Transform;     // 0x0E70(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_2_3_2_1_1_CachedIndex;   // 0x0ED0(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___SetTransform_2_2_3_1_1_CachedIndex;   // 0x0EE0(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___GetTransform_2_1_2_2_1_1_Transform;   // 0x0EF0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_2_1_2_2_1_1_CachedIndex; // 0x0F50(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___SetTransform_2_2_1_3_1_1_CachedIndex; // 0x0F60(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___ProjectTransformToNewParent_1_1_1_Transform; // 0x0F70(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___ProjectTransformToNewParent_1_1_1_CachedChild; // 0x0FD0(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___ProjectTransformToNewParent_1_1_1_CachedOldParent; // 0x0FE0(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___ProjectTransformToNewParent_1_1_1_CachedNewParent; // 0x0FF0(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  RigVMModel___SetRotation_3_1_Value;                // 0x1000(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___SetRotation_3_1_CachedIndex;          // 0x1020(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___GetTransform_5_1_Transform;           // 0x1030(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_5_1_CachedIndex;         // 0x1090(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___SetTransform_4_2_CachedIndex;         // 0x10A0(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___ProjectTransformToNewParent_4_1_1_Transform; // 0x10B0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___ProjectTransformToNewParent_4_1_1_CachedChild; // 0x1110(0x0010)(Edit, EditConst, NonTransactional)
