#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SurvivalPlayer_Test

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "EquipmentData_structs.hpp"
#include "MaterialArray_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "S_WindowClimb_structs.hpp"
#include "StatType_structs.hpp"
#include "WE_NewDeathScreenState_structs.hpp"
#include "NameArray_structs.hpp"
#include "ClimBType_structs.hpp"
#include "ComponentAndTransform_structs.hpp"
#include "ClimbAsset_structs.hpp"
#include "ClimbParams_structs.hpp"
#include "InputCore_structs.hpp"
#include "CraftState_structs.hpp"
#include "BPE_Weapon_Type_structs.hpp"
#include "FMODStudio_structs.hpp"
#include "StanceState_structs.hpp"
#include "BuildingInfo_Struct_structs.hpp"
#include "E_CarStatus_structs.hpp"
#include "PlayerRoomItemsStructure_structs.hpp"
#include "FItemInfo_structs.hpp"


namespace SDK::Params
{

// Function SurvivalPlayer_Test.SurvivalPlayer_Test_C.AnotherPlayerLeaveSquad
// 0x0028 (0x0028 - 0x0000)
struct SurvivalPlayer_Test_C_AnotherPlayerLeaveSquad final
{
public:
	class APS_TDB_C*                              LeavePS;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_V2_C*                   LeavePlayer;                                       // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPawn_ReturnValue;                      // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_V2_C*                   K2Node_DynamicCast_AsSurvival_Player_V2;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SurvivalPlayer_Test_C_AnotherPlayerLeaveSquad) == 0x000008, "Wrong alignment on SurvivalPlayer_Test_C_AnotherPlayerLeaveSquad");
static_assert(sizeof(SurvivalPlayer_Test_C_AnotherPlayerLeaveSquad) == 0x000028, "Wrong size on SurvivalPlayer_Test_C_AnotherPlayerLeaveSquad");
static_assert(offsetof(SurvivalPlayer_Test_C_AnotherPlayerLeaveSquad, LeavePS) == 0x000000, "Member 'SurvivalPlayer_Test_C_AnotherPlayerLeaveSquad::LeavePS' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_AnotherPlayerLeaveSquad, LeavePlayer) == 0x000008, "Member 'SurvivalPlayer_Test_C_AnotherPlayerLeaveSquad::LeavePlayer' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_AnotherPlayerLeaveSquad, CallFunc_GetPawn_ReturnValue) == 0x000010, "Member 'SurvivalPlayer_Test_C_AnotherPlayerLeaveSquad::CallFunc_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_AnotherPlayerLeaveSquad, K2Node_DynamicCast_AsSurvival_Player_V2) == 0x000018, "Member 'SurvivalPlayer_Test_C_AnotherPlayerLeaveSquad::K2Node_DynamicCast_AsSurvival_Player_V2' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_AnotherPlayerLeaveSquad, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'SurvivalPlayer_Test_C_AnotherPlayerLeaveSquad::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_AnotherPlayerLeaveSquad, CallFunc_Array_RemoveItem_ReturnValue) == 0x000021, "Member 'SurvivalPlayer_Test_C_AnotherPlayerLeaveSquad::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");

// Function SurvivalPlayer_Test.SurvivalPlayer_Test_C.BndEvt__SurvivalPlayer_Test_PlayerNameSphereCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct SurvivalPlayer_Test_C_BndEvt__SurvivalPlayer_Test_PlayerNameSphereCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(SurvivalPlayer_Test_C_BndEvt__SurvivalPlayer_Test_PlayerNameSphereCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on SurvivalPlayer_Test_C_BndEvt__SurvivalPlayer_Test_PlayerNameSphereCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(SurvivalPlayer_Test_C_BndEvt__SurvivalPlayer_Test_PlayerNameSphereCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on SurvivalPlayer_Test_C_BndEvt__SurvivalPlayer_Test_PlayerNameSphereCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(SurvivalPlayer_Test_C_BndEvt__SurvivalPlayer_Test_PlayerNameSphereCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'SurvivalPlayer_Test_C_BndEvt__SurvivalPlayer_Test_PlayerNameSphereCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_BndEvt__SurvivalPlayer_Test_PlayerNameSphereCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'SurvivalPlayer_Test_C_BndEvt__SurvivalPlayer_Test_PlayerNameSphereCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_BndEvt__SurvivalPlayer_Test_PlayerNameSphereCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'SurvivalPlayer_Test_C_BndEvt__SurvivalPlayer_Test_PlayerNameSphereCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_BndEvt__SurvivalPlayer_Test_PlayerNameSphereCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'SurvivalPlayer_Test_C_BndEvt__SurvivalPlayer_Test_PlayerNameSphereCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_BndEvt__SurvivalPlayer_Test_PlayerNameSphereCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'SurvivalPlayer_Test_C_BndEvt__SurvivalPlayer_Test_PlayerNameSphereCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_BndEvt__SurvivalPlayer_Test_PlayerNameSphereCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'SurvivalPlayer_Test_C_BndEvt__SurvivalPlayer_Test_PlayerNameSphereCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function SurvivalPlayer_Test.SurvivalPlayer_Test_C.BndEvt__SurvivalPlayer_Test_PlayerNameSphereCollision_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct SurvivalPlayer_Test_C_BndEvt__SurvivalPlayer_Test_PlayerNameSphereCollision_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SurvivalPlayer_Test_C_BndEvt__SurvivalPlayer_Test_PlayerNameSphereCollision_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on SurvivalPlayer_Test_C_BndEvt__SurvivalPlayer_Test_PlayerNameSphereCollision_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(SurvivalPlayer_Test_C_BndEvt__SurvivalPlayer_Test_PlayerNameSphereCollision_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on SurvivalPlayer_Test_C_BndEvt__SurvivalPlayer_Test_PlayerNameSphereCollision_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(SurvivalPlayer_Test_C_BndEvt__SurvivalPlayer_Test_PlayerNameSphereCollision_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'SurvivalPlayer_Test_C_BndEvt__SurvivalPlayer_Test_PlayerNameSphereCollision_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_BndEvt__SurvivalPlayer_Test_PlayerNameSphereCollision_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'SurvivalPlayer_Test_C_BndEvt__SurvivalPlayer_Test_PlayerNameSphereCollision_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_BndEvt__SurvivalPlayer_Test_PlayerNameSphereCollision_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'SurvivalPlayer_Test_C_BndEvt__SurvivalPlayer_Test_PlayerNameSphereCollision_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_BndEvt__SurvivalPlayer_Test_PlayerNameSphereCollision_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'SurvivalPlayer_Test_C_BndEvt__SurvivalPlayer_Test_PlayerNameSphereCollision_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function SurvivalPlayer_Test.SurvivalPlayer_Test_C.CalculateBSh
// 0x0380 (0x0380 - 0x0000)
struct SurvivalPlayer_Test_C_CalculateBSh final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0014(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_5;                  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_6;                  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_5;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_6;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNameArray                             CallFunc_Map_Find_Value;                           // 0x0060(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_7;                   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_7;                  // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNameArray                             CallFunc_Map_Find_Value_1;                         // 0x0090(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_7;                 // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x00B8(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item_2;                         // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEquipmentData                         CallFunc_GetDataTableRowFromName_OutRow;           // 0x00D0(0x0180)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         K2Node_MakeArray_Array_1;                          // 0x0258(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item_3;                         // 0x0268(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          CallFunc_GetSkeletalMesh_DEPRECATED_ReturnValue;   // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMorphTarget*>                   CallFunc_GetMorphTargetsPtrConv_ReturnValue;       // 0x0288(0x0010)(ReferenceParm)
	class UMorphTarget*                           CallFunc_Array_Get_Item_4;                         // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x02A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue;              // 0x02B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BA[0x2];                                      // 0x02BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x02BC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C5[0x3];                                      // 0x02C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x02C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x02D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FNameArray                             CallFunc_Map_Find_Value_2;                         // 0x02E8(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_2;                   // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNameArray                             CallFunc_Map_Find_Value_3;                         // 0x0300(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_3;                   // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_311[0x3];                                      // 0x0311(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item_5;                         // 0x0314(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_6;                         // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_329[0x3];                                      // 0x0329(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FNameArray                             CallFunc_Map_Find_Value_4;                         // 0x0330(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_4;                   // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x0341(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_342[0x6];                                      // 0x0342(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNameArray                             CallFunc_Map_Find_Value_5;                         // 0x0348(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_5;                   // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_359[0x3];                                      // 0x0359(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item_7;                         // 0x035C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_6;               // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_8;                         // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_6;                // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_371[0x3];                                      // 0x0371(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_7;               // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_7;                // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SurvivalPlayer_Test_C_CalculateBSh) == 0x000008, "Wrong alignment on SurvivalPlayer_Test_C_CalculateBSh");
static_assert(sizeof(SurvivalPlayer_Test_C_CalculateBSh) == 0x000380, "Wrong size on SurvivalPlayer_Test_C_CalculateBSh");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'SurvivalPlayer_Test_C_CalculateBSh::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'SurvivalPlayer_Test_C_CalculateBSh::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, Temp_int_Array_Index_Variable) == 0x000008, "Member 'SurvivalPlayer_Test_C_CalculateBSh::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, Temp_int_Loop_Counter_Variable_1) == 0x00000C, "Member 'SurvivalPlayer_Test_C_CalculateBSh::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, CallFunc_Add_IntInt_ReturnValue_1) == 0x000010, "Member 'SurvivalPlayer_Test_C_CalculateBSh::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, Temp_name_Variable) == 0x000014, "Member 'SurvivalPlayer_Test_C_CalculateBSh::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, Temp_int_Array_Index_Variable_1) == 0x00001C, "Member 'SurvivalPlayer_Test_C_CalculateBSh::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, Temp_int_Loop_Counter_Variable_2) == 0x000020, "Member 'SurvivalPlayer_Test_C_CalculateBSh::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, CallFunc_Add_IntInt_ReturnValue_2) == 0x000024, "Member 'SurvivalPlayer_Test_C_CalculateBSh::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, Temp_int_Array_Index_Variable_2) == 0x000028, "Member 'SurvivalPlayer_Test_C_CalculateBSh::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, Temp_int_Array_Index_Variable_3) == 0x00002C, "Member 'SurvivalPlayer_Test_C_CalculateBSh::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, Temp_int_Loop_Counter_Variable_3) == 0x000030, "Member 'SurvivalPlayer_Test_C_CalculateBSh::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, CallFunc_Add_IntInt_ReturnValue_3) == 0x000034, "Member 'SurvivalPlayer_Test_C_CalculateBSh::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, Temp_int_Array_Index_Variable_4) == 0x000038, "Member 'SurvivalPlayer_Test_C_CalculateBSh::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, Temp_int_Loop_Counter_Variable_4) == 0x00003C, "Member 'SurvivalPlayer_Test_C_CalculateBSh::Temp_int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, CallFunc_Add_IntInt_ReturnValue_4) == 0x000040, "Member 'SurvivalPlayer_Test_C_CalculateBSh::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, Temp_int_Loop_Counter_Variable_5) == 0x000044, "Member 'SurvivalPlayer_Test_C_CalculateBSh::Temp_int_Loop_Counter_Variable_5' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, Temp_int_Loop_Counter_Variable_6) == 0x000048, "Member 'SurvivalPlayer_Test_C_CalculateBSh::Temp_int_Loop_Counter_Variable_6' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, CallFunc_Add_IntInt_ReturnValue_5) == 0x00004C, "Member 'SurvivalPlayer_Test_C_CalculateBSh::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, CallFunc_Add_IntInt_ReturnValue_6) == 0x000050, "Member 'SurvivalPlayer_Test_C_CalculateBSh::CallFunc_Add_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, Temp_int_Array_Index_Variable_5) == 0x000054, "Member 'SurvivalPlayer_Test_C_CalculateBSh::Temp_int_Array_Index_Variable_5' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, Temp_int_Array_Index_Variable_6) == 0x000058, "Member 'SurvivalPlayer_Test_C_CalculateBSh::Temp_int_Array_Index_Variable_6' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, CallFunc_Map_Find_Value) == 0x000060, "Member 'SurvivalPlayer_Test_C_CalculateBSh::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, CallFunc_Map_Find_ReturnValue) == 0x000070, "Member 'SurvivalPlayer_Test_C_CalculateBSh::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, CallFunc_Array_Length_ReturnValue) == 0x000074, "Member 'SurvivalPlayer_Test_C_CalculateBSh::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, Temp_int_Array_Index_Variable_7) == 0x000078, "Member 'SurvivalPlayer_Test_C_CalculateBSh::Temp_int_Array_Index_Variable_7' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, CallFunc_Less_IntInt_ReturnValue) == 0x00007C, "Member 'SurvivalPlayer_Test_C_CalculateBSh::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, CallFunc_Array_Get_Item) == 0x000080, "Member 'SurvivalPlayer_Test_C_CalculateBSh::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, Temp_int_Loop_Counter_Variable_7) == 0x000088, "Member 'SurvivalPlayer_Test_C_CalculateBSh::Temp_int_Loop_Counter_Variable_7' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, CallFunc_Map_Find_Value_1) == 0x000090, "Member 'SurvivalPlayer_Test_C_CalculateBSh::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, CallFunc_Map_Find_ReturnValue_1) == 0x0000A0, "Member 'SurvivalPlayer_Test_C_CalculateBSh::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, CallFunc_Add_IntInt_ReturnValue_7) == 0x0000A4, "Member 'SurvivalPlayer_Test_C_CalculateBSh::CallFunc_Add_IntInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, CallFunc_Array_Get_Item_1) == 0x0000A8, "Member 'SurvivalPlayer_Test_C_CalculateBSh::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, CallFunc_Array_Length_ReturnValue_1) == 0x0000B0, "Member 'SurvivalPlayer_Test_C_CalculateBSh::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000B4, "Member 'SurvivalPlayer_Test_C_CalculateBSh::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, K2Node_MakeArray_Array) == 0x0000B8, "Member 'SurvivalPlayer_Test_C_CalculateBSh::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, CallFunc_Array_Get_Item_2) == 0x0000C8, "Member 'SurvivalPlayer_Test_C_CalculateBSh::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, CallFunc_GetDataTableRowFromName_OutRow) == 0x0000D0, "Member 'SurvivalPlayer_Test_C_CalculateBSh::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000250, "Member 'SurvivalPlayer_Test_C_CalculateBSh::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, K2Node_MakeArray_Array_1) == 0x000258, "Member 'SurvivalPlayer_Test_C_CalculateBSh::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, CallFunc_Array_Get_Item_3) == 0x000268, "Member 'SurvivalPlayer_Test_C_CalculateBSh::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, CallFunc_Array_Length_ReturnValue_2) == 0x000270, "Member 'SurvivalPlayer_Test_C_CalculateBSh::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, CallFunc_GetSkeletalMesh_DEPRECATED_ReturnValue) == 0x000278, "Member 'SurvivalPlayer_Test_C_CalculateBSh::CallFunc_GetSkeletalMesh_DEPRECATED_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, CallFunc_Less_IntInt_ReturnValue_2) == 0x000280, "Member 'SurvivalPlayer_Test_C_CalculateBSh::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, CallFunc_GetMorphTargetsPtrConv_ReturnValue) == 0x000288, "Member 'SurvivalPlayer_Test_C_CalculateBSh::CallFunc_GetMorphTargetsPtrConv_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, CallFunc_Array_Get_Item_4) == 0x000298, "Member 'SurvivalPlayer_Test_C_CalculateBSh::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, CallFunc_Array_Length_ReturnValue_3) == 0x0002A0, "Member 'SurvivalPlayer_Test_C_CalculateBSh::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, CallFunc_GetObjectName_ReturnValue) == 0x0002A8, "Member 'SurvivalPlayer_Test_C_CalculateBSh::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, CallFunc_Less_IntInt_ReturnValue_3) == 0x0002B8, "Member 'SurvivalPlayer_Test_C_CalculateBSh::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, CallFunc_NotEqual_StrStr_ReturnValue) == 0x0002B9, "Member 'SurvivalPlayer_Test_C_CalculateBSh::CallFunc_NotEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, CallFunc_Conv_StringToName_ReturnValue) == 0x0002BC, "Member 'SurvivalPlayer_Test_C_CalculateBSh::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, CallFunc_IsValid_ReturnValue) == 0x0002C4, "Member 'SurvivalPlayer_Test_C_CalculateBSh::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, CallFunc_Conv_NameToString_ReturnValue) == 0x0002C8, "Member 'SurvivalPlayer_Test_C_CalculateBSh::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, CallFunc_Conv_NameToString_ReturnValue_1) == 0x0002D8, "Member 'SurvivalPlayer_Test_C_CalculateBSh::CallFunc_Conv_NameToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, CallFunc_Map_Find_Value_2) == 0x0002E8, "Member 'SurvivalPlayer_Test_C_CalculateBSh::CallFunc_Map_Find_Value_2' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, CallFunc_Map_Find_ReturnValue_2) == 0x0002F8, "Member 'SurvivalPlayer_Test_C_CalculateBSh::CallFunc_Map_Find_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, CallFunc_Map_Find_Value_3) == 0x000300, "Member 'SurvivalPlayer_Test_C_CalculateBSh::CallFunc_Map_Find_Value_3' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, CallFunc_Map_Find_ReturnValue_3) == 0x000310, "Member 'SurvivalPlayer_Test_C_CalculateBSh::CallFunc_Map_Find_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, CallFunc_Array_Get_Item_5) == 0x000314, "Member 'SurvivalPlayer_Test_C_CalculateBSh::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, CallFunc_Array_Length_ReturnValue_4) == 0x00031C, "Member 'SurvivalPlayer_Test_C_CalculateBSh::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, CallFunc_Array_Get_Item_6) == 0x000320, "Member 'SurvivalPlayer_Test_C_CalculateBSh::CallFunc_Array_Get_Item_6' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, CallFunc_Less_IntInt_ReturnValue_4) == 0x000328, "Member 'SurvivalPlayer_Test_C_CalculateBSh::CallFunc_Less_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, CallFunc_Array_Length_ReturnValue_5) == 0x00032C, "Member 'SurvivalPlayer_Test_C_CalculateBSh::CallFunc_Array_Length_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, CallFunc_Map_Find_Value_4) == 0x000330, "Member 'SurvivalPlayer_Test_C_CalculateBSh::CallFunc_Map_Find_Value_4' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, CallFunc_Map_Find_ReturnValue_4) == 0x000340, "Member 'SurvivalPlayer_Test_C_CalculateBSh::CallFunc_Map_Find_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, CallFunc_Less_IntInt_ReturnValue_5) == 0x000341, "Member 'SurvivalPlayer_Test_C_CalculateBSh::CallFunc_Less_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, CallFunc_Map_Find_Value_5) == 0x000348, "Member 'SurvivalPlayer_Test_C_CalculateBSh::CallFunc_Map_Find_Value_5' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, CallFunc_Map_Find_ReturnValue_5) == 0x000358, "Member 'SurvivalPlayer_Test_C_CalculateBSh::CallFunc_Map_Find_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, CallFunc_Array_Get_Item_7) == 0x00035C, "Member 'SurvivalPlayer_Test_C_CalculateBSh::CallFunc_Array_Get_Item_7' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, CallFunc_Array_Length_ReturnValue_6) == 0x000364, "Member 'SurvivalPlayer_Test_C_CalculateBSh::CallFunc_Array_Length_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, CallFunc_Array_Get_Item_8) == 0x000368, "Member 'SurvivalPlayer_Test_C_CalculateBSh::CallFunc_Array_Get_Item_8' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, CallFunc_Less_IntInt_ReturnValue_6) == 0x000370, "Member 'SurvivalPlayer_Test_C_CalculateBSh::CallFunc_Less_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, CallFunc_Array_Length_ReturnValue_7) == 0x000374, "Member 'SurvivalPlayer_Test_C_CalculateBSh::CallFunc_Array_Length_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CalculateBSh, CallFunc_Less_IntInt_ReturnValue_7) == 0x000378, "Member 'SurvivalPlayer_Test_C_CalculateBSh::CallFunc_Less_IntInt_ReturnValue_7' has a wrong offset!");

// Function SurvivalPlayer_Test.SurvivalPlayer_Test_C.CapsuleHasRoomCheck
// 0x02B0 (0x02B0 - 0x0000)
struct SurvivalPlayer_Test_C_CapsuleHasRoomCheck final
{
public:
	class UCapsuleComponent*                      Capsule;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TargetLocation;                                    // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HeightOffset;                                      // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RadiusOffset;                                      // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasRoom;                                           // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0038(0x0010)(ConstParm, ReferenceParm)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScaledCapsuleHalfHeight_WithoutHemisphere_ReturnValue; // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_2;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_SphereTraceSingle_OutHit;                 // 0x00D0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingle_ReturnValue;            // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x01BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BB[0x1];                                      // 0x01BB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0210(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0238(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0260(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0278(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanNOR_ReturnValue;                   // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast_1;        // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SphereTraceSingle_Radius_ImplicitCast;    // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SurvivalPlayer_Test_C_CapsuleHasRoomCheck) == 0x000008, "Wrong alignment on SurvivalPlayer_Test_C_CapsuleHasRoomCheck");
static_assert(sizeof(SurvivalPlayer_Test_C_CapsuleHasRoomCheck) == 0x0002B0, "Wrong size on SurvivalPlayer_Test_C_CapsuleHasRoomCheck");
static_assert(offsetof(SurvivalPlayer_Test_C_CapsuleHasRoomCheck, Capsule) == 0x000000, "Member 'SurvivalPlayer_Test_C_CapsuleHasRoomCheck::Capsule' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CapsuleHasRoomCheck, TargetLocation) == 0x000008, "Member 'SurvivalPlayer_Test_C_CapsuleHasRoomCheck::TargetLocation' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CapsuleHasRoomCheck, HeightOffset) == 0x000020, "Member 'SurvivalPlayer_Test_C_CapsuleHasRoomCheck::HeightOffset' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CapsuleHasRoomCheck, RadiusOffset) == 0x000028, "Member 'SurvivalPlayer_Test_C_CapsuleHasRoomCheck::RadiusOffset' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CapsuleHasRoomCheck, HasRoom) == 0x000030, "Member 'SurvivalPlayer_Test_C_CapsuleHasRoomCheck::HasRoom' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CapsuleHasRoomCheck, Temp_object_Variable) == 0x000038, "Member 'SurvivalPlayer_Test_C_CapsuleHasRoomCheck::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CapsuleHasRoomCheck, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000048, "Member 'SurvivalPlayer_Test_C_CapsuleHasRoomCheck::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CapsuleHasRoomCheck, CallFunc_GetScaledCapsuleHalfHeight_WithoutHemisphere_ReturnValue) == 0x000050, "Member 'SurvivalPlayer_Test_C_CapsuleHasRoomCheck::CallFunc_GetScaledCapsuleHalfHeight_WithoutHemisphere_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CapsuleHasRoomCheck, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000058, "Member 'SurvivalPlayer_Test_C_CapsuleHasRoomCheck::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CapsuleHasRoomCheck, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000060, "Member 'SurvivalPlayer_Test_C_CapsuleHasRoomCheck::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CapsuleHasRoomCheck, CallFunc_Add_DoubleDouble_ReturnValue_2) == 0x000068, "Member 'SurvivalPlayer_Test_C_CapsuleHasRoomCheck::CallFunc_Add_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CapsuleHasRoomCheck, CallFunc_MakeVector_ReturnValue) == 0x000070, "Member 'SurvivalPlayer_Test_C_CapsuleHasRoomCheck::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CapsuleHasRoomCheck, CallFunc_MakeVector_ReturnValue_1) == 0x000088, "Member 'SurvivalPlayer_Test_C_CapsuleHasRoomCheck::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CapsuleHasRoomCheck, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000A0, "Member 'SurvivalPlayer_Test_C_CapsuleHasRoomCheck::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CapsuleHasRoomCheck, CallFunc_Add_VectorVector_ReturnValue) == 0x0000B8, "Member 'SurvivalPlayer_Test_C_CapsuleHasRoomCheck::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CapsuleHasRoomCheck, CallFunc_SphereTraceSingle_OutHit) == 0x0000D0, "Member 'SurvivalPlayer_Test_C_CapsuleHasRoomCheck::CallFunc_SphereTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CapsuleHasRoomCheck, CallFunc_SphereTraceSingle_ReturnValue) == 0x0001B8, "Member 'SurvivalPlayer_Test_C_CapsuleHasRoomCheck::CallFunc_SphereTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CapsuleHasRoomCheck, CallFunc_BreakHitResult_bBlockingHit) == 0x0001B9, "Member 'SurvivalPlayer_Test_C_CapsuleHasRoomCheck::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CapsuleHasRoomCheck, CallFunc_BreakHitResult_bInitialOverlap) == 0x0001BA, "Member 'SurvivalPlayer_Test_C_CapsuleHasRoomCheck::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CapsuleHasRoomCheck, CallFunc_BreakHitResult_Time) == 0x0001BC, "Member 'SurvivalPlayer_Test_C_CapsuleHasRoomCheck::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CapsuleHasRoomCheck, CallFunc_BreakHitResult_Distance) == 0x0001C0, "Member 'SurvivalPlayer_Test_C_CapsuleHasRoomCheck::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CapsuleHasRoomCheck, CallFunc_BreakHitResult_Location) == 0x0001C8, "Member 'SurvivalPlayer_Test_C_CapsuleHasRoomCheck::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CapsuleHasRoomCheck, CallFunc_BreakHitResult_ImpactPoint) == 0x0001E0, "Member 'SurvivalPlayer_Test_C_CapsuleHasRoomCheck::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CapsuleHasRoomCheck, CallFunc_BreakHitResult_Normal) == 0x0001F8, "Member 'SurvivalPlayer_Test_C_CapsuleHasRoomCheck::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CapsuleHasRoomCheck, CallFunc_BreakHitResult_ImpactNormal) == 0x000210, "Member 'SurvivalPlayer_Test_C_CapsuleHasRoomCheck::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CapsuleHasRoomCheck, CallFunc_BreakHitResult_PhysMat) == 0x000228, "Member 'SurvivalPlayer_Test_C_CapsuleHasRoomCheck::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CapsuleHasRoomCheck, CallFunc_BreakHitResult_HitActor) == 0x000230, "Member 'SurvivalPlayer_Test_C_CapsuleHasRoomCheck::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CapsuleHasRoomCheck, CallFunc_BreakHitResult_HitComponent) == 0x000238, "Member 'SurvivalPlayer_Test_C_CapsuleHasRoomCheck::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CapsuleHasRoomCheck, CallFunc_BreakHitResult_HitBoneName) == 0x000240, "Member 'SurvivalPlayer_Test_C_CapsuleHasRoomCheck::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CapsuleHasRoomCheck, CallFunc_BreakHitResult_BoneName) == 0x000248, "Member 'SurvivalPlayer_Test_C_CapsuleHasRoomCheck::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Test_C_CapsuleHasRoomCheck, CallFunc_BreakHitResult_HitItem) == 0x000250, "Member 'SurvivalPlayer_Test_C_CapsuleHasRoomCheck::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
