#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SurvivalPlayer_V2

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "S_Mat_structs.hpp"
#include "FGrenadeInfo_structs.hpp"
#include "EquipmentData_structs.hpp"
#include "Engine_structs.hpp"
#include "BPE_Weapon_Type_structs.hpp"
#include "WE_NewDeathScreenState_structs.hpp"
#include "InputCore_structs.hpp"
#include "FMODStudio_structs.hpp"
#include "StanceState_structs.hpp"


namespace SDK::Params
{

// Function SurvivalPlayer_V2.SurvivalPlayer_V2_C.Activate Grenade Server
// 0x0030 (0x0030 - 0x0000)
struct SurvivalPlayer_V2_C_Activate_Grenade_Server final
{
public:
	TSoftClassPtr<class UClass>                   Param_Class;                                       // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(SurvivalPlayer_V2_C_Activate_Grenade_Server) == 0x000008, "Wrong alignment on SurvivalPlayer_V2_C_Activate_Grenade_Server");
static_assert(sizeof(SurvivalPlayer_V2_C_Activate_Grenade_Server) == 0x000030, "Wrong size on SurvivalPlayer_V2_C_Activate_Grenade_Server");
static_assert(offsetof(SurvivalPlayer_V2_C_Activate_Grenade_Server, Param_Class) == 0x000000, "Member 'SurvivalPlayer_V2_C_Activate_Grenade_Server::Param_Class' has a wrong offset!");

// Function SurvivalPlayer_V2.SurvivalPlayer_V2_C.ActivateEquippedGrenadeInHand
// 0x03B0 (0x03B0 - 0x0000)
struct SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand final
{
public:
	TSoftClassPtr<class UClass>                   Param_Class;                                       // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Explosive_Molotov;                                 // 0x0030(0x0030)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Explosive_Flash;                                   // 0x0060(0x0030)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Explosive_Smoke;                                   // 0x0090(0x0030)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Explosive_F1;                                      // 0x00C0(0x0030)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00F0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_SoftClassReference_ReturnValue; // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x3];                                      // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakRotator_Roll;                        // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_SoftClassReference_ReturnValue_1; // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_SoftClassReference_ReturnValue_2; // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_SoftClassReference_ReturnValue_3; // 0x01AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AB[0x5];                                      // 0x01AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x01B0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x0210(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x0228(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x0240(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0258(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0270(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_294[0x4];                                      // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_2;           // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x02B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C8[0x8];                                      // 0x02C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x02D0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0338(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AExplosion_F1_C*                        CallFunc_FinishSpawningActor_ReturnValue;          // 0x0340(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AExplosion_Molotov_C*                   CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0348(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x0350(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3; // 0x0358(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AExplosion_Flash_C*                     CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x0360(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AExplosion_Smoke_C*                     CallFunc_FinishSpawningActor_ReturnValue_3;        // 0x0368(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast_1;        // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast_2;        // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast_1;        // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast_2;        // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast;            // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Pitch_ImplicitCast;           // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand) == 0x000010, "Wrong alignment on SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand");
static_assert(sizeof(SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand) == 0x0003B0, "Wrong size on SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand");
static_assert(offsetof(SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand, Param_Class) == 0x000000, "Member 'SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand::Param_Class' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand, Explosive_Molotov) == 0x000030, "Member 'SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand::Explosive_Molotov' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand, Explosive_Flash) == 0x000060, "Member 'SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand::Explosive_Flash' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand, Explosive_Smoke) == 0x000090, "Member 'SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand::Explosive_Smoke' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand, Explosive_F1) == 0x0000C0, "Member 'SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand::Explosive_F1' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand, CallFunc_MakeTransform_ReturnValue) == 0x0000F0, "Member 'SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand, CallFunc_BreakTransform_Location) == 0x000150, "Member 'SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand, CallFunc_BreakTransform_Rotation) == 0x000168, "Member 'SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand, CallFunc_BreakTransform_Scale) == 0x000180, "Member 'SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand, CallFunc_EqualEqual_SoftClassReference_ReturnValue) == 0x000198, "Member 'SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand::CallFunc_EqualEqual_SoftClassReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand, CallFunc_BreakRotator_Roll) == 0x00019C, "Member 'SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand, CallFunc_BreakRotator_Pitch) == 0x0001A0, "Member 'SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand, CallFunc_BreakRotator_Yaw) == 0x0001A4, "Member 'SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand, CallFunc_EqualEqual_SoftClassReference_ReturnValue_1) == 0x0001A8, "Member 'SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand::CallFunc_EqualEqual_SoftClassReference_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand, CallFunc_EqualEqual_SoftClassReference_ReturnValue_2) == 0x0001A9, "Member 'SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand::CallFunc_EqualEqual_SoftClassReference_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand, CallFunc_EqualEqual_SoftClassReference_ReturnValue_3) == 0x0001AA, "Member 'SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand::CallFunc_EqualEqual_SoftClassReference_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand, CallFunc_GetSocketTransform_ReturnValue) == 0x0001B0, "Member 'SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand, CallFunc_BreakTransform_Location_1) == 0x000210, "Member 'SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand, CallFunc_BreakTransform_Rotation_1) == 0x000228, "Member 'SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand, CallFunc_BreakTransform_Scale_1) == 0x000240, "Member 'SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand, CallFunc_Add_VectorVector_ReturnValue) == 0x000258, "Member 'SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000270, "Member 'SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand, CallFunc_BreakRotator_Roll_1) == 0x000288, "Member 'SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand, CallFunc_BreakRotator_Pitch_1) == 0x00028C, "Member 'SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand, CallFunc_BreakRotator_Yaw_1) == 0x000290, "Member 'SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000298, "Member 'SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x0002A0, "Member 'SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand, CallFunc_Add_DoubleDouble_ReturnValue_2) == 0x0002A8, "Member 'SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand::CallFunc_Add_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand, CallFunc_MakeRotator_ReturnValue) == 0x0002B0, "Member 'SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand, CallFunc_MakeTransform_ReturnValue_1) == 0x0002D0, "Member 'SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000330, "Member 'SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000338, "Member 'SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand, CallFunc_FinishSpawningActor_ReturnValue) == 0x000340, "Member 'SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000348, "Member 'SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2) == 0x000350, "Member 'SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3) == 0x000358, "Member 'SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand, CallFunc_FinishSpawningActor_ReturnValue_2) == 0x000360, "Member 'SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand::CallFunc_FinishSpawningActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand, CallFunc_FinishSpawningActor_ReturnValue_3) == 0x000368, "Member 'SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand::CallFunc_FinishSpawningActor_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x000370, "Member 'SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand, CallFunc_Add_DoubleDouble_B_ImplicitCast_1) == 0x000378, "Member 'SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand::CallFunc_Add_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand, CallFunc_Add_DoubleDouble_B_ImplicitCast_2) == 0x000380, "Member 'SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand::CallFunc_Add_DoubleDouble_B_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000388, "Member 'SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand, CallFunc_Add_DoubleDouble_A_ImplicitCast_1) == 0x000390, "Member 'SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand::CallFunc_Add_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand, CallFunc_Add_DoubleDouble_A_ImplicitCast_2) == 0x000398, "Member 'SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand::CallFunc_Add_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand, CallFunc_MakeRotator_Roll_ImplicitCast) == 0x0003A0, "Member 'SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand::CallFunc_MakeRotator_Roll_ImplicitCast' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x0003A4, "Member 'SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand, CallFunc_MakeRotator_Pitch_ImplicitCast) == 0x0003A8, "Member 'SurvivalPlayer_V2_C_ActivateEquippedGrenadeInHand::CallFunc_MakeRotator_Pitch_ImplicitCast' has a wrong offset!");

// Function SurvivalPlayer_V2.SurvivalPlayer_V2_C.ActivateGrenade(Multicast)
// 0x0030 (0x0030 - 0x0000)
struct SurvivalPlayer_V2_C_ActivateGrenade_Multicast_ final
{
public:
	TSoftClassPtr<class UClass>                   Param_Class;                                       // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(SurvivalPlayer_V2_C_ActivateGrenade_Multicast_) == 0x000008, "Wrong alignment on SurvivalPlayer_V2_C_ActivateGrenade_Multicast_");
static_assert(sizeof(SurvivalPlayer_V2_C_ActivateGrenade_Multicast_) == 0x000030, "Wrong size on SurvivalPlayer_V2_C_ActivateGrenade_Multicast_");
static_assert(offsetof(SurvivalPlayer_V2_C_ActivateGrenade_Multicast_, Param_Class) == 0x000000, "Member 'SurvivalPlayer_V2_C_ActivateGrenade_Multicast_::Param_Class' has a wrong offset!");

// Function SurvivalPlayer_V2.SurvivalPlayer_V2_C.AnimGetGrenade(Multicast)
// 0x0010 (0x0010 - 0x0000)
struct SurvivalPlayer_V2_C_AnimGetGrenade_Multicast_ final
{
public:
	class UClass*                                 GrenadeFake;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          EquipNew;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SurvivalPlayer_V2_C_AnimGetGrenade_Multicast_) == 0x000008, "Wrong alignment on SurvivalPlayer_V2_C_AnimGetGrenade_Multicast_");
static_assert(sizeof(SurvivalPlayer_V2_C_AnimGetGrenade_Multicast_) == 0x000010, "Wrong size on SurvivalPlayer_V2_C_AnimGetGrenade_Multicast_");
static_assert(offsetof(SurvivalPlayer_V2_C_AnimGetGrenade_Multicast_, GrenadeFake) == 0x000000, "Member 'SurvivalPlayer_V2_C_AnimGetGrenade_Multicast_::GrenadeFake' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_AnimGetGrenade_Multicast_, EquipNew) == 0x000008, "Member 'SurvivalPlayer_V2_C_AnimGetGrenade_Multicast_::EquipNew' has a wrong offset!");

// Function SurvivalPlayer_V2.SurvivalPlayer_V2_C.AnimGetGrenade_Server
// 0x0010 (0x0010 - 0x0000)
struct SurvivalPlayer_V2_C_AnimGetGrenade_Server final
{
public:
	class UClass*                                 NewParam;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          EquipNew;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SurvivalPlayer_V2_C_AnimGetGrenade_Server) == 0x000008, "Wrong alignment on SurvivalPlayer_V2_C_AnimGetGrenade_Server");
static_assert(sizeof(SurvivalPlayer_V2_C_AnimGetGrenade_Server) == 0x000010, "Wrong size on SurvivalPlayer_V2_C_AnimGetGrenade_Server");
static_assert(offsetof(SurvivalPlayer_V2_C_AnimGetGrenade_Server, NewParam) == 0x000000, "Member 'SurvivalPlayer_V2_C_AnimGetGrenade_Server::NewParam' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_AnimGetGrenade_Server, EquipNew) == 0x000008, "Member 'SurvivalPlayer_V2_C_AnimGetGrenade_Server::EquipNew' has a wrong offset!");

// Function SurvivalPlayer_V2.SurvivalPlayer_V2_C.BndEvt__SurvivalPlayer_V2_CapsuleComponent_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature
// 0x0118 (0x0118 - 0x0000)
struct SurvivalPlayer_V2_C_BndEvt__SurvivalPlayer_V2_CapsuleComponent_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0030(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(SurvivalPlayer_V2_C_BndEvt__SurvivalPlayer_V2_CapsuleComponent_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature) == 0x000008, "Wrong alignment on SurvivalPlayer_V2_C_BndEvt__SurvivalPlayer_V2_CapsuleComponent_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature");
static_assert(sizeof(SurvivalPlayer_V2_C_BndEvt__SurvivalPlayer_V2_CapsuleComponent_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature) == 0x000118, "Wrong size on SurvivalPlayer_V2_C_BndEvt__SurvivalPlayer_V2_CapsuleComponent_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature");
static_assert(offsetof(SurvivalPlayer_V2_C_BndEvt__SurvivalPlayer_V2_CapsuleComponent_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature, HitComponent) == 0x000000, "Member 'SurvivalPlayer_V2_C_BndEvt__SurvivalPlayer_V2_CapsuleComponent_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature::HitComponent' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_BndEvt__SurvivalPlayer_V2_CapsuleComponent_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'SurvivalPlayer_V2_C_BndEvt__SurvivalPlayer_V2_CapsuleComponent_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_BndEvt__SurvivalPlayer_V2_CapsuleComponent_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'SurvivalPlayer_V2_C_BndEvt__SurvivalPlayer_V2_CapsuleComponent_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_BndEvt__SurvivalPlayer_V2_CapsuleComponent_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature, NormalImpulse) == 0x000018, "Member 'SurvivalPlayer_V2_C_BndEvt__SurvivalPlayer_V2_CapsuleComponent_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature::NormalImpulse' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_BndEvt__SurvivalPlayer_V2_CapsuleComponent_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature, Hit) == 0x000030, "Member 'SurvivalPlayer_V2_C_BndEvt__SurvivalPlayer_V2_CapsuleComponent_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature::Hit' has a wrong offset!");

// Function SurvivalPlayer_V2.SurvivalPlayer_V2_C.BndEvt__SurvivalPlayer_V2_CapsuleComponent_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct SurvivalPlayer_V2_C_BndEvt__SurvivalPlayer_V2_CapsuleComponent_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(SurvivalPlayer_V2_C_BndEvt__SurvivalPlayer_V2_CapsuleComponent_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on SurvivalPlayer_V2_C_BndEvt__SurvivalPlayer_V2_CapsuleComponent_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(SurvivalPlayer_V2_C_BndEvt__SurvivalPlayer_V2_CapsuleComponent_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on SurvivalPlayer_V2_C_BndEvt__SurvivalPlayer_V2_CapsuleComponent_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(SurvivalPlayer_V2_C_BndEvt__SurvivalPlayer_V2_CapsuleComponent_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'SurvivalPlayer_V2_C_BndEvt__SurvivalPlayer_V2_CapsuleComponent_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_BndEvt__SurvivalPlayer_V2_CapsuleComponent_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'SurvivalPlayer_V2_C_BndEvt__SurvivalPlayer_V2_CapsuleComponent_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_BndEvt__SurvivalPlayer_V2_CapsuleComponent_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'SurvivalPlayer_V2_C_BndEvt__SurvivalPlayer_V2_CapsuleComponent_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_BndEvt__SurvivalPlayer_V2_CapsuleComponent_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'SurvivalPlayer_V2_C_BndEvt__SurvivalPlayer_V2_CapsuleComponent_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_BndEvt__SurvivalPlayer_V2_CapsuleComponent_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'SurvivalPlayer_V2_C_BndEvt__SurvivalPlayer_V2_CapsuleComponent_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_BndEvt__SurvivalPlayer_V2_CapsuleComponent_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'SurvivalPlayer_V2_C_BndEvt__SurvivalPlayer_V2_CapsuleComponent_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function SurvivalPlayer_V2.SurvivalPlayer_V2_C.BndEvt__SurvivalPlayer_V2_CapsuleComponent_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct SurvivalPlayer_V2_C_BndEvt__SurvivalPlayer_V2_CapsuleComponent_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SurvivalPlayer_V2_C_BndEvt__SurvivalPlayer_V2_CapsuleComponent_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on SurvivalPlayer_V2_C_BndEvt__SurvivalPlayer_V2_CapsuleComponent_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(SurvivalPlayer_V2_C_BndEvt__SurvivalPlayer_V2_CapsuleComponent_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on SurvivalPlayer_V2_C_BndEvt__SurvivalPlayer_V2_CapsuleComponent_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(SurvivalPlayer_V2_C_BndEvt__SurvivalPlayer_V2_CapsuleComponent_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'SurvivalPlayer_V2_C_BndEvt__SurvivalPlayer_V2_CapsuleComponent_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_BndEvt__SurvivalPlayer_V2_CapsuleComponent_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'SurvivalPlayer_V2_C_BndEvt__SurvivalPlayer_V2_CapsuleComponent_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_BndEvt__SurvivalPlayer_V2_CapsuleComponent_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'SurvivalPlayer_V2_C_BndEvt__SurvivalPlayer_V2_CapsuleComponent_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_BndEvt__SurvivalPlayer_V2_CapsuleComponent_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'SurvivalPlayer_V2_C_BndEvt__SurvivalPlayer_V2_CapsuleComponent_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function SurvivalPlayer_V2.SurvivalPlayer_V2_C.CallThrowableEquipAnim
// 0x0010 (0x0010 - 0x0000)
struct SurvivalPlayer_V2_C_CallThrowableEquipAnim final
{
public:
	class UClass*                                 ThrowableFakeClass;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          EquipNew;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SurvivalPlayer_V2_C_CallThrowableEquipAnim) == 0x000008, "Wrong alignment on SurvivalPlayer_V2_C_CallThrowableEquipAnim");
static_assert(sizeof(SurvivalPlayer_V2_C_CallThrowableEquipAnim) == 0x000010, "Wrong size on SurvivalPlayer_V2_C_CallThrowableEquipAnim");
static_assert(offsetof(SurvivalPlayer_V2_C_CallThrowableEquipAnim, ThrowableFakeClass) == 0x000000, "Member 'SurvivalPlayer_V2_C_CallThrowableEquipAnim::ThrowableFakeClass' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_CallThrowableEquipAnim, EquipNew) == 0x000008, "Member 'SurvivalPlayer_V2_C_CallThrowableEquipAnim::EquipNew' has a wrong offset!");

// Function SurvivalPlayer_V2.SurvivalPlayer_V2_C.CanThrowGrenade
// 0x0058 (0x0058 - 0x0000)
struct SurvivalPlayer_V2_C_CanThrowGrenade final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetItemCountByName_ReturnedCount;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_StriStri_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC;                  // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_TabsWindow_C*                        CallFunc_GetTabsWidget_Widget;                     // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_6;                // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_7;                 // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_8;                 // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_9;                 // 0x004F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_10;                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_11;                // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SurvivalPlayer_V2_C_CanThrowGrenade) == 0x000008, "Wrong alignment on SurvivalPlayer_V2_C_CanThrowGrenade");
static_assert(sizeof(SurvivalPlayer_V2_C_CanThrowGrenade) == 0x000058, "Wrong size on SurvivalPlayer_V2_C_CanThrowGrenade");
static_assert(offsetof(SurvivalPlayer_V2_C_CanThrowGrenade, ReturnValue) == 0x000000, "Member 'SurvivalPlayer_V2_C_CanThrowGrenade::ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_CanThrowGrenade, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'SurvivalPlayer_V2_C_CanThrowGrenade::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_CanThrowGrenade, CallFunc_GetItemCountByName_ReturnedCount) == 0x000004, "Member 'SurvivalPlayer_V2_C_CanThrowGrenade::CallFunc_GetItemCountByName_ReturnedCount' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_CanThrowGrenade, CallFunc_NotEqual_StriStri_ReturnValue) == 0x000008, "Member 'SurvivalPlayer_V2_C_CanThrowGrenade::CallFunc_NotEqual_StriStri_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_CanThrowGrenade, CallFunc_Greater_IntInt_ReturnValue) == 0x000009, "Member 'SurvivalPlayer_V2_C_CanThrowGrenade::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_CanThrowGrenade, CallFunc_BooleanAND_ReturnValue) == 0x00000A, "Member 'SurvivalPlayer_V2_C_CanThrowGrenade::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_CanThrowGrenade, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00000B, "Member 'SurvivalPlayer_V2_C_CanThrowGrenade::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_CanThrowGrenade, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'SurvivalPlayer_V2_C_CanThrowGrenade::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_CanThrowGrenade, CallFunc_Not_PreBool_ReturnValue_1) == 0x000018, "Member 'SurvivalPlayer_V2_C_CanThrowGrenade::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_CanThrowGrenade, K2Node_DynamicCast_AsBPI_Surv_PC) == 0x000020, "Member 'SurvivalPlayer_V2_C_CanThrowGrenade::K2Node_DynamicCast_AsBPI_Surv_PC' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_CanThrowGrenade, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'SurvivalPlayer_V2_C_CanThrowGrenade::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_CanThrowGrenade, CallFunc_GetTabsWidget_Widget) == 0x000038, "Member 'SurvivalPlayer_V2_C_CanThrowGrenade::CallFunc_GetTabsWidget_Widget' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_CanThrowGrenade, CallFunc_Not_PreBool_ReturnValue_2) == 0x000040, "Member 'SurvivalPlayer_V2_C_CanThrowGrenade::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_CanThrowGrenade, CallFunc_Not_PreBool_ReturnValue_3) == 0x000041, "Member 'SurvivalPlayer_V2_C_CanThrowGrenade::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_CanThrowGrenade, CallFunc_Not_PreBool_ReturnValue_4) == 0x000042, "Member 'SurvivalPlayer_V2_C_CanThrowGrenade::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_CanThrowGrenade, CallFunc_Not_PreBool_ReturnValue_5) == 0x000043, "Member 'SurvivalPlayer_V2_C_CanThrowGrenade::CallFunc_Not_PreBool_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_CanThrowGrenade, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000044, "Member 'SurvivalPlayer_V2_C_CanThrowGrenade::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_CanThrowGrenade, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x000045, "Member 'SurvivalPlayer_V2_C_CanThrowGrenade::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_CanThrowGrenade, CallFunc_Not_PreBool_ReturnValue_6) == 0x000046, "Member 'SurvivalPlayer_V2_C_CanThrowGrenade::CallFunc_Not_PreBool_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_CanThrowGrenade, CallFunc_BooleanAND_ReturnValue_1) == 0x000047, "Member 'SurvivalPlayer_V2_C_CanThrowGrenade::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_CanThrowGrenade, CallFunc_BooleanAND_ReturnValue_2) == 0x000048, "Member 'SurvivalPlayer_V2_C_CanThrowGrenade::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_CanThrowGrenade, CallFunc_BooleanAND_ReturnValue_3) == 0x000049, "Member 'SurvivalPlayer_V2_C_CanThrowGrenade::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_CanThrowGrenade, CallFunc_BooleanAND_ReturnValue_4) == 0x00004A, "Member 'SurvivalPlayer_V2_C_CanThrowGrenade::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_CanThrowGrenade, CallFunc_BooleanAND_ReturnValue_5) == 0x00004B, "Member 'SurvivalPlayer_V2_C_CanThrowGrenade::CallFunc_BooleanAND_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_CanThrowGrenade, CallFunc_BooleanAND_ReturnValue_6) == 0x00004C, "Member 'SurvivalPlayer_V2_C_CanThrowGrenade::CallFunc_BooleanAND_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_CanThrowGrenade, CallFunc_BooleanAND_ReturnValue_7) == 0x00004D, "Member 'SurvivalPlayer_V2_C_CanThrowGrenade::CallFunc_BooleanAND_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_CanThrowGrenade, CallFunc_BooleanAND_ReturnValue_8) == 0x00004E, "Member 'SurvivalPlayer_V2_C_CanThrowGrenade::CallFunc_BooleanAND_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_CanThrowGrenade, CallFunc_BooleanAND_ReturnValue_9) == 0x00004F, "Member 'SurvivalPlayer_V2_C_CanThrowGrenade::CallFunc_BooleanAND_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_CanThrowGrenade, CallFunc_BooleanAND_ReturnValue_10) == 0x000050, "Member 'SurvivalPlayer_V2_C_CanThrowGrenade::CallFunc_BooleanAND_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_CanThrowGrenade, CallFunc_BooleanAND_ReturnValue_11) == 0x000051, "Member 'SurvivalPlayer_V2_C_CanThrowGrenade::CallFunc_BooleanAND_ReturnValue_11' has a wrong offset!");

// Function SurvivalPlayer_V2.SurvivalPlayer_V2_C.Change Grenade Server
// 0x0040 (0x0040 - 0x0000)
struct SurvivalPlayer_V2_C_Change_Grenade_Server final
{
public:
	class FString                                 Name_Grenade;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Param_Throw_Weapon;                                // 0x0010(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(SurvivalPlayer_V2_C_Change_Grenade_Server) == 0x000008, "Wrong alignment on SurvivalPlayer_V2_C_Change_Grenade_Server");
static_assert(sizeof(SurvivalPlayer_V2_C_Change_Grenade_Server) == 0x000040, "Wrong size on SurvivalPlayer_V2_C_Change_Grenade_Server");
static_assert(offsetof(SurvivalPlayer_V2_C_Change_Grenade_Server, Name_Grenade) == 0x000000, "Member 'SurvivalPlayer_V2_C_Change_Grenade_Server::Name_Grenade' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_Change_Grenade_Server, Param_Throw_Weapon) == 0x000010, "Member 'SurvivalPlayer_V2_C_Change_Grenade_Server::Param_Throw_Weapon' has a wrong offset!");

// Function SurvivalPlayer_V2.SurvivalPlayer_V2_C.Change Material Param Color
// 0x0090 (0x0090 - 0x0000)
struct SurvivalPlayer_V2_C_Change_Material_Param_Color final
{
public:
	TArray<class USkeletalMeshComponent*>         Array;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class FName                                   ParameterName;                                     // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Value;                                             // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue;                 // 0x0058(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_Array_Get_Item_1;                         // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SurvivalPlayer_V2_C_Change_Material_Param_Color) == 0x000008, "Wrong alignment on SurvivalPlayer_V2_C_Change_Material_Param_Color");
static_assert(sizeof(SurvivalPlayer_V2_C_Change_Material_Param_Color) == 0x000090, "Wrong size on SurvivalPlayer_V2_C_Change_Material_Param_Color");
static_assert(offsetof(SurvivalPlayer_V2_C_Change_Material_Param_Color, Array) == 0x000000, "Member 'SurvivalPlayer_V2_C_Change_Material_Param_Color::Array' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_Change_Material_Param_Color, ParameterName) == 0x000010, "Member 'SurvivalPlayer_V2_C_Change_Material_Param_Color::ParameterName' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_Change_Material_Param_Color, Value) == 0x000018, "Member 'SurvivalPlayer_V2_C_Change_Material_Param_Color::Value' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_Change_Material_Param_Color, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'SurvivalPlayer_V2_C_Change_Material_Param_Color::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_Change_Material_Param_Color, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'SurvivalPlayer_V2_C_Change_Material_Param_Color::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_V2_C_Change_Material_Param_Color, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'SurvivalPlayer_V2_C_Change_Material_Param_Color::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
