#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SurvPC

#include "Basic.hpp"

#include "DefaultItemInfo_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_HouseType_structs.hpp"
#include "Engine_structs.hpp"
#include "E_TabType_structs.hpp"
#include "QuestFramework_structs.hpp"
#include "DropItemEntry_structs.hpp"
#include "AISpawnZoneType_structs.hpp"
#include "ZoneAnalyzer_structs.hpp"
#include "LG2_LootRareType_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "LootGeneratorType_structs.hpp"
#include "FMODStudio_structs.hpp"
#include "ChatType_structs.hpp"
#include "FirebaseFeatures_structs.hpp"
#include "NPC_Structure_structs.hpp"
#include "E_Works_structs.hpp"
#include "InputCore_structs.hpp"
#include "UMG_structs.hpp"
#include "F_RPZoneInfo_structs.hpp"
#include "Enum_WarningMessageType_structs.hpp"
#include "BPE_FireMode_structs.hpp"


namespace SDK::Params
{

// Function SurvPC.SurvPC_C.ActivateTowersIconsGPS
// 0x0038 (0x0038 - 0x0000)
struct SurvPC_C_ActivateTowersIconsGPS final
{
public:
	bool                                          IconHiden;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_QuestZone_C*                        CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_QuestZone_Towers_C*                 K2Node_DynamicCast_AsBP_Quest_Zone_Towers;         // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SurvPC_C_ActivateTowersIconsGPS) == 0x000008, "Wrong alignment on SurvPC_C_ActivateTowersIconsGPS");
static_assert(sizeof(SurvPC_C_ActivateTowersIconsGPS) == 0x000038, "Wrong size on SurvPC_C_ActivateTowersIconsGPS");
static_assert(offsetof(SurvPC_C_ActivateTowersIconsGPS, IconHiden) == 0x000000, "Member 'SurvPC_C_ActivateTowersIconsGPS::IconHiden' has a wrong offset!");
static_assert(offsetof(SurvPC_C_ActivateTowersIconsGPS, Temp_int_Array_Index_Variable) == 0x000004, "Member 'SurvPC_C_ActivateTowersIconsGPS::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SurvPC_C_ActivateTowersIconsGPS, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'SurvPC_C_ActivateTowersIconsGPS::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SurvPC_C_ActivateTowersIconsGPS, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'SurvPC_C_ActivateTowersIconsGPS::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvPC_C_ActivateTowersIconsGPS, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'SurvPC_C_ActivateTowersIconsGPS::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvPC_C_ActivateTowersIconsGPS, CallFunc_Array_Get_Item) == 0x000018, "Member 'SurvPC_C_ActivateTowersIconsGPS::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SurvPC_C_ActivateTowersIconsGPS, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'SurvPC_C_ActivateTowersIconsGPS::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvPC_C_ActivateTowersIconsGPS, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'SurvPC_C_ActivateTowersIconsGPS::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvPC_C_ActivateTowersIconsGPS, K2Node_DynamicCast_AsBP_Quest_Zone_Towers) == 0x000028, "Member 'SurvPC_C_ActivateTowersIconsGPS::K2Node_DynamicCast_AsBP_Quest_Zone_Towers' has a wrong offset!");
static_assert(offsetof(SurvPC_C_ActivateTowersIconsGPS, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'SurvPC_C_ActivateTowersIconsGPS::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function SurvPC.SurvPC_C.Add Bullet Decal
// 0x0008 (0x0008 - 0x0000)
struct SurvPC_C_Add_Bullet_Decal final
{
public:
	const class UDecalComponent*                  NewItem;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SurvPC_C_Add_Bullet_Decal) == 0x000008, "Wrong alignment on SurvPC_C_Add_Bullet_Decal");
static_assert(sizeof(SurvPC_C_Add_Bullet_Decal) == 0x000008, "Wrong size on SurvPC_C_Add_Bullet_Decal");
static_assert(offsetof(SurvPC_C_Add_Bullet_Decal, NewItem) == 0x000000, "Member 'SurvPC_C_Add_Bullet_Decal::NewItem' has a wrong offset!");

// Function SurvPC.SurvPC_C.AddNew2DSound
// 0x0038 (0x0038 - 0x0000)
struct SurvPC_C_AddNew2DSound final
{
public:
	struct FFMODEventInstance                     NewItem;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFMODEventInstance                     CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EventInstanceIsValid_ReturnValue;         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SurvPC_C_AddNew2DSound) == 0x000008, "Wrong alignment on SurvPC_C_AddNew2DSound");
static_assert(sizeof(SurvPC_C_AddNew2DSound) == 0x000038, "Wrong size on SurvPC_C_AddNew2DSound");
static_assert(offsetof(SurvPC_C_AddNew2DSound, NewItem) == 0x000000, "Member 'SurvPC_C_AddNew2DSound::NewItem' has a wrong offset!");
static_assert(offsetof(SurvPC_C_AddNew2DSound, Temp_int_Array_Index_Variable) == 0x000008, "Member 'SurvPC_C_AddNew2DSound::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SurvPC_C_AddNew2DSound, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'SurvPC_C_AddNew2DSound::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SurvPC_C_AddNew2DSound, CallFunc_Subtract_IntInt_ReturnValue) == 0x000010, "Member 'SurvPC_C_AddNew2DSound::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvPC_C_AddNew2DSound, CallFunc_Array_Add_ReturnValue) == 0x000014, "Member 'SurvPC_C_AddNew2DSound::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvPC_C_AddNew2DSound, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000018, "Member 'SurvPC_C_AddNew2DSound::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvPC_C_AddNew2DSound, CallFunc_Array_Get_Item) == 0x000020, "Member 'SurvPC_C_AddNew2DSound::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SurvPC_C_AddNew2DSound, CallFunc_EventInstanceIsValid_ReturnValue) == 0x000028, "Member 'SurvPC_C_AddNew2DSound::CallFunc_EventInstanceIsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvPC_C_AddNew2DSound, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'SurvPC_C_AddNew2DSound::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvPC_C_AddNew2DSound, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000030, "Member 'SurvPC_C_AddNew2DSound::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SurvPC_C_AddNew2DSound, CallFunc_Max_ReturnValue) == 0x000034, "Member 'SurvPC_C_AddNew2DSound::CallFunc_Max_ReturnValue' has a wrong offset!");

// Function SurvPC.SurvPC_C.AddSkillPoint
// 0x0008 (0x0008 - 0x0000)
struct SurvPC_C_AddSkillPoint final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SurvPC_C_AddSkillPoint) == 0x000004, "Wrong alignment on SurvPC_C_AddSkillPoint");
static_assert(sizeof(SurvPC_C_AddSkillPoint) == 0x000008, "Wrong size on SurvPC_C_AddSkillPoint");
static_assert(offsetof(SurvPC_C_AddSkillPoint, Value) == 0x000000, "Member 'SurvPC_C_AddSkillPoint::Value' has a wrong offset!");
static_assert(offsetof(SurvPC_C_AddSkillPoint, Success) == 0x000004, "Member 'SurvPC_C_AddSkillPoint::Success' has a wrong offset!");

// Function SurvPC.SurvPC_C.AddXP
// 0x0020 (0x0020 - 0x0000)
struct SurvPC_C_AddXP final
{
public:
	double                                        XP;                                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Sender;                                            // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(SurvPC_C_AddXP) == 0x000008, "Wrong alignment on SurvPC_C_AddXP");
static_assert(sizeof(SurvPC_C_AddXP) == 0x000020, "Wrong size on SurvPC_C_AddXP");
static_assert(offsetof(SurvPC_C_AddXP, XP) == 0x000000, "Member 'SurvPC_C_AddXP::XP' has a wrong offset!");
static_assert(offsetof(SurvPC_C_AddXP, Sender) == 0x000008, "Member 'SurvPC_C_AddXP::Sender' has a wrong offset!");

// Function SurvPC.SurvPC_C.BeginQuestTrack
// 0x0008 (0x0008 - 0x0000)
struct SurvPC_C_BeginQuestTrack final
{
public:
	class UQuestContext*                          Context;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SurvPC_C_BeginQuestTrack) == 0x000008, "Wrong alignment on SurvPC_C_BeginQuestTrack");
static_assert(sizeof(SurvPC_C_BeginQuestTrack) == 0x000008, "Wrong size on SurvPC_C_BeginQuestTrack");
static_assert(offsetof(SurvPC_C_BeginQuestTrack, Context) == 0x000000, "Member 'SurvPC_C_BeginQuestTrack::Context' has a wrong offset!");

// Function SurvPC.SurvPC_C.BindShowTutorialQuestReward
// 0x0088 (0x0088 - 0x0000)
struct SurvPC_C_BindShowTutorialQuestReward final
{
public:
	class FText                                   QuestName;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   QuestText;                                         // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	TMap<class FString, int32>                    Param_Reward_Items;                                // 0x0030(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         Param_Reward_Rp;                                   // 0x0080(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SurvPC_C_BindShowTutorialQuestReward) == 0x000008, "Wrong alignment on SurvPC_C_BindShowTutorialQuestReward");
static_assert(sizeof(SurvPC_C_BindShowTutorialQuestReward) == 0x000088, "Wrong size on SurvPC_C_BindShowTutorialQuestReward");
static_assert(offsetof(SurvPC_C_BindShowTutorialQuestReward, QuestName) == 0x000000, "Member 'SurvPC_C_BindShowTutorialQuestReward::QuestName' has a wrong offset!");
static_assert(offsetof(SurvPC_C_BindShowTutorialQuestReward, QuestText) == 0x000018, "Member 'SurvPC_C_BindShowTutorialQuestReward::QuestText' has a wrong offset!");
static_assert(offsetof(SurvPC_C_BindShowTutorialQuestReward, Param_Reward_Items) == 0x000030, "Member 'SurvPC_C_BindShowTutorialQuestReward::Param_Reward_Items' has a wrong offset!");
static_assert(offsetof(SurvPC_C_BindShowTutorialQuestReward, Param_Reward_Rp) == 0x000080, "Member 'SurvPC_C_BindShowTutorialQuestReward::Param_Reward_Rp' has a wrong offset!");

// Function SurvPC.SurvPC_C.BlockControlRotation
// 0x0001 (0x0001 - 0x0000)
struct SurvPC_C_BlockControlRotation final
{
public:
	bool                                          SetBlock;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SurvPC_C_BlockControlRotation) == 0x000001, "Wrong alignment on SurvPC_C_BlockControlRotation");
static_assert(sizeof(SurvPC_C_BlockControlRotation) == 0x000001, "Wrong size on SurvPC_C_BlockControlRotation");
static_assert(offsetof(SurvPC_C_BlockControlRotation, SetBlock) == 0x000000, "Member 'SurvPC_C_BlockControlRotation::SetBlock' has a wrong offset!");

// Function SurvPC.SurvPC_C.ChangeQuestHint
// 0x0010 (0x0010 - 0x0000)
struct SurvPC_C_ChangeQuestHint final
{
public:
	class FString                                 Hint;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(SurvPC_C_ChangeQuestHint) == 0x000008, "Wrong alignment on SurvPC_C_ChangeQuestHint");
static_assert(sizeof(SurvPC_C_ChangeQuestHint) == 0x000010, "Wrong size on SurvPC_C_ChangeQuestHint");
static_assert(offsetof(SurvPC_C_ChangeQuestHint, Hint) == 0x000000, "Member 'SurvPC_C_ChangeQuestHint::Hint' has a wrong offset!");

// Function SurvPC.SurvPC_C.CheckRenderedPawn_MULTI
// 0x0008 (0x0008 - 0x0000)
struct SurvPC_C_CheckRenderedPawn_MULTI final
{
public:
	class AActor*                                 Param_Pawn;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SurvPC_C_CheckRenderedPawn_MULTI) == 0x000008, "Wrong alignment on SurvPC_C_CheckRenderedPawn_MULTI");
static_assert(sizeof(SurvPC_C_CheckRenderedPawn_MULTI) == 0x000008, "Wrong size on SurvPC_C_CheckRenderedPawn_MULTI");
static_assert(offsetof(SurvPC_C_CheckRenderedPawn_MULTI, Param_Pawn) == 0x000000, "Member 'SurvPC_C_CheckRenderedPawn_MULTI::Param_Pawn' has a wrong offset!");

// Function SurvPC.SurvPC_C.CheckRenderedPawn_SERV
// 0x0001 (0x0001 - 0x0000)
struct SurvPC_C_CheckRenderedPawn_SERV final
{
public:
	bool                                          IsRendered;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SurvPC_C_CheckRenderedPawn_SERV) == 0x000001, "Wrong alignment on SurvPC_C_CheckRenderedPawn_SERV");
static_assert(sizeof(SurvPC_C_CheckRenderedPawn_SERV) == 0x000001, "Wrong size on SurvPC_C_CheckRenderedPawn_SERV");
static_assert(offsetof(SurvPC_C_CheckRenderedPawn_SERV, IsRendered) == 0x000000, "Member 'SurvPC_C_CheckRenderedPawn_SERV::IsRendered' has a wrong offset!");

// Function SurvPC.SurvPC_C.ClientShowAllDeers
// 0x0010 (0x0010 - 0x0000)
struct SurvPC_C_ClientShowAllDeers final
{
public:
	TArray<class ABP_DeerV2_C*>                   Deers;                                             // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(SurvPC_C_ClientShowAllDeers) == 0x000008, "Wrong alignment on SurvPC_C_ClientShowAllDeers");
static_assert(sizeof(SurvPC_C_ClientShowAllDeers) == 0x000010, "Wrong size on SurvPC_C_ClientShowAllDeers");
static_assert(offsetof(SurvPC_C_ClientShowAllDeers, Deers) == 0x000000, "Member 'SurvPC_C_ClientShowAllDeers::Deers' has a wrong offset!");

// Function SurvPC.SurvPC_C.CloseTabsWindow
// 0x0020 (0x0020 - 0x0000)
struct SurvPC_C_CloseTabsWindow final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SurvPC_C_CloseTabsWindow) == 0x000008, "Wrong alignment on SurvPC_C_CloseTabsWindow");
static_assert(sizeof(SurvPC_C_CloseTabsWindow) == 0x000020, "Wrong size on SurvPC_C_CloseTabsWindow");
static_assert(offsetof(SurvPC_C_CloseTabsWindow, Success) == 0x000000, "Member 'SurvPC_C_CloseTabsWindow::Success' has a wrong offset!");
static_assert(offsetof(SurvPC_C_CloseTabsWindow, CallFunc_K2_GetPawn_ReturnValue) == 0x000008, "Member 'SurvPC_C_CloseTabsWindow::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvPC_C_CloseTabsWindow, K2Node_DynamicCast_AsSurvival_Player) == 0x000010, "Member 'SurvPC_C_CloseTabsWindow::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(SurvPC_C_CloseTabsWindow, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'SurvPC_C_CloseTabsWindow::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function SurvPC.SurvPC_C.CompleteQuest_Owning
// 0x0010 (0x0010 - 0x0000)
struct SurvPC_C_CompleteQuest_Owning final
{
public:
	struct FGameplayTag                           MessageTag;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class UQuest*                                 Quest;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SurvPC_C_CompleteQuest_Owning) == 0x000008, "Wrong alignment on SurvPC_C_CompleteQuest_Owning");
static_assert(sizeof(SurvPC_C_CompleteQuest_Owning) == 0x000010, "Wrong size on SurvPC_C_CompleteQuest_Owning");
static_assert(offsetof(SurvPC_C_CompleteQuest_Owning, MessageTag) == 0x000000, "Member 'SurvPC_C_CompleteQuest_Owning::MessageTag' has a wrong offset!");
static_assert(offsetof(SurvPC_C_CompleteQuest_Owning, Quest) == 0x000008, "Member 'SurvPC_C_CompleteQuest_Owning::Quest' has a wrong offset!");

// Function SurvPC.SurvPC_C.CompleteQuest_Serv
// 0x0010 (0x0010 - 0x0000)
struct SurvPC_C_CompleteQuest_Serv final
{
public:
	struct FGameplayTag                           MessageTag;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class UQuest*                                 Quest;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SurvPC_C_CompleteQuest_Serv) == 0x000008, "Wrong alignment on SurvPC_C_CompleteQuest_Serv");
static_assert(sizeof(SurvPC_C_CompleteQuest_Serv) == 0x000010, "Wrong size on SurvPC_C_CompleteQuest_Serv");
static_assert(offsetof(SurvPC_C_CompleteQuest_Serv, MessageTag) == 0x000000, "Member 'SurvPC_C_CompleteQuest_Serv::MessageTag' has a wrong offset!");
static_assert(offsetof(SurvPC_C_CompleteQuest_Serv, Quest) == 0x000008, "Member 'SurvPC_C_CompleteQuest_Serv::Quest' has a wrong offset!");

// Function SurvPC.SurvPC_C.ConfirmJoin
// 0x0010 (0x0010 - 0x0000)
struct SurvPC_C_ConfirmJoin final
{
public:
	class FString                                 PlayFabID;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(SurvPC_C_ConfirmJoin) == 0x000008, "Wrong alignment on SurvPC_C_ConfirmJoin");
static_assert(sizeof(SurvPC_C_ConfirmJoin) == 0x000010, "Wrong size on SurvPC_C_ConfirmJoin");
static_assert(offsetof(SurvPC_C_ConfirmJoin, PlayFabID) == 0x000000, "Member 'SurvPC_C_ConfirmJoin::PlayFabID' has a wrong offset!");

// Function SurvPC.SurvPC_C.ControlOriginByDistance
// 0x0028 (0x0028 - 0x0000)
struct SurvPC_C_ControlOriginByDistance final
{
public:
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSizeXY_ReturnValue;                      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SurvPC_C_ControlOriginByDistance) == 0x000008, "Wrong alignment on SurvPC_C_ControlOriginByDistance");
static_assert(sizeof(SurvPC_C_ControlOriginByDistance) == 0x000028, "Wrong size on SurvPC_C_ControlOriginByDistance");
static_assert(offsetof(SurvPC_C_ControlOriginByDistance, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000000, "Member 'SurvPC_C_ControlOriginByDistance::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvPC_C_ControlOriginByDistance, CallFunc_VSizeXY_ReturnValue) == 0x000018, "Member 'SurvPC_C_ControlOriginByDistance::CallFunc_VSizeXY_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvPC_C_ControlOriginByDistance, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000020, "Member 'SurvPC_C_ControlOriginByDistance::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");

// Function SurvPC.SurvPC_C.CreateContainerAtLocation
// 0x0078 (0x0078 - 0x0000)
struct SurvPC_C_CreateContainerAtLocation final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELootGeneratorType                            GenericLootType;                                   // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             CustomAsset;                                       // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   ContainerName;                                     // 0x0028(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FVector                                CustomOffset;                                      // 0x0040(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            CustomMesh;                                        // 0x0058(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        AttachTo;                                          // 0x0060(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   SocketName;                                        // 0x0068(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x0070(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SurvPC_C_CreateContainerAtLocation) == 0x000008, "Wrong alignment on SurvPC_C_CreateContainerAtLocation");
static_assert(sizeof(SurvPC_C_CreateContainerAtLocation) == 0x000078, "Wrong size on SurvPC_C_CreateContainerAtLocation");
static_assert(offsetof(SurvPC_C_CreateContainerAtLocation, Location) == 0x000000, "Member 'SurvPC_C_CreateContainerAtLocation::Location' has a wrong offset!");
static_assert(offsetof(SurvPC_C_CreateContainerAtLocation, GenericLootType) == 0x000018, "Member 'SurvPC_C_CreateContainerAtLocation::GenericLootType' has a wrong offset!");
static_assert(offsetof(SurvPC_C_CreateContainerAtLocation, CustomAsset) == 0x000020, "Member 'SurvPC_C_CreateContainerAtLocation::CustomAsset' has a wrong offset!");
static_assert(offsetof(SurvPC_C_CreateContainerAtLocation, ContainerName) == 0x000028, "Member 'SurvPC_C_CreateContainerAtLocation::ContainerName' has a wrong offset!");
static_assert(offsetof(SurvPC_C_CreateContainerAtLocation, CustomOffset) == 0x000040, "Member 'SurvPC_C_CreateContainerAtLocation::CustomOffset' has a wrong offset!");
static_assert(offsetof(SurvPC_C_CreateContainerAtLocation, CustomMesh) == 0x000058, "Member 'SurvPC_C_CreateContainerAtLocation::CustomMesh' has a wrong offset!");
static_assert(offsetof(SurvPC_C_CreateContainerAtLocation, AttachTo) == 0x000060, "Member 'SurvPC_C_CreateContainerAtLocation::AttachTo' has a wrong offset!");
static_assert(offsetof(SurvPC_C_CreateContainerAtLocation, SocketName) == 0x000068, "Member 'SurvPC_C_CreateContainerAtLocation::SocketName' has a wrong offset!");
static_assert(offsetof(SurvPC_C_CreateContainerAtLocation, Return) == 0x000070, "Member 'SurvPC_C_CreateContainerAtLocation::Return' has a wrong offset!");

// Function SurvPC.SurvPC_C.CreateContainerWithDrop
// 0x05A0 (0x05A0 - 0x0000)
struct SurvPC_C_CreateContainerWithDrop final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 ContainerName;                                     // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                ContainerOffset;                                   // 0x0028(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FDropItemEntry>                 DropItems;                                         // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          Return;                                            // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FDefaultItemInfo>               ContainerItems;                                    // 0x0058(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ConstParm, ReferenceParm)
	struct FDropItemEntry                         CallFunc_Array_Get_Item;                           // 0x0080(0x0240)(ContainsInstancedReference, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDefaultItemInfo                       K2Node_MakeStruct_DefaultItemInfo;                 // 0x02C8(0x0040)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_311[0x3];                                      // 0x0311(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_Down_ReturnValue;                  // 0x0318(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0330(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0340(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0358(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x0370(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0459(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x045A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45B[0x1];                                      // 0x045B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x045C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_464[0x4];                                      // 0x0464(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0468(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0480(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0498(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x04B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x04C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x04D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x04D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x04E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x04E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x04F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x04F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x04F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FC[0x4];                                      // 0x04FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0500(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0518(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0530(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0590(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawnLoot_C*                            CallFunc_FinishSpawningActor_ReturnValue;          // 0x0598(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SurvPC_C_CreateContainerWithDrop) == 0x000010, "Wrong alignment on SurvPC_C_CreateContainerWithDrop");
static_assert(sizeof(SurvPC_C_CreateContainerWithDrop) == 0x0005A0, "Wrong size on SurvPC_C_CreateContainerWithDrop");
static_assert(offsetof(SurvPC_C_CreateContainerWithDrop, Location) == 0x000000, "Member 'SurvPC_C_CreateContainerWithDrop::Location' has a wrong offset!");
static_assert(offsetof(SurvPC_C_CreateContainerWithDrop, ContainerName) == 0x000018, "Member 'SurvPC_C_CreateContainerWithDrop::ContainerName' has a wrong offset!");
static_assert(offsetof(SurvPC_C_CreateContainerWithDrop, ContainerOffset) == 0x000028, "Member 'SurvPC_C_CreateContainerWithDrop::ContainerOffset' has a wrong offset!");
static_assert(offsetof(SurvPC_C_CreateContainerWithDrop, DropItems) == 0x000040, "Member 'SurvPC_C_CreateContainerWithDrop::DropItems' has a wrong offset!");
static_assert(offsetof(SurvPC_C_CreateContainerWithDrop, Return) == 0x000050, "Member 'SurvPC_C_CreateContainerWithDrop::Return' has a wrong offset!");
static_assert(offsetof(SurvPC_C_CreateContainerWithDrop, ContainerItems) == 0x000058, "Member 'SurvPC_C_CreateContainerWithDrop::ContainerItems' has a wrong offset!");
static_assert(offsetof(SurvPC_C_CreateContainerWithDrop, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'SurvPC_C_CreateContainerWithDrop::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvPC_C_CreateContainerWithDrop, Temp_int_Array_Index_Variable) == 0x00006C, "Member 'SurvPC_C_CreateContainerWithDrop::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SurvPC_C_CreateContainerWithDrop, K2Node_MakeArray_Array) == 0x000070, "Member 'SurvPC_C_CreateContainerWithDrop::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(SurvPC_C_CreateContainerWithDrop, CallFunc_Array_Get_Item) == 0x000080, "Member 'SurvPC_C_CreateContainerWithDrop::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SurvPC_C_CreateContainerWithDrop, CallFunc_Conv_StringToName_ReturnValue) == 0x0002C0, "Member 'SurvPC_C_CreateContainerWithDrop::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvPC_C_CreateContainerWithDrop, K2Node_MakeStruct_DefaultItemInfo) == 0x0002C8, "Member 'SurvPC_C_CreateContainerWithDrop::K2Node_MakeStruct_DefaultItemInfo' has a wrong offset!");
static_assert(offsetof(SurvPC_C_CreateContainerWithDrop, Temp_int_Loop_Counter_Variable) == 0x000308, "Member 'SurvPC_C_CreateContainerWithDrop::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SurvPC_C_CreateContainerWithDrop, CallFunc_Array_Add_ReturnValue) == 0x00030C, "Member 'SurvPC_C_CreateContainerWithDrop::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvPC_C_CreateContainerWithDrop, CallFunc_Less_IntInt_ReturnValue) == 0x000310, "Member 'SurvPC_C_CreateContainerWithDrop::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvPC_C_CreateContainerWithDrop, CallFunc_Add_IntInt_ReturnValue) == 0x000314, "Member 'SurvPC_C_CreateContainerWithDrop::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvPC_C_CreateContainerWithDrop, CallFunc_Vector_Down_ReturnValue) == 0x000318, "Member 'SurvPC_C_CreateContainerWithDrop::CallFunc_Vector_Down_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvPC_C_CreateContainerWithDrop, Temp_object_Variable) == 0x000330, "Member 'SurvPC_C_CreateContainerWithDrop::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(SurvPC_C_CreateContainerWithDrop, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000340, "Member 'SurvPC_C_CreateContainerWithDrop::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvPC_C_CreateContainerWithDrop, CallFunc_Add_VectorVector_ReturnValue) == 0x000358, "Member 'SurvPC_C_CreateContainerWithDrop::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvPC_C_CreateContainerWithDrop, CallFunc_LineTraceSingleForObjects_OutHit) == 0x000370, "Member 'SurvPC_C_CreateContainerWithDrop::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(SurvPC_C_CreateContainerWithDrop, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x000458, "Member 'SurvPC_C_CreateContainerWithDrop::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvPC_C_CreateContainerWithDrop, CallFunc_BreakHitResult_bBlockingHit) == 0x000459, "Member 'SurvPC_C_CreateContainerWithDrop::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(SurvPC_C_CreateContainerWithDrop, CallFunc_BreakHitResult_bInitialOverlap) == 0x00045A, "Member 'SurvPC_C_CreateContainerWithDrop::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(SurvPC_C_CreateContainerWithDrop, CallFunc_BreakHitResult_Time) == 0x00045C, "Member 'SurvPC_C_CreateContainerWithDrop::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(SurvPC_C_CreateContainerWithDrop, CallFunc_BreakHitResult_Distance) == 0x000460, "Member 'SurvPC_C_CreateContainerWithDrop::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(SurvPC_C_CreateContainerWithDrop, CallFunc_BreakHitResult_Location) == 0x000468, "Member 'SurvPC_C_CreateContainerWithDrop::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(SurvPC_C_CreateContainerWithDrop, CallFunc_BreakHitResult_ImpactPoint) == 0x000480, "Member 'SurvPC_C_CreateContainerWithDrop::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(SurvPC_C_CreateContainerWithDrop, CallFunc_BreakHitResult_Normal) == 0x000498, "Member 'SurvPC_C_CreateContainerWithDrop::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(SurvPC_C_CreateContainerWithDrop, CallFunc_BreakHitResult_ImpactNormal) == 0x0004B0, "Member 'SurvPC_C_CreateContainerWithDrop::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(SurvPC_C_CreateContainerWithDrop, CallFunc_BreakHitResult_PhysMat) == 0x0004C8, "Member 'SurvPC_C_CreateContainerWithDrop::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(SurvPC_C_CreateContainerWithDrop, CallFunc_BreakHitResult_HitActor) == 0x0004D0, "Member 'SurvPC_C_CreateContainerWithDrop::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(SurvPC_C_CreateContainerWithDrop, CallFunc_BreakHitResult_HitComponent) == 0x0004D8, "Member 'SurvPC_C_CreateContainerWithDrop::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(SurvPC_C_CreateContainerWithDrop, CallFunc_BreakHitResult_HitBoneName) == 0x0004E0, "Member 'SurvPC_C_CreateContainerWithDrop::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(SurvPC_C_CreateContainerWithDrop, CallFunc_BreakHitResult_BoneName) == 0x0004E8, "Member 'SurvPC_C_CreateContainerWithDrop::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(SurvPC_C_CreateContainerWithDrop, CallFunc_BreakHitResult_HitItem) == 0x0004F0, "Member 'SurvPC_C_CreateContainerWithDrop::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(SurvPC_C_CreateContainerWithDrop, CallFunc_BreakHitResult_ElementIndex) == 0x0004F4, "Member 'SurvPC_C_CreateContainerWithDrop::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(SurvPC_C_CreateContainerWithDrop, CallFunc_BreakHitResult_FaceIndex) == 0x0004F8, "Member 'SurvPC_C_CreateContainerWithDrop::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(SurvPC_C_CreateContainerWithDrop, CallFunc_BreakHitResult_TraceStart) == 0x000500, "Member 'SurvPC_C_CreateContainerWithDrop::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(SurvPC_C_CreateContainerWithDrop, CallFunc_BreakHitResult_TraceEnd) == 0x000518, "Member 'SurvPC_C_CreateContainerWithDrop::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(SurvPC_C_CreateContainerWithDrop, CallFunc_MakeTransform_ReturnValue) == 0x000530, "Member 'SurvPC_C_CreateContainerWithDrop::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvPC_C_CreateContainerWithDrop, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000590, "Member 'SurvPC_C_CreateContainerWithDrop::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvPC_C_CreateContainerWithDrop, CallFunc_FinishSpawningActor_ReturnValue) == 0x000598, "Member 'SurvPC_C_CreateContainerWithDrop::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function SurvPC.SurvPC_C.DisplayLocation
// 0x0004 (0x0004 - 0x0000)
struct SurvPC_C_DisplayLocation final
{
public:
	float                                         NewTime;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SurvPC_C_DisplayLocation) == 0x000004, "Wrong alignment on SurvPC_C_DisplayLocation");
static_assert(sizeof(SurvPC_C_DisplayLocation) == 0x000004, "Wrong size on SurvPC_C_DisplayLocation");
static_assert(offsetof(SurvPC_C_DisplayLocation, NewTime) == 0x000000, "Member 'SurvPC_C_DisplayLocation::NewTime' has a wrong offset!");

// Function SurvPC.SurvPC_C.EasyQuestsCompleted
// 0x0010 (0x0010 - 0x0000)
struct SurvPC_C_EasyQuestsCompleted final
{
public:
	bool                                          Completed;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Set_Length_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SurvPC_C_EasyQuestsCompleted) == 0x000004, "Wrong alignment on SurvPC_C_EasyQuestsCompleted");
static_assert(sizeof(SurvPC_C_EasyQuestsCompleted) == 0x000010, "Wrong size on SurvPC_C_EasyQuestsCompleted");
static_assert(offsetof(SurvPC_C_EasyQuestsCompleted, Completed) == 0x000000, "Member 'SurvPC_C_EasyQuestsCompleted::Completed' has a wrong offset!");
static_assert(offsetof(SurvPC_C_EasyQuestsCompleted, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'SurvPC_C_EasyQuestsCompleted::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvPC_C_EasyQuestsCompleted, CallFunc_Set_Length_ReturnValue) == 0x000008, "Member 'SurvPC_C_EasyQuestsCompleted::CallFunc_Set_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvPC_C_EasyQuestsCompleted, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00000C, "Member 'SurvPC_C_EasyQuestsCompleted::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function SurvPC.SurvPC_C.ExecuteUbergraph_SurvPC
// 0x3290 (0x3290 - 0x0000)
struct SurvPC_C_ExecuteUbergraph_SurvPC final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_1; // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F[0x1];                                       // 0x002F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_Hint_1;                               // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Event_Title;                                // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UADSDialogue*                           K2Node_Event_Dialogue;                             // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_NPC_Name;                             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UFMODEvent>              K2Node_CustomEvent_FireSoundEvent;                 // 0x0060(0x0030)(HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_IndoorShot;                     // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalGameMode*                      K2Node_DynamicCast_AsSurvival_Game_Mode;           // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APlayerController*>              CallFunc_GetAllPlayerController_ReturnValue;       // 0x00B0(0x0010)(ReferenceParm)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_1;                 // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue_1;                // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalGameMode*                      K2Node_DynamicCast_AsSurvival_Game_Mode_1;         // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APlayerController*>              CallFunc_GetAllPlayerController_ReturnValue_1;     // 0x0128(0x0010)(ReferenceParm)
	struct FQuestVariable                         K2Node_MakeStruct_QuestVariable;                   // 0x0138(0x000C)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_2;                 // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_3;                 // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
