#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SurvivalPlayer_Mannequin

#include "Basic.hpp"

#include "FItemInfo_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "EquipmentData_structs.hpp"
#include "Engine_structs.hpp"
#include "BPS_WeaponData_structs.hpp"
#include "PlayerSlots_structs.hpp"
#include "EffectMainContructor_structs.hpp"
#include "EffectContructor_structs.hpp"


namespace SDK::Params
{

// Function SurvivalPlayer_Mannequin.SurvivalPlayer_Mannequin_C.Calc Damage with Armory
// 0x0060 (0x0060 - 0x0000)
struct SurvivalPlayer_Mannequin_C_Calc_Damage_with_Armory final
{
public:
	class FName                                   BoneName;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Damage;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Param_FinalDamage;                                 // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Multiplier;                                        // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SurvivalPlayer_Mannequin_C_Calc_Damage_with_Armory) == 0x000008, "Wrong alignment on SurvivalPlayer_Mannequin_C_Calc_Damage_with_Armory");
static_assert(sizeof(SurvivalPlayer_Mannequin_C_Calc_Damage_with_Armory) == 0x000060, "Wrong size on SurvivalPlayer_Mannequin_C_Calc_Damage_with_Armory");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_Calc_Damage_with_Armory, BoneName) == 0x000000, "Member 'SurvivalPlayer_Mannequin_C_Calc_Damage_with_Armory::BoneName' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_Calc_Damage_with_Armory, Damage) == 0x000008, "Member 'SurvivalPlayer_Mannequin_C_Calc_Damage_with_Armory::Damage' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_Calc_Damage_with_Armory, Param_FinalDamage) == 0x000010, "Member 'SurvivalPlayer_Mannequin_C_Calc_Damage_with_Armory::Param_FinalDamage' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_Calc_Damage_with_Armory, Multiplier) == 0x000018, "Member 'SurvivalPlayer_Mannequin_C_Calc_Damage_with_Armory::Multiplier' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_Calc_Damage_with_Armory, K2Node_SwitchName_CmpSuccess) == 0x000020, "Member 'SurvivalPlayer_Mannequin_C_Calc_Damage_with_Armory::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_Calc_Damage_with_Armory, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000028, "Member 'SurvivalPlayer_Mannequin_C_Calc_Damage_with_Armory::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_Calc_Damage_with_Armory, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000030, "Member 'SurvivalPlayer_Mannequin_C_Calc_Damage_with_Armory::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_Calc_Damage_with_Armory, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000031, "Member 'SurvivalPlayer_Mannequin_C_Calc_Damage_with_Armory::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_Calc_Damage_with_Armory, CallFunc_SelectFloat_ReturnValue) == 0x000038, "Member 'SurvivalPlayer_Mannequin_C_Calc_Damage_with_Armory::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_Calc_Damage_with_Armory, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000040, "Member 'SurvivalPlayer_Mannequin_C_Calc_Damage_with_Armory::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_Calc_Damage_with_Armory, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000048, "Member 'SurvivalPlayer_Mannequin_C_Calc_Damage_with_Armory::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_Calc_Damage_with_Armory, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000050, "Member 'SurvivalPlayer_Mannequin_C_Calc_Damage_with_Armory::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_Calc_Damage_with_Armory, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000058, "Member 'SurvivalPlayer_Mannequin_C_Calc_Damage_with_Armory::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");

// Function SurvivalPlayer_Mannequin.SurvivalPlayer_Mannequin_C.EnableRagdol
// 0x0018 (0x0018 - 0x0000)
struct SurvivalPlayer_Mannequin_C_EnableRagdol final
{
public:
	class FName                                   BoneName;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            InstigatedBy;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Damage;                                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SurvivalPlayer_Mannequin_C_EnableRagdol) == 0x000008, "Wrong alignment on SurvivalPlayer_Mannequin_C_EnableRagdol");
static_assert(sizeof(SurvivalPlayer_Mannequin_C_EnableRagdol) == 0x000018, "Wrong size on SurvivalPlayer_Mannequin_C_EnableRagdol");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_EnableRagdol, BoneName) == 0x000000, "Member 'SurvivalPlayer_Mannequin_C_EnableRagdol::BoneName' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_EnableRagdol, InstigatedBy) == 0x000008, "Member 'SurvivalPlayer_Mannequin_C_EnableRagdol::InstigatedBy' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_EnableRagdol, Damage) == 0x000010, "Member 'SurvivalPlayer_Mannequin_C_EnableRagdol::Damage' has a wrong offset!");

// Function SurvivalPlayer_Mannequin.SurvivalPlayer_Mannequin_C.EquipItems
// 0x0220 (0x0220 - 0x0000)
struct SurvivalPlayer_Mannequin_C_EquipItems final
{
public:
	struct FFItemInfo                             Param_ItemInfo;                                    // 0x0000(0x0220)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(SurvivalPlayer_Mannequin_C_EquipItems) == 0x000008, "Wrong alignment on SurvivalPlayer_Mannequin_C_EquipItems");
static_assert(sizeof(SurvivalPlayer_Mannequin_C_EquipItems) == 0x000220, "Wrong size on SurvivalPlayer_Mannequin_C_EquipItems");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_EquipItems, Param_ItemInfo) == 0x000000, "Member 'SurvivalPlayer_Mannequin_C_EquipItems::Param_ItemInfo' has a wrong offset!");

// Function SurvivalPlayer_Mannequin.SurvivalPlayer_Mannequin_C.ExecuteUbergraph_SurvivalPlayer_Mannequin
// 0x1660 (0x1660 - 0x0000)
struct SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_InName;                         // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_InFloat;                        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0058(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0070(0x0018)()
	float                                         K2Node_Event_Damage;                               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UDamageType*                      K2Node_Event_DamageType;                           // 0x0090(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitLocation;                          // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_HitComponent;                         // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_BoneName;                             // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_ShotFromDirection;                    // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            K2Node_Event_InstigatedBy;                         // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x0100(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue_1;        // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_BoneName_1;                     // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            K2Node_CustomEvent_InstigatedBy;                   // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Damage;                         // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0210(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0230(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasCanister_HasCanister;                  // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24A[0x2];                                      // 0x024A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x024C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0260(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult; // 0x0268(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0358(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0370(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0388(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Location;                       // 0x03A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_HitNormal;                      // 0x03B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_BoneName;                       // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x03D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x03F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0410(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_421[0x7];                                      // 0x0421(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             CallFunc_GetDataTableRowFromName_OutRow;           // 0x0428(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0648(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_649[0x7];                                      // 0x0649(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBPS_WeaponData                        CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0650(0x04C0)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0B10(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x0B11(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_4;               // 0x0B12(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B13[0x1];                                      // 0x0B13(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetWeaponNamesFromSlots_PrimaryWeaponName; // 0x0B14(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetWeaponNamesFromSlots_SecondaryWeaponName; // 0x0B1C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetWeaponNamesFromSlots_PistolWeaponName; // 0x0B24(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetWeaponNamesFromSlots_MeleeWeaponName;  // 0x0B2C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0B34(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x0B3C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B44[0x4];                                      // 0x0B44(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             CallFunc_GetDataTableRowFromName_OutRow_2;         // 0x0B48(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_2;    // 0x0D68(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D69[0x7];                                      // 0x0D69(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             CallFunc_GetDataTableRowFromName_OutRow_3;         // 0x0D70(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_3;    // 0x0F90(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F91[0x7];                                      // 0x0F91(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0F98(0x0010)(ConstParm, ReferenceParm)
	struct FFItemInfo                             K2Node_CustomEvent_ItemInfo;                       // 0x0FA8(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x11C8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x12B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12B1[0x7];                                     // 0x12B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEquipmentData                         CallFunc_GetDataTableRowFromName_OutRow_4;         // 0x12B8(0x0180)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_4;    // 0x1438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x1439(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_143A[0x6];                                     // 0x143A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x1440(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x1450(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x1460(0x0018)()
	class UJSI_Slot_C*                            Temp_object_Variable_1;                            // 0x1478(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x1480(0x0018)()
	class UJSI_Slot_C*                            Temp_object_Variable_2;                            // 0x1498(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJSI_Slot_C*                            Temp_object_Variable_3;                            // 0x14A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJSI_Slot_C*                            Temp_object_Variable_4;                            // 0x14A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJSI_Slot_C*                            Temp_object_Variable_5;                            // 0x14B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJSI_Slot_C*                            Temp_object_Variable_6;                            // 0x14B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJSI_Slot_C*                            Temp_object_Variable_7;                            // 0x14C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJSI_Slot_C*                            Temp_object_Variable_8;                            // 0x14C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EPlayerSlots                                  Temp_byte_Variable;                                // 0x14D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x14D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x14D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14D3[0x5];                                     // 0x14D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UJSI_Slot_C*                            K2Node_Select_Default;                             // 0x14D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_2;                         // 0x14E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_3;                         // 0x14E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEffectMainContructor                  CallFunc_GetDataTableRowFromName_OutRow_5;         // 0x14F0(0x0078)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_5;    // 0x1568(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1569[0x7];                                     // 0x1569(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEffectMainContructor                  CallFunc_GetDataTableRowFromName_OutRow_6;         // 0x1570(0x0078)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_6;    // 0x15E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15E9[0x3];                                     // 0x15E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEffectContructor                      CallFunc_Array_Get_Item_4;                         // 0x15EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEffectContructor                      CallFunc_Array_Get_Item_5;                         // 0x15F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1604[0x4];                                     // 0x1604(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x1608(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x1620(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x1638(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_HelmetReduction_ImplicitCast;   // 0x1650(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_ArmorReduction_ImplicitCast;    // 0x1658(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin) == 0x000008, "Wrong alignment on SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin");
static_assert(sizeof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin) == 0x001660, "Wrong size on SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, EntryPoint) == 0x000000, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::EntryPoint' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, K2Node_CustomEvent_InName) == 0x000004, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::K2Node_CustomEvent_InName' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, K2Node_CustomEvent_InFloat) == 0x000010, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::K2Node_CustomEvent_InFloat' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, CallFunc_Conv_DoubleToString_ReturnValue) == 0x000018, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::CallFunc_Conv_DoubleToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, CallFunc_Conv_NameToString_ReturnValue) == 0x000028, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, CallFunc_Concat_StrStr_ReturnValue) == 0x000038, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000048, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, CallFunc_Conv_StringToText_ReturnValue) == 0x000058, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, CallFunc_MakeLiteralText_ReturnValue) == 0x000070, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, K2Node_Event_Damage) == 0x000088, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, K2Node_Event_DamageType) == 0x000090, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::K2Node_Event_DamageType' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, K2Node_Event_HitLocation) == 0x000098, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, K2Node_Event_HitNormal) == 0x0000B0, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, K2Node_Event_HitComponent) == 0x0000C8, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::K2Node_Event_HitComponent' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, K2Node_Event_BoneName) == 0x0000D0, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::K2Node_Event_BoneName' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, K2Node_Event_ShotFromDirection) == 0x0000D8, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::K2Node_Event_ShotFromDirection' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, K2Node_Event_InstigatedBy) == 0x0000F0, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, K2Node_Event_DamageCauser) == 0x0000F8, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, K2Node_Event_HitInfo) == 0x000100, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, CallFunc_Conv_DoubleToString_ReturnValue_1) == 0x0001E8, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::CallFunc_Conv_DoubleToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, K2Node_CustomEvent_BoneName_1) == 0x0001F8, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::K2Node_CustomEvent_BoneName_1' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, K2Node_CustomEvent_InstigatedBy) == 0x000200, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::K2Node_CustomEvent_InstigatedBy' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, K2Node_CustomEvent_Damage) == 0x000208, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000210, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, CallFunc_K2_GetPawn_ReturnValue) == 0x000228, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000230, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, CallFunc_HasCanister_HasCanister) == 0x000248, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::CallFunc_HasCanister_HasCanister' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, CallFunc_HasAuthority_ReturnValue) == 0x000249, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, K2Node_CreateDelegate_OutputDelegate) == 0x00024C, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000260, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult) == 0x000268, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000350, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, CallFunc_GetSocketLocation_ReturnValue) == 0x000358, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, CallFunc_FindLookAtRotation_ReturnValue) == 0x000370, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, CallFunc_GetForwardVector_ReturnValue) == 0x000388, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, K2Node_CustomEvent_Location) == 0x0003A0, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::K2Node_CustomEvent_Location' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, K2Node_CustomEvent_HitNormal) == 0x0003B8, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::K2Node_CustomEvent_HitNormal' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, K2Node_CustomEvent_BoneName) == 0x0003D0, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::K2Node_CustomEvent_BoneName' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0003D8, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, CallFunc_HasAuthority_ReturnValue_1) == 0x0003F0, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0003F8, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, K2Node_MakeArray_Array) == 0x000410, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, CallFunc_HasAuthority_ReturnValue_2) == 0x000420, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, CallFunc_GetDataTableRowFromName_OutRow) == 0x000428, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000648, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000650, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000B10, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, CallFunc_HasAuthority_ReturnValue_3) == 0x000B11, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::CallFunc_HasAuthority_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, CallFunc_HasAuthority_ReturnValue_4) == 0x000B12, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::CallFunc_HasAuthority_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, CallFunc_GetWeaponNamesFromSlots_PrimaryWeaponName) == 0x000B14, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::CallFunc_GetWeaponNamesFromSlots_PrimaryWeaponName' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, CallFunc_GetWeaponNamesFromSlots_SecondaryWeaponName) == 0x000B1C, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::CallFunc_GetWeaponNamesFromSlots_SecondaryWeaponName' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, CallFunc_GetWeaponNamesFromSlots_PistolWeaponName) == 0x000B24, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::CallFunc_GetWeaponNamesFromSlots_PistolWeaponName' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, CallFunc_GetWeaponNamesFromSlots_MeleeWeaponName) == 0x000B2C, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::CallFunc_GetWeaponNamesFromSlots_MeleeWeaponName' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, CallFunc_Array_Get_Item) == 0x000B34, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, CallFunc_Array_Get_Item_1) == 0x000B3C, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, CallFunc_GetDataTableRowFromName_OutRow_2) == 0x000B48, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::CallFunc_GetDataTableRowFromName_OutRow_2' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, CallFunc_GetDataTableRowFromName_ReturnValue_2) == 0x000D68, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::CallFunc_GetDataTableRowFromName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, CallFunc_GetDataTableRowFromName_OutRow_3) == 0x000D70, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::CallFunc_GetDataTableRowFromName_OutRow_3' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, CallFunc_GetDataTableRowFromName_ReturnValue_3) == 0x000F90, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::CallFunc_GetDataTableRowFromName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, Temp_object_Variable) == 0x000F98, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, K2Node_CustomEvent_ItemInfo) == 0x000FA8, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::K2Node_CustomEvent_ItemInfo' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, CallFunc_LineTraceSingleForObjects_OutHit) == 0x0011C8, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x0012B0, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, CallFunc_GetDataTableRowFromName_OutRow_4) == 0x0012B8, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::CallFunc_GetDataTableRowFromName_OutRow_4' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, CallFunc_GetDataTableRowFromName_ReturnValue_4) == 0x001438, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::CallFunc_GetDataTableRowFromName_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, K2Node_SwitchEnum_CmpSuccess) == 0x001439, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, CallFunc_Concat_StrStr_ReturnValue_2) == 0x001440, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, CallFunc_Concat_StrStr_ReturnValue_3) == 0x001450, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, CallFunc_Conv_StringToText_ReturnValue_1) == 0x001460, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, Temp_object_Variable_1) == 0x001478, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, CallFunc_MakeLiteralText_ReturnValue_1) == 0x001480, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, Temp_object_Variable_2) == 0x001498, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, Temp_object_Variable_3) == 0x0014A0, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, Temp_object_Variable_4) == 0x0014A8, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, Temp_object_Variable_5) == 0x0014B0, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, Temp_object_Variable_6) == 0x0014B8, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, Temp_object_Variable_7) == 0x0014C0, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::Temp_object_Variable_7' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, Temp_object_Variable_8) == 0x0014C8, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::Temp_object_Variable_8' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, Temp_byte_Variable) == 0x0014D0, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, CallFunc_MakeLiteralByte_ReturnValue) == 0x0014D1, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0014D2, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, K2Node_Select_Default) == 0x0014D8, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, CallFunc_Array_Get_Item_2) == 0x0014E0, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, CallFunc_Array_Get_Item_3) == 0x0014E8, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, CallFunc_GetDataTableRowFromName_OutRow_5) == 0x0014F0, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::CallFunc_GetDataTableRowFromName_OutRow_5' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, CallFunc_GetDataTableRowFromName_ReturnValue_5) == 0x001568, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::CallFunc_GetDataTableRowFromName_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, CallFunc_GetDataTableRowFromName_OutRow_6) == 0x001570, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::CallFunc_GetDataTableRowFromName_OutRow_6' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, CallFunc_GetDataTableRowFromName_ReturnValue_6) == 0x0015E8, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::CallFunc_GetDataTableRowFromName_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, CallFunc_Array_Get_Item_4) == 0x0015EC, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, CallFunc_Array_Get_Item_5) == 0x0015F8, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, CallFunc_Conv_DoubleToVector_ReturnValue_1) == 0x001608, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::CallFunc_Conv_DoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, CallFunc_Multiply_VectorVector_ReturnValue) == 0x001620, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x001638, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, K2Node_VariableSet_HelmetReduction_ImplicitCast) == 0x001650, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::K2Node_VariableSet_HelmetReduction_ImplicitCast' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin, K2Node_VariableSet_ArmorReduction_ImplicitCast) == 0x001658, "Member 'SurvivalPlayer_Mannequin_C_ExecuteUbergraph_SurvivalPlayer_Mannequin::K2Node_VariableSet_ArmorReduction_ImplicitCast' has a wrong offset!");

// Function SurvivalPlayer_Mannequin.SurvivalPlayer_Mannequin_C.ReceivePointDamage
// 0x0160 (0x0160 - 0x0000)
struct SurvivalPlayer_Mannequin_C_ReceivePointDamage final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UDamageType*                      DamageType;                                        // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation;                                       // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormal;                                         // 0x0028(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   BoneName;                                          // 0x0048(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ShotFromDirection;                                 // 0x0050(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            InstigatedBy;                                      // 0x0068(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0070(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitInfo;                                           // 0x0078(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(SurvivalPlayer_Mannequin_C_ReceivePointDamage) == 0x000008, "Wrong alignment on SurvivalPlayer_Mannequin_C_ReceivePointDamage");
static_assert(sizeof(SurvivalPlayer_Mannequin_C_ReceivePointDamage) == 0x000160, "Wrong size on SurvivalPlayer_Mannequin_C_ReceivePointDamage");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ReceivePointDamage, Damage) == 0x000000, "Member 'SurvivalPlayer_Mannequin_C_ReceivePointDamage::Damage' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ReceivePointDamage, DamageType) == 0x000008, "Member 'SurvivalPlayer_Mannequin_C_ReceivePointDamage::DamageType' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ReceivePointDamage, HitLocation) == 0x000010, "Member 'SurvivalPlayer_Mannequin_C_ReceivePointDamage::HitLocation' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ReceivePointDamage, HitNormal) == 0x000028, "Member 'SurvivalPlayer_Mannequin_C_ReceivePointDamage::HitNormal' has a wrong offset!");
static_assert(offsetof(SurvivalPlayer_Mannequin_C_ReceivePointDamage, HitComponent) == 0x000040, "Member 'SurvivalPlayer_Mannequin_C_ReceivePointDamage::HitComponent' has a wrong offset!");
