#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Survival

#include "Basic.hpp"

#include "Survival_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Survival.BP_AnimUROComponent.SetMeshCustomURO
// 0x0010 (0x0010 - 0x0000)
struct BP_AnimUROComponent_SetMeshCustomURO final
{
public:
	class USkinnedMeshComponent*                  MeshToURO;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         UroLevel;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BP_AnimUROComponent_SetMeshCustomURO) == 0x000008, "Wrong alignment on BP_AnimUROComponent_SetMeshCustomURO");
static_assert(sizeof(BP_AnimUROComponent_SetMeshCustomURO) == 0x000010, "Wrong size on BP_AnimUROComponent_SetMeshCustomURO");
static_assert(offsetof(BP_AnimUROComponent_SetMeshCustomURO, MeshToURO) == 0x000000, "Member 'BP_AnimUROComponent_SetMeshCustomURO::MeshToURO' has a wrong offset!");
static_assert(offsetof(BP_AnimUROComponent_SetMeshCustomURO, UroLevel) == 0x000008, "Member 'BP_AnimUROComponent_SetMeshCustomURO::UroLevel' has a wrong offset!");

// Function Survival.BP_AnimUROComponent.SetMeshURO
// 0x0008 (0x0008 - 0x0000)
struct BP_AnimUROComponent_SetMeshURO final
{
public:
	class USkinnedMeshComponent*                  MeshToURO;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_AnimUROComponent_SetMeshURO) == 0x000008, "Wrong alignment on BP_AnimUROComponent_SetMeshURO");
static_assert(sizeof(BP_AnimUROComponent_SetMeshURO) == 0x000008, "Wrong size on BP_AnimUROComponent_SetMeshURO");
static_assert(offsetof(BP_AnimUROComponent_SetMeshURO, MeshToURO) == 0x000000, "Member 'BP_AnimUROComponent_SetMeshURO::MeshToURO' has a wrong offset!");

// Function Survival.ZombieCharacter.GetAgressive
// 0x0001 (0x0001 - 0x0000)
struct ZombieCharacter_GetAgressive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ZombieCharacter_GetAgressive) == 0x000001, "Wrong alignment on ZombieCharacter_GetAgressive");
static_assert(sizeof(ZombieCharacter_GetAgressive) == 0x000001, "Wrong size on ZombieCharacter_GetAgressive");
static_assert(offsetof(ZombieCharacter_GetAgressive, ReturnValue) == 0x000000, "Member 'ZombieCharacter_GetAgressive::ReturnValue' has a wrong offset!");

// Function Survival.ZombieCharacter.GetBackToIdle
// 0x0001 (0x0001 - 0x0000)
struct ZombieCharacter_GetBackToIdle final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ZombieCharacter_GetBackToIdle) == 0x000001, "Wrong alignment on ZombieCharacter_GetBackToIdle");
static_assert(sizeof(ZombieCharacter_GetBackToIdle) == 0x000001, "Wrong size on ZombieCharacter_GetBackToIdle");
static_assert(offsetof(ZombieCharacter_GetBackToIdle, ReturnValue) == 0x000000, "Member 'ZombieCharacter_GetBackToIdle::ReturnValue' has a wrong offset!");

// Function Survival.ZombieCharacter.GetCPPZombieType
// 0x0001 (0x0001 - 0x0000)
struct ZombieCharacter_GetCPPZombieType final
{
public:
	EZombieType                                   ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ZombieCharacter_GetCPPZombieType) == 0x000001, "Wrong alignment on ZombieCharacter_GetCPPZombieType");
static_assert(sizeof(ZombieCharacter_GetCPPZombieType) == 0x000001, "Wrong size on ZombieCharacter_GetCPPZombieType");
static_assert(offsetof(ZombieCharacter_GetCPPZombieType, ReturnValue) == 0x000000, "Member 'ZombieCharacter_GetCPPZombieType::ReturnValue' has a wrong offset!");

// Function Survival.ZombieCharacter.GetDamaged
// 0x0001 (0x0001 - 0x0000)
struct ZombieCharacter_GetDamaged final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ZombieCharacter_GetDamaged) == 0x000001, "Wrong alignment on ZombieCharacter_GetDamaged");
static_assert(sizeof(ZombieCharacter_GetDamaged) == 0x000001, "Wrong size on ZombieCharacter_GetDamaged");
static_assert(offsetof(ZombieCharacter_GetDamaged, ReturnValue) == 0x000000, "Member 'ZombieCharacter_GetDamaged::ReturnValue' has a wrong offset!");

// Function Survival.ZombieCharacter.GetZombieAnimType
// 0x0001 (0x0001 - 0x0000)
struct ZombieCharacter_GetZombieAnimType final
{
public:
	EZombieAnimType                               ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ZombieCharacter_GetZombieAnimType) == 0x000001, "Wrong alignment on ZombieCharacter_GetZombieAnimType");
static_assert(sizeof(ZombieCharacter_GetZombieAnimType) == 0x000001, "Wrong size on ZombieCharacter_GetZombieAnimType");
static_assert(offsetof(ZombieCharacter_GetZombieAnimType, ReturnValue) == 0x000000, "Member 'ZombieCharacter_GetZombieAnimType::ReturnValue' has a wrong offset!");

// Function Survival.ZombieCharacter.SetAgressive
// 0x0001 (0x0001 - 0x0000)
struct ZombieCharacter_SetAgressive final
{
public:
	bool                                          NewValue;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ZombieCharacter_SetAgressive) == 0x000001, "Wrong alignment on ZombieCharacter_SetAgressive");
static_assert(sizeof(ZombieCharacter_SetAgressive) == 0x000001, "Wrong size on ZombieCharacter_SetAgressive");
static_assert(offsetof(ZombieCharacter_SetAgressive, NewValue) == 0x000000, "Member 'ZombieCharacter_SetAgressive::NewValue' has a wrong offset!");

// Function Survival.ZombieCharacter.SetBackToIdle
// 0x0001 (0x0001 - 0x0000)
struct ZombieCharacter_SetBackToIdle final
{
public:
	bool                                          NewValue;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ZombieCharacter_SetBackToIdle) == 0x000001, "Wrong alignment on ZombieCharacter_SetBackToIdle");
static_assert(sizeof(ZombieCharacter_SetBackToIdle) == 0x000001, "Wrong size on ZombieCharacter_SetBackToIdle");
static_assert(offsetof(ZombieCharacter_SetBackToIdle, NewValue) == 0x000000, "Member 'ZombieCharacter_SetBackToIdle::NewValue' has a wrong offset!");

// Function Survival.ZombieCharacter.SetCPPZombieType
// 0x0001 (0x0001 - 0x0000)
struct ZombieCharacter_SetCPPZombieType final
{
public:
	EZombieType                                   NewValue;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ZombieCharacter_SetCPPZombieType) == 0x000001, "Wrong alignment on ZombieCharacter_SetCPPZombieType");
static_assert(sizeof(ZombieCharacter_SetCPPZombieType) == 0x000001, "Wrong size on ZombieCharacter_SetCPPZombieType");
static_assert(offsetof(ZombieCharacter_SetCPPZombieType, NewValue) == 0x000000, "Member 'ZombieCharacter_SetCPPZombieType::NewValue' has a wrong offset!");

// Function Survival.ZombieCharacter.SetDamaged
// 0x0001 (0x0001 - 0x0000)
struct ZombieCharacter_SetDamaged final
{
public:
	bool                                          NewValue;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ZombieCharacter_SetDamaged) == 0x000001, "Wrong alignment on ZombieCharacter_SetDamaged");
static_assert(sizeof(ZombieCharacter_SetDamaged) == 0x000001, "Wrong size on ZombieCharacter_SetDamaged");
static_assert(offsetof(ZombieCharacter_SetDamaged, NewValue) == 0x000000, "Member 'ZombieCharacter_SetDamaged::NewValue' has a wrong offset!");

// Function Survival.ZombieCharacter.SetZombieAnimType
// 0x0001 (0x0001 - 0x0000)
struct ZombieCharacter_SetZombieAnimType final
{
public:
	EZombieAnimType                               NewZombieAnimType;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ZombieCharacter_SetZombieAnimType) == 0x000001, "Wrong alignment on ZombieCharacter_SetZombieAnimType");
static_assert(sizeof(ZombieCharacter_SetZombieAnimType) == 0x000001, "Wrong size on ZombieCharacter_SetZombieAnimType");
static_assert(offsetof(ZombieCharacter_SetZombieAnimType, NewZombieAnimType) == 0x000000, "Member 'ZombieCharacter_SetZombieAnimType::NewZombieAnimType' has a wrong offset!");

// Function Survival.AdditionalEditorFunctions.GetViewportCamera
// 0x0018 (0x0018 - 0x0000)
struct AdditionalEditorFunctions_GetViewportCamera final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AdditionalEditorFunctions_GetViewportCamera) == 0x000008, "Wrong alignment on AdditionalEditorFunctions_GetViewportCamera");
static_assert(sizeof(AdditionalEditorFunctions_GetViewportCamera) == 0x000018, "Wrong size on AdditionalEditorFunctions_GetViewportCamera");
static_assert(offsetof(AdditionalEditorFunctions_GetViewportCamera, ReturnValue) == 0x000000, "Member 'AdditionalEditorFunctions_GetViewportCamera::ReturnValue' has a wrong offset!");

// Function Survival.AdditionalEditorFunctions.IsWithEditor
// 0x0001 (0x0001 - 0x0000)
struct AdditionalEditorFunctions_IsWithEditor final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AdditionalEditorFunctions_IsWithEditor) == 0x000001, "Wrong alignment on AdditionalEditorFunctions_IsWithEditor");
static_assert(sizeof(AdditionalEditorFunctions_IsWithEditor) == 0x000001, "Wrong size on AdditionalEditorFunctions_IsWithEditor");
static_assert(offsetof(AdditionalEditorFunctions_IsWithEditor, ReturnValue) == 0x000000, "Member 'AdditionalEditorFunctions_IsWithEditor::ReturnValue' has a wrong offset!");

// Function Survival.AIControllerTeam.SetCrowdSimulationState
// 0x0008 (0x0008 - 0x0000)
struct AIControllerTeam_SetCrowdSimulationState final
{
public:
	class UCrowdFollowingComponent*               CrowdFollowingComponent;                           // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AIControllerTeam_SetCrowdSimulationState) == 0x000008, "Wrong alignment on AIControllerTeam_SetCrowdSimulationState");
static_assert(sizeof(AIControllerTeam_SetCrowdSimulationState) == 0x000008, "Wrong size on AIControllerTeam_SetCrowdSimulationState");
static_assert(offsetof(AIControllerTeam_SetCrowdSimulationState, CrowdFollowingComponent) == 0x000000, "Member 'AIControllerTeam_SetCrowdSimulationState::CrowdFollowingComponent' has a wrong offset!");

// Function Survival.AIControllerTeam.GetActorPerceptionViewpoint
// 0x0030 (0x0030 - 0x0000)
struct AIControllerTeam_GetActorPerceptionViewpoint final
{
public:
	struct FVector                                Out_Location;                                      // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Out_Rotation;                                      // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(AIControllerTeam_GetActorPerceptionViewpoint) == 0x000008, "Wrong alignment on AIControllerTeam_GetActorPerceptionViewpoint");
static_assert(sizeof(AIControllerTeam_GetActorPerceptionViewpoint) == 0x000030, "Wrong size on AIControllerTeam_GetActorPerceptionViewpoint");
static_assert(offsetof(AIControllerTeam_GetActorPerceptionViewpoint, Out_Location) == 0x000000, "Member 'AIControllerTeam_GetActorPerceptionViewpoint::Out_Location' has a wrong offset!");
static_assert(offsetof(AIControllerTeam_GetActorPerceptionViewpoint, Out_Rotation) == 0x000018, "Member 'AIControllerTeam_GetActorPerceptionViewpoint::Out_Rotation' has a wrong offset!");

// Function Survival.AIMoveComp.GetCPPAnimationAngle
// 0x0004 (0x0004 - 0x0000)
struct AIMoveComp_GetCPPAnimationAngle final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AIMoveComp_GetCPPAnimationAngle) == 0x000004, "Wrong alignment on AIMoveComp_GetCPPAnimationAngle");
static_assert(sizeof(AIMoveComp_GetCPPAnimationAngle) == 0x000004, "Wrong size on AIMoveComp_GetCPPAnimationAngle");
static_assert(offsetof(AIMoveComp_GetCPPAnimationAngle, ReturnValue) == 0x000000, "Member 'AIMoveComp_GetCPPAnimationAngle::ReturnValue' has a wrong offset!");

// Function Survival.AIMoveComp.GetCPPIsStopping
// 0x0001 (0x0001 - 0x0000)
struct AIMoveComp_GetCPPIsStopping final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AIMoveComp_GetCPPIsStopping) == 0x000001, "Wrong alignment on AIMoveComp_GetCPPIsStopping");
static_assert(sizeof(AIMoveComp_GetCPPIsStopping) == 0x000001, "Wrong size on AIMoveComp_GetCPPIsStopping");
static_assert(offsetof(AIMoveComp_GetCPPIsStopping, ReturnValue) == 0x000000, "Member 'AIMoveComp_GetCPPIsStopping::ReturnValue' has a wrong offset!");

// Function Survival.AIMoveComp.GetCPPMovementType
// 0x0001 (0x0001 - 0x0000)
struct AIMoveComp_GetCPPMovementType final
{
public:
	Survival::EMovementType                       ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AIMoveComp_GetCPPMovementType) == 0x000001, "Wrong alignment on AIMoveComp_GetCPPMovementType");
static_assert(sizeof(AIMoveComp_GetCPPMovementType) == 0x000001, "Wrong size on AIMoveComp_GetCPPMovementType");
static_assert(offsetof(AIMoveComp_GetCPPMovementType, ReturnValue) == 0x000000, "Member 'AIMoveComp_GetCPPMovementType::ReturnValue' has a wrong offset!");

// Function Survival.AIMoveComp.GetCPPVelocityFromAnimation
// 0x0001 (0x0001 - 0x0000)
struct AIMoveComp_GetCPPVelocityFromAnimation final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AIMoveComp_GetCPPVelocityFromAnimation) == 0x000001, "Wrong alignment on AIMoveComp_GetCPPVelocityFromAnimation");
static_assert(sizeof(AIMoveComp_GetCPPVelocityFromAnimation) == 0x000001, "Wrong size on AIMoveComp_GetCPPVelocityFromAnimation");
static_assert(offsetof(AIMoveComp_GetCPPVelocityFromAnimation, ReturnValue) == 0x000000, "Member 'AIMoveComp_GetCPPVelocityFromAnimation::ReturnValue' has a wrong offset!");

// Function Survival.AIMoveComp.GetCPPVelocityValue
// 0x0004 (0x0004 - 0x0000)
struct AIMoveComp_GetCPPVelocityValue final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AIMoveComp_GetCPPVelocityValue) == 0x000004, "Wrong alignment on AIMoveComp_GetCPPVelocityValue");
static_assert(sizeof(AIMoveComp_GetCPPVelocityValue) == 0x000004, "Wrong size on AIMoveComp_GetCPPVelocityValue");
static_assert(offsetof(AIMoveComp_GetCPPVelocityValue, ReturnValue) == 0x000000, "Member 'AIMoveComp_GetCPPVelocityValue::ReturnValue' has a wrong offset!");

// Function Survival.AIMoveComp.SetCPPAnimationAngle
// 0x0004 (0x0004 - 0x0000)
struct AIMoveComp_SetCPPAnimationAngle final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AIMoveComp_SetCPPAnimationAngle) == 0x000004, "Wrong alignment on AIMoveComp_SetCPPAnimationAngle");
static_assert(sizeof(AIMoveComp_SetCPPAnimationAngle) == 0x000004, "Wrong size on AIMoveComp_SetCPPAnimationAngle");
static_assert(offsetof(AIMoveComp_SetCPPAnimationAngle, NewValue) == 0x000000, "Member 'AIMoveComp_SetCPPAnimationAngle::NewValue' has a wrong offset!");

// Function Survival.AIMoveComp.SetCPPIsStopping
// 0x0001 (0x0001 - 0x0000)
struct AIMoveComp_SetCPPIsStopping final
{
public:
	bool                                          NewValue;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AIMoveComp_SetCPPIsStopping) == 0x000001, "Wrong alignment on AIMoveComp_SetCPPIsStopping");
static_assert(sizeof(AIMoveComp_SetCPPIsStopping) == 0x000001, "Wrong size on AIMoveComp_SetCPPIsStopping");
static_assert(offsetof(AIMoveComp_SetCPPIsStopping, NewValue) == 0x000000, "Member 'AIMoveComp_SetCPPIsStopping::NewValue' has a wrong offset!");

// Function Survival.AIMoveComp.SetCPPMovementType
// 0x0001 (0x0001 - 0x0000)
struct AIMoveComp_SetCPPMovementType final
{
public:
	Survival::EMovementType                       NewValue;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AIMoveComp_SetCPPMovementType) == 0x000001, "Wrong alignment on AIMoveComp_SetCPPMovementType");
static_assert(sizeof(AIMoveComp_SetCPPMovementType) == 0x000001, "Wrong size on AIMoveComp_SetCPPMovementType");
static_assert(offsetof(AIMoveComp_SetCPPMovementType, NewValue) == 0x000000, "Member 'AIMoveComp_SetCPPMovementType::NewValue' has a wrong offset!");

// Function Survival.AIMoveComp.SetCPPVelocityFromAnimation
// 0x0001 (0x0001 - 0x0000)
struct AIMoveComp_SetCPPVelocityFromAnimation final
{
public:
	bool                                          NewValue;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AIMoveComp_SetCPPVelocityFromAnimation) == 0x000001, "Wrong alignment on AIMoveComp_SetCPPVelocityFromAnimation");
static_assert(sizeof(AIMoveComp_SetCPPVelocityFromAnimation) == 0x000001, "Wrong size on AIMoveComp_SetCPPVelocityFromAnimation");
static_assert(offsetof(AIMoveComp_SetCPPVelocityFromAnimation, NewValue) == 0x000000, "Member 'AIMoveComp_SetCPPVelocityFromAnimation::NewValue' has a wrong offset!");

// Function Survival.AIMoveComp.SetCPPVelocityValue
// 0x0004 (0x0004 - 0x0000)
struct AIMoveComp_SetCPPVelocityValue final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AIMoveComp_SetCPPVelocityValue) == 0x000004, "Wrong alignment on AIMoveComp_SetCPPVelocityValue");
static_assert(sizeof(AIMoveComp_SetCPPVelocityValue) == 0x000004, "Wrong size on AIMoveComp_SetCPPVelocityValue");
static_assert(offsetof(AIMoveComp_SetCPPVelocityValue, NewValue) == 0x000000, "Member 'AIMoveComp_SetCPPVelocityValue::NewValue' has a wrong offset!");

// Function Survival.BFL_Loop.ArraySortInt
// 0x0028 (0x0028 - 0x0000)
struct BFL_Loop_ArraySortInt final
{
public:
	TArray<int32>                                 Arrayname;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          FromEnd;                                           // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BFL_Loop_ArraySortInt) == 0x000008, "Wrong alignment on BFL_Loop_ArraySortInt");
static_assert(sizeof(BFL_Loop_ArraySortInt) == 0x000028, "Wrong size on BFL_Loop_ArraySortInt");
static_assert(offsetof(BFL_Loop_ArraySortInt, Arrayname) == 0x000000, "Member 'BFL_Loop_ArraySortInt::Arrayname' has a wrong offset!");
static_assert(offsetof(BFL_Loop_ArraySortInt, FromEnd) == 0x000010, "Member 'BFL_Loop_ArraySortInt::FromEnd' has a wrong offset!");
static_assert(offsetof(BFL_Loop_ArraySortInt, ReturnValue) == 0x000018, "Member 'BFL_Loop_ArraySortInt::ReturnValue' has a wrong offset!");

// Function Survival.BFL_Loop.MapSortByValue
// 0x00A8 (0x00A8 - 0x0000)
struct BFL_Loop_MapSortByValue final
{
public:
	TMap<class UObject*, int32>                   Map;                                               // 0x0000(0x0050)(Parm, NativeAccessSpecifierPublic)
	bool                                          FromEnd;                                           // 0x0050(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UObject*, int32>                   ReturnValue;                                       // 0x0058(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BFL_Loop_MapSortByValue) == 0x000008, "Wrong alignment on BFL_Loop_MapSortByValue");
static_assert(sizeof(BFL_Loop_MapSortByValue) == 0x0000A8, "Wrong size on BFL_Loop_MapSortByValue");
static_assert(offsetof(BFL_Loop_MapSortByValue, Map) == 0x000000, "Member 'BFL_Loop_MapSortByValue::Map' has a wrong offset!");
static_assert(offsetof(BFL_Loop_MapSortByValue, FromEnd) == 0x000050, "Member 'BFL_Loop_MapSortByValue::FromEnd' has a wrong offset!");
static_assert(offsetof(BFL_Loop_MapSortByValue, ReturnValue) == 0x000058, "Member 'BFL_Loop_MapSortByValue::ReturnValue' has a wrong offset!");

// Function Survival.BFL_Loop.StringMapSortByInt
// 0x00A8 (0x00A8 - 0x0000)
struct BFL_Loop_StringMapSortByInt final
{
public:
	TMap<class FString, int32>                    Map;                                               // 0x0000(0x0050)(Parm, NativeAccessSpecifierPublic)
	bool                                          FromEnd;                                           // 0x0050(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, int32>                    ReturnValue;                                       // 0x0058(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BFL_Loop_StringMapSortByInt) == 0x000008, "Wrong alignment on BFL_Loop_StringMapSortByInt");
static_assert(sizeof(BFL_Loop_StringMapSortByInt) == 0x0000A8, "Wrong size on BFL_Loop_StringMapSortByInt");
static_assert(offsetof(BFL_Loop_StringMapSortByInt, Map) == 0x000000, "Member 'BFL_Loop_StringMapSortByInt::Map' has a wrong offset!");
static_assert(offsetof(BFL_Loop_StringMapSortByInt, FromEnd) == 0x000050, "Member 'BFL_Loop_StringMapSortByInt::FromEnd' has a wrong offset!");
static_assert(offsetof(BFL_Loop_StringMapSortByInt, ReturnValue) == 0x000058, "Member 'BFL_Loop_StringMapSortByInt::ReturnValue' has a wrong offset!");

// Function Survival.RnnrSetVar.SetBoolByName
// 0x0020 (0x0020 - 0x0000)
struct RnnrSetVar_SetBoolByName final
{
public:
	class UObject*                                Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   VarName;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          NewValue;                                          // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RnnrSetVar_SetBoolByName) == 0x000008, "Wrong alignment on RnnrSetVar_SetBoolByName");
static_assert(sizeof(RnnrSetVar_SetBoolByName) == 0x000020, "Wrong size on RnnrSetVar_SetBoolByName");
static_assert(offsetof(RnnrSetVar_SetBoolByName, Target) == 0x000000, "Member 'RnnrSetVar_SetBoolByName::Target' has a wrong offset!");
static_assert(offsetof(RnnrSetVar_SetBoolByName, VarName) == 0x000008, "Member 'RnnrSetVar_SetBoolByName::VarName' has a wrong offset!");
static_assert(offsetof(RnnrSetVar_SetBoolByName, NewValue) == 0x000010, "Member 'RnnrSetVar_SetBoolByName::NewValue' has a wrong offset!");
static_assert(offsetof(RnnrSetVar_SetBoolByName, ReturnValue) == 0x000018, "Member 'RnnrSetVar_SetBoolByName::ReturnValue' has a wrong offset!");

// Function Survival.RnnrSetVar.SetVolumetricTranslucentShadow
// 0x0010 (0x0010 - 0x0000)
struct RnnrSetVar_SetVolumetricTranslucentShadow final
{
public:
	class UPrimitiveComponent*                    Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          NewValue;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RnnrSetVar_SetVolumetricTranslucentShadow) == 0x000008, "Wrong alignment on RnnrSetVar_SetVolumetricTranslucentShadow");
static_assert(sizeof(RnnrSetVar_SetVolumetricTranslucentShadow) == 0x000010, "Wrong size on RnnrSetVar_SetVolumetricTranslucentShadow");
static_assert(offsetof(RnnrSetVar_SetVolumetricTranslucentShadow, Target) == 0x000000, "Member 'RnnrSetVar_SetVolumetricTranslucentShadow::Target' has a wrong offset!");
static_assert(offsetof(RnnrSetVar_SetVolumetricTranslucentShadow, NewValue) == 0x000008, "Member 'RnnrSetVar_SetVolumetricTranslucentShadow::NewValue' has a wrong offset!");

// Function Survival.CharacterHeadStim.CalculateVariablesCPP
// 0x0004 (0x0004 - 0x0000)
struct CharacterHeadStim_CalculateVariablesCPP final
{
public:
	float                                         _DeltaTime;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterHeadStim_CalculateVariablesCPP) == 0x000004, "Wrong alignment on CharacterHeadStim_CalculateVariablesCPP");
static_assert(sizeof(CharacterHeadStim_CalculateVariablesCPP) == 0x000004, "Wrong size on CharacterHeadStim_CalculateVariablesCPP");
static_assert(offsetof(CharacterHeadStim_CalculateVariablesCPP, _DeltaTime) == 0x000000, "Member 'CharacterHeadStim_CalculateVariablesCPP::_DeltaTime' has a wrong offset!");

// Function Survival.CharacterHeadStim.MainLineTrace
// 0x00F0 (0x00F0 - 0x0000)
struct CharacterHeadStim_MainLineTrace final
{
public:
	float                                         Distance;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Debug;                                             // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             ReturnValue;                                       // 0x0008(0x00E8)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterHeadStim_MainLineTrace) == 0x000008, "Wrong alignment on CharacterHeadStim_MainLineTrace");
static_assert(sizeof(CharacterHeadStim_MainLineTrace) == 0x0000F0, "Wrong size on CharacterHeadStim_MainLineTrace");
static_assert(offsetof(CharacterHeadStim_MainLineTrace, Distance) == 0x000000, "Member 'CharacterHeadStim_MainLineTrace::Distance' has a wrong offset!");
static_assert(offsetof(CharacterHeadStim_MainLineTrace, Debug) == 0x000004, "Member 'CharacterHeadStim_MainLineTrace::Debug' has a wrong offset!");
static_assert(offsetof(CharacterHeadStim_MainLineTrace, ReturnValue) == 0x000008, "Member 'CharacterHeadStim_MainLineTrace::ReturnValue' has a wrong offset!");

// Function Survival.CharacterHeadStim.NegativeEffectCalculate
// 0x0028 (0x0028 - 0x0000)
struct CharacterHeadStim_NegativeEffectCalculate final
{
public:
	EUNegativeEffectDamageType                    _negativeEffectDamageType;                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _health;                                           // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   _boneName;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _bleedChanceMultiplier;                            // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _armor;                                            // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EUNegativeEffectType>                  ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterHeadStim_NegativeEffectCalculate) == 0x000008, "Wrong alignment on CharacterHeadStim_NegativeEffectCalculate");
static_assert(sizeof(CharacterHeadStim_NegativeEffectCalculate) == 0x000028, "Wrong size on CharacterHeadStim_NegativeEffectCalculate");
static_assert(offsetof(CharacterHeadStim_NegativeEffectCalculate, _negativeEffectDamageType) == 0x000000, "Member 'CharacterHeadStim_NegativeEffectCalculate::_negativeEffectDamageType' has a wrong offset!");
static_assert(offsetof(CharacterHeadStim_NegativeEffectCalculate, _health) == 0x000004, "Member 'CharacterHeadStim_NegativeEffectCalculate::_health' has a wrong offset!");
static_assert(offsetof(CharacterHeadStim_NegativeEffectCalculate, _boneName) == 0x000008, "Member 'CharacterHeadStim_NegativeEffectCalculate::_boneName' has a wrong offset!");
static_assert(offsetof(CharacterHeadStim_NegativeEffectCalculate, _bleedChanceMultiplier) == 0x000010, "Member 'CharacterHeadStim_NegativeEffectCalculate::_bleedChanceMultiplier' has a wrong offset!");
static_assert(offsetof(CharacterHeadStim_NegativeEffectCalculate, _armor) == 0x000014, "Member 'CharacterHeadStim_NegativeEffectCalculate::_armor' has a wrong offset!");
static_assert(offsetof(CharacterHeadStim_NegativeEffectCalculate, ReturnValue) == 0x000018, "Member 'CharacterHeadStim_NegativeEffectCalculate::ReturnValue' has a wrong offset!");

// Function Survival.CharacterHeadStim.OnSignificance
// 0x0003 (0x0003 - 0x0000)
struct CharacterHeadStim_OnSignificance final
{
public:
	ESignificanceLevel                            OldSignificance;                                   // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESignificanceLevel                            Significance;                                      // 0x0001(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFinal;                                            // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterHeadStim_OnSignificance) == 0x000001, "Wrong alignment on CharacterHeadStim_OnSignificance");
static_assert(sizeof(CharacterHeadStim_OnSignificance) == 0x000003, "Wrong size on CharacterHeadStim_OnSignificance");
static_assert(offsetof(CharacterHeadStim_OnSignificance, OldSignificance) == 0x000000, "Member 'CharacterHeadStim_OnSignificance::OldSignificance' has a wrong offset!");
static_assert(offsetof(CharacterHeadStim_OnSignificance, Significance) == 0x000001, "Member 'CharacterHeadStim_OnSignificance::Significance' has a wrong offset!");
static_assert(offsetof(CharacterHeadStim_OnSignificance, bFinal) == 0x000002, "Member 'CharacterHeadStim_OnSignificance::bFinal' has a wrong offset!");

// Function Survival.CharacterHeadStim.GetLookAtLocation
// 0x0018 (0x0018 - 0x0000)
struct CharacterHeadStim_GetLookAtLocation final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterHeadStim_GetLookAtLocation) == 0x000008, "Wrong alignment on CharacterHeadStim_GetLookAtLocation");
static_assert(sizeof(CharacterHeadStim_GetLookAtLocation) == 0x000018, "Wrong size on CharacterHeadStim_GetLookAtLocation");
static_assert(offsetof(CharacterHeadStim_GetLookAtLocation, ReturnValue) == 0x000000, "Member 'CharacterHeadStim_GetLookAtLocation::ReturnValue' has a wrong offset!");

// Function Survival.FL_SteamHelper.GetSteamAuthenticateUserTicket
// 0x0010 (0x0010 - 0x0000)
struct FL_SteamHelper_GetSteamAuthenticateUserTicket final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FL_SteamHelper_GetSteamAuthenticateUserTicket) == 0x000008, "Wrong alignment on FL_SteamHelper_GetSteamAuthenticateUserTicket");
static_assert(sizeof(FL_SteamHelper_GetSteamAuthenticateUserTicket) == 0x000010, "Wrong size on FL_SteamHelper_GetSteamAuthenticateUserTicket");
static_assert(offsetof(FL_SteamHelper_GetSteamAuthenticateUserTicket, ReturnValue) == 0x000000, "Member 'FL_SteamHelper_GetSteamAuthenticateUserTicket::ReturnValue' has a wrong offset!");

// Function Survival.FL_SteamHelper.GetSteamUserCountryCode
// 0x0010 (0x0010 - 0x0000)
struct FL_SteamHelper_GetSteamUserCountryCode final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FL_SteamHelper_GetSteamUserCountryCode) == 0x000008, "Wrong alignment on FL_SteamHelper_GetSteamUserCountryCode");
static_assert(sizeof(FL_SteamHelper_GetSteamUserCountryCode) == 0x000010, "Wrong size on FL_SteamHelper_GetSteamUserCountryCode");
static_assert(offsetof(FL_SteamHelper_GetSteamUserCountryCode, ReturnValue) == 0x000000, "Member 'FL_SteamHelper_GetSteamUserCountryCode::ReturnValue' has a wrong offset!");

// Function Survival.FL_SteamHelper.GetSteamUserIDString
// 0x0010 (0x0010 - 0x0000)
struct FL_SteamHelper_GetSteamUserIDString final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FL_SteamHelper_GetSteamUserIDString) == 0x000008, "Wrong alignment on FL_SteamHelper_GetSteamUserIDString");
static_assert(sizeof(FL_SteamHelper_GetSteamUserIDString) == 0x000010, "Wrong size on FL_SteamHelper_GetSteamUserIDString");
static_assert(offsetof(FL_SteamHelper_GetSteamUserIDString, ReturnValue) == 0x000000, "Member 'FL_SteamHelper_GetSteamUserIDString::ReturnValue' has a wrong offset!");

// Function Survival.GameHUD.SetUI
// 0x0001 (0x0001 - 0x0000)
struct GameHUD_SetUI final
{
public:
	EUIType                                       Type;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameHUD_SetUI) == 0x000001, "Wrong alignment on GameHUD_SetUI");
static_assert(sizeof(GameHUD_SetUI) == 0x000001, "Wrong size on GameHUD_SetUI");
static_assert(offsetof(GameHUD_SetUI, Type) == 0x000000, "Member 'GameHUD_SetUI::Type' has a wrong offset!");

// Function Survival.GoreComponent.TransformHitLocationToSkeletonRelative
// 0x0040 (0x0040 - 0x0000)
struct GoreComponent_TransformHitLocationToSkeletonRelative final
{
public:
	struct FVector                                HitLocation;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class USkeletalMeshComponent*           Mesh;                                              // 0x0018(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0020(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0028(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GoreComponent_TransformHitLocationToSkeletonRelative) == 0x000008, "Wrong alignment on GoreComponent_TransformHitLocationToSkeletonRelative");
static_assert(sizeof(GoreComponent_TransformHitLocationToSkeletonRelative) == 0x000040, "Wrong size on GoreComponent_TransformHitLocationToSkeletonRelative");
static_assert(offsetof(GoreComponent_TransformHitLocationToSkeletonRelative, HitLocation) == 0x000000, "Member 'GoreComponent_TransformHitLocationToSkeletonRelative::HitLocation' has a wrong offset!");
static_assert(offsetof(GoreComponent_TransformHitLocationToSkeletonRelative, Mesh) == 0x000018, "Member 'GoreComponent_TransformHitLocationToSkeletonRelative::Mesh' has a wrong offset!");
static_assert(offsetof(GoreComponent_TransformHitLocationToSkeletonRelative, BoneName) == 0x000020, "Member 'GoreComponent_TransformHitLocationToSkeletonRelative::BoneName' has a wrong offset!");
static_assert(offsetof(GoreComponent_TransformHitLocationToSkeletonRelative, ReturnValue) == 0x000028, "Member 'GoreComponent_TransformHitLocationToSkeletonRelative::ReturnValue' has a wrong offset!");

// Function Survival.GoreComponent.CriticalDamaged
// 0x0001 (0x0001 - 0x0000)
struct GoreComponent_CriticalDamaged final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GoreComponent_CriticalDamaged) == 0x000001, "Wrong alignment on GoreComponent_CriticalDamaged");
static_assert(sizeof(GoreComponent_CriticalDamaged) == 0x000001, "Wrong size on GoreComponent_CriticalDamaged");
static_assert(offsetof(GoreComponent_CriticalDamaged, ReturnValue) == 0x000000, "Member 'GoreComponent_CriticalDamaged::ReturnValue' has a wrong offset!");

// Function Survival.GoreComponent.DestroyLimb
// 0x0020 (0x0020 - 0x0000)
struct GoreComponent_DestroyLimb final
{
public:
	class FName                                   BoneName;                                          // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                HitLocation;                                       // 0x0008(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GoreComponent_DestroyLimb) == 0x000008, "Wrong alignment on GoreComponent_DestroyLimb");
static_assert(sizeof(GoreComponent_DestroyLimb) == 0x000020, "Wrong size on GoreComponent_DestroyLimb");
static_assert(offsetof(GoreComponent_DestroyLimb, BoneName) == 0x000000, "Member 'GoreComponent_DestroyLimb::BoneName' has a wrong offset!");
static_assert(offsetof(GoreComponent_DestroyLimb, HitLocation) == 0x000008, "Member 'GoreComponent_DestroyLimb::HitLocation' has a wrong offset!");

// Function Survival.GoreComponent.SetOwnerMesh
// 0x0008 (0x0008 - 0x0000)
struct GoreComponent_SetOwnerMesh final
{
public:
	class USkeletalMeshComponent*                 Mesh;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GoreComponent_SetOwnerMesh) == 0x000008, "Wrong alignment on GoreComponent_SetOwnerMesh");
static_assert(sizeof(GoreComponent_SetOwnerMesh) == 0x000008, "Wrong size on GoreComponent_SetOwnerMesh");
static_assert(offsetof(GoreComponent_SetOwnerMesh, Mesh) == 0x000000, "Member 'GoreComponent_SetOwnerMesh::Mesh' has a wrong offset!");

// Function Survival.PathToAnimal.AddAnimalStep
// 0x0028 (0x0028 - 0x0000)
struct PathToAnimal_AddAnimalStep final
{
public:
	struct FAnimalSteps                           Steps;                                             // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	class AActor*                                 Actor;                                             // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         ReturnedSteps;                                     // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(PathToAnimal_AddAnimalStep) == 0x000008, "Wrong alignment on PathToAnimal_AddAnimalStep");
static_assert(sizeof(PathToAnimal_AddAnimalStep) == 0x000028, "Wrong size on PathToAnimal_AddAnimalStep");
static_assert(offsetof(PathToAnimal_AddAnimalStep, Steps) == 0x000000, "Member 'PathToAnimal_AddAnimalStep::Steps' has a wrong offset!");
static_assert(offsetof(PathToAnimal_AddAnimalStep, Actor) == 0x000010, "Member 'PathToAnimal_AddAnimalStep::Actor' has a wrong offset!");
static_assert(offsetof(PathToAnimal_AddAnimalStep, ReturnedSteps) == 0x000018, "Member 'PathToAnimal_AddAnimalStep::ReturnedSteps' has a wrong offset!");

// Function Survival.ProjectileBullet.CalcVelocity
// 0x0018 (0x0018 - 0x0000)
struct ProjectileBullet_CalcVelocity final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ProjectileBullet_CalcVelocity) == 0x000008, "Wrong alignment on ProjectileBullet_CalcVelocity");
static_assert(sizeof(ProjectileBullet_CalcVelocity) == 0x000018, "Wrong size on ProjectileBullet_CalcVelocity");
static_assert(offsetof(ProjectileBullet_CalcVelocity, ReturnValue) == 0x000000, "Member 'ProjectileBullet_CalcVelocity::ReturnValue' has a wrong offset!");

// Function Survival.ProjectileBullet.InitBullet
// 0x0010 (0x0010 - 0x0000)
struct ProjectileBullet_InitBullet final
{
public:
	float                                         bulletSpeedMultiplier;                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bulletSlowCoef;                                    // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bulletSpeed;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bulletSpeedFinal;                                  // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ProjectileBullet_InitBullet) == 0x000004, "Wrong alignment on ProjectileBullet_InitBullet");
static_assert(sizeof(ProjectileBullet_InitBullet) == 0x000010, "Wrong size on ProjectileBullet_InitBullet");
static_assert(offsetof(ProjectileBullet_InitBullet, bulletSpeedMultiplier) == 0x000000, "Member 'ProjectileBullet_InitBullet::bulletSpeedMultiplier' has a wrong offset!");
static_assert(offsetof(ProjectileBullet_InitBullet, bulletSlowCoef) == 0x000004, "Member 'ProjectileBullet_InitBullet::bulletSlowCoef' has a wrong offset!");
static_assert(offsetof(ProjectileBullet_InitBullet, bulletSpeed) == 0x000008, "Member 'ProjectileBullet_InitBullet::bulletSpeed' has a wrong offset!");
static_assert(offsetof(ProjectileBullet_InitBullet, bulletSpeedFinal) == 0x00000C, "Member 'ProjectileBullet_InitBullet::bulletSpeedFinal' has a wrong offset!");

// Function Survival.ProjectileBullet.InitBulletParam
// 0x0008 (0x0008 - 0x0000)
struct ProjectileBullet_InitBulletParam final
{
public:
	float                                         FMass;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FTrueCaliber;                                      // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ProjectileBullet_InitBulletParam) == 0x000004, "Wrong alignment on ProjectileBullet_InitBulletParam");
static_assert(sizeof(ProjectileBullet_InitBulletParam) == 0x000008, "Wrong size on ProjectileBullet_InitBulletParam");
static_assert(offsetof(ProjectileBullet_InitBulletParam, FMass) == 0x000000, "Member 'ProjectileBullet_InitBulletParam::FMass' has a wrong offset!");
static_assert(offsetof(ProjectileBullet_InitBulletParam, FTrueCaliber) == 0x000004, "Member 'ProjectileBullet_InitBulletParam::FTrueCaliber' has a wrong offset!");

// Function Survival.ProjectileBullet.ProjectileOnceTime
// 0x0004 (0x0004 - 0x0000)
struct ProjectileBullet_ProjectileOnceTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ProjectileBullet_ProjectileOnceTime) == 0x000004, "Wrong alignment on ProjectileBullet_ProjectileOnceTime");
static_assert(sizeof(ProjectileBullet_ProjectileOnceTime) == 0x000004, "Wrong size on ProjectileBullet_ProjectileOnceTime");
static_assert(offsetof(ProjectileBullet_ProjectileOnceTime, ReturnValue) == 0x000000, "Member 'ProjectileBullet_ProjectileOnceTime::ReturnValue' has a wrong offset!");

// Function Survival.RBVehicle.PhysicsTick
// 0x0004 (0x0004 - 0x0000)
struct RBVehicle_PhysicsTick final
{
public:
	float                                         SubstepDeltaTime;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RBVehicle_PhysicsTick) == 0x000004, "Wrong alignment on RBVehicle_PhysicsTick");
static_assert(sizeof(RBVehicle_PhysicsTick) == 0x000004, "Wrong size on RBVehicle_PhysicsTick");
static_assert(offsetof(RBVehicle_PhysicsTick, SubstepDeltaTime) == 0x000000, "Member 'RBVehicle_PhysicsTick::SubstepDeltaTime' has a wrong offset!");

// Function Survival.RBVehicle.UpdateLastMove
// 0x0004 (0x0004 - 0x0000)
struct RBVehicle_UpdateLastMove final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RBVehicle_UpdateLastMove) == 0x000004, "Wrong alignment on RBVehicle_UpdateLastMove");
static_assert(sizeof(RBVehicle_UpdateLastMove) == 0x000004, "Wrong size on RBVehicle_UpdateLastMove");
static_assert(offsetof(RBVehicle_UpdateLastMove, DeltaTime) == 0x000000, "Member 'RBVehicle_UpdateLastMove::DeltaTime' has a wrong offset!");

// Function Survival.SmoothSync.ClientSendsTransformToServer
// 0x0010 (0x0010 - 0x0000)
struct SmoothSync_ClientSendsTransformToServer final
{
public:
	TArray<uint8>                                 Value;                                             // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SmoothSync_ClientSendsTransformToServer) == 0x000008, "Wrong alignment on SmoothSync_ClientSendsTransformToServer");
static_assert(sizeof(SmoothSync_ClientSendsTransformToServer) == 0x000010, "Wrong size on SmoothSync_ClientSendsTransformToServer");
static_assert(offsetof(SmoothSync_ClientSendsTransformToServer, Value) == 0x000000, "Member 'SmoothSync_ClientSendsTransformToServer::Value' has a wrong offset!");

// Function Survival.SmoothSync.enableSmoothSync
// 0x0001 (0x0001 - 0x0000)
struct SmoothSync_EnableSmoothSync final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SmoothSync_EnableSmoothSync) == 0x000001, "Wrong alignment on SmoothSync_EnableSmoothSync");
static_assert(sizeof(SmoothSync_EnableSmoothSync) == 0x000001, "Wrong size on SmoothSync_EnableSmoothSync");
static_assert(offsetof(SmoothSync_EnableSmoothSync, Enable) == 0x000000, "Member 'SmoothSync_EnableSmoothSync::Enable' has a wrong offset!");

// Function Survival.SmoothSync.ServerSendsTransformToEveryone
// 0x0010 (0x0010 - 0x0000)
struct SmoothSync_ServerSendsTransformToEveryone final
{
public:
	TArray<uint8>                                 Value;                                             // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SmoothSync_ServerSendsTransformToEveryone) == 0x000008, "Wrong alignment on SmoothSync_ServerSendsTransformToEveryone");
static_assert(sizeof(SmoothSync_ServerSendsTransformToEveryone) == 0x000010, "Wrong size on SmoothSync_ServerSendsTransformToEveryone");
static_assert(offsetof(SmoothSync_ServerSendsTransformToEveryone, Value) == 0x000000, "Member 'SmoothSync_ServerSendsTransformToEveryone::Value' has a wrong offset!");

// Function Survival.SmoothSync.setSceneComponentToSync
// 0x0008 (0x0008 - 0x0000)
struct SmoothSync_SetSceneComponentToSync final
{
public:
	class USceneComponent*                        TheComponent;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SmoothSync_SetSceneComponentToSync) == 0x000008, "Wrong alignment on SmoothSync_SetSceneComponentToSync");
static_assert(sizeof(SmoothSync_SetSceneComponentToSync) == 0x000008, "Wrong size on SmoothSync_SetSceneComponentToSync");
static_assert(offsetof(SmoothSync_SetSceneComponentToSync, TheComponent) == 0x000000, "Member 'SmoothSync_SetSceneComponentToSync::TheComponent' has a wrong offset!");

// Function Survival.SmoothSync.SmoothSyncEnableClientToServer
// 0x0001 (0x0001 - 0x0000)
struct SmoothSync_SmoothSyncEnableClientToServer final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SmoothSync_SmoothSyncEnableClientToServer) == 0x000001, "Wrong alignment on SmoothSync_SmoothSyncEnableClientToServer");
static_assert(sizeof(SmoothSync_SmoothSyncEnableClientToServer) == 0x000001, "Wrong size on SmoothSync_SmoothSyncEnableClientToServer");
static_assert(offsetof(SmoothSync_SmoothSyncEnableClientToServer, Enable) == 0x000000, "Member 'SmoothSync_SmoothSyncEnableClientToServer::Enable' has a wrong offset!");

// Function Survival.SmoothSync.SmoothSyncEnableServerToClients
// 0x0001 (0x0001 - 0x0000)
struct SmoothSync_SmoothSyncEnableServerToClients final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SmoothSync_SmoothSyncEnableServerToClients) == 0x000001, "Wrong alignment on SmoothSync_SmoothSyncEnableServerToClients");
static_assert(sizeof(SmoothSync_SmoothSyncEnableServerToClients) == 0x000001, "Wrong size on SmoothSync_SmoothSyncEnableServerToClients");
static_assert(offsetof(SmoothSync_SmoothSyncEnableServerToClients, Enable) == 0x000000, "Member 'SmoothSync_SmoothSyncEnableServerToClients::Enable' has a wrong offset!");

// Function Survival.SmoothSync.SmoothSyncTeleportClientToServer
// 0x0028 (0x0028 - 0x0000)
struct SmoothSync_SmoothSyncTeleportClientToServer final
{
public:
	struct FVector3f                              Position;                                          // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector3f                              Rotation;                                          // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector3f                              Scale;                                             // 0x0018(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TempOwnerTime;                                     // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SmoothSync_SmoothSyncTeleportClientToServer) == 0x000004, "Wrong alignment on SmoothSync_SmoothSyncTeleportClientToServer");
static_assert(sizeof(SmoothSync_SmoothSyncTeleportClientToServer) == 0x000028, "Wrong size on SmoothSync_SmoothSyncTeleportClientToServer");
static_assert(offsetof(SmoothSync_SmoothSyncTeleportClientToServer, Position) == 0x000000, "Member 'SmoothSync_SmoothSyncTeleportClientToServer::Position' has a wrong offset!");
static_assert(offsetof(SmoothSync_SmoothSyncTeleportClientToServer, Rotation) == 0x00000C, "Member 'SmoothSync_SmoothSyncTeleportClientToServer::Rotation' has a wrong offset!");
static_assert(offsetof(SmoothSync_SmoothSyncTeleportClientToServer, Scale) == 0x000018, "Member 'SmoothSync_SmoothSyncTeleportClientToServer::Scale' has a wrong offset!");
static_assert(offsetof(SmoothSync_SmoothSyncTeleportClientToServer, TempOwnerTime) == 0x000024, "Member 'SmoothSync_SmoothSyncTeleportClientToServer::TempOwnerTime' has a wrong offset!");

// Function Survival.SmoothSync.SmoothSyncTeleportServerToClients
// 0x0028 (0x0028 - 0x0000)
struct SmoothSync_SmoothSyncTeleportServerToClients final
{
public:
	struct FVector3f                              Position;                                          // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector3f                              Rotation;                                          // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
