#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SurviveAnim_IK

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "BPE_Weapon_Type_structs.hpp"


namespace SDK::Params
{

// Function SurviveAnim_IK.SurviveAnim_IK_C.AddCharacterRotation
// 0x0018 (0x0018 - 0x0000)
struct SurviveAnim_IK_C_AddCharacterRotation final
{
public:
	struct FRotator                               Amount;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SurviveAnim_IK_C_AddCharacterRotation) == 0x000008, "Wrong alignment on SurviveAnim_IK_C_AddCharacterRotation");
static_assert(sizeof(SurviveAnim_IK_C_AddCharacterRotation) == 0x000018, "Wrong size on SurviveAnim_IK_C_AddCharacterRotation");
static_assert(offsetof(SurviveAnim_IK_C_AddCharacterRotation, Amount) == 0x000000, "Member 'SurviveAnim_IK_C_AddCharacterRotation::Amount' has a wrong offset!");

// Function SurviveAnim_IK.SurviveAnim_IK_C.AnimGraph
// 0x0020 (0x0020 - 0x0000)
struct SurviveAnim_IK_C_AnimGraph final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(SurviveAnim_IK_C_AnimGraph) == 0x000008, "Wrong alignment on SurviveAnim_IK_C_AnimGraph");
static_assert(sizeof(SurviveAnim_IK_C_AnimGraph) == 0x000020, "Wrong size on SurviveAnim_IK_C_AnimGraph");
static_assert(offsetof(SurviveAnim_IK_C_AnimGraph, InPose) == 0x000000, "Member 'SurviveAnim_IK_C_AnimGraph::InPose' has a wrong offset!");
static_assert(offsetof(SurviveAnim_IK_C_AnimGraph, Param_AnimGraph) == 0x000010, "Member 'SurviveAnim_IK_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function SurviveAnim_IK.SurviveAnim_IK_C.AnimNotifyTurningInPlace
// 0x0010 (0x0010 - 0x0000)
struct SurviveAnim_IK_C_AnimNotifyTurningInPlace final
{
public:
	class UAnimMontage*                           TurnIPMontage;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldTurn;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TurningIP;                                         // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TurningRight;                                      // 0x000A(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SurviveAnim_IK_C_AnimNotifyTurningInPlace) == 0x000008, "Wrong alignment on SurviveAnim_IK_C_AnimNotifyTurningInPlace");
static_assert(sizeof(SurviveAnim_IK_C_AnimNotifyTurningInPlace) == 0x000010, "Wrong size on SurviveAnim_IK_C_AnimNotifyTurningInPlace");
static_assert(offsetof(SurviveAnim_IK_C_AnimNotifyTurningInPlace, TurnIPMontage) == 0x000000, "Member 'SurviveAnim_IK_C_AnimNotifyTurningInPlace::TurnIPMontage' has a wrong offset!");
static_assert(offsetof(SurviveAnim_IK_C_AnimNotifyTurningInPlace, ShouldTurn) == 0x000008, "Member 'SurviveAnim_IK_C_AnimNotifyTurningInPlace::ShouldTurn' has a wrong offset!");
static_assert(offsetof(SurviveAnim_IK_C_AnimNotifyTurningInPlace, TurningIP) == 0x000009, "Member 'SurviveAnim_IK_C_AnimNotifyTurningInPlace::TurningIP' has a wrong offset!");
static_assert(offsetof(SurviveAnim_IK_C_AnimNotifyTurningInPlace, TurningRight) == 0x00000A, "Member 'SurviveAnim_IK_C_AnimNotifyTurningInPlace::TurningRight' has a wrong offset!");

// Function SurviveAnim_IK.SurviveAnim_IK_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct SurviveAnim_IK_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SurviveAnim_IK_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on SurviveAnim_IK_C_BlueprintUpdateAnimation");
static_assert(sizeof(SurviveAnim_IK_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on SurviveAnim_IK_C_BlueprintUpdateAnimation");
static_assert(offsetof(SurviveAnim_IK_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'SurviveAnim_IK_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function SurviveAnim_IK.SurviveAnim_IK_C.BPI_CameraShake
// 0x0018 (0x0018 - 0x0000)
struct SurviveAnim_IK_C_BPI_CameraShake final
{
public:
	class UClass*                                 ShakeClass;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          NeedChangeScale;                                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Scale;                                             // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SurviveAnim_IK_C_BPI_CameraShake) == 0x000008, "Wrong alignment on SurviveAnim_IK_C_BPI_CameraShake");
static_assert(sizeof(SurviveAnim_IK_C_BPI_CameraShake) == 0x000018, "Wrong size on SurviveAnim_IK_C_BPI_CameraShake");
static_assert(offsetof(SurviveAnim_IK_C_BPI_CameraShake, ShakeClass) == 0x000000, "Member 'SurviveAnim_IK_C_BPI_CameraShake::ShakeClass' has a wrong offset!");
static_assert(offsetof(SurviveAnim_IK_C_BPI_CameraShake, NeedChangeScale) == 0x000008, "Member 'SurviveAnim_IK_C_BPI_CameraShake::NeedChangeScale' has a wrong offset!");
static_assert(offsetof(SurviveAnim_IK_C_BPI_CameraShake, Scale) == 0x000010, "Member 'SurviveAnim_IK_C_BPI_CameraShake::Scale' has a wrong offset!");

// Function SurviveAnim_IK.SurviveAnim_IK_C.CallEatMesh
// 0x0028 (0x0028 - 0x0000)
struct SurviveAnim_IK_C_CallEatMesh final
{
public:
	class FName                                   ItemType;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DurationAttached;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AnimDelay;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DissappearDelay;                                   // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PlayRate;                                          // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SurviveAnim_IK_C_CallEatMesh) == 0x000008, "Wrong alignment on SurviveAnim_IK_C_CallEatMesh");
static_assert(sizeof(SurviveAnim_IK_C_CallEatMesh) == 0x000028, "Wrong size on SurviveAnim_IK_C_CallEatMesh");
static_assert(offsetof(SurviveAnim_IK_C_CallEatMesh, ItemType) == 0x000000, "Member 'SurviveAnim_IK_C_CallEatMesh::ItemType' has a wrong offset!");
static_assert(offsetof(SurviveAnim_IK_C_CallEatMesh, DurationAttached) == 0x000008, "Member 'SurviveAnim_IK_C_CallEatMesh::DurationAttached' has a wrong offset!");
static_assert(offsetof(SurviveAnim_IK_C_CallEatMesh, AnimDelay) == 0x000010, "Member 'SurviveAnim_IK_C_CallEatMesh::AnimDelay' has a wrong offset!");
static_assert(offsetof(SurviveAnim_IK_C_CallEatMesh, DissappearDelay) == 0x000018, "Member 'SurviveAnim_IK_C_CallEatMesh::DissappearDelay' has a wrong offset!");
static_assert(offsetof(SurviveAnim_IK_C_CallEatMesh, PlayRate) == 0x000020, "Member 'SurviveAnim_IK_C_CallEatMesh::PlayRate' has a wrong offset!");

// Function SurviveAnim_IK.SurviveAnim_IK_C.CheckEndEat
// 0x0001 (0x0001 - 0x0000)
struct SurviveAnim_IK_C_CheckEndEat final
{
public:
	bool                                          Eat_;                                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SurviveAnim_IK_C_CheckEndEat) == 0x000001, "Wrong alignment on SurviveAnim_IK_C_CheckEndEat");
static_assert(sizeof(SurviveAnim_IK_C_CheckEndEat) == 0x000001, "Wrong size on SurviveAnim_IK_C_CheckEndEat");
static_assert(offsetof(SurviveAnim_IK_C_CheckEndEat, Eat_) == 0x000000, "Member 'SurviveAnim_IK_C_CheckEndEat::Eat_' has a wrong offset!");

// Function SurviveAnim_IK.SurviveAnim_IK_C.ExecuteUbergraph_SurviveAnim_IK
// 0x0250 (0x0250 - 0x0000)
struct SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_Event_TurnIPMontage;                        // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_ShouldTurn;                           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_TurningIP;                            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_TurningRight;                         // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               K2Node_Event_Amount;                               // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UClass*                                 K2Node_Event_ShakeClass;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_NeedChangeScale;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Event_Scale;                                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_Event_AnimMontage;                          // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsHipfire;                            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Reloading;                            // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Event_PlayRate;                             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_StartTime;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBPE_Weapon_Type                              K2Node_Event_WeaponType;                           // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_State;                                // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x2];                                       // 0x0082(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_ItemType;                             // 0x0084(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Event_DurationAttached;                     // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_AnimDelay;                            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_DissappearDelay;                      // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_PlayRate_1;                           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMovementMode                                 K2Node_Event_NewParam;                             // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue_1;            // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasRecentlyRendered_ReturnValue;          // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetOwningComponent_ReturnValue;           // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x00D0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0182(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_183[0xD];                                      // 0x0183(0x000D)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue_1;         // 0x0190(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x01F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x0210(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x0228(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          K2Node_Event_Anim;                                 // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_SpecialItem;                          // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_CanMove;                              // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_HasStandAnim;                         // 0x024A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_WepNotHiding;                         // 0x024B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK) == 0x000010, "Wrong alignment on SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK");
static_assert(sizeof(SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK) == 0x000250, "Wrong size on SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK");
static_assert(offsetof(SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK, EntryPoint) == 0x000000, "Member 'SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK::EntryPoint' has a wrong offset!");
static_assert(offsetof(SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK, K2Node_Event_TurnIPMontage) == 0x000008, "Member 'SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK::K2Node_Event_TurnIPMontage' has a wrong offset!");
static_assert(offsetof(SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK, K2Node_Event_ShouldTurn) == 0x000010, "Member 'SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK::K2Node_Event_ShouldTurn' has a wrong offset!");
static_assert(offsetof(SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK, K2Node_Event_TurningIP) == 0x000011, "Member 'SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK::K2Node_Event_TurningIP' has a wrong offset!");
static_assert(offsetof(SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK, K2Node_Event_TurningRight) == 0x000012, "Member 'SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK::K2Node_Event_TurningRight' has a wrong offset!");
static_assert(offsetof(SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK, K2Node_Event_Amount) == 0x000018, "Member 'SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK::K2Node_Event_Amount' has a wrong offset!");
static_assert(offsetof(SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK, K2Node_Event_ShakeClass) == 0x000030, "Member 'SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK::K2Node_Event_ShakeClass' has a wrong offset!");
static_assert(offsetof(SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK, K2Node_Event_NeedChangeScale) == 0x000038, "Member 'SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK::K2Node_Event_NeedChangeScale' has a wrong offset!");
static_assert(offsetof(SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK, K2Node_Event_Scale) == 0x000040, "Member 'SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK::K2Node_Event_Scale' has a wrong offset!");
static_assert(offsetof(SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK, K2Node_Event_AnimMontage) == 0x000048, "Member 'SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK::K2Node_Event_AnimMontage' has a wrong offset!");
static_assert(offsetof(SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK, K2Node_Event_IsHipfire) == 0x000050, "Member 'SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK::K2Node_Event_IsHipfire' has a wrong offset!");
static_assert(offsetof(SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK, K2Node_Event_Reloading) == 0x000051, "Member 'SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK::K2Node_Event_Reloading' has a wrong offset!");
static_assert(offsetof(SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK, K2Node_Event_PlayRate) == 0x000058, "Member 'SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK::K2Node_Event_PlayRate' has a wrong offset!");
static_assert(offsetof(SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK, K2Node_Event_StartTime) == 0x000060, "Member 'SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK::K2Node_Event_StartTime' has a wrong offset!");
static_assert(offsetof(SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK, K2Node_Event_WeaponType) == 0x000068, "Member 'SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK::K2Node_Event_WeaponType' has a wrong offset!");
static_assert(offsetof(SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK, K2Node_Event_State) == 0x000069, "Member 'SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK, K2Node_Event_DeltaTimeX) == 0x00006C, "Member 'SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000070, "Member 'SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK, K2Node_DynamicCast_AsSurvival_Player) == 0x000078, "Member 'SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK, CallFunc_IsValid_ReturnValue) == 0x000081, "Member 'SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK, K2Node_Event_ItemType) == 0x000084, "Member 'SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK::K2Node_Event_ItemType' has a wrong offset!");
static_assert(offsetof(SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK, K2Node_Event_DurationAttached) == 0x000090, "Member 'SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK::K2Node_Event_DurationAttached' has a wrong offset!");
static_assert(offsetof(SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK, K2Node_Event_AnimDelay) == 0x000098, "Member 'SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK::K2Node_Event_AnimDelay' has a wrong offset!");
static_assert(offsetof(SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK, K2Node_Event_DissappearDelay) == 0x0000A0, "Member 'SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK::K2Node_Event_DissappearDelay' has a wrong offset!");
static_assert(offsetof(SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK, K2Node_Event_PlayRate_1) == 0x0000A8, "Member 'SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK::K2Node_Event_PlayRate_1' has a wrong offset!");
static_assert(offsetof(SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK, K2Node_Event_NewParam) == 0x0000B0, "Member 'SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK::K2Node_Event_NewParam' has a wrong offset!");
static_assert(offsetof(SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK, K2Node_SwitchEnum_CmpSuccess) == 0x0000B1, "Member 'SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK, CallFunc_TryGetPawnOwner_ReturnValue_1) == 0x0000B8, "Member 'SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK::CallFunc_TryGetPawnOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK, CallFunc_IsValid_ReturnValue_1) == 0x0000C0, "Member 'SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK, CallFunc_WasRecentlyRendered_ReturnValue) == 0x0000C1, "Member 'SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK::CallFunc_WasRecentlyRendered_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK, CallFunc_GetOwningComponent_ReturnValue) == 0x0000C8, "Member 'SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK::CallFunc_GetOwningComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK, CallFunc_GetSocketTransform_ReturnValue) == 0x0000D0, "Member 'SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK, CallFunc_IsValid_ReturnValue_2) == 0x000130, "Member 'SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK, CallFunc_BreakTransform_Location) == 0x000138, "Member 'SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK, CallFunc_BreakTransform_Rotation) == 0x000150, "Member 'SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK, CallFunc_BreakTransform_Scale) == 0x000168, "Member 'SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000180, "Member 'SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK, CallFunc_BooleanOR_ReturnValue) == 0x000181, "Member 'SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK, CallFunc_BooleanOR_ReturnValue_1) == 0x000182, "Member 'SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK, CallFunc_GetSocketTransform_ReturnValue_1) == 0x000190, "Member 'SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK::CallFunc_GetSocketTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK, CallFunc_BooleanOR_ReturnValue_2) == 0x0001F0, "Member 'SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK, CallFunc_BreakTransform_Location_1) == 0x0001F8, "Member 'SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK, CallFunc_BreakTransform_Rotation_1) == 0x000210, "Member 'SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK, CallFunc_BreakTransform_Scale_1) == 0x000228, "Member 'SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK, K2Node_Event_Anim) == 0x000240, "Member 'SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK::K2Node_Event_Anim' has a wrong offset!");
static_assert(offsetof(SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK, K2Node_Event_SpecialItem) == 0x000248, "Member 'SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK::K2Node_Event_SpecialItem' has a wrong offset!");
static_assert(offsetof(SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK, K2Node_Event_CanMove) == 0x000249, "Member 'SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK::K2Node_Event_CanMove' has a wrong offset!");
static_assert(offsetof(SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK, K2Node_Event_HasStandAnim) == 0x00024A, "Member 'SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK::K2Node_Event_HasStandAnim' has a wrong offset!");
static_assert(offsetof(SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK, K2Node_Event_WepNotHiding) == 0x00024B, "Member 'SurviveAnim_IK_C_ExecuteUbergraph_SurviveAnim_IK::K2Node_Event_WepNotHiding' has a wrong offset!");

// Function SurviveAnim_IK.SurviveAnim_IK_C.FootIK
// 0x12F0 (0x12F0 - 0x0000)
struct SurviveAnim_IK_C_FootIK final
{
public:
	struct FVector                                RightFootOffsetTargets;                            // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LeftFootOffsetTargets;                             // 0x0018(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0060(0x0010)(ConstParm, ReferenceParm)
	bool                                          Temp_bool_Variable_2;                              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable_1;                            // 0x0078(0x0010)(ConstParm, ReferenceParm)
	bool                                          Temp_bool_Variable_3;                              // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X_1;                          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_2;                          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_2;                          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_2;                          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable_2;                            // 0x00E0(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable_3;                            // 0x0108(0x0010)(ConstParm, ReferenceParm)
	uint8                                         Temp_byte_Variable;                                // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable_1;                              // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Select_Default;                             // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_3;                          // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_3;                          // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_3;                          // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable_2;                              // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable_3;                              // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16A[0x6];                                      // 0x016A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Select_Default_1;                           // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_4;                          // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_4;                          // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_4;                          // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default_2;                           // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default_3;                           // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_5;                          // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_5;                          // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_5;                          // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_6;                          // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_6;                          // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_6;                          // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable_4;                              // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue_2;       // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue_3;       // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default_4;                           // 0x0218(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_7;                          // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_7;                          // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_7;                          // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0248(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_VSizeSquared_ReturnValue;                 // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_272[0x6];                                      // 0x0272(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X_8;                          // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_8;                          // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_8;                          // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0290(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x02A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Temp_byte_Variable_5;                              // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X_9;                          // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_9;                          // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_9;                          // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x02E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default_5;                           // 0x02F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_10;                         // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_10;                         // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_10;                         // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0328(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_BreakVector_X_11;                         // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_11;                         // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_11;                         // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_12;                         // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_12;                         // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_12;                         // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue_1;     // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_379[0x7];                                      // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_389[0x7];                                      // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default_6;                           // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FInterpTo_ReturnValue;                    // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default_7;                           // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_ReturnValue_1;                  // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_13;                         // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_13;                         // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_13;                         // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x03D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_ReturnValue_2;                  // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_2;               // 0x03F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Vector2DInterpTo_ReturnValue;             // 0x0400(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_14;                         // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_14;                         // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_14;                         // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_ReturnValue_3;                  // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_4;                 // 0x0440(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_3;               // 0x0458(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Vector2DInterpTo_ReturnValue_1;           // 0x0468(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable_6;                              // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_479[0x7];                                      // 0x0479(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_5;                 // 0x0490(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default_8;                           // 0x04A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_15;                         // 0x04C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_15;                         // 0x04C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_15;                         // 0x04D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable_7;                              // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D9[0x7];                                      // 0x04D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetOwningComponent_ReturnValue;           // 0x04E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x04E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default_9;                           // 0x0500(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_16;                         // 0x0518(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_16;                         // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_16;                         // 0x0528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_17;                         // 0x0530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_17;                         // 0x0538(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_17;                         // 0x0540(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_6;                 // 0x0548(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x0560(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_2;          // 0x0578(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_18;                         // 0x0590(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_18;                         // 0x0598(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_18;                         // 0x05A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_19;                         // 0x05A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_19;                         // 0x05B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_19;                         // 0x05B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_7;                 // 0x05C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_8;                 // 0x05D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x05F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_3;          // 0x0608(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_20;                         // 0x0620(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
