#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SurvCameraManager

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function SurvCameraManager.SurvCameraManager_C.BlueprintUpdateCamera
// 0x00F8 (0x00F8 - 0x0000)
struct SurvCameraManager_C_BlueprintUpdateCamera final
{
public:
	class AActor*                                 CameraTarget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NewCameraLocation;                                 // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               NewCameraRotation;                                 // 0x0020(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         NewCameraFOV;                                      // 0x0038(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x003C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_CustomCameraBehavior_Location;            // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_CustomCameraBehavior_Rotation;            // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_CustomCameraBehavior_FOV;                 // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BlueprintUpdateCamera_NewCameraLocation;  // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BlueprintUpdateCamera_NewCameraRotation;  // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BlueprintUpdateCamera_NewCameraFOV;       // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BlueprintUpdateCamera_ReturnValue;        // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BlueprintUpdateCamera_NewCameraLocation_1; // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BlueprintUpdateCamera_NewCameraRotation_1; // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BlueprintUpdateCamera_NewCameraFOV_1;     // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BlueprintUpdateCamera_ReturnValue_1;      // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_FunctionResult_NewCameraFOV_ImplicitCast;   // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SurvCameraManager_C_BlueprintUpdateCamera) == 0x000008, "Wrong alignment on SurvCameraManager_C_BlueprintUpdateCamera");
static_assert(sizeof(SurvCameraManager_C_BlueprintUpdateCamera) == 0x0000F8, "Wrong size on SurvCameraManager_C_BlueprintUpdateCamera");
static_assert(offsetof(SurvCameraManager_C_BlueprintUpdateCamera, CameraTarget) == 0x000000, "Member 'SurvCameraManager_C_BlueprintUpdateCamera::CameraTarget' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_BlueprintUpdateCamera, NewCameraLocation) == 0x000008, "Member 'SurvCameraManager_C_BlueprintUpdateCamera::NewCameraLocation' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_BlueprintUpdateCamera, NewCameraRotation) == 0x000020, "Member 'SurvCameraManager_C_BlueprintUpdateCamera::NewCameraRotation' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_BlueprintUpdateCamera, NewCameraFOV) == 0x000038, "Member 'SurvCameraManager_C_BlueprintUpdateCamera::NewCameraFOV' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_BlueprintUpdateCamera, ReturnValue) == 0x00003C, "Member 'SurvCameraManager_C_BlueprintUpdateCamera::ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_BlueprintUpdateCamera, CallFunc_CustomCameraBehavior_Location) == 0x000040, "Member 'SurvCameraManager_C_BlueprintUpdateCamera::CallFunc_CustomCameraBehavior_Location' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_BlueprintUpdateCamera, CallFunc_CustomCameraBehavior_Rotation) == 0x000058, "Member 'SurvCameraManager_C_BlueprintUpdateCamera::CallFunc_CustomCameraBehavior_Rotation' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_BlueprintUpdateCamera, CallFunc_CustomCameraBehavior_FOV) == 0x000070, "Member 'SurvCameraManager_C_BlueprintUpdateCamera::CallFunc_CustomCameraBehavior_FOV' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_BlueprintUpdateCamera, CallFunc_BlueprintUpdateCamera_NewCameraLocation) == 0x000078, "Member 'SurvCameraManager_C_BlueprintUpdateCamera::CallFunc_BlueprintUpdateCamera_NewCameraLocation' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_BlueprintUpdateCamera, CallFunc_BlueprintUpdateCamera_NewCameraRotation) == 0x000090, "Member 'SurvCameraManager_C_BlueprintUpdateCamera::CallFunc_BlueprintUpdateCamera_NewCameraRotation' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_BlueprintUpdateCamera, CallFunc_BlueprintUpdateCamera_NewCameraFOV) == 0x0000A8, "Member 'SurvCameraManager_C_BlueprintUpdateCamera::CallFunc_BlueprintUpdateCamera_NewCameraFOV' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_BlueprintUpdateCamera, CallFunc_BlueprintUpdateCamera_ReturnValue) == 0x0000AC, "Member 'SurvCameraManager_C_BlueprintUpdateCamera::CallFunc_BlueprintUpdateCamera_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_BlueprintUpdateCamera, CallFunc_BlueprintUpdateCamera_NewCameraLocation_1) == 0x0000B0, "Member 'SurvCameraManager_C_BlueprintUpdateCamera::CallFunc_BlueprintUpdateCamera_NewCameraLocation_1' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_BlueprintUpdateCamera, CallFunc_BlueprintUpdateCamera_NewCameraRotation_1) == 0x0000C8, "Member 'SurvCameraManager_C_BlueprintUpdateCamera::CallFunc_BlueprintUpdateCamera_NewCameraRotation_1' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_BlueprintUpdateCamera, CallFunc_BlueprintUpdateCamera_NewCameraFOV_1) == 0x0000E0, "Member 'SurvCameraManager_C_BlueprintUpdateCamera::CallFunc_BlueprintUpdateCamera_NewCameraFOV_1' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_BlueprintUpdateCamera, CallFunc_BlueprintUpdateCamera_ReturnValue_1) == 0x0000E4, "Member 'SurvCameraManager_C_BlueprintUpdateCamera::CallFunc_BlueprintUpdateCamera_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_BlueprintUpdateCamera, K2Node_DynamicCast_AsSurvival_Player) == 0x0000E8, "Member 'SurvCameraManager_C_BlueprintUpdateCamera::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_BlueprintUpdateCamera, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'SurvCameraManager_C_BlueprintUpdateCamera::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_BlueprintUpdateCamera, K2Node_FunctionResult_NewCameraFOV_ImplicitCast) == 0x0000F4, "Member 'SurvCameraManager_C_BlueprintUpdateCamera::K2Node_FunctionResult_NewCameraFOV_ImplicitCast' has a wrong offset!");

// Function SurvCameraManager.SurvCameraManager_C.CalculateAxisIndependentLag
// 0x0180 (0x0180 - 0x0000)
struct SurvCameraManager_C_CalculateAxisIndependentLag final
{
public:
	struct FVector                                CurrentLocation;                                   // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TargetLocation;                                    // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CameraRotation;                                    // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                LagSpeeds;                                         // 0x0048(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Return;                                            // 0x0060(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CameraRotationYaw;                                 // 0x0078(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_BreakVector_X;                            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_LessLess_VectorRotator_ReturnValue;       // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_LessLess_VectorRotator_ReturnValue_1;     // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_2;                          // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_2;                          // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_2;                          // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_ReturnValue;                    // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_ReturnValue_1;                  // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_ReturnValue_2;                  // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue; // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SurvCameraManager_C_CalculateAxisIndependentLag) == 0x000008, "Wrong alignment on SurvCameraManager_C_CalculateAxisIndependentLag");
static_assert(sizeof(SurvCameraManager_C_CalculateAxisIndependentLag) == 0x000180, "Wrong size on SurvCameraManager_C_CalculateAxisIndependentLag");
static_assert(offsetof(SurvCameraManager_C_CalculateAxisIndependentLag, CurrentLocation) == 0x000000, "Member 'SurvCameraManager_C_CalculateAxisIndependentLag::CurrentLocation' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CalculateAxisIndependentLag, TargetLocation) == 0x000018, "Member 'SurvCameraManager_C_CalculateAxisIndependentLag::TargetLocation' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CalculateAxisIndependentLag, CameraRotation) == 0x000030, "Member 'SurvCameraManager_C_CalculateAxisIndependentLag::CameraRotation' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CalculateAxisIndependentLag, LagSpeeds) == 0x000048, "Member 'SurvCameraManager_C_CalculateAxisIndependentLag::LagSpeeds' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CalculateAxisIndependentLag, Return) == 0x000060, "Member 'SurvCameraManager_C_CalculateAxisIndependentLag::Return' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CalculateAxisIndependentLag, CameraRotationYaw) == 0x000078, "Member 'SurvCameraManager_C_CalculateAxisIndependentLag::CameraRotationYaw' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CalculateAxisIndependentLag, CallFunc_BreakVector_X) == 0x000090, "Member 'SurvCameraManager_C_CalculateAxisIndependentLag::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CalculateAxisIndependentLag, CallFunc_BreakVector_Y) == 0x000098, "Member 'SurvCameraManager_C_CalculateAxisIndependentLag::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CalculateAxisIndependentLag, CallFunc_BreakVector_Z) == 0x0000A0, "Member 'SurvCameraManager_C_CalculateAxisIndependentLag::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CalculateAxisIndependentLag, CallFunc_BreakRotator_Roll) == 0x0000A8, "Member 'SurvCameraManager_C_CalculateAxisIndependentLag::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CalculateAxisIndependentLag, CallFunc_BreakRotator_Pitch) == 0x0000AC, "Member 'SurvCameraManager_C_CalculateAxisIndependentLag::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CalculateAxisIndependentLag, CallFunc_BreakRotator_Yaw) == 0x0000B0, "Member 'SurvCameraManager_C_CalculateAxisIndependentLag::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CalculateAxisIndependentLag, CallFunc_MakeRotator_ReturnValue) == 0x0000B8, "Member 'SurvCameraManager_C_CalculateAxisIndependentLag::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CalculateAxisIndependentLag, CallFunc_LessLess_VectorRotator_ReturnValue) == 0x0000D0, "Member 'SurvCameraManager_C_CalculateAxisIndependentLag::CallFunc_LessLess_VectorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CalculateAxisIndependentLag, CallFunc_BreakVector_X_1) == 0x0000E8, "Member 'SurvCameraManager_C_CalculateAxisIndependentLag::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CalculateAxisIndependentLag, CallFunc_BreakVector_Y_1) == 0x0000F0, "Member 'SurvCameraManager_C_CalculateAxisIndependentLag::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CalculateAxisIndependentLag, CallFunc_BreakVector_Z_1) == 0x0000F8, "Member 'SurvCameraManager_C_CalculateAxisIndependentLag::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CalculateAxisIndependentLag, CallFunc_LessLess_VectorRotator_ReturnValue_1) == 0x000100, "Member 'SurvCameraManager_C_CalculateAxisIndependentLag::CallFunc_LessLess_VectorRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CalculateAxisIndependentLag, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000118, "Member 'SurvCameraManager_C_CalculateAxisIndependentLag::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CalculateAxisIndependentLag, CallFunc_BreakVector_X_2) == 0x000120, "Member 'SurvCameraManager_C_CalculateAxisIndependentLag::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CalculateAxisIndependentLag, CallFunc_BreakVector_Y_2) == 0x000128, "Member 'SurvCameraManager_C_CalculateAxisIndependentLag::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CalculateAxisIndependentLag, CallFunc_BreakVector_Z_2) == 0x000130, "Member 'SurvCameraManager_C_CalculateAxisIndependentLag::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CalculateAxisIndependentLag, CallFunc_FInterpTo_ReturnValue) == 0x000138, "Member 'SurvCameraManager_C_CalculateAxisIndependentLag::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CalculateAxisIndependentLag, CallFunc_FInterpTo_ReturnValue_1) == 0x000140, "Member 'SurvCameraManager_C_CalculateAxisIndependentLag::CallFunc_FInterpTo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CalculateAxisIndependentLag, CallFunc_FInterpTo_ReturnValue_2) == 0x000148, "Member 'SurvCameraManager_C_CalculateAxisIndependentLag::CallFunc_FInterpTo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CalculateAxisIndependentLag, CallFunc_MakeVector_ReturnValue) == 0x000150, "Member 'SurvCameraManager_C_CalculateAxisIndependentLag::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CalculateAxisIndependentLag, CallFunc_GreaterGreater_VectorRotator_ReturnValue) == 0x000168, "Member 'SurvCameraManager_C_CalculateAxisIndependentLag::CallFunc_GreaterGreater_VectorRotator_ReturnValue' has a wrong offset!");

// Function SurvCameraManager.SurvCameraManager_C.CustomCameraBehavior
// 0x05E0 (0x05E0 - 0x0000)
struct SurvCameraManager_C_CustomCameraBehavior final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        FOV;                                               // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TPFOV;                                             // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             PivotTarget;                                       // 0x0040(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUpVector_ReturnValue;                  // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetRightVector_ReturnValue;               // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A8[0x8];                                      // 0x01A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetPivotTarget_ReturnValue;               // 0x01B0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x0210(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x0228(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x0240(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_2;                // 0x0258(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_2;                // 0x0270(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_2;                   // 0x0288(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_3;                // 0x02A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_3;                // 0x02B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_3;                   // 0x02D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_CalculateAxisIndependentLag_Return;       // 0x02E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_4;                // 0x0300(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_4;                // 0x0318(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_4;                   // 0x0330(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_348[0x8];                                      // 0x0348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0350(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x03B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x03C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetCameraRotation_ReturnValue;            // 0x03E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x03F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayerController_ReturnValue;    // 0x0418(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue;           // 0x0420(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetUpVector_ReturnValue_1;                // 0x0438(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RInterpTo_ReturnValue;                    // 0x0450(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_3;       // 0x0468(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetRightVector_ReturnValue_1;             // 0x0480(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_1;           // 0x0498(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_4;       // 0x04B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_5;       // 0x04C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x04E0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_3;           // 0x0540(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_5;                // 0x0558(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_5;                // 0x0570(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_5;                   // 0x0588(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_4;           // 0x05A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_5;           // 0x05B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RInterpTo_InterpSpeed_ImplicitCast;       // 0x05D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RInterpTo_DeltaTime_ImplicitCast;         // 0x05D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SurvCameraManager_C_CustomCameraBehavior) == 0x000010, "Wrong alignment on SurvCameraManager_C_CustomCameraBehavior");
static_assert(sizeof(SurvCameraManager_C_CustomCameraBehavior) == 0x0005E0, "Wrong size on SurvCameraManager_C_CustomCameraBehavior");
static_assert(offsetof(SurvCameraManager_C_CustomCameraBehavior, Location) == 0x000000, "Member 'SurvCameraManager_C_CustomCameraBehavior::Location' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CustomCameraBehavior, Rotation) == 0x000018, "Member 'SurvCameraManager_C_CustomCameraBehavior::Rotation' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CustomCameraBehavior, FOV) == 0x000030, "Member 'SurvCameraManager_C_CustomCameraBehavior::FOV' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CustomCameraBehavior, TPFOV) == 0x000038, "Member 'SurvCameraManager_C_CustomCameraBehavior::TPFOV' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CustomCameraBehavior, PivotTarget) == 0x000040, "Member 'SurvCameraManager_C_CustomCameraBehavior::PivotTarget' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CustomCameraBehavior, CallFunc_BreakTransform_Location) == 0x0000A0, "Member 'SurvCameraManager_C_CustomCameraBehavior::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CustomCameraBehavior, CallFunc_BreakTransform_Rotation) == 0x0000B8, "Member 'SurvCameraManager_C_CustomCameraBehavior::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CustomCameraBehavior, CallFunc_BreakTransform_Scale) == 0x0000D0, "Member 'SurvCameraManager_C_CustomCameraBehavior::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CustomCameraBehavior, CallFunc_GetUpVector_ReturnValue) == 0x0000E8, "Member 'SurvCameraManager_C_CustomCameraBehavior::CallFunc_GetUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CustomCameraBehavior, CallFunc_GetRightVector_ReturnValue) == 0x000100, "Member 'SurvCameraManager_C_CustomCameraBehavior::CallFunc_GetRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CustomCameraBehavior, CallFunc_GetForwardVector_ReturnValue) == 0x000118, "Member 'SurvCameraManager_C_CustomCameraBehavior::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CustomCameraBehavior, CallFunc_BreakVector_X) == 0x000130, "Member 'SurvCameraManager_C_CustomCameraBehavior::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CustomCameraBehavior, CallFunc_BreakVector_Y) == 0x000138, "Member 'SurvCameraManager_C_CustomCameraBehavior::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CustomCameraBehavior, CallFunc_BreakVector_Z) == 0x000140, "Member 'SurvCameraManager_C_CustomCameraBehavior::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CustomCameraBehavior, CallFunc_BreakVector_X_1) == 0x000148, "Member 'SurvCameraManager_C_CustomCameraBehavior::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CustomCameraBehavior, CallFunc_BreakVector_Y_1) == 0x000150, "Member 'SurvCameraManager_C_CustomCameraBehavior::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CustomCameraBehavior, CallFunc_BreakVector_Z_1) == 0x000158, "Member 'SurvCameraManager_C_CustomCameraBehavior::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CustomCameraBehavior, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000160, "Member 'SurvCameraManager_C_CustomCameraBehavior::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CustomCameraBehavior, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000178, "Member 'SurvCameraManager_C_CustomCameraBehavior::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CustomCameraBehavior, CallFunc_Multiply_VectorFloat_ReturnValue_2) == 0x000190, "Member 'SurvCameraManager_C_CustomCameraBehavior::CallFunc_Multiply_VectorFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CustomCameraBehavior, CallFunc_GetPivotTarget_ReturnValue) == 0x0001B0, "Member 'SurvCameraManager_C_CustomCameraBehavior::CallFunc_GetPivotTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CustomCameraBehavior, CallFunc_BreakTransform_Location_1) == 0x000210, "Member 'SurvCameraManager_C_CustomCameraBehavior::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CustomCameraBehavior, CallFunc_BreakTransform_Rotation_1) == 0x000228, "Member 'SurvCameraManager_C_CustomCameraBehavior::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CustomCameraBehavior, CallFunc_BreakTransform_Scale_1) == 0x000240, "Member 'SurvCameraManager_C_CustomCameraBehavior::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CustomCameraBehavior, CallFunc_BreakTransform_Location_2) == 0x000258, "Member 'SurvCameraManager_C_CustomCameraBehavior::CallFunc_BreakTransform_Location_2' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CustomCameraBehavior, CallFunc_BreakTransform_Rotation_2) == 0x000270, "Member 'SurvCameraManager_C_CustomCameraBehavior::CallFunc_BreakTransform_Rotation_2' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CustomCameraBehavior, CallFunc_BreakTransform_Scale_2) == 0x000288, "Member 'SurvCameraManager_C_CustomCameraBehavior::CallFunc_BreakTransform_Scale_2' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CustomCameraBehavior, CallFunc_BreakTransform_Location_3) == 0x0002A0, "Member 'SurvCameraManager_C_CustomCameraBehavior::CallFunc_BreakTransform_Location_3' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CustomCameraBehavior, CallFunc_BreakTransform_Rotation_3) == 0x0002B8, "Member 'SurvCameraManager_C_CustomCameraBehavior::CallFunc_BreakTransform_Rotation_3' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CustomCameraBehavior, CallFunc_BreakTransform_Scale_3) == 0x0002D0, "Member 'SurvCameraManager_C_CustomCameraBehavior::CallFunc_BreakTransform_Scale_3' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CustomCameraBehavior, CallFunc_CalculateAxisIndependentLag_Return) == 0x0002E8, "Member 'SurvCameraManager_C_CustomCameraBehavior::CallFunc_CalculateAxisIndependentLag_Return' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CustomCameraBehavior, CallFunc_BreakTransform_Location_4) == 0x000300, "Member 'SurvCameraManager_C_CustomCameraBehavior::CallFunc_BreakTransform_Location_4' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CustomCameraBehavior, CallFunc_BreakTransform_Rotation_4) == 0x000318, "Member 'SurvCameraManager_C_CustomCameraBehavior::CallFunc_BreakTransform_Rotation_4' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CustomCameraBehavior, CallFunc_BreakTransform_Scale_4) == 0x000330, "Member 'SurvCameraManager_C_CustomCameraBehavior::CallFunc_BreakTransform_Scale_4' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CustomCameraBehavior, CallFunc_MakeTransform_ReturnValue) == 0x000350, "Member 'SurvCameraManager_C_CustomCameraBehavior::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CustomCameraBehavior, CallFunc_Add_VectorVector_ReturnValue) == 0x0003B0, "Member 'SurvCameraManager_C_CustomCameraBehavior::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CustomCameraBehavior, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0003C8, "Member 'SurvCameraManager_C_CustomCameraBehavior::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CustomCameraBehavior, CallFunc_GetCameraRotation_ReturnValue) == 0x0003E0, "Member 'SurvCameraManager_C_CustomCameraBehavior::CallFunc_GetCameraRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CustomCameraBehavior, CallFunc_Add_VectorVector_ReturnValue_2) == 0x0003F8, "Member 'SurvCameraManager_C_CustomCameraBehavior::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CustomCameraBehavior, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000410, "Member 'SurvCameraManager_C_CustomCameraBehavior::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CustomCameraBehavior, CallFunc_GetOwningPlayerController_ReturnValue) == 0x000418, "Member 'SurvCameraManager_C_CustomCameraBehavior::CallFunc_GetOwningPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CustomCameraBehavior, CallFunc_GetControlRotation_ReturnValue) == 0x000420, "Member 'SurvCameraManager_C_CustomCameraBehavior::CallFunc_GetControlRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CustomCameraBehavior, CallFunc_GetUpVector_ReturnValue_1) == 0x000438, "Member 'SurvCameraManager_C_CustomCameraBehavior::CallFunc_GetUpVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CustomCameraBehavior, CallFunc_RInterpTo_ReturnValue) == 0x000450, "Member 'SurvCameraManager_C_CustomCameraBehavior::CallFunc_RInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CustomCameraBehavior, CallFunc_Multiply_VectorFloat_ReturnValue_3) == 0x000468, "Member 'SurvCameraManager_C_CustomCameraBehavior::CallFunc_Multiply_VectorFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CustomCameraBehavior, CallFunc_GetRightVector_ReturnValue_1) == 0x000480, "Member 'SurvCameraManager_C_CustomCameraBehavior::CallFunc_GetRightVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CustomCameraBehavior, CallFunc_GetForwardVector_ReturnValue_1) == 0x000498, "Member 'SurvCameraManager_C_CustomCameraBehavior::CallFunc_GetForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CustomCameraBehavior, CallFunc_Multiply_VectorFloat_ReturnValue_4) == 0x0004B0, "Member 'SurvCameraManager_C_CustomCameraBehavior::CallFunc_Multiply_VectorFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CustomCameraBehavior, CallFunc_Multiply_VectorFloat_ReturnValue_5) == 0x0004C8, "Member 'SurvCameraManager_C_CustomCameraBehavior::CallFunc_Multiply_VectorFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CustomCameraBehavior, CallFunc_MakeTransform_ReturnValue_1) == 0x0004E0, "Member 'SurvCameraManager_C_CustomCameraBehavior::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CustomCameraBehavior, CallFunc_Add_VectorVector_ReturnValue_3) == 0x000540, "Member 'SurvCameraManager_C_CustomCameraBehavior::CallFunc_Add_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CustomCameraBehavior, CallFunc_BreakTransform_Location_5) == 0x000558, "Member 'SurvCameraManager_C_CustomCameraBehavior::CallFunc_BreakTransform_Location_5' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CustomCameraBehavior, CallFunc_BreakTransform_Rotation_5) == 0x000570, "Member 'SurvCameraManager_C_CustomCameraBehavior::CallFunc_BreakTransform_Rotation_5' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CustomCameraBehavior, CallFunc_BreakTransform_Scale_5) == 0x000588, "Member 'SurvCameraManager_C_CustomCameraBehavior::CallFunc_BreakTransform_Scale_5' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CustomCameraBehavior, CallFunc_Add_VectorVector_ReturnValue_4) == 0x0005A0, "Member 'SurvCameraManager_C_CustomCameraBehavior::CallFunc_Add_VectorVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CustomCameraBehavior, CallFunc_Add_VectorVector_ReturnValue_5) == 0x0005B8, "Member 'SurvCameraManager_C_CustomCameraBehavior::CallFunc_Add_VectorVector_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CustomCameraBehavior, CallFunc_RInterpTo_InterpSpeed_ImplicitCast) == 0x0005D0, "Member 'SurvCameraManager_C_CustomCameraBehavior::CallFunc_RInterpTo_InterpSpeed_ImplicitCast' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_CustomCameraBehavior, CallFunc_RInterpTo_DeltaTime_ImplicitCast) == 0x0005D4, "Member 'SurvCameraManager_C_CustomCameraBehavior::CallFunc_RInterpTo_DeltaTime_ImplicitCast' has a wrong offset!");

// Function SurvCameraManager.SurvCameraManager_C.ExecuteUbergraph_SurvCameraManager
// 0x0098 (0x0098 - 0x0000)
struct SurvCameraManager_C_ExecuteUbergraph_SurvCameraManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key;                          // 0x0008(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue;           // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_RLerp_ReturnValue;                        // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SurvCameraManager_C_ExecuteUbergraph_SurvCameraManager) == 0x000008, "Wrong alignment on SurvCameraManager_C_ExecuteUbergraph_SurvCameraManager");
static_assert(sizeof(SurvCameraManager_C_ExecuteUbergraph_SurvCameraManager) == 0x000098, "Wrong size on SurvCameraManager_C_ExecuteUbergraph_SurvCameraManager");
static_assert(offsetof(SurvCameraManager_C_ExecuteUbergraph_SurvCameraManager, EntryPoint) == 0x000000, "Member 'SurvCameraManager_C_ExecuteUbergraph_SurvCameraManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_ExecuteUbergraph_SurvCameraManager, K2Node_InputKeyEvent_Key) == 0x000008, "Member 'SurvCameraManager_C_ExecuteUbergraph_SurvCameraManager::K2Node_InputKeyEvent_Key' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_ExecuteUbergraph_SurvCameraManager, CallFunc_Not_PreBool_ReturnValue) == 0x000020, "Member 'SurvCameraManager_C_ExecuteUbergraph_SurvCameraManager::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_ExecuteUbergraph_SurvCameraManager, K2Node_DynamicCast_AsSurvival_Player) == 0x000028, "Member 'SurvCameraManager_C_ExecuteUbergraph_SurvCameraManager::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_ExecuteUbergraph_SurvCameraManager, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'SurvCameraManager_C_ExecuteUbergraph_SurvCameraManager::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_ExecuteUbergraph_SurvCameraManager, CallFunc_GetControlRotation_ReturnValue) == 0x000038, "Member 'SurvCameraManager_C_ExecuteUbergraph_SurvCameraManager::CallFunc_GetControlRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_ExecuteUbergraph_SurvCameraManager, CallFunc_RLerp_ReturnValue) == 0x000050, "Member 'SurvCameraManager_C_ExecuteUbergraph_SurvCameraManager::CallFunc_RLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_ExecuteUbergraph_SurvCameraManager, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000068, "Member 'SurvCameraManager_C_ExecuteUbergraph_SurvCameraManager::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvCameraManager_C_ExecuteUbergraph_SurvCameraManager, CallFunc_VLerp_ReturnValue) == 0x000080, "Member 'SurvCameraManager_C_ExecuteUbergraph_SurvCameraManager::CallFunc_VLerp_ReturnValue' has a wrong offset!");

// Function SurvCameraManager.SurvCameraManager_C.InpActEvt_X_K2Node_InputKeyEvent_0
// 0x0018 (0x0018 - 0x0000)
struct SurvCameraManager_C_InpActEvt_X_K2Node_InputKeyEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(SurvCameraManager_C_InpActEvt_X_K2Node_InputKeyEvent_0) == 0x000008, "Wrong alignment on SurvCameraManager_C_InpActEvt_X_K2Node_InputKeyEvent_0");
static_assert(sizeof(SurvCameraManager_C_InpActEvt_X_K2Node_InputKeyEvent_0) == 0x000018, "Wrong size on SurvCameraManager_C_InpActEvt_X_K2Node_InputKeyEvent_0");
static_assert(offsetof(SurvCameraManager_C_InpActEvt_X_K2Node_InputKeyEvent_0, Key) == 0x000000, "Member 'SurvCameraManager_C_InpActEvt_X_K2Node_InputKeyEvent_0::Key' has a wrong offset!");

}

