#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SurviveAnim_IK

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "SurviveAnim_IK_structs.hpp"
#include "StanceState_structs.hpp"
#include "BPE_Weapon_Type_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass SurviveAnim_IK.SurviveAnim_IK_C
// 0x1590 (0x18E0 - 0x0350)
class USurviveAnim_IK_C final : public UAnimInstance
{
public:
	uint8                                         Pad_348[0x8];                                      // 0x0348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct SurviveAnim_IK::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x0358(0x0002)(HasGetValueTypeHash)
	uint8                                         Pad_35A[0x6];                                      // 0x035A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0360(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0368(0x0008)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x0370(0x0108)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x0478(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x04A0(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_7;                        // 0x04C0(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x05E8(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x0710(0x0128)()
	uint8                                         Pad_838[0x8];                                      // 0x0838(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_1;                         // 0x0840(0x0280)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK;                           // 0x0AC0(0x0280)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x0D40(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x0D60(0x0108)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x0E68(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0E90(0x0048)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x0ED8(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x1000(0x0128)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x1128(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1150(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x1170(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x1298(0x0128)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x13C0(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x13E0(0x0108)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_SubInput;                            // 0x14E8(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x15B0(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x15D0(0x0128)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x16F8(0x0028)()
	double                                        PelvisOffset;                                      // 0x1720(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LeftFootOffset;                                    // 0x1728(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RightFootOffset;                                   // 0x1740(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FootIKAlpha;                                       // 0x1758(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableFootIK;                                      // 0x1760(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1761[0x7];                                     // 0x1761(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      CharRef;                                           // 0x1768(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	EStanceState                                  Stance;                                            // 0x1770(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1771[0x7];                                     // 0x1771(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        TraceLengthAboveFoot;                              // 0x1778(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TraceLengthBelowFoot;                              // 0x1780(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MinLimitsStanding;                                 // 0x1788(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MinLimitCrouching;                                 // 0x17A0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MaxLimitStanding;                                  // 0x17B8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MaxLimitCrouching;                                 // 0x17D0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMovementMode                                 MoveMode;                                          // 0x17E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17E9[0x7];                                     // 0x17E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                PelvisPosition;                                    // 0x17F0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PelvisRightPosition;                               // 0x1808(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PelvisLeftPosition;                                // 0x1820(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PelvisOffsetPos;                                   // 0x1838(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               LeftFootRotation;                                  // 0x1850(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                LeftFootPosition;                                  // 0x1868(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RightFootPosition;                                 // 0x1880(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               RightFootRotation;                                 // 0x1898(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                PelvisOffsetTemp;                                  // 0x18B0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PelvisAddOffset;                                   // 0x18C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CrouchedInterpValue;                               // 0x18D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddCharacterRotation(const struct FRotator& Amount);
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* Param_AnimGraph);
	void AnimNotifyTurningInPlace(class UAnimMontage* TurnIPMontage, bool ShouldTurn, bool TurningIP, bool TurningRight);
	void BlueprintInitializeAnimation();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void BPI_CameraShake(class UClass* ShakeClass, bool NeedChangeScale, double Scale);
	void CallEatMesh(class FName ItemType, double DurationAttached, double AnimDelay, double DissappearDelay, double PlayRate);
	void CheckEndEat(bool* Eat_);
	void ExecuteUbergraph_SurviveAnim_IK(int32 EntryPoint);
	void FootIK();
	void GetCameraOffset(struct FVector* Param_PelvisOffset, struct FVector* InterpOffset);
	void GetPelvisBonesPos();
	void GetSurvController(class ASurvPC_C** SurvPC);
	void MovementModeChanged(EMovementMode NewParam);
	void NotifyItemUsing();
	void PlayMontage(class UAnimMontage* AnimMontage, bool IsHipfire, bool Reloading, double PlayRate, double StartTime);
	void ResetItemUsingAnim();
	void SetItemUsingAnim(class UAnimSequence* Anim, bool SpecialItem, bool CanMove, bool HasStandAnim, bool WepNotHiding);
	void SetReloadState(bool State);
	void SetWeaponType(EBPE_Weapon_Type WeaponType);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SurviveAnim_IK_C">();
	}
	static class USurviveAnim_IK_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USurviveAnim_IK_C>();
	}
};
static_assert(alignof(USurviveAnim_IK_C) == 0x000010, "Wrong alignment on USurviveAnim_IK_C");
static_assert(sizeof(USurviveAnim_IK_C) == 0x0018E0, "Wrong size on USurviveAnim_IK_C");
static_assert(offsetof(USurviveAnim_IK_C, UberGraphFrame) == 0x000350, "Member 'USurviveAnim_IK_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USurviveAnim_IK_C, __AnimBlueprintMutables) == 0x000358, "Member 'USurviveAnim_IK_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(USurviveAnim_IK_C, AnimBlueprintExtension_PropertyAccess) == 0x000360, "Member 'USurviveAnim_IK_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(USurviveAnim_IK_C, AnimBlueprintExtension_Base) == 0x000368, "Member 'USurviveAnim_IK_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(USurviveAnim_IK_C, AnimGraphNode_SaveCachedPose_2) == 0x000370, "Member 'USurviveAnim_IK_C::AnimGraphNode_SaveCachedPose_2' has a wrong offset!");
static_assert(offsetof(USurviveAnim_IK_C, AnimGraphNode_UseCachedPose_3) == 0x000478, "Member 'USurviveAnim_IK_C::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(USurviveAnim_IK_C, AnimGraphNode_LocalToComponentSpace_1) == 0x0004A0, "Member 'USurviveAnim_IK_C::AnimGraphNode_LocalToComponentSpace_1' has a wrong offset!");
static_assert(offsetof(USurviveAnim_IK_C, AnimGraphNode_ModifyBone_7) == 0x0004C0, "Member 'USurviveAnim_IK_C::AnimGraphNode_ModifyBone_7' has a wrong offset!");
static_assert(offsetof(USurviveAnim_IK_C, AnimGraphNode_ModifyBone_6) == 0x0005E8, "Member 'USurviveAnim_IK_C::AnimGraphNode_ModifyBone_6' has a wrong offset!");
static_assert(offsetof(USurviveAnim_IK_C, AnimGraphNode_ModifyBone_5) == 0x000710, "Member 'USurviveAnim_IK_C::AnimGraphNode_ModifyBone_5' has a wrong offset!");
static_assert(offsetof(USurviveAnim_IK_C, AnimGraphNode_TwoBoneIK_1) == 0x000840, "Member 'USurviveAnim_IK_C::AnimGraphNode_TwoBoneIK_1' has a wrong offset!");
static_assert(offsetof(USurviveAnim_IK_C, AnimGraphNode_TwoBoneIK) == 0x000AC0, "Member 'USurviveAnim_IK_C::AnimGraphNode_TwoBoneIK' has a wrong offset!");
static_assert(offsetof(USurviveAnim_IK_C, AnimGraphNode_ComponentToLocalSpace_1) == 0x000D40, "Member 'USurviveAnim_IK_C::AnimGraphNode_ComponentToLocalSpace_1' has a wrong offset!");
static_assert(offsetof(USurviveAnim_IK_C, AnimGraphNode_SaveCachedPose_1) == 0x000D60, "Member 'USurviveAnim_IK_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(USurviveAnim_IK_C, AnimGraphNode_UseCachedPose_2) == 0x000E68, "Member 'USurviveAnim_IK_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(USurviveAnim_IK_C, AnimGraphNode_BlendListByBool) == 0x000E90, "Member 'USurviveAnim_IK_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(USurviveAnim_IK_C, AnimGraphNode_ModifyBone_4) == 0x000ED8, "Member 'USurviveAnim_IK_C::AnimGraphNode_ModifyBone_4' has a wrong offset!");
static_assert(offsetof(USurviveAnim_IK_C, AnimGraphNode_ModifyBone_3) == 0x001000, "Member 'USurviveAnim_IK_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(USurviveAnim_IK_C, AnimGraphNode_UseCachedPose_1) == 0x001128, "Member 'USurviveAnim_IK_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(USurviveAnim_IK_C, AnimGraphNode_LocalToComponentSpace) == 0x001150, "Member 'USurviveAnim_IK_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(USurviveAnim_IK_C, AnimGraphNode_ModifyBone_2) == 0x001170, "Member 'USurviveAnim_IK_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(USurviveAnim_IK_C, AnimGraphNode_ModifyBone_1) == 0x001298, "Member 'USurviveAnim_IK_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(USurviveAnim_IK_C, AnimGraphNode_ComponentToLocalSpace) == 0x0013C0, "Member 'USurviveAnim_IK_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(USurviveAnim_IK_C, AnimGraphNode_SaveCachedPose) == 0x0013E0, "Member 'USurviveAnim_IK_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(USurviveAnim_IK_C, AnimGraphNode_SubInput) == 0x0014E8, "Member 'USurviveAnim_IK_C::AnimGraphNode_SubInput' has a wrong offset!");
static_assert(offsetof(USurviveAnim_IK_C, AnimGraphNode_Root) == 0x0015B0, "Member 'USurviveAnim_IK_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(USurviveAnim_IK_C, AnimGraphNode_ModifyBone) == 0x0015D0, "Member 'USurviveAnim_IK_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(USurviveAnim_IK_C, AnimGraphNode_UseCachedPose) == 0x0016F8, "Member 'USurviveAnim_IK_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(USurviveAnim_IK_C, PelvisOffset) == 0x001720, "Member 'USurviveAnim_IK_C::PelvisOffset' has a wrong offset!");
static_assert(offsetof(USurviveAnim_IK_C, LeftFootOffset) == 0x001728, "Member 'USurviveAnim_IK_C::LeftFootOffset' has a wrong offset!");
static_assert(offsetof(USurviveAnim_IK_C, RightFootOffset) == 0x001740, "Member 'USurviveAnim_IK_C::RightFootOffset' has a wrong offset!");
static_assert(offsetof(USurviveAnim_IK_C, FootIKAlpha) == 0x001758, "Member 'USurviveAnim_IK_C::FootIKAlpha' has a wrong offset!");
static_assert(offsetof(USurviveAnim_IK_C, EnableFootIK) == 0x001760, "Member 'USurviveAnim_IK_C::EnableFootIK' has a wrong offset!");
static_assert(offsetof(USurviveAnim_IK_C, CharRef) == 0x001768, "Member 'USurviveAnim_IK_C::CharRef' has a wrong offset!");
static_assert(offsetof(USurviveAnim_IK_C, Stance) == 0x001770, "Member 'USurviveAnim_IK_C::Stance' has a wrong offset!");
static_assert(offsetof(USurviveAnim_IK_C, TraceLengthAboveFoot) == 0x001778, "Member 'USurviveAnim_IK_C::TraceLengthAboveFoot' has a wrong offset!");
static_assert(offsetof(USurviveAnim_IK_C, TraceLengthBelowFoot) == 0x001780, "Member 'USurviveAnim_IK_C::TraceLengthBelowFoot' has a wrong offset!");
static_assert(offsetof(USurviveAnim_IK_C, MinLimitsStanding) == 0x001788, "Member 'USurviveAnim_IK_C::MinLimitsStanding' has a wrong offset!");
static_assert(offsetof(USurviveAnim_IK_C, MinLimitCrouching) == 0x0017A0, "Member 'USurviveAnim_IK_C::MinLimitCrouching' has a wrong offset!");
static_assert(offsetof(USurviveAnim_IK_C, MaxLimitStanding) == 0x0017B8, "Member 'USurviveAnim_IK_C::MaxLimitStanding' has a wrong offset!");
static_assert(offsetof(USurviveAnim_IK_C, MaxLimitCrouching) == 0x0017D0, "Member 'USurviveAnim_IK_C::MaxLimitCrouching' has a wrong offset!");
static_assert(offsetof(USurviveAnim_IK_C, MoveMode) == 0x0017E8, "Member 'USurviveAnim_IK_C::MoveMode' has a wrong offset!");
static_assert(offsetof(USurviveAnim_IK_C, PelvisPosition) == 0x0017F0, "Member 'USurviveAnim_IK_C::PelvisPosition' has a wrong offset!");
static_assert(offsetof(USurviveAnim_IK_C, PelvisRightPosition) == 0x001808, "Member 'USurviveAnim_IK_C::PelvisRightPosition' has a wrong offset!");
static_assert(offsetof(USurviveAnim_IK_C, PelvisLeftPosition) == 0x001820, "Member 'USurviveAnim_IK_C::PelvisLeftPosition' has a wrong offset!");
static_assert(offsetof(USurviveAnim_IK_C, PelvisOffsetPos) == 0x001838, "Member 'USurviveAnim_IK_C::PelvisOffsetPos' has a wrong offset!");
static_assert(offsetof(USurviveAnim_IK_C, LeftFootRotation) == 0x001850, "Member 'USurviveAnim_IK_C::LeftFootRotation' has a wrong offset!");
static_assert(offsetof(USurviveAnim_IK_C, LeftFootPosition) == 0x001868, "Member 'USurviveAnim_IK_C::LeftFootPosition' has a wrong offset!");
static_assert(offsetof(USurviveAnim_IK_C, RightFootPosition) == 0x001880, "Member 'USurviveAnim_IK_C::RightFootPosition' has a wrong offset!");
static_assert(offsetof(USurviveAnim_IK_C, RightFootRotation) == 0x001898, "Member 'USurviveAnim_IK_C::RightFootRotation' has a wrong offset!");
static_assert(offsetof(USurviveAnim_IK_C, PelvisOffsetTemp) == 0x0018B0, "Member 'USurviveAnim_IK_C::PelvisOffsetTemp' has a wrong offset!");
static_assert(offsetof(USurviveAnim_IK_C, PelvisAddOffset) == 0x0018C8, "Member 'USurviveAnim_IK_C::PelvisAddOffset' has a wrong offset!");
static_assert(offsetof(USurviveAnim_IK_C, CrouchedInterpValue) == 0x0018D0, "Member 'USurviveAnim_IK_C::CrouchedInterpValue' has a wrong offset!");

}

