#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TakeItemTutorial

#include "Basic.hpp"

#include "AGSGraphRuntime_classes.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass TakeItemTutorial.TakeItemTutorial_C
// 0x0080 (0x00B0 - 0x0030)
class UTakeItemTutorial_C final : public UAGSAction
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0030(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          ShowBigSlides;                                     // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   SlideName;                                         // 0x003C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           QuestGameplay_Tag;                                 // 0x0044(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, int32>                      RowNames;                                          // 0x0050(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                 TutorStageNane;                                    // 0x00A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void CompletetQuest_Serv(class APlayerController* PlayerController);
	void ExecuteAction(class APlayerController* PlayerController, class UAGSGraphNode* NodeOwner);
	void ExecuteUbergraph_TakeItemTutorial(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TakeItemTutorial_C">();
	}
	static class UTakeItemTutorial_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTakeItemTutorial_C>();
	}
};
static_assert(alignof(UTakeItemTutorial_C) == 0x000008, "Wrong alignment on UTakeItemTutorial_C");
static_assert(sizeof(UTakeItemTutorial_C) == 0x0000B0, "Wrong size on UTakeItemTutorial_C");
static_assert(offsetof(UTakeItemTutorial_C, UberGraphFrame) == 0x000030, "Member 'UTakeItemTutorial_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTakeItemTutorial_C, ShowBigSlides) == 0x000038, "Member 'UTakeItemTutorial_C::ShowBigSlides' has a wrong offset!");
static_assert(offsetof(UTakeItemTutorial_C, SlideName) == 0x00003C, "Member 'UTakeItemTutorial_C::SlideName' has a wrong offset!");
static_assert(offsetof(UTakeItemTutorial_C, QuestGameplay_Tag) == 0x000044, "Member 'UTakeItemTutorial_C::QuestGameplay_Tag' has a wrong offset!");
static_assert(offsetof(UTakeItemTutorial_C, RowNames) == 0x000050, "Member 'UTakeItemTutorial_C::RowNames' has a wrong offset!");
static_assert(offsetof(UTakeItemTutorial_C, TutorStageNane) == 0x0000A0, "Member 'UTakeItemTutorial_C::TutorStageNane' has a wrong offset!");

}

