#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Task_SomeoneIsSee

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Task_SomeoneIsSee.Task_SomeoneIsSee_C.ExecuteUbergraph_Task_SomeoneIsSee
// 0x00F8 (0x00F8 - 0x0000)
struct Task_SomeoneIsSee_C_ExecuteUbergraph_Task_SomeoneIsSee final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0048(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x0060(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_1;            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_2;            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetValueAsVector_ReturnValue;             // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_3;            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          CallFunc_GetAIController_ReturnValue;              // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue_1;              // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue_2;              // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue_3;              // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SphereOverlapActors_SphereRadius_ImplicitCast; // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Task_SomeoneIsSee_C_ExecuteUbergraph_Task_SomeoneIsSee) == 0x000008, "Wrong alignment on Task_SomeoneIsSee_C_ExecuteUbergraph_Task_SomeoneIsSee");
static_assert(sizeof(Task_SomeoneIsSee_C_ExecuteUbergraph_Task_SomeoneIsSee) == 0x0000F8, "Wrong size on Task_SomeoneIsSee_C_ExecuteUbergraph_Task_SomeoneIsSee");
static_assert(offsetof(Task_SomeoneIsSee_C_ExecuteUbergraph_Task_SomeoneIsSee, EntryPoint) == 0x000000, "Member 'Task_SomeoneIsSee_C_ExecuteUbergraph_Task_SomeoneIsSee::EntryPoint' has a wrong offset!");
static_assert(offsetof(Task_SomeoneIsSee_C_ExecuteUbergraph_Task_SomeoneIsSee, Temp_object_Variable) == 0x000008, "Member 'Task_SomeoneIsSee_C_ExecuteUbergraph_Task_SomeoneIsSee::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Task_SomeoneIsSee_C_ExecuteUbergraph_Task_SomeoneIsSee, K2Node_Event_OwnerController) == 0x000018, "Member 'Task_SomeoneIsSee_C_ExecuteUbergraph_Task_SomeoneIsSee::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(Task_SomeoneIsSee_C_ExecuteUbergraph_Task_SomeoneIsSee, K2Node_Event_ControlledPawn) == 0x000020, "Member 'Task_SomeoneIsSee_C_ExecuteUbergraph_Task_SomeoneIsSee::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(Task_SomeoneIsSee_C_ExecuteUbergraph_Task_SomeoneIsSee, CallFunc_GetBlackboard_ReturnValue) == 0x000028, "Member 'Task_SomeoneIsSee_C_ExecuteUbergraph_Task_SomeoneIsSee::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_SomeoneIsSee_C_ExecuteUbergraph_Task_SomeoneIsSee, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000030, "Member 'Task_SomeoneIsSee_C_ExecuteUbergraph_Task_SomeoneIsSee::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_SomeoneIsSee_C_ExecuteUbergraph_Task_SomeoneIsSee, K2Node_MakeArray_Array) == 0x000048, "Member 'Task_SomeoneIsSee_C_ExecuteUbergraph_Task_SomeoneIsSee::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Task_SomeoneIsSee_C_ExecuteUbergraph_Task_SomeoneIsSee, Temp_int_Loop_Counter_Variable) == 0x000058, "Member 'Task_SomeoneIsSee_C_ExecuteUbergraph_Task_SomeoneIsSee::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Task_SomeoneIsSee_C_ExecuteUbergraph_Task_SomeoneIsSee, CallFunc_SphereOverlapActors_OutActors) == 0x000060, "Member 'Task_SomeoneIsSee_C_ExecuteUbergraph_Task_SomeoneIsSee::CallFunc_SphereOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(Task_SomeoneIsSee_C_ExecuteUbergraph_Task_SomeoneIsSee, CallFunc_SphereOverlapActors_ReturnValue) == 0x000070, "Member 'Task_SomeoneIsSee_C_ExecuteUbergraph_Task_SomeoneIsSee::CallFunc_SphereOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_SomeoneIsSee_C_ExecuteUbergraph_Task_SomeoneIsSee, CallFunc_Add_IntInt_ReturnValue) == 0x000074, "Member 'Task_SomeoneIsSee_C_ExecuteUbergraph_Task_SomeoneIsSee::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_SomeoneIsSee_C_ExecuteUbergraph_Task_SomeoneIsSee, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'Task_SomeoneIsSee_C_ExecuteUbergraph_Task_SomeoneIsSee::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_SomeoneIsSee_C_ExecuteUbergraph_Task_SomeoneIsSee, CallFunc_Less_IntInt_ReturnValue) == 0x00007C, "Member 'Task_SomeoneIsSee_C_ExecuteUbergraph_Task_SomeoneIsSee::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_SomeoneIsSee_C_ExecuteUbergraph_Task_SomeoneIsSee, CallFunc_MakeLiteralName_ReturnValue) == 0x000080, "Member 'Task_SomeoneIsSee_C_ExecuteUbergraph_Task_SomeoneIsSee::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_SomeoneIsSee_C_ExecuteUbergraph_Task_SomeoneIsSee, CallFunc_MakeLiteralName_ReturnValue_1) == 0x000088, "Member 'Task_SomeoneIsSee_C_ExecuteUbergraph_Task_SomeoneIsSee::CallFunc_MakeLiteralName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_SomeoneIsSee_C_ExecuteUbergraph_Task_SomeoneIsSee, CallFunc_MakeLiteralName_ReturnValue_2) == 0x000090, "Member 'Task_SomeoneIsSee_C_ExecuteUbergraph_Task_SomeoneIsSee::CallFunc_MakeLiteralName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Task_SomeoneIsSee_C_ExecuteUbergraph_Task_SomeoneIsSee, CallFunc_GetValueAsVector_ReturnValue) == 0x000098, "Member 'Task_SomeoneIsSee_C_ExecuteUbergraph_Task_SomeoneIsSee::CallFunc_GetValueAsVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_SomeoneIsSee_C_ExecuteUbergraph_Task_SomeoneIsSee, CallFunc_MakeLiteralName_ReturnValue_3) == 0x0000B0, "Member 'Task_SomeoneIsSee_C_ExecuteUbergraph_Task_SomeoneIsSee::CallFunc_MakeLiteralName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Task_SomeoneIsSee_C_ExecuteUbergraph_Task_SomeoneIsSee, Temp_int_Array_Index_Variable) == 0x0000B8, "Member 'Task_SomeoneIsSee_C_ExecuteUbergraph_Task_SomeoneIsSee::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Task_SomeoneIsSee_C_ExecuteUbergraph_Task_SomeoneIsSee, CallFunc_Array_Get_Item) == 0x0000C0, "Member 'Task_SomeoneIsSee_C_ExecuteUbergraph_Task_SomeoneIsSee::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Task_SomeoneIsSee_C_ExecuteUbergraph_Task_SomeoneIsSee, CallFunc_GetAIController_ReturnValue) == 0x0000C8, "Member 'Task_SomeoneIsSee_C_ExecuteUbergraph_Task_SomeoneIsSee::CallFunc_GetAIController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_SomeoneIsSee_C_ExecuteUbergraph_Task_SomeoneIsSee, CallFunc_GetBlackboard_ReturnValue_1) == 0x0000D0, "Member 'Task_SomeoneIsSee_C_ExecuteUbergraph_Task_SomeoneIsSee::CallFunc_GetBlackboard_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_SomeoneIsSee_C_ExecuteUbergraph_Task_SomeoneIsSee, CallFunc_GetBlackboard_ReturnValue_2) == 0x0000D8, "Member 'Task_SomeoneIsSee_C_ExecuteUbergraph_Task_SomeoneIsSee::CallFunc_GetBlackboard_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Task_SomeoneIsSee_C_ExecuteUbergraph_Task_SomeoneIsSee, CallFunc_IsValid_ReturnValue) == 0x0000E0, "Member 'Task_SomeoneIsSee_C_ExecuteUbergraph_Task_SomeoneIsSee::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_SomeoneIsSee_C_ExecuteUbergraph_Task_SomeoneIsSee, CallFunc_GetBlackboard_ReturnValue_3) == 0x0000E8, "Member 'Task_SomeoneIsSee_C_ExecuteUbergraph_Task_SomeoneIsSee::CallFunc_GetBlackboard_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Task_SomeoneIsSee_C_ExecuteUbergraph_Task_SomeoneIsSee, CallFunc_SphereOverlapActors_SphereRadius_ImplicitCast) == 0x0000F0, "Member 'Task_SomeoneIsSee_C_ExecuteUbergraph_Task_SomeoneIsSee::CallFunc_SphereOverlapActors_SphereRadius_ImplicitCast' has a wrong offset!");

// Function Task_SomeoneIsSee.Task_SomeoneIsSee_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct Task_SomeoneIsSee_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Task_SomeoneIsSee_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on Task_SomeoneIsSee_C_ReceiveExecuteAI");
static_assert(sizeof(Task_SomeoneIsSee_C_ReceiveExecuteAI) == 0x000010, "Wrong size on Task_SomeoneIsSee_C_ReceiveExecuteAI");
static_assert(offsetof(Task_SomeoneIsSee_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'Task_SomeoneIsSee_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(Task_SomeoneIsSee_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'Task_SomeoneIsSee_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

