#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Task_Bandit_RunEQSWithValidLocation

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "BTTask_BlueprintBase_New_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Task_Bandit_RunEQSWithValidLocation.Task_Bandit_RunEQSWithValidLocation_C
// 0x0050 (0x0100 - 0x00B0)
class UTask_Bandit_RunEQSWithValidLocation_C final : public UBTTask_BlueprintBase_New_C
{
public:
	struct FBlackboardKeySelector                 BB_Key;                                            // 0x00B0(0x0028)(Edit, BlueprintVisible)
	class UEnvQuery*                              QueryTemplate;                                     // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<double>                                ItemScore;                                         // 0x00E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                 ItemIndex;                                         // 0x00F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Task_Bandit_RunEQSWithValidLocation_C">();
	}
	static class UTask_Bandit_RunEQSWithValidLocation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTask_Bandit_RunEQSWithValidLocation_C>();
	}
};
static_assert(alignof(UTask_Bandit_RunEQSWithValidLocation_C) == 0x000008, "Wrong alignment on UTask_Bandit_RunEQSWithValidLocation_C");
static_assert(sizeof(UTask_Bandit_RunEQSWithValidLocation_C) == 0x000100, "Wrong size on UTask_Bandit_RunEQSWithValidLocation_C");
static_assert(offsetof(UTask_Bandit_RunEQSWithValidLocation_C, BB_Key) == 0x0000B0, "Member 'UTask_Bandit_RunEQSWithValidLocation_C::BB_Key' has a wrong offset!");
static_assert(offsetof(UTask_Bandit_RunEQSWithValidLocation_C, QueryTemplate) == 0x0000D8, "Member 'UTask_Bandit_RunEQSWithValidLocation_C::QueryTemplate' has a wrong offset!");
static_assert(offsetof(UTask_Bandit_RunEQSWithValidLocation_C, ItemScore) == 0x0000E0, "Member 'UTask_Bandit_RunEQSWithValidLocation_C::ItemScore' has a wrong offset!");
static_assert(offsetof(UTask_Bandit_RunEQSWithValidLocation_C, ItemIndex) == 0x0000F0, "Member 'UTask_Bandit_RunEQSWithValidLocation_C::ItemIndex' has a wrong offset!");

}

