#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Task_SetOnCover

#include "Basic.hpp"


namespace SDK::Params
{

// Function Task_SetOnCover.Task_SetOnCover_C.ExecuteUbergraph_Task_SetOnCover
// 0x0028 (0x0028 - 0x0000)
struct Task_SetOnCover_C_ExecuteUbergraph_Task_SetOnCover final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Task_SetOnCover_C_ExecuteUbergraph_Task_SetOnCover) == 0x000008, "Wrong alignment on Task_SetOnCover_C_ExecuteUbergraph_Task_SetOnCover");
static_assert(sizeof(Task_SetOnCover_C_ExecuteUbergraph_Task_SetOnCover) == 0x000028, "Wrong size on Task_SetOnCover_C_ExecuteUbergraph_Task_SetOnCover");
static_assert(offsetof(Task_SetOnCover_C_ExecuteUbergraph_Task_SetOnCover, EntryPoint) == 0x000000, "Member 'Task_SetOnCover_C_ExecuteUbergraph_Task_SetOnCover::EntryPoint' has a wrong offset!");
static_assert(offsetof(Task_SetOnCover_C_ExecuteUbergraph_Task_SetOnCover, K2Node_Event_OwnerController) == 0x000008, "Member 'Task_SetOnCover_C_ExecuteUbergraph_Task_SetOnCover::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(Task_SetOnCover_C_ExecuteUbergraph_Task_SetOnCover, K2Node_Event_ControlledPawn) == 0x000010, "Member 'Task_SetOnCover_C_ExecuteUbergraph_Task_SetOnCover::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(Task_SetOnCover_C_ExecuteUbergraph_Task_SetOnCover, CallFunc_MakeLiteralName_ReturnValue) == 0x000018, "Member 'Task_SetOnCover_C_ExecuteUbergraph_Task_SetOnCover::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_SetOnCover_C_ExecuteUbergraph_Task_SetOnCover, CallFunc_GetBlackboard_ReturnValue) == 0x000020, "Member 'Task_SetOnCover_C_ExecuteUbergraph_Task_SetOnCover::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");

// Function Task_SetOnCover.Task_SetOnCover_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct Task_SetOnCover_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Task_SetOnCover_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on Task_SetOnCover_C_ReceiveExecuteAI");
static_assert(sizeof(Task_SetOnCover_C_ReceiveExecuteAI) == 0x000010, "Wrong size on Task_SetOnCover_C_ReceiveExecuteAI");
static_assert(offsetof(Task_SetOnCover_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'Task_SetOnCover_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(Task_SetOnCover_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'Task_SetOnCover_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

