#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Task_All_SetFocus

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Task_All_SetFocus.Task_All_SetFocus_C.ExecuteUbergraph_Task_All_SetFocus
// 0x0048 (0x0048 - 0x0000)
struct Task_All_SetFocus_C_ExecuteUbergraph_Task_All_SetFocus final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetBlackboardValueAsActor_ReturnValue;    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetBlackboardValueAsVector_ReturnValue;   // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetBlackboardValueAsActor_ReturnValue_1;  // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Task_All_SetFocus_C_ExecuteUbergraph_Task_All_SetFocus) == 0x000008, "Wrong alignment on Task_All_SetFocus_C_ExecuteUbergraph_Task_All_SetFocus");
static_assert(sizeof(Task_All_SetFocus_C_ExecuteUbergraph_Task_All_SetFocus) == 0x000048, "Wrong size on Task_All_SetFocus_C_ExecuteUbergraph_Task_All_SetFocus");
static_assert(offsetof(Task_All_SetFocus_C_ExecuteUbergraph_Task_All_SetFocus, EntryPoint) == 0x000000, "Member 'Task_All_SetFocus_C_ExecuteUbergraph_Task_All_SetFocus::EntryPoint' has a wrong offset!");
static_assert(offsetof(Task_All_SetFocus_C_ExecuteUbergraph_Task_All_SetFocus, K2Node_Event_OwnerController) == 0x000008, "Member 'Task_All_SetFocus_C_ExecuteUbergraph_Task_All_SetFocus::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(Task_All_SetFocus_C_ExecuteUbergraph_Task_All_SetFocus, K2Node_Event_ControlledPawn) == 0x000010, "Member 'Task_All_SetFocus_C_ExecuteUbergraph_Task_All_SetFocus::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(Task_All_SetFocus_C_ExecuteUbergraph_Task_All_SetFocus, CallFunc_GetBlackboardValueAsActor_ReturnValue) == 0x000018, "Member 'Task_All_SetFocus_C_ExecuteUbergraph_Task_All_SetFocus::CallFunc_GetBlackboardValueAsActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_All_SetFocus_C_ExecuteUbergraph_Task_All_SetFocus, CallFunc_GetBlackboardValueAsVector_ReturnValue) == 0x000020, "Member 'Task_All_SetFocus_C_ExecuteUbergraph_Task_All_SetFocus::CallFunc_GetBlackboardValueAsVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_All_SetFocus_C_ExecuteUbergraph_Task_All_SetFocus, CallFunc_GetBlackboardValueAsActor_ReturnValue_1) == 0x000038, "Member 'Task_All_SetFocus_C_ExecuteUbergraph_Task_All_SetFocus::CallFunc_GetBlackboardValueAsActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_All_SetFocus_C_ExecuteUbergraph_Task_All_SetFocus, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'Task_All_SetFocus_C_ExecuteUbergraph_Task_All_SetFocus::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function Task_All_SetFocus.Task_All_SetFocus_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct Task_All_SetFocus_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Task_All_SetFocus_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on Task_All_SetFocus_C_ReceiveExecuteAI");
static_assert(sizeof(Task_All_SetFocus_C_ReceiveExecuteAI) == 0x000010, "Wrong size on Task_All_SetFocus_C_ReceiveExecuteAI");
static_assert(offsetof(Task_All_SetFocus_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'Task_All_SetFocus_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(Task_All_SetFocus_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'Task_All_SetFocus_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

