#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Task_Zombie_ChaseTarget

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Task_Zombie_ChaseTarget.Task_Zombie_ChaseTarget_C.Can Start Running
// 0x00F0 (0x00F0 - 0x0000)
struct Task_Zombie_ChaseTarget_C_Can_Start_Running final
{
public:
	bool                                          StartRunning;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDamaged_ReturnValue;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0xD];                                        // 0x0003(0x000D)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetBlackboardValueAsActor_ReturnValue;    // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetBlackboardValueAsActor_ReturnValue_1;  // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBlackboardValueAsBool_ReturnValue;     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_FindRelativeLookAtRotation_ReturnValue;   // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetDistanceTo_ReturnValue;                // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAgressive_ReturnValue;                 // 0x00D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x00D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00D6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x00D7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast;    // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Task_Zombie_ChaseTarget_C_Can_Start_Running) == 0x000010, "Wrong alignment on Task_Zombie_ChaseTarget_C_Can_Start_Running");
static_assert(sizeof(Task_Zombie_ChaseTarget_C_Can_Start_Running) == 0x0000F0, "Wrong size on Task_Zombie_ChaseTarget_C_Can_Start_Running");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_Can_Start_Running, StartRunning) == 0x000000, "Member 'Task_Zombie_ChaseTarget_C_Can_Start_Running::StartRunning' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_Can_Start_Running, Result) == 0x000001, "Member 'Task_Zombie_ChaseTarget_C_Can_Start_Running::Result' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_Can_Start_Running, CallFunc_GetDamaged_ReturnValue) == 0x000002, "Member 'Task_Zombie_ChaseTarget_C_Can_Start_Running::CallFunc_GetDamaged_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_Can_Start_Running, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'Task_Zombie_ChaseTarget_C_Can_Start_Running::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_Can_Start_Running, CallFunc_GetBlackboardValueAsActor_ReturnValue) == 0x000070, "Member 'Task_Zombie_ChaseTarget_C_Can_Start_Running::CallFunc_GetBlackboardValueAsActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_Can_Start_Running, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'Task_Zombie_ChaseTarget_C_Can_Start_Running::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_Can_Start_Running, CallFunc_Not_PreBool_ReturnValue) == 0x000079, "Member 'Task_Zombie_ChaseTarget_C_Can_Start_Running::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_Can_Start_Running, CallFunc_GetBlackboardValueAsActor_ReturnValue_1) == 0x000080, "Member 'Task_Zombie_ChaseTarget_C_Can_Start_Running::CallFunc_GetBlackboardValueAsActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_Can_Start_Running, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000088, "Member 'Task_Zombie_ChaseTarget_C_Can_Start_Running::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_Can_Start_Running, CallFunc_GetBlackboardValueAsBool_ReturnValue) == 0x0000A0, "Member 'Task_Zombie_ChaseTarget_C_Can_Start_Running::CallFunc_GetBlackboardValueAsBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_Can_Start_Running, CallFunc_FindRelativeLookAtRotation_ReturnValue) == 0x0000A8, "Member 'Task_Zombie_ChaseTarget_C_Can_Start_Running::CallFunc_FindRelativeLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_Can_Start_Running, CallFunc_GetDistanceTo_ReturnValue) == 0x0000C0, "Member 'Task_Zombie_ChaseTarget_C_Can_Start_Running::CallFunc_GetDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_Can_Start_Running, CallFunc_BreakRotator_Roll) == 0x0000C4, "Member 'Task_Zombie_ChaseTarget_C_Can_Start_Running::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_Can_Start_Running, CallFunc_BreakRotator_Pitch) == 0x0000C8, "Member 'Task_Zombie_ChaseTarget_C_Can_Start_Running::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_Can_Start_Running, CallFunc_BreakRotator_Yaw) == 0x0000CC, "Member 'Task_Zombie_ChaseTarget_C_Can_Start_Running::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_Can_Start_Running, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x0000D0, "Member 'Task_Zombie_ChaseTarget_C_Can_Start_Running::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_Can_Start_Running, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x0000D1, "Member 'Task_Zombie_ChaseTarget_C_Can_Start_Running::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_Can_Start_Running, CallFunc_BooleanAND_ReturnValue) == 0x0000D2, "Member 'Task_Zombie_ChaseTarget_C_Can_Start_Running::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_Can_Start_Running, CallFunc_GetAgressive_ReturnValue) == 0x0000D3, "Member 'Task_Zombie_ChaseTarget_C_Can_Start_Running::CallFunc_GetAgressive_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_Can_Start_Running, CallFunc_BooleanOR_ReturnValue) == 0x0000D4, "Member 'Task_Zombie_ChaseTarget_C_Can_Start_Running::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_Can_Start_Running, CallFunc_BooleanOR_ReturnValue_1) == 0x0000D5, "Member 'Task_Zombie_ChaseTarget_C_Can_Start_Running::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_Can_Start_Running, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000D6, "Member 'Task_Zombie_ChaseTarget_C_Can_Start_Running::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_Can_Start_Running, CallFunc_BooleanOR_ReturnValue_2) == 0x0000D7, "Member 'Task_Zombie_ChaseTarget_C_Can_Start_Running::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_Can_Start_Running, CallFunc_BooleanOR_ReturnValue_3) == 0x0000D8, "Member 'Task_Zombie_ChaseTarget_C_Can_Start_Running::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_Can_Start_Running, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x0000E0, "Member 'Task_Zombie_ChaseTarget_C_Can_Start_Running::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_Can_Start_Running, CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast) == 0x0000E8, "Member 'Task_Zombie_ChaseTarget_C_Can_Start_Running::CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast' has a wrong offset!");

// Function Task_Zombie_ChaseTarget.Task_Zombie_ChaseTarget_C.Continue Chasing
// 0x00B0 (0x00B0 - 0x0000)
struct Task_Zombie_ChaseTarget_C_Continue_Chasing final
{
public:
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          CallFunc_GetAIController_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AZombieController_C*                    K2Node_DynamicCast_AsZombie_Controller;            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCPPVelocityValue_ReturnValue;          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_V2_C*                   K2Node_DynamicCast_AsSurvival_Player_V2;           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAttackSetted_AttackIsSetted;            // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B[0x1];                                       // 0x006B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCPPVelocityValue_ReturnValue_1;        // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue_1;     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAttackSetted_AttackIsSetted_1;          // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetCurrentPathPointLocation_CurrentPathPointLocation; // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetBlackboardValueAsActor_ReturnValue;    // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Get_Degrees_to_Target_DesiredDegrees;     // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast;    // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast_1;  // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Task_Zombie_ChaseTarget_C_Continue_Chasing) == 0x000008, "Wrong alignment on Task_Zombie_ChaseTarget_C_Continue_Chasing");
static_assert(sizeof(Task_Zombie_ChaseTarget_C_Continue_Chasing) == 0x0000B0, "Wrong size on Task_Zombie_ChaseTarget_C_Continue_Chasing");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_Continue_Chasing, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000000, "Member 'Task_Zombie_ChaseTarget_C_Continue_Chasing::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_Continue_Chasing, CallFunc_GetAIController_ReturnValue) == 0x000018, "Member 'Task_Zombie_ChaseTarget_C_Continue_Chasing::CallFunc_GetAIController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_Continue_Chasing, K2Node_DynamicCast_AsZombie_Controller) == 0x000020, "Member 'Task_Zombie_ChaseTarget_C_Continue_Chasing::K2Node_DynamicCast_AsZombie_Controller' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_Continue_Chasing, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'Task_Zombie_ChaseTarget_C_Continue_Chasing::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_Continue_Chasing, CallFunc_GetCPPVelocityValue_ReturnValue) == 0x00002C, "Member 'Task_Zombie_ChaseTarget_C_Continue_Chasing::CallFunc_GetCPPVelocityValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_Continue_Chasing, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'Task_Zombie_ChaseTarget_C_Continue_Chasing::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_Continue_Chasing, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000031, "Member 'Task_Zombie_ChaseTarget_C_Continue_Chasing::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_Continue_Chasing, CallFunc_Not_PreBool_ReturnValue) == 0x000032, "Member 'Task_Zombie_ChaseTarget_C_Continue_Chasing::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_Continue_Chasing, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000038, "Member 'Task_Zombie_ChaseTarget_C_Continue_Chasing::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_Continue_Chasing, K2Node_DynamicCast_AsSurvival_Player_V2) == 0x000050, "Member 'Task_Zombie_ChaseTarget_C_Continue_Chasing::K2Node_DynamicCast_AsSurvival_Player_V2' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_Continue_Chasing, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'Task_Zombie_ChaseTarget_C_Continue_Chasing::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_Continue_Chasing, CallFunc_Vector_Distance_ReturnValue) == 0x000060, "Member 'Task_Zombie_ChaseTarget_C_Continue_Chasing::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_Continue_Chasing, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000068, "Member 'Task_Zombie_ChaseTarget_C_Continue_Chasing::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_Continue_Chasing, CallFunc_IsAttackSetted_AttackIsSetted) == 0x000069, "Member 'Task_Zombie_ChaseTarget_C_Continue_Chasing::CallFunc_IsAttackSetted_AttackIsSetted' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_Continue_Chasing, CallFunc_BooleanOR_ReturnValue) == 0x00006A, "Member 'Task_Zombie_ChaseTarget_C_Continue_Chasing::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_Continue_Chasing, CallFunc_GetCPPVelocityValue_ReturnValue_1) == 0x00006C, "Member 'Task_Zombie_ChaseTarget_C_Continue_Chasing::CallFunc_GetCPPVelocityValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_Continue_Chasing, CallFunc_NearlyEqual_FloatFloat_ReturnValue_1) == 0x000070, "Member 'Task_Zombie_ChaseTarget_C_Continue_Chasing::CallFunc_NearlyEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_Continue_Chasing, CallFunc_Not_PreBool_ReturnValue_1) == 0x000071, "Member 'Task_Zombie_ChaseTarget_C_Continue_Chasing::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_Continue_Chasing, CallFunc_IsAttackSetted_AttackIsSetted_1) == 0x000072, "Member 'Task_Zombie_ChaseTarget_C_Continue_Chasing::CallFunc_IsAttackSetted_AttackIsSetted_1' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_Continue_Chasing, CallFunc_BooleanOR_ReturnValue_1) == 0x000073, "Member 'Task_Zombie_ChaseTarget_C_Continue_Chasing::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_Continue_Chasing, CallFunc_Not_PreBool_ReturnValue_2) == 0x000074, "Member 'Task_Zombie_ChaseTarget_C_Continue_Chasing::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_Continue_Chasing, CallFunc_GetCurrentPathPointLocation_CurrentPathPointLocation) == 0x000078, "Member 'Task_Zombie_ChaseTarget_C_Continue_Chasing::CallFunc_GetCurrentPathPointLocation_CurrentPathPointLocation' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_Continue_Chasing, CallFunc_GetBlackboardValueAsActor_ReturnValue) == 0x000090, "Member 'Task_Zombie_ChaseTarget_C_Continue_Chasing::CallFunc_GetBlackboardValueAsActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_Continue_Chasing, CallFunc_Get_Degrees_to_Target_DesiredDegrees) == 0x000098, "Member 'Task_Zombie_ChaseTarget_C_Continue_Chasing::CallFunc_Get_Degrees_to_Target_DesiredDegrees' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_Continue_Chasing, CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast) == 0x0000A0, "Member 'Task_Zombie_ChaseTarget_C_Continue_Chasing::CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_Continue_Chasing, CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast_1) == 0x0000A8, "Member 'Task_Zombie_ChaseTarget_C_Continue_Chasing::CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast_1' has a wrong offset!");

// Function Task_Zombie_ChaseTarget.Task_Zombie_ChaseTarget_C.ExecuteUbergraph_Task_Zombie_ChaseTarget
// 0x0080 (0x0080 - 0x0000)
struct Task_Zombie_ChaseTarget_C_ExecuteUbergraph_Task_Zombie_ChaseTarget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_Event_OwnerController_1;                    // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn_1;                     // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AZombie_C*                              K2Node_DynamicCast_AsZombie;                       // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x005C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Can_Start_Running_StartRunning;           // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0070(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Task_Zombie_ChaseTarget_C_ExecuteUbergraph_Task_Zombie_ChaseTarget) == 0x000008, "Wrong alignment on Task_Zombie_ChaseTarget_C_ExecuteUbergraph_Task_Zombie_ChaseTarget");
static_assert(sizeof(Task_Zombie_ChaseTarget_C_ExecuteUbergraph_Task_Zombie_ChaseTarget) == 0x000080, "Wrong size on Task_Zombie_ChaseTarget_C_ExecuteUbergraph_Task_Zombie_ChaseTarget");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_ExecuteUbergraph_Task_Zombie_ChaseTarget, EntryPoint) == 0x000000, "Member 'Task_Zombie_ChaseTarget_C_ExecuteUbergraph_Task_Zombie_ChaseTarget::EntryPoint' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_ExecuteUbergraph_Task_Zombie_ChaseTarget, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'Task_Zombie_ChaseTarget_C_ExecuteUbergraph_Task_Zombie_ChaseTarget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_ExecuteUbergraph_Task_Zombie_ChaseTarget, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'Task_Zombie_ChaseTarget_C_ExecuteUbergraph_Task_Zombie_ChaseTarget::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_ExecuteUbergraph_Task_Zombie_ChaseTarget, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'Task_Zombie_ChaseTarget_C_ExecuteUbergraph_Task_Zombie_ChaseTarget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_ExecuteUbergraph_Task_Zombie_ChaseTarget, K2Node_Event_OwnerController_1) == 0x000030, "Member 'Task_Zombie_ChaseTarget_C_ExecuteUbergraph_Task_Zombie_ChaseTarget::K2Node_Event_OwnerController_1' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_ExecuteUbergraph_Task_Zombie_ChaseTarget, K2Node_Event_ControlledPawn_1) == 0x000038, "Member 'Task_Zombie_ChaseTarget_C_ExecuteUbergraph_Task_Zombie_ChaseTarget::K2Node_Event_ControlledPawn_1' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_ExecuteUbergraph_Task_Zombie_ChaseTarget, K2Node_Event_OwnerController) == 0x000040, "Member 'Task_Zombie_ChaseTarget_C_ExecuteUbergraph_Task_Zombie_ChaseTarget::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_ExecuteUbergraph_Task_Zombie_ChaseTarget, K2Node_Event_ControlledPawn) == 0x000048, "Member 'Task_Zombie_ChaseTarget_C_ExecuteUbergraph_Task_Zombie_ChaseTarget::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_ExecuteUbergraph_Task_Zombie_ChaseTarget, K2Node_DynamicCast_AsZombie) == 0x000050, "Member 'Task_Zombie_ChaseTarget_C_ExecuteUbergraph_Task_Zombie_ChaseTarget::K2Node_DynamicCast_AsZombie' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_ExecuteUbergraph_Task_Zombie_ChaseTarget, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'Task_Zombie_ChaseTarget_C_ExecuteUbergraph_Task_Zombie_ChaseTarget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_ExecuteUbergraph_Task_Zombie_ChaseTarget, K2Node_CreateDelegate_OutputDelegate_2) == 0x00005C, "Member 'Task_Zombie_ChaseTarget_C_ExecuteUbergraph_Task_Zombie_ChaseTarget::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_ExecuteUbergraph_Task_Zombie_ChaseTarget, CallFunc_Can_Start_Running_StartRunning) == 0x00006C, "Member 'Task_Zombie_ChaseTarget_C_ExecuteUbergraph_Task_Zombie_ChaseTarget::CallFunc_Can_Start_Running_StartRunning' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_ExecuteUbergraph_Task_Zombie_ChaseTarget, K2Node_CreateDelegate_OutputDelegate_3) == 0x000070, "Member 'Task_Zombie_ChaseTarget_C_ExecuteUbergraph_Task_Zombie_ChaseTarget::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");

// Function Task_Zombie_ChaseTarget.Task_Zombie_ChaseTarget_C.IsAttackSetted
// 0x0002 (0x0002 - 0x0000)
struct Task_Zombie_ChaseTarget_C_IsAttackSetted final
{
public:
	bool                                          AttackIsSetted;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBlackboardValueAsBool_ReturnValue;     // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Task_Zombie_ChaseTarget_C_IsAttackSetted) == 0x000001, "Wrong alignment on Task_Zombie_ChaseTarget_C_IsAttackSetted");
static_assert(sizeof(Task_Zombie_ChaseTarget_C_IsAttackSetted) == 0x000002, "Wrong size on Task_Zombie_ChaseTarget_C_IsAttackSetted");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_IsAttackSetted, AttackIsSetted) == 0x000000, "Member 'Task_Zombie_ChaseTarget_C_IsAttackSetted::AttackIsSetted' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_IsAttackSetted, CallFunc_GetBlackboardValueAsBool_ReturnValue) == 0x000001, "Member 'Task_Zombie_ChaseTarget_C_IsAttackSetted::CallFunc_GetBlackboardValueAsBool_ReturnValue' has a wrong offset!");

// Function Task_Zombie_ChaseTarget.Task_Zombie_ChaseTarget_C.OnFinishTask
// 0x0030 (0x0030 - 0x0000)
struct Task_Zombie_ChaseTarget_C_OnFinishTask final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Task_Zombie_ChaseTarget_C_OnFinishTask) == 0x000004, "Wrong alignment on Task_Zombie_ChaseTarget_C_OnFinishTask");
static_assert(sizeof(Task_Zombie_ChaseTarget_C_OnFinishTask) == 0x000030, "Wrong size on Task_Zombie_ChaseTarget_C_OnFinishTask");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_OnFinishTask, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'Task_Zombie_ChaseTarget_C_OnFinishTask::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_OnFinishTask, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'Task_Zombie_ChaseTarget_C_OnFinishTask::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_OnFinishTask, K2Node_CreateDelegate_OutputDelegate_2) == 0x000020, "Member 'Task_Zombie_ChaseTarget_C_OnFinishTask::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");

// Function Task_Zombie_ChaseTarget.Task_Zombie_ChaseTarget_C.ReceiveAbortAI
// 0x0010 (0x0010 - 0x0000)
struct Task_Zombie_ChaseTarget_C_ReceiveAbortAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Task_Zombie_ChaseTarget_C_ReceiveAbortAI) == 0x000008, "Wrong alignment on Task_Zombie_ChaseTarget_C_ReceiveAbortAI");
static_assert(sizeof(Task_Zombie_ChaseTarget_C_ReceiveAbortAI) == 0x000010, "Wrong size on Task_Zombie_ChaseTarget_C_ReceiveAbortAI");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_ReceiveAbortAI, OwnerController) == 0x000000, "Member 'Task_Zombie_ChaseTarget_C_ReceiveAbortAI::OwnerController' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_ReceiveAbortAI, ControlledPawn) == 0x000008, "Member 'Task_Zombie_ChaseTarget_C_ReceiveAbortAI::ControlledPawn' has a wrong offset!");

// Function Task_Zombie_ChaseTarget.Task_Zombie_ChaseTarget_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct Task_Zombie_ChaseTarget_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Task_Zombie_ChaseTarget_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on Task_Zombie_ChaseTarget_C_ReceiveExecuteAI");
static_assert(sizeof(Task_Zombie_ChaseTarget_C_ReceiveExecuteAI) == 0x000010, "Wrong size on Task_Zombie_ChaseTarget_C_ReceiveExecuteAI");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'Task_Zombie_ChaseTarget_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'Task_Zombie_ChaseTarget_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

// Function Task_Zombie_ChaseTarget.Task_Zombie_ChaseTarget_C.WaitTillStart
// 0x0001 (0x0001 - 0x0000)
struct Task_Zombie_ChaseTarget_C_WaitTillStart final
{
public:
	bool                                          CallFunc_Can_Start_Running_StartRunning;           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Task_Zombie_ChaseTarget_C_WaitTillStart) == 0x000001, "Wrong alignment on Task_Zombie_ChaseTarget_C_WaitTillStart");
static_assert(sizeof(Task_Zombie_ChaseTarget_C_WaitTillStart) == 0x000001, "Wrong size on Task_Zombie_ChaseTarget_C_WaitTillStart");
static_assert(offsetof(Task_Zombie_ChaseTarget_C_WaitTillStart, CallFunc_Can_Start_Running_StartRunning) == 0x000000, "Member 'Task_Zombie_ChaseTarget_C_WaitTillStart::CallFunc_Can_Start_Running_StartRunning' has a wrong offset!");

}

