#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TDB_GameMode

#include "Basic.hpp"

#include "Agones_structs.hpp"
#include "FItemInfo_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FirebaseFeatures_structs.hpp"
#include "Engine_structs.hpp"
#include "PlayerStatesArray_structs.hpp"


namespace SDK::Params
{

// Function TDB_GameMode.TDB_GameMode_C.AddDeadBody
// 0x0028 (0x0028 - 0x0000)
struct TDB_GameMode_C_AddDeadBody final
{
public:
	const class APlayerDeadBodyRepl_C*            NewItem;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class APlayerDeadBodyRepl_C*                  DeadBodyToRemove;                                  // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class APlayerDeadBodyRepl_C*                  CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TDB_GameMode_C_AddDeadBody) == 0x000008, "Wrong alignment on TDB_GameMode_C_AddDeadBody");
static_assert(sizeof(TDB_GameMode_C_AddDeadBody) == 0x000028, "Wrong size on TDB_GameMode_C_AddDeadBody");
static_assert(offsetof(TDB_GameMode_C_AddDeadBody, NewItem) == 0x000000, "Member 'TDB_GameMode_C_AddDeadBody::NewItem' has a wrong offset!");
static_assert(offsetof(TDB_GameMode_C_AddDeadBody, DeadBodyToRemove) == 0x000008, "Member 'TDB_GameMode_C_AddDeadBody::DeadBodyToRemove' has a wrong offset!");
static_assert(offsetof(TDB_GameMode_C_AddDeadBody, CallFunc_Array_Get_Item) == 0x000010, "Member 'TDB_GameMode_C_AddDeadBody::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TDB_GameMode_C_AddDeadBody, CallFunc_Array_RemoveItem_ReturnValue) == 0x000018, "Member 'TDB_GameMode_C_AddDeadBody::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(TDB_GameMode_C_AddDeadBody, CallFunc_Array_Add_ReturnValue) == 0x00001C, "Member 'TDB_GameMode_C_AddDeadBody::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(TDB_GameMode_C_AddDeadBody, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000020, "Member 'TDB_GameMode_C_AddDeadBody::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function TDB_GameMode.TDB_GameMode_C.AddPlayfabPlayer
// 0x0018 (0x0018 - 0x0000)
struct TDB_GameMode_C_AddPlayfabPlayer final
{
public:
	class FString                                 PlayFabID;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class ASurvPC_C*                              Player;                                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TDB_GameMode_C_AddPlayfabPlayer) == 0x000008, "Wrong alignment on TDB_GameMode_C_AddPlayfabPlayer");
static_assert(sizeof(TDB_GameMode_C_AddPlayfabPlayer) == 0x000018, "Wrong size on TDB_GameMode_C_AddPlayfabPlayer");
static_assert(offsetof(TDB_GameMode_C_AddPlayfabPlayer, PlayFabID) == 0x000000, "Member 'TDB_GameMode_C_AddPlayfabPlayer::PlayFabID' has a wrong offset!");
static_assert(offsetof(TDB_GameMode_C_AddPlayfabPlayer, Player) == 0x000010, "Member 'TDB_GameMode_C_AddPlayfabPlayer::Player' has a wrong offset!");

// Function TDB_GameMode.TDB_GameMode_C.AgonesAllocateSuccess
// 0x0001 (0x0001 - 0x0000)
struct TDB_GameMode_C_AgonesAllocateSuccess final
{
public:
	struct FEmptyResponse                         Param_Response;                                    // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TDB_GameMode_C_AgonesAllocateSuccess) == 0x000001, "Wrong alignment on TDB_GameMode_C_AgonesAllocateSuccess");
static_assert(sizeof(TDB_GameMode_C_AgonesAllocateSuccess) == 0x000001, "Wrong size on TDB_GameMode_C_AgonesAllocateSuccess");
static_assert(offsetof(TDB_GameMode_C_AgonesAllocateSuccess, Param_Response) == 0x000000, "Member 'TDB_GameMode_C_AgonesAllocateSuccess::Param_Response' has a wrong offset!");

// Function TDB_GameMode.TDB_GameMode_C.AgonesResponseError
// 0x0010 (0x0010 - 0x0000)
struct TDB_GameMode_C_AgonesResponseError final
{
public:
	struct FAgonesError                           Error;                                             // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(TDB_GameMode_C_AgonesResponseError) == 0x000008, "Wrong alignment on TDB_GameMode_C_AgonesResponseError");
static_assert(sizeof(TDB_GameMode_C_AgonesResponseError) == 0x000010, "Wrong size on TDB_GameMode_C_AgonesResponseError");
static_assert(offsetof(TDB_GameMode_C_AgonesResponseError, Error) == 0x000000, "Member 'TDB_GameMode_C_AgonesResponseError::Error' has a wrong offset!");

// Function TDB_GameMode.TDB_GameMode_C.AgonesResponseSuccess
// 0x0001 (0x0001 - 0x0000)
struct TDB_GameMode_C_AgonesResponseSuccess final
{
public:
	struct FEmptyResponse                         Param_Response;                                    // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TDB_GameMode_C_AgonesResponseSuccess) == 0x000001, "Wrong alignment on TDB_GameMode_C_AgonesResponseSuccess");
static_assert(sizeof(TDB_GameMode_C_AgonesResponseSuccess) == 0x000001, "Wrong size on TDB_GameMode_C_AgonesResponseSuccess");
static_assert(offsetof(TDB_GameMode_C_AgonesResponseSuccess, Param_Response) == 0x000000, "Member 'TDB_GameMode_C_AgonesResponseSuccess::Param_Response' has a wrong offset!");

// Function TDB_GameMode.TDB_GameMode_C.CalculateMinutesFrom2022
// 0x0078 (0x0078 - 0x0000)
struct TDB_GameMode_C_CalculateMinutesFrom2022 final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Hours;                                             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Days;                                              // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_DaysInYear_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue_1;            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_UtcNow_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Year;                       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Month;                      // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Day;                        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Hour;                       // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Minute;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Second;                     // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Millisecond;                // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_DaysInMonth_ReturnValue;                  // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TDB_GameMode_C_CalculateMinutesFrom2022) == 0x000008, "Wrong alignment on TDB_GameMode_C_CalculateMinutesFrom2022");
static_assert(sizeof(TDB_GameMode_C_CalculateMinutesFrom2022) == 0x000078, "Wrong size on TDB_GameMode_C_CalculateMinutesFrom2022");
static_assert(offsetof(TDB_GameMode_C_CalculateMinutesFrom2022, ReturnValue) == 0x000000, "Member 'TDB_GameMode_C_CalculateMinutesFrom2022::ReturnValue' has a wrong offset!");
static_assert(offsetof(TDB_GameMode_C_CalculateMinutesFrom2022, Hours) == 0x000004, "Member 'TDB_GameMode_C_CalculateMinutesFrom2022::Hours' has a wrong offset!");
static_assert(offsetof(TDB_GameMode_C_CalculateMinutesFrom2022, Days) == 0x000008, "Member 'TDB_GameMode_C_CalculateMinutesFrom2022::Days' has a wrong offset!");
static_assert(offsetof(TDB_GameMode_C_CalculateMinutesFrom2022, Temp_int_Variable) == 0x00000C, "Member 'TDB_GameMode_C_CalculateMinutesFrom2022::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(TDB_GameMode_C_CalculateMinutesFrom2022, CallFunc_DaysInYear_ReturnValue) == 0x000010, "Member 'TDB_GameMode_C_CalculateMinutesFrom2022::CallFunc_DaysInYear_ReturnValue' has a wrong offset!");
static_assert(offsetof(TDB_GameMode_C_CalculateMinutesFrom2022, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'TDB_GameMode_C_CalculateMinutesFrom2022::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TDB_GameMode_C_CalculateMinutesFrom2022, CallFunc_Multiply_IntInt_ReturnValue) == 0x000018, "Member 'TDB_GameMode_C_CalculateMinutesFrom2022::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TDB_GameMode_C_CalculateMinutesFrom2022, Temp_int_Variable_1) == 0x00001C, "Member 'TDB_GameMode_C_CalculateMinutesFrom2022::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(TDB_GameMode_C_CalculateMinutesFrom2022, CallFunc_Greater_IntInt_ReturnValue) == 0x000020, "Member 'TDB_GameMode_C_CalculateMinutesFrom2022::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TDB_GameMode_C_CalculateMinutesFrom2022, CallFunc_Add_IntInt_ReturnValue_1) == 0x000024, "Member 'TDB_GameMode_C_CalculateMinutesFrom2022::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TDB_GameMode_C_CalculateMinutesFrom2022, CallFunc_Add_IntInt_ReturnValue_2) == 0x000028, "Member 'TDB_GameMode_C_CalculateMinutesFrom2022::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TDB_GameMode_C_CalculateMinutesFrom2022, CallFunc_Multiply_IntInt_ReturnValue_1) == 0x00002C, "Member 'TDB_GameMode_C_CalculateMinutesFrom2022::CallFunc_Multiply_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TDB_GameMode_C_CalculateMinutesFrom2022, CallFunc_UtcNow_ReturnValue) == 0x000030, "Member 'TDB_GameMode_C_CalculateMinutesFrom2022::CallFunc_UtcNow_ReturnValue' has a wrong offset!");
static_assert(offsetof(TDB_GameMode_C_CalculateMinutesFrom2022, CallFunc_BreakDateTime_Year) == 0x000038, "Member 'TDB_GameMode_C_CalculateMinutesFrom2022::CallFunc_BreakDateTime_Year' has a wrong offset!");
static_assert(offsetof(TDB_GameMode_C_CalculateMinutesFrom2022, CallFunc_BreakDateTime_Month) == 0x00003C, "Member 'TDB_GameMode_C_CalculateMinutesFrom2022::CallFunc_BreakDateTime_Month' has a wrong offset!");
static_assert(offsetof(TDB_GameMode_C_CalculateMinutesFrom2022, CallFunc_BreakDateTime_Day) == 0x000040, "Member 'TDB_GameMode_C_CalculateMinutesFrom2022::CallFunc_BreakDateTime_Day' has a wrong offset!");
static_assert(offsetof(TDB_GameMode_C_CalculateMinutesFrom2022, CallFunc_BreakDateTime_Hour) == 0x000044, "Member 'TDB_GameMode_C_CalculateMinutesFrom2022::CallFunc_BreakDateTime_Hour' has a wrong offset!");
static_assert(offsetof(TDB_GameMode_C_CalculateMinutesFrom2022, CallFunc_BreakDateTime_Minute) == 0x000048, "Member 'TDB_GameMode_C_CalculateMinutesFrom2022::CallFunc_BreakDateTime_Minute' has a wrong offset!");
static_assert(offsetof(TDB_GameMode_C_CalculateMinutesFrom2022, CallFunc_BreakDateTime_Second) == 0x00004C, "Member 'TDB_GameMode_C_CalculateMinutesFrom2022::CallFunc_BreakDateTime_Second' has a wrong offset!");
static_assert(offsetof(TDB_GameMode_C_CalculateMinutesFrom2022, CallFunc_BreakDateTime_Millisecond) == 0x000050, "Member 'TDB_GameMode_C_CalculateMinutesFrom2022::CallFunc_BreakDateTime_Millisecond' has a wrong offset!");
static_assert(offsetof(TDB_GameMode_C_CalculateMinutesFrom2022, CallFunc_DaysInMonth_ReturnValue) == 0x000054, "Member 'TDB_GameMode_C_CalculateMinutesFrom2022::CallFunc_DaysInMonth_ReturnValue' has a wrong offset!");
static_assert(offsetof(TDB_GameMode_C_CalculateMinutesFrom2022, CallFunc_Add_IntInt_ReturnValue_3) == 0x000058, "Member 'TDB_GameMode_C_CalculateMinutesFrom2022::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(TDB_GameMode_C_CalculateMinutesFrom2022, CallFunc_Add_IntInt_ReturnValue_4) == 0x00005C, "Member 'TDB_GameMode_C_CalculateMinutesFrom2022::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(TDB_GameMode_C_CalculateMinutesFrom2022, CallFunc_Add_IntInt_ReturnValue_5) == 0x000060, "Member 'TDB_GameMode_C_CalculateMinutesFrom2022::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(TDB_GameMode_C_CalculateMinutesFrom2022, CallFunc_Add_IntInt_ReturnValue_6) == 0x000064, "Member 'TDB_GameMode_C_CalculateMinutesFrom2022::CallFunc_Add_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(TDB_GameMode_C_CalculateMinutesFrom2022, CallFunc_Subtract_IntInt_ReturnValue) == 0x000068, "Member 'TDB_GameMode_C_CalculateMinutesFrom2022::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TDB_GameMode_C_CalculateMinutesFrom2022, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x00006C, "Member 'TDB_GameMode_C_CalculateMinutesFrom2022::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TDB_GameMode_C_CalculateMinutesFrom2022, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000070, "Member 'TDB_GameMode_C_CalculateMinutesFrom2022::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TDB_GameMode_C_CalculateMinutesFrom2022, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000071, "Member 'TDB_GameMode_C_CalculateMinutesFrom2022::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");

// Function TDB_GameMode.TDB_GameMode_C.CallLootAnim
// 0x0010 (0x0010 - 0x0000)
struct TDB_GameMode_C_CallLootAnim final
{
public:
	double                                        LootingHeight;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LootPointOpened;                                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TDB_GameMode_C_CallLootAnim) == 0x000008, "Wrong alignment on TDB_GameMode_C_CallLootAnim");
static_assert(sizeof(TDB_GameMode_C_CallLootAnim) == 0x000010, "Wrong size on TDB_GameMode_C_CallLootAnim");
static_assert(offsetof(TDB_GameMode_C_CallLootAnim, LootingHeight) == 0x000000, "Member 'TDB_GameMode_C_CallLootAnim::LootingHeight' has a wrong offset!");
static_assert(offsetof(TDB_GameMode_C_CallLootAnim, LootPointOpened) == 0x000008, "Member 'TDB_GameMode_C_CallLootAnim::LootPointOpened' has a wrong offset!");

// Function TDB_GameMode.TDB_GameMode_C.ChoosePlayerStart
// 0x0040 (0x0040 - 0x0000)
struct TDB_GameMode_C_ChoosePlayerStart final
{
public:
	class AController*                            Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWithEditor_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_ChoosePlayerStart_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetStartForBunker_Start;                  // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetStartForBunker_ReturnValue;            // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TDB_GameMode_C_ChoosePlayerStart) == 0x000008, "Wrong alignment on TDB_GameMode_C_ChoosePlayerStart");
static_assert(sizeof(TDB_GameMode_C_ChoosePlayerStart) == 0x000040, "Wrong size on TDB_GameMode_C_ChoosePlayerStart");
static_assert(offsetof(TDB_GameMode_C_ChoosePlayerStart, Player) == 0x000000, "Member 'TDB_GameMode_C_ChoosePlayerStart::Player' has a wrong offset!");
static_assert(offsetof(TDB_GameMode_C_ChoosePlayerStart, ReturnValue) == 0x000008, "Member 'TDB_GameMode_C_ChoosePlayerStart::ReturnValue' has a wrong offset!");
static_assert(offsetof(TDB_GameMode_C_ChoosePlayerStart, CallFunc_IsWithEditor_ReturnValue) == 0x000010, "Member 'TDB_GameMode_C_ChoosePlayerStart::CallFunc_IsWithEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(TDB_GameMode_C_ChoosePlayerStart, CallFunc_ChoosePlayerStart_ReturnValue) == 0x000018, "Member 'TDB_GameMode_C_ChoosePlayerStart::CallFunc_ChoosePlayerStart_ReturnValue' has a wrong offset!");
static_assert(offsetof(TDB_GameMode_C_ChoosePlayerStart, CallFunc_GetStartForBunker_Start) == 0x000020, "Member 'TDB_GameMode_C_ChoosePlayerStart::CallFunc_GetStartForBunker_Start' has a wrong offset!");
static_assert(offsetof(TDB_GameMode_C_ChoosePlayerStart, CallFunc_GetStartForBunker_ReturnValue) == 0x000028, "Member 'TDB_GameMode_C_ChoosePlayerStart::CallFunc_GetStartForBunker_ReturnValue' has a wrong offset!");

// Function TDB_GameMode.TDB_GameMode_C.ConfirmPlayerJoined
// 0x0018 (0x0018 - 0x0000)
struct TDB_GameMode_C_ConfirmPlayerJoined final
{
public:
	class FString                                 PlayFabPlayerID;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class ASurvPC_C*                              Controller;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TDB_GameMode_C_ConfirmPlayerJoined) == 0x000008, "Wrong alignment on TDB_GameMode_C_ConfirmPlayerJoined");
static_assert(sizeof(TDB_GameMode_C_ConfirmPlayerJoined) == 0x000018, "Wrong size on TDB_GameMode_C_ConfirmPlayerJoined");
static_assert(offsetof(TDB_GameMode_C_ConfirmPlayerJoined, PlayFabPlayerID) == 0x000000, "Member 'TDB_GameMode_C_ConfirmPlayerJoined::PlayFabPlayerID' has a wrong offset!");
static_assert(offsetof(TDB_GameMode_C_ConfirmPlayerJoined, Controller) == 0x000010, "Member 'TDB_GameMode_C_ConfirmPlayerJoined::Controller' has a wrong offset!");

// Function TDB_GameMode.TDB_GameMode_C.Craft
// 0x0008 (0x0008 - 0x0000)
struct TDB_GameMode_C_Craft final
{
public:
	class APawn*                                  Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TDB_GameMode_C_Craft) == 0x000008, "Wrong alignment on TDB_GameMode_C_Craft");
static_assert(sizeof(TDB_GameMode_C_Craft) == 0x000008, "Wrong size on TDB_GameMode_C_Craft");
static_assert(offsetof(TDB_GameMode_C_Craft, Player) == 0x000000, "Member 'TDB_GameMode_C_Craft::Player' has a wrong offset!");

// Function TDB_GameMode.TDB_GameMode_C.CreateJSONRequest
// 0x0040 (0x0040 - 0x0000)
struct TDB_GameMode_C_CreateJSONRequest final
{
public:
	struct FVector                                Position;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTDBJsonObject*                         Result;                                            // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTDBJsonObject*                         JSONRequest;                                       // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTDBJsonObject*                         CallFunc_ConstructJsonObject_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_VectorToString_ReturnValue;          // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(TDB_GameMode_C_CreateJSONRequest) == 0x000008, "Wrong alignment on TDB_GameMode_C_CreateJSONRequest");
static_assert(sizeof(TDB_GameMode_C_CreateJSONRequest) == 0x000040, "Wrong size on TDB_GameMode_C_CreateJSONRequest");
static_assert(offsetof(TDB_GameMode_C_CreateJSONRequest, Position) == 0x000000, "Member 'TDB_GameMode_C_CreateJSONRequest::Position' has a wrong offset!");
static_assert(offsetof(TDB_GameMode_C_CreateJSONRequest, Result) == 0x000018, "Member 'TDB_GameMode_C_CreateJSONRequest::Result' has a wrong offset!");
static_assert(offsetof(TDB_GameMode_C_CreateJSONRequest, JSONRequest) == 0x000020, "Member 'TDB_GameMode_C_CreateJSONRequest::JSONRequest' has a wrong offset!");
static_assert(offsetof(TDB_GameMode_C_CreateJSONRequest, CallFunc_ConstructJsonObject_ReturnValue) == 0x000028, "Member 'TDB_GameMode_C_CreateJSONRequest::CallFunc_ConstructJsonObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(TDB_GameMode_C_CreateJSONRequest, CallFunc_Conv_VectorToString_ReturnValue) == 0x000030, "Member 'TDB_GameMode_C_CreateJSONRequest::CallFunc_Conv_VectorToString_ReturnValue' has a wrong offset!");

// Function TDB_GameMode.TDB_GameMode_C.ExecuteUbergraph_TDB_GameMode
// 0x12B0 (0x12B0 - 0x0000)
struct TDB_GameMode_C_ExecuteUbergraph_TDB_GameMode final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFirestoreError                               K2Node_CustomEvent_Error_9;                        // 0x0004(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EFirestoreError Error)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EFirestoreError                               K2Node_CustomEvent_Error_8;                        // 0x0018(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EFirestoreError Error)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EFirestoreError                               Temp_byte_Variable;                                // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EFirestoreError Error)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EFirestoreError                               K2Node_CustomEvent_Error_7;                        // 0x0040(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFirestoreError                               K2Node_CustomEvent_Error_6;                        // 0x0041(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EFirestoreError Error)>        K2Node_CreateDelegate_OutputDelegate_3;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EFirestoreError                               Temp_byte_Variable_1;                              // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFirestoreError                               K2Node_CustomEvent_Error_5;                        // 0x005C(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFirestoreDocumentSnapshot             K2Node_CustomEvent_DocumentSnapshot_1;             // 0x0060(0x0010)(ConstParm)
	TDelegate<void(EFirestoreError Error, struct FFirestoreDocumentSnapshot& DocumentSnapshot)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0070(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EFirestoreError                               K2Node_CustomEvent_Error_4;                        // 0x0080(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFirestoreDocumentSnapshot             K2Node_CustomEvent_DocumentSnapshot;               // 0x0088(0x0010)(ConstParm)
	TDelegate<void(EFirestoreError Error, struct FFirestoreDocumentSnapshot& DocumentSnapshot)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0098(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFirestoreDocumentSnapshot             Temp_struct_Variable;                              // 0x00A8(0x0010)()
	EFirestoreError                               Temp_byte_Variable_2;                              // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, struct FFirestoreFieldValue> CallFunc_GetData_ReturnValue;                      // 0x00C0(0x0050)()
	class FString                                 Temp_string_Variable;                              // 0x0110(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(EFirestoreError Error, TArray<struct FFirestoreDocumentSnapshot>& DocumentSnapshots, TArray<class UFirestoreDocumentChange*>& DocumentChanges)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x0120(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFirestoreFieldValue                   CallFunc_Map_Find_Value;                           // 0x0130(0x0008)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFirestoreError                               K2Node_CustomEvent_Error_3;                        // 0x0139(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13A[0x6];                                      // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFirestoreDocumentSnapshot>     K2Node_CustomEvent_DocumentSnapshots_1;            // 0x0140(0x0010)(ConstParm, ReferenceParm)
	TArray<class UFirestoreDocumentChange*>       K2Node_CustomEvent_DocumentChanges_1;              // 0x0150(0x0010)(ConstParm, ReferenceParm)
	class FString                                 CallFunc_FieldValue_ToString_ReturnValue;          // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue_1;           // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EFirestoreError Error, TArray<struct FFirestoreDocumentSnapshot>& DocumentSnapshots, TArray<class UFirestoreDocumentChange*>& DocumentChanges)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x0174(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EFirestoreError                               K2Node_CustomEvent_Error_2;                        // 0x0184(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_185[0x3];                                      // 0x0185(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFirestoreDocumentSnapshot>     K2Node_CustomEvent_DocumentSnapshots;              // 0x0188(0x0010)(ConstParm, ReferenceParm)
	TArray<class UFirestoreDocumentChange*>       K2Node_CustomEvent_DocumentChanges;                // 0x0198(0x0010)(ConstParm, ReferenceParm)
	TArray<class UFirestoreDocumentChange*>       Temp_object_Variable;                              // 0x01A8(0x0010)(ReferenceParm)
	TArray<struct FFirestoreDocumentSnapshot>     Temp_struct_Variable_1;                            // 0x01B8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFirestoreError                               Temp_byte_Variable_3;                              // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFirestoreError                               Temp_byte_Variable_4;                              // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFirestoreDocumentSnapshot>     Temp_struct_Variable_2;                            // 0x0200(0x0010)(ReferenceParm)
	TArray<class UFirestoreDocumentChange*>       Temp_object_Variable_1;                            // 0x0210(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_225[0x3];                                      // 0x0225(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0234(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0235(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFirestoreError                               K2Node_CustomEvent_Error_10;                       // 0x0236(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_237[0x1];                                      // 0x0237(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFirestoreDocumentSnapshot>     K2Node_CustomEvent_DocumentSnapshots_2;            // 0x0238(0x0010)(ConstParm, ReferenceParm)
	TArray<class UFirestoreDocumentChange*>       K2Node_CustomEvent_DocumentChanges_2;              // 0x0248(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EFirestoreError Error, TArray<struct FFirestoreDocumentSnapshot>& DocumentSnapshots, TArray<class UFirestoreDocumentChange*>& DocumentChanges)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x0264(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_Player_3;                             // 0x0280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_Player_2;                             // 0x0288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_LootingHeight;                        // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_LootPointOpened;                      // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALootPoint_C*                           K2Node_Event_LootPoint;                            // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_Event_String;                               // 0x02A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ABP_Door_C*                             K2Node_Event_Door;                                 // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsOpen;                               // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Attach;                               // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C2[0x6];                                      // 0x02C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Canister_C*                         K2Node_Event_Canister;                             // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_NewParam;                             // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_NewEnable;                            // 0x02D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D2[0x2];                                      // 0x02D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_TileName_1;                           // 0x02D4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_TileName;                             // 0x02DC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x02E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_PlayerLoad;                     // 0x02F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_LevelName;                      // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0308(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0318(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_Event_NewPlayer;                            // 0x0328(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvPC_C*                              K2Node_DynamicCast_AsSurv_PC;                      // 0x0330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339[0x3];                                      // 0x0339(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumPlayers_ReturnValue;                // 0x033C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0340(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0350(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Player_1;                             // 0x0368(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0370(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37C[0x4];                                      // 0x037C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_GS_TDB_C>         K2Node_DynamicCast_AsBPI_GS_TDB;                   // 0x0380(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_391[0x7];                                      // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAISpawnManager_C*                      K2Node_Event_AISpawnManager;                       // 0x0398(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A4[0x4];                                      // 0x03A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_PlayFabPlayerID;                // 0x03A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ASurvPC_C*                              K2Node_CustomEvent_Controller;                     // 0x03B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EFirestoreError                               K2Node_CustomEvent_Error_11;                       // 0x03C0(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C1[0x7];                                      // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFirestoreDocumentSnapshot>     K2Node_CustomEvent_DocumentSnapshots_3;            // 0x03C8(0x0010)(ConstParm, ReferenceParm)
	TArray<class UFirestoreDocumentChange*>       K2Node_CustomEvent_DocumentChanges_3;              // 0x03D8(0x0010)(ConstParm, ReferenceParm)
	class ASurvivalPlayer_C*                      K2Node_Event_Player;                               // 0x03E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DestroyedActor;                 // 0x03F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_Map_Keys_Keys;                            // 0x0400(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0410(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0420(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_424[0x4];                                      // 0x0424(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      CallFunc_Map_Find_Value_1;                         // 0x0428(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0431(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x0432(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_433[0x1];                                      // 0x0433(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EFirestoreError Error, TArray<struct FFirestoreDocumentSnapshot>& DocumentSnapshots, TArray<class UFirestoreDocumentChange*>& DocumentChanges)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x0434(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0444(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0448(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_464[0x4];                                      // 0x0464(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             CallFunc_GetDataTableRowFromName_OutRow;           // 0x0468(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0688(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0689(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x068A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_68B[0x1];                                      // 0x068B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x068C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0690(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x0694(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_4;                  // 0x0698(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_5;                  // 0x069C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_6;                  // 0x06A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_7;                  // 0x06A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_8;                  // 0x06A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_9;                  // 0x06AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_1;                            // 0x06B0(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_10;                 // 0x06C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_pPID;                                 // 0x06C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_Event_pReason;                              // 0x06C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x06D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D9[0x7];                                      // 0x06D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x06E0(0x0018)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x06F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F9[0x7];                                      // 0x06F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0700(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ABE_PlayerController*                   CallFunc_GetPlayerByPID_ReturnValue;               // 0x0710(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_KickPlayerCustom_ReturnValue;             // 0x0718(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_719[0x3];                                      // 0x0719(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x071C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0720(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_724[0x4];                                      // 0x0724(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvPC_C*                              K2Node_CustomEvent_SurvPC_1;                       // 0x0728(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvPC_C*                              K2Node_CustomEvent_SurvPC;                         // 0x0730(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0738(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EFirestoreError                               Temp_byte_Variable_5;                              // 0x0740(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_741[0x7];                                      // 0x0741(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0748(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0750(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ActorHasTag_ReturnValue;                  // 0x0751(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0752(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0753(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_754[0xC];                                      // 0x0754(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0760(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x07C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C1[0x7];                                      // 0x07C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TransformToString_ReturnValue;       // 0x07C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
