#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TDB_APP_FIK

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct TDB_APP_FIK.TDB_APP_FIK_C.AnimBlueprintGeneratedConstantData
// 0x0107 (0x0108 - 0x0001)
struct TDB_APP_FIK::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_137;                               // 0x0008(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_138;                               // 0x0018(0x0010)(BlueprintVisible, EditFixedSize)
	class UBlendProfile*                          __BlendProfile_139;                                // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_140;                                  // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_141;                                // 0x0038(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_142;                                // 0x0039(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_143;                                // 0x003A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B[0x1];                                       // 0x003B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_144;                                // 0x003C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_145;                                // 0x0044(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_146;                              // 0x0050(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0070(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00F0(0x0018)()
};
static_assert(alignof(TDB_APP_FIK::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on TDB_APP_FIK::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(TDB_APP_FIK::FAnimBlueprintGeneratedConstantData) == 0x000108, "Wrong size on TDB_APP_FIK::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(TDB_APP_FIK::FAnimBlueprintGeneratedConstantData, __ArrayProperty_137) == 0x000008, "Member 'TDB_APP_FIK::FAnimBlueprintGeneratedConstantData::__ArrayProperty_137' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK::FAnimBlueprintGeneratedConstantData, __ArrayProperty_138) == 0x000018, "Member 'TDB_APP_FIK::FAnimBlueprintGeneratedConstantData::__ArrayProperty_138' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK::FAnimBlueprintGeneratedConstantData, __BlendProfile_139) == 0x000028, "Member 'TDB_APP_FIK::FAnimBlueprintGeneratedConstantData::__BlendProfile_139' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK::FAnimBlueprintGeneratedConstantData, __CurveFloat_140) == 0x000030, "Member 'TDB_APP_FIK::FAnimBlueprintGeneratedConstantData::__CurveFloat_140' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK::FAnimBlueprintGeneratedConstantData, __BoolProperty_141) == 0x000038, "Member 'TDB_APP_FIK::FAnimBlueprintGeneratedConstantData::__BoolProperty_141' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK::FAnimBlueprintGeneratedConstantData, __EnumProperty_142) == 0x000039, "Member 'TDB_APP_FIK::FAnimBlueprintGeneratedConstantData::__EnumProperty_142' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK::FAnimBlueprintGeneratedConstantData, __EnumProperty_143) == 0x00003A, "Member 'TDB_APP_FIK::FAnimBlueprintGeneratedConstantData::__EnumProperty_143' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK::FAnimBlueprintGeneratedConstantData, __NameProperty_144) == 0x00003C, "Member 'TDB_APP_FIK::FAnimBlueprintGeneratedConstantData::__NameProperty_144' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK::FAnimBlueprintGeneratedConstantData, __NameProperty_145) == 0x000044, "Member 'TDB_APP_FIK::FAnimBlueprintGeneratedConstantData::__NameProperty_145' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK::FAnimBlueprintGeneratedConstantData, __StructProperty_146) == 0x000050, "Member 'TDB_APP_FIK::FAnimBlueprintGeneratedConstantData::__StructProperty_146' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000070, "Member 'TDB_APP_FIK::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000F0, "Member 'TDB_APP_FIK::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct TDB_APP_FIK.TDB_APP_FIK_C.AnimBlueprintGeneratedMutableData
// 0x001F (0x0020 - 0x0001)
struct TDB_APP_FIK::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_0;                                  // 0x0002(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1;                                  // 0x0003(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_2;                                 // 0x0008(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          __BoolProperty_3;                                  // 0x0018(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TDB_APP_FIK::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong alignment on TDB_APP_FIK::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(TDB_APP_FIK::FAnimBlueprintGeneratedMutableData) == 0x000020, "Wrong size on TDB_APP_FIK::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(TDB_APP_FIK::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'TDB_APP_FIK::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK::FAnimBlueprintGeneratedMutableData, __BoolProperty_0) == 0x000002, "Member 'TDB_APP_FIK::FAnimBlueprintGeneratedMutableData::__BoolProperty_0' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK::FAnimBlueprintGeneratedMutableData, __BoolProperty_1) == 0x000003, "Member 'TDB_APP_FIK::FAnimBlueprintGeneratedMutableData::__BoolProperty_1' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK::FAnimBlueprintGeneratedMutableData, __ArrayProperty_2) == 0x000008, "Member 'TDB_APP_FIK::FAnimBlueprintGeneratedMutableData::__ArrayProperty_2' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK::FAnimBlueprintGeneratedMutableData, __BoolProperty_3) == 0x000018, "Member 'TDB_APP_FIK::FAnimBlueprintGeneratedMutableData::__BoolProperty_3' has a wrong offset!");

}

