#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TDB_APP_FIK

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function TDB_APP_FIK.TDB_APP_FIK_C.AnimGraph
// 0x0020 (0x0020 - 0x0000)
struct TDB_APP_FIK_C_AnimGraph final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(TDB_APP_FIK_C_AnimGraph) == 0x000008, "Wrong alignment on TDB_APP_FIK_C_AnimGraph");
static_assert(sizeof(TDB_APP_FIK_C_AnimGraph) == 0x000020, "Wrong size on TDB_APP_FIK_C_AnimGraph");
static_assert(offsetof(TDB_APP_FIK_C_AnimGraph, InPose) == 0x000000, "Member 'TDB_APP_FIK_C_AnimGraph::InPose' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_AnimGraph, Param_AnimGraph) == 0x000010, "Member 'TDB_APP_FIK_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function TDB_APP_FIK.TDB_APP_FIK_C.BlueprintThreadSafeUpdateAnimation
// 0x0020 (0x0020 - 0x0000)
struct TDB_APP_FIK_C_BlueprintThreadSafeUpdateAnimation final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_ReturnValue;                    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TDB_APP_FIK_C_BlueprintThreadSafeUpdateAnimation) == 0x000008, "Wrong alignment on TDB_APP_FIK_C_BlueprintThreadSafeUpdateAnimation");
static_assert(sizeof(TDB_APP_FIK_C_BlueprintThreadSafeUpdateAnimation) == 0x000020, "Wrong size on TDB_APP_FIK_C_BlueprintThreadSafeUpdateAnimation");
static_assert(offsetof(TDB_APP_FIK_C_BlueprintThreadSafeUpdateAnimation, DeltaTime) == 0x000000, "Member 'TDB_APP_FIK_C_BlueprintThreadSafeUpdateAnimation::DeltaTime' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_BlueprintThreadSafeUpdateAnimation, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000004, "Member 'TDB_APP_FIK_C_BlueprintThreadSafeUpdateAnimation::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_BlueprintThreadSafeUpdateAnimation, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'TDB_APP_FIK_C_BlueprintThreadSafeUpdateAnimation::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_BlueprintThreadSafeUpdateAnimation, CallFunc_SelectFloat_ReturnValue) == 0x000008, "Member 'TDB_APP_FIK_C_BlueprintThreadSafeUpdateAnimation::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_BlueprintThreadSafeUpdateAnimation, CallFunc_Conv_BoolToDouble_ReturnValue) == 0x000010, "Member 'TDB_APP_FIK_C_BlueprintThreadSafeUpdateAnimation::CallFunc_Conv_BoolToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_BlueprintThreadSafeUpdateAnimation, CallFunc_FInterpTo_ReturnValue) == 0x000018, "Member 'TDB_APP_FIK_C_BlueprintThreadSafeUpdateAnimation::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");

// Function TDB_APP_FIK.TDB_APP_FIK_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct TDB_APP_FIK_C_BlueprintUpdateAnimation final
{
public:
	float                                         Param_DeltaTimeX;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TDB_APP_FIK_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on TDB_APP_FIK_C_BlueprintUpdateAnimation");
static_assert(sizeof(TDB_APP_FIK_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on TDB_APP_FIK_C_BlueprintUpdateAnimation");
static_assert(offsetof(TDB_APP_FIK_C_BlueprintUpdateAnimation, Param_DeltaTimeX) == 0x000000, "Member 'TDB_APP_FIK_C_BlueprintUpdateAnimation::Param_DeltaTimeX' has a wrong offset!");

// Function TDB_APP_FIK.TDB_APP_FIK_C.CheckEquipAnim
// 0x0006 (0x0006 - 0x0000)
struct TDB_APP_FIK_C_CheckEquipAnim final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TDB_APP_FIK_C_CheckEquipAnim) == 0x000001, "Wrong alignment on TDB_APP_FIK_C_CheckEquipAnim");
static_assert(sizeof(TDB_APP_FIK_C_CheckEquipAnim) == 0x000006, "Wrong size on TDB_APP_FIK_C_CheckEquipAnim");
static_assert(offsetof(TDB_APP_FIK_C_CheckEquipAnim, ReturnValue) == 0x000000, "Member 'TDB_APP_FIK_C_CheckEquipAnim::ReturnValue' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_CheckEquipAnim, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'TDB_APP_FIK_C_CheckEquipAnim::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_CheckEquipAnim, CallFunc_IsValid_ReturnValue_1) == 0x000002, "Member 'TDB_APP_FIK_C_CheckEquipAnim::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_CheckEquipAnim, CallFunc_BooleanAND_ReturnValue) == 0x000003, "Member 'TDB_APP_FIK_C_CheckEquipAnim::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_CheckEquipAnim, CallFunc_BooleanAND_ReturnValue_1) == 0x000004, "Member 'TDB_APP_FIK_C_CheckEquipAnim::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_CheckEquipAnim, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'TDB_APP_FIK_C_CheckEquipAnim::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function TDB_APP_FIK.TDB_APP_FIK_C.CheckWeaponData
// 0x0006 (0x0006 - 0x0000)
struct TDB_APP_FIK_C_CheckWeaponData final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TDB_APP_FIK_C_CheckWeaponData) == 0x000001, "Wrong alignment on TDB_APP_FIK_C_CheckWeaponData");
static_assert(sizeof(TDB_APP_FIK_C_CheckWeaponData) == 0x000006, "Wrong size on TDB_APP_FIK_C_CheckWeaponData");
static_assert(offsetof(TDB_APP_FIK_C_CheckWeaponData, ReturnValue) == 0x000000, "Member 'TDB_APP_FIK_C_CheckWeaponData::ReturnValue' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_CheckWeaponData, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'TDB_APP_FIK_C_CheckWeaponData::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_CheckWeaponData, CallFunc_IsValid_ReturnValue_1) == 0x000002, "Member 'TDB_APP_FIK_C_CheckWeaponData::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_CheckWeaponData, CallFunc_BooleanAND_ReturnValue) == 0x000003, "Member 'TDB_APP_FIK_C_CheckWeaponData::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_CheckWeaponData, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000004, "Member 'TDB_APP_FIK_C_CheckWeaponData::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_CheckWeaponData, CallFunc_BooleanAND_ReturnValue_1) == 0x000005, "Member 'TDB_APP_FIK_C_CheckWeaponData::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function TDB_APP_FIK.TDB_APP_FIK_C.ExecuteUbergraph_TDB_APP_FIK
// 0x03E0 (0x03E0 - 0x0000)
struct TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue_1;    // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetOwningComponent_ReturnValue;           // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetOwningComponent_ReturnValue_1;         // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x00D0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue_1;         // 0x0130(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_2;                // 0x01D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_2;                // 0x01F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_2;                   // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ISurvAnimInterface_C>  K2Node_DynamicCast_AsSurv_Anim_Interface;          // 0x0260(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ISurvAnimInterface_C>  K2Node_DynamicCast_AsSurv_Anim_Interface_1;        // 0x0278(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSpineMontage_Return;                    // 0x0289(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsReloading_IsReloading;                  // 0x028A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x028B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x028C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x028D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x028E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x028F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0292(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0293(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0294(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0295(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_296[0x2];                                      // 0x0296(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ISurvAnimInterface_C>  K2Node_DynamicCast_AsSurv_Anim_Interface_2;        // 0x0298(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x02A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AA[0x6];                                      // 0x02AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTacticalGripOffset_GripOffset;         // 0x02B0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0311(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0312(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0313(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_314[0xC];                                      // 0x0314(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_TInterpTo_ReturnValue;                    // 0x0320(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x0381(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_382[0x2];                                      // 0x0382(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue;                // 0x0384(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_6;                // 0x0389(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x038A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckWeaponData_ReturnValue;              // 0x038B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_7;                 // 0x038C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_8;                 // 0x038D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckEquipAnim_ReturnValue;               // 0x038E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x038F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_9;                 // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_10;                // 0x0391(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x0392(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_11;                // 0x0393(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_394[0x4];                                      // 0x0394(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast;   // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_StructMemberSet_Alpha_ImplicitCast;         // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Set_Item_ImplicitCast;              // 0x03AC(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast_1; // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_DeltaTimeX_ImplicitCast;        // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_TInterpTo_DeltaTime_ImplicitCast;         // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C4[0x4];                                      // 0x03C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_B_ImplicitCast;               // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_LeftHandAlpha_ImplicitCast;     // 0x03D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK) == 0x000010, "Wrong alignment on TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK");
static_assert(sizeof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK) == 0x0003E0, "Wrong size on TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, EntryPoint) == 0x000000, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::EntryPoint' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_IsLocallyControlled_ReturnValue) == 0x000004, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_GetVelocity_ReturnValue) == 0x000008, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_Not_PreBool_ReturnValue) == 0x000020, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000021, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_BooleanAND_ReturnValue) == 0x000022, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_IsValid_ReturnValue) == 0x000023, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_Conv_BoolToDouble_ReturnValue) == 0x000028, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_Conv_BoolToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_BreakTransform_Location) == 0x000030, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_BreakTransform_Rotation) == 0x000048, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_BreakTransform_Scale) == 0x000060, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_SelectFloat_ReturnValue) == 0x000078, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_Not_PreBool_ReturnValue_1) == 0x000080, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_BooleanAND_ReturnValue_1) == 0x000081, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_EqualEqual_DoubleDouble_ReturnValue_1) == 0x000082, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_EqualEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_BooleanAND_ReturnValue_2) == 0x000083, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_BooleanAND_ReturnValue_3) == 0x000084, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_GetOwningComponent_ReturnValue) == 0x000088, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_GetOwningComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_GetAnimInstance_ReturnValue) == 0x000090, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000098, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, K2Node_Event_DeltaTimeX) == 0x0000A0, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, K2Node_DynamicCast_AsCharacter) == 0x0000A8, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, K2Node_DynamicCast_bSuccess) == 0x0000B0, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, K2Node_DynamicCast_AsSurvival_Player) == 0x0000B8, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, K2Node_DynamicCast_bSuccess_1) == 0x0000C0, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_GetOwningComponent_ReturnValue_1) == 0x0000C8, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_GetOwningComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_GetSocketTransform_ReturnValue) == 0x0000D0, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_GetSocketTransform_ReturnValue_1) == 0x000130, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_GetSocketTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_BreakTransform_Location_1) == 0x000190, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_BreakTransform_Rotation_1) == 0x0001A8, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_BreakTransform_Scale_1) == 0x0001C0, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_BreakTransform_Location_2) == 0x0001D8, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_BreakTransform_Location_2' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_BreakTransform_Rotation_2) == 0x0001F0, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_BreakTransform_Rotation_2' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_BreakTransform_Scale_2) == 0x000208, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_BreakTransform_Scale_2' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_BreakVector_X) == 0x000220, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_BreakVector_Y) == 0x000228, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_BreakVector_Z) == 0x000230, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_BreakVector_X_1) == 0x000238, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_BreakVector_Y_1) == 0x000240, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_BreakVector_Z_1) == 0x000248, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000250, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000258, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, K2Node_DynamicCast_AsSurv_Anim_Interface) == 0x000260, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::K2Node_DynamicCast_AsSurv_Anim_Interface' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, K2Node_DynamicCast_bSuccess_2) == 0x000270, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, K2Node_DynamicCast_AsSurv_Anim_Interface_1) == 0x000278, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::K2Node_DynamicCast_AsSurv_Anim_Interface_1' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, K2Node_DynamicCast_bSuccess_3) == 0x000288, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_IsSpineMontage_Return) == 0x000289, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_IsSpineMontage_Return' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_IsReloading_IsReloading) == 0x00028A, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_IsReloading_IsReloading' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_Not_PreBool_ReturnValue_2) == 0x00028B, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_BooleanAND_ReturnValue_4) == 0x00028C, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_BooleanAND_ReturnValue_5) == 0x00028D, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_BooleanAND_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_IsValid_ReturnValue_1) == 0x00028E, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_Not_PreBool_ReturnValue_3) == 0x00028F, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_Not_PreBool_ReturnValue_4) == 0x000290, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, Temp_bool_Variable) == 0x000291, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_IsValid_ReturnValue_2) == 0x000292, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_IsValid_ReturnValue_3) == 0x000293, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_BooleanOR_ReturnValue) == 0x000294, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_BooleanOR_ReturnValue_1) == 0x000295, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, K2Node_DynamicCast_AsSurv_Anim_Interface_2) == 0x000298, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::K2Node_DynamicCast_AsSurv_Anim_Interface_2' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, K2Node_DynamicCast_bSuccess_4) == 0x0002A8, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0002A9, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_GetTacticalGripOffset_GripOffset) == 0x0002B0, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_GetTacticalGripOffset_GripOffset' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000310, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_IsValid_ReturnValue_4) == 0x000311, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_BooleanOR_ReturnValue_2) == 0x000312, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_IsValid_ReturnValue_5) == 0x000313, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_TInterpTo_ReturnValue) == 0x000320, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_TInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000380, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_Not_PreBool_ReturnValue_5) == 0x000381, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_Not_PreBool_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_GetCurveValue_ReturnValue) == 0x000384, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_GetCurveValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000388, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_Not_PreBool_ReturnValue_6) == 0x000389, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_Not_PreBool_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_BooleanAND_ReturnValue_6) == 0x00038A, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_BooleanAND_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_CheckWeaponData_ReturnValue) == 0x00038B, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_CheckWeaponData_ReturnValue' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_BooleanAND_ReturnValue_7) == 0x00038C, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_BooleanAND_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_BooleanAND_ReturnValue_8) == 0x00038D, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_BooleanAND_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_CheckEquipAnim_ReturnValue) == 0x00038E, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_CheckEquipAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, Temp_bool_Variable_1) == 0x00038F, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_BooleanAND_ReturnValue_9) == 0x000390, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_BooleanAND_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_BooleanAND_ReturnValue_10) == 0x000391, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_BooleanAND_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, K2Node_Select_Default) == 0x000392, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_BooleanAND_ReturnValue_11) == 0x000393, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_BooleanAND_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_SelectFloat_ReturnValue_1) == 0x000398, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast) == 0x0003A0, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, K2Node_StructMemberSet_Alpha_ImplicitCast) == 0x0003A8, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::K2Node_StructMemberSet_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_Array_Set_Item_ImplicitCast) == 0x0003AC, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_Array_Set_Item_ImplicitCast' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast_1) == 0x0003B0, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, K2Node_VariableSet_DeltaTimeX_ImplicitCast) == 0x0003B8, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::K2Node_VariableSet_DeltaTimeX_ImplicitCast' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_TInterpTo_DeltaTime_ImplicitCast) == 0x0003C0, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_TInterpTo_DeltaTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, CallFunc_SelectFloat_B_ImplicitCast) == 0x0003C8, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::CallFunc_SelectFloat_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK, K2Node_VariableSet_LeftHandAlpha_ImplicitCast) == 0x0003D0, "Member 'TDB_APP_FIK_C_ExecuteUbergraph_TDB_APP_FIK::K2Node_VariableSet_LeftHandAlpha_ImplicitCast' has a wrong offset!");

// Function TDB_APP_FIK.TDB_APP_FIK_C.SetFootLocking
// 0x0050 (0x0050 - 0x0000)
struct TDB_APP_FIK_C_SetFootLocking final
{
public:
	class FName                                   FootLockCurve;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   IKFootBone;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentFootLockAlpha;                              // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CurrentFootLockLocation;                           // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CurrentFootLockRotation;                           // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor)
	double                                        FootLockCurveValue;                                // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TDB_APP_FIK_C_SetFootLocking) == 0x000008, "Wrong alignment on TDB_APP_FIK_C_SetFootLocking");
static_assert(sizeof(TDB_APP_FIK_C_SetFootLocking) == 0x000050, "Wrong size on TDB_APP_FIK_C_SetFootLocking");
static_assert(offsetof(TDB_APP_FIK_C_SetFootLocking, FootLockCurve) == 0x000000, "Member 'TDB_APP_FIK_C_SetFootLocking::FootLockCurve' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_SetFootLocking, IKFootBone) == 0x000008, "Member 'TDB_APP_FIK_C_SetFootLocking::IKFootBone' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_SetFootLocking, CurrentFootLockAlpha) == 0x000010, "Member 'TDB_APP_FIK_C_SetFootLocking::CurrentFootLockAlpha' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_SetFootLocking, CurrentFootLockLocation) == 0x000018, "Member 'TDB_APP_FIK_C_SetFootLocking::CurrentFootLockLocation' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_SetFootLocking, CurrentFootLockRotation) == 0x000030, "Member 'TDB_APP_FIK_C_SetFootLocking::CurrentFootLockRotation' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_SetFootLocking, FootLockCurveValue) == 0x000048, "Member 'TDB_APP_FIK_C_SetFootLocking::FootLockCurveValue' has a wrong offset!");

// Function TDB_APP_FIK.TDB_APP_FIK_C.SetFootLockOffsets
// 0x0160 (0x0160 - 0x0000)
struct TDB_APP_FIK_C_SetFootLockOffsets final
{
public:
	struct FVector                                LocalLocation;                                     // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               LocalRotation;                                     // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor)
	struct FRotator                               RotationDifference;                                // 0x0030(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                LocationDifference;                                // 0x0048(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_NormalizedDeltaRotator_ReturnValue;       // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetOwningComponent_ReturnValue;           // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_LessLess_VectorRotator_ReturnValue;       // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetLastUpdateRotation_ReturnValue;        // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_NormalizedDeltaRotator_ReturnValue_1;     // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMovingOnGround_ReturnValue;             // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TDB_APP_FIK_C_SetFootLockOffsets) == 0x000008, "Wrong alignment on TDB_APP_FIK_C_SetFootLockOffsets");
static_assert(sizeof(TDB_APP_FIK_C_SetFootLockOffsets) == 0x000160, "Wrong size on TDB_APP_FIK_C_SetFootLockOffsets");
static_assert(offsetof(TDB_APP_FIK_C_SetFootLockOffsets, LocalLocation) == 0x000000, "Member 'TDB_APP_FIK_C_SetFootLockOffsets::LocalLocation' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_SetFootLockOffsets, LocalRotation) == 0x000018, "Member 'TDB_APP_FIK_C_SetFootLockOffsets::LocalRotation' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_SetFootLockOffsets, RotationDifference) == 0x000030, "Member 'TDB_APP_FIK_C_SetFootLockOffsets::RotationDifference' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_SetFootLockOffsets, LocationDifference) == 0x000048, "Member 'TDB_APP_FIK_C_SetFootLockOffsets::LocationDifference' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_SetFootLockOffsets, CallFunc_NormalizedDeltaRotator_ReturnValue) == 0x000060, "Member 'TDB_APP_FIK_C_SetFootLockOffsets::CallFunc_NormalizedDeltaRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_SetFootLockOffsets, CallFunc_BreakRotator_Roll) == 0x000078, "Member 'TDB_APP_FIK_C_SetFootLockOffsets::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_SetFootLockOffsets, CallFunc_BreakRotator_Pitch) == 0x00007C, "Member 'TDB_APP_FIK_C_SetFootLockOffsets::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_SetFootLockOffsets, CallFunc_BreakRotator_Yaw) == 0x000080, "Member 'TDB_APP_FIK_C_SetFootLockOffsets::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_SetFootLockOffsets, CallFunc_GetOwningComponent_ReturnValue) == 0x000088, "Member 'TDB_APP_FIK_C_SetFootLockOffsets::CallFunc_GetOwningComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_SetFootLockOffsets, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000090, "Member 'TDB_APP_FIK_C_SetFootLockOffsets::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_SetFootLockOffsets, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x0000A8, "Member 'TDB_APP_FIK_C_SetFootLockOffsets::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(TDB_APP_FIK_C_SetFootLockOffsets, CallFunc_RotateAngleAxis_ReturnValue) == 0x0000C0, "Member 'TDB_APP_FIK_C_SetFootLockOffsets::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
