#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TimeoutQuest

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "QuestV2_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TimeoutQuest.TimeoutQuest_C
// 0x0018 (0x00A0 - 0x0088)
class UTimeoutQuest_C final : public UQuestV2_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0088(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        Duration;                                          // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SpentTime;                                         // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TimeoutQuest(int32 EntryPoint);
	void Initialize(const struct FQuestData& Data);
	void QuestActivated();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TimeoutQuest_C">();
	}
	static class UTimeoutQuest_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTimeoutQuest_C>();
	}
};
static_assert(alignof(UTimeoutQuest_C) == 0x000008, "Wrong alignment on UTimeoutQuest_C");
static_assert(sizeof(UTimeoutQuest_C) == 0x0000A0, "Wrong size on UTimeoutQuest_C");
static_assert(offsetof(UTimeoutQuest_C, UberGraphFrame) == 0x000088, "Member 'UTimeoutQuest_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTimeoutQuest_C, Duration) == 0x000090, "Member 'UTimeoutQuest_C::Duration' has a wrong offset!");
static_assert(offsetof(UTimeoutQuest_C, SpentTime) == 0x000098, "Member 'UTimeoutQuest_C::SpentTime' has a wrong offset!");

}

