#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TimeoutQuest

#include "Basic.hpp"

#include "QuestData_0_structs.hpp"
#include "CustomQuestData_structs.hpp"


namespace SDK::Params
{

// Function TimeoutQuest.TimeoutQuest_C.ExecuteUbergraph_TimeoutQuest
// 0x0088 (0x0088 - 0x0000)
struct TimeoutQuest_C_ExecuteUbergraph_TimeoutQuest final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuestData                             K2Node_Event_Data;                                 // 0x0008(0x0058)(HasGetValueTypeHash)
	struct FCustomQuestData                       CallFunc_Array_Get_Item;                           // 0x0060(0x0020)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TimeoutQuest_C_ExecuteUbergraph_TimeoutQuest) == 0x000008, "Wrong alignment on TimeoutQuest_C_ExecuteUbergraph_TimeoutQuest");
static_assert(sizeof(TimeoutQuest_C_ExecuteUbergraph_TimeoutQuest) == 0x000088, "Wrong size on TimeoutQuest_C_ExecuteUbergraph_TimeoutQuest");
static_assert(offsetof(TimeoutQuest_C_ExecuteUbergraph_TimeoutQuest, EntryPoint) == 0x000000, "Member 'TimeoutQuest_C_ExecuteUbergraph_TimeoutQuest::EntryPoint' has a wrong offset!");
static_assert(offsetof(TimeoutQuest_C_ExecuteUbergraph_TimeoutQuest, K2Node_Event_Data) == 0x000008, "Member 'TimeoutQuest_C_ExecuteUbergraph_TimeoutQuest::K2Node_Event_Data' has a wrong offset!");
static_assert(offsetof(TimeoutQuest_C_ExecuteUbergraph_TimeoutQuest, CallFunc_Array_Get_Item) == 0x000060, "Member 'TimeoutQuest_C_ExecuteUbergraph_TimeoutQuest::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TimeoutQuest_C_ExecuteUbergraph_TimeoutQuest, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000080, "Member 'TimeoutQuest_C_ExecuteUbergraph_TimeoutQuest::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");

// Function TimeoutQuest.TimeoutQuest_C.Initialize
// 0x0058 (0x0058 - 0x0000)
struct TimeoutQuest_C_Initialize final
{
public:
	struct FQuestData                             Data;                                              // 0x0000(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(TimeoutQuest_C_Initialize) == 0x000008, "Wrong alignment on TimeoutQuest_C_Initialize");
static_assert(sizeof(TimeoutQuest_C_Initialize) == 0x000058, "Wrong size on TimeoutQuest_C_Initialize");
static_assert(offsetof(TimeoutQuest_C_Initialize, Data) == 0x000000, "Member 'TimeoutQuest_C_Initialize::Data' has a wrong offset!");

}

