#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TimeoutTrigger

#include "Basic.hpp"


namespace SDK::Params
{

// Function TimeoutTrigger.TimeoutTrigger_C.ExecuteUbergraph_TimeoutTrigger
// 0x0020 (0x0020 - 0x0000)
struct TimeoutTrigger_C_ExecuteUbergraph_TimeoutTrigger final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TimeoutTrigger_C_ExecuteUbergraph_TimeoutTrigger) == 0x000008, "Wrong alignment on TimeoutTrigger_C_ExecuteUbergraph_TimeoutTrigger");
static_assert(sizeof(TimeoutTrigger_C_ExecuteUbergraph_TimeoutTrigger) == 0x000020, "Wrong size on TimeoutTrigger_C_ExecuteUbergraph_TimeoutTrigger");
static_assert(offsetof(TimeoutTrigger_C_ExecuteUbergraph_TimeoutTrigger, EntryPoint) == 0x000000, "Member 'TimeoutTrigger_C_ExecuteUbergraph_TimeoutTrigger::EntryPoint' has a wrong offset!");
static_assert(offsetof(TimeoutTrigger_C_ExecuteUbergraph_TimeoutTrigger, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'TimeoutTrigger_C_ExecuteUbergraph_TimeoutTrigger::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(TimeoutTrigger_C_ExecuteUbergraph_TimeoutTrigger, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000008, "Member 'TimeoutTrigger_C_ExecuteUbergraph_TimeoutTrigger::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(TimeoutTrigger_C_ExecuteUbergraph_TimeoutTrigger, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000010, "Member 'TimeoutTrigger_C_ExecuteUbergraph_TimeoutTrigger::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(TimeoutTrigger_C_ExecuteUbergraph_TimeoutTrigger, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000018, "Member 'TimeoutTrigger_C_ExecuteUbergraph_TimeoutTrigger::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function TimeoutTrigger.TimeoutTrigger_C.Initialize
// 0x0018 (0x0018 - 0x0000)
struct TimeoutTrigger_C_Initialize final
{
public:
	class FString                                 Param_QuestEvent;                                  // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	double                                        Param_Duration;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TimeoutTrigger_C_Initialize) == 0x000008, "Wrong alignment on TimeoutTrigger_C_Initialize");
static_assert(sizeof(TimeoutTrigger_C_Initialize) == 0x000018, "Wrong size on TimeoutTrigger_C_Initialize");
static_assert(offsetof(TimeoutTrigger_C_Initialize, Param_QuestEvent) == 0x000000, "Member 'TimeoutTrigger_C_Initialize::Param_QuestEvent' has a wrong offset!");
static_assert(offsetof(TimeoutTrigger_C_Initialize, Param_Duration) == 0x000010, "Member 'TimeoutTrigger_C_Initialize::Param_Duration' has a wrong offset!");

// Function TimeoutTrigger.TimeoutTrigger_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct TimeoutTrigger_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TimeoutTrigger_C_ReceiveTick) == 0x000004, "Wrong alignment on TimeoutTrigger_C_ReceiveTick");
static_assert(sizeof(TimeoutTrigger_C_ReceiveTick) == 0x000004, "Wrong size on TimeoutTrigger_C_ReceiveTick");
static_assert(offsetof(TimeoutTrigger_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'TimeoutTrigger_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

