#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TrackQuest

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "QuestFramework_structs.hpp"
#include "QuestFramework_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TrackQuest.TrackQuest_C
// 0x0018 (0x0050 - 0x0038)
class UTrackQuest_C final : public UQuestEvent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0038(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	EQuestVariableType                            Variable_Type;                                     // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Variable_Variable;                                 // 0x0044(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteEvent(class UQuestContext* Context, const struct FQuestEventPayload& Payload);
	void ExecuteUbergraph_TrackQuest(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TrackQuest_C">();
	}
	static class UTrackQuest_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTrackQuest_C>();
	}
};
static_assert(alignof(UTrackQuest_C) == 0x000008, "Wrong alignment on UTrackQuest_C");
static_assert(sizeof(UTrackQuest_C) == 0x000050, "Wrong size on UTrackQuest_C");
static_assert(offsetof(UTrackQuest_C, UberGraphFrame) == 0x000038, "Member 'UTrackQuest_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTrackQuest_C, Variable_Type) == 0x000040, "Member 'UTrackQuest_C::Variable_Type' has a wrong offset!");
static_assert(offsetof(UTrackQuest_C, Variable_Variable) == 0x000044, "Member 'UTrackQuest_C::Variable_Variable' has a wrong offset!");

}

