#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trader_Body_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Trader_Body_Skeleton_AnimBlueprint_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Trader_Body_Skeleton_AnimBlueprint.Trader_Body_Skeleton_AnimBlueprint_C
// 0x0700 (0x0A50 - 0x0350)
class UTrader_Body_Skeleton_AnimBlueprint_C final : public UAnimInstance
{
public:
	uint8                                         Pad_348[0x8];                                      // 0x0348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct Trader_Body_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x0358(0x0002)(HasGetValueTypeHash)
	uint8                                         Pad_35A[0x6];                                      // 0x035A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0360(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0368(0x0008)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x0370(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x03B8(0x0108)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x04C0(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x04E8(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0530(0x0108)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0638(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0660(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0688(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x06D0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x06F0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0738(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x0758(0x00C8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0820(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0848(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0890(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x08B0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x08F8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0918(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x09E0(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0A28(0x0020)()
	bool                                          bSurvInteracted;                                   // 0x0A48(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Trader_Body_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_0A46DD5E4ACB7ED79F8632B8BA42CC2B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Trader_Body_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_1469F1F4475FFE7F6D35C79E1B73F179();
	void ExecuteUbergraph_Trader_Body_Skeleton_AnimBlueprint(int32 EntryPoint);
	void OnInteracted();
	void StopInteracting();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Trader_Body_Skeleton_AnimBlueprint_C">();
	}
	static class UTrader_Body_Skeleton_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTrader_Body_Skeleton_AnimBlueprint_C>();
	}
};
static_assert(alignof(UTrader_Body_Skeleton_AnimBlueprint_C) == 0x000010, "Wrong alignment on UTrader_Body_Skeleton_AnimBlueprint_C");
static_assert(sizeof(UTrader_Body_Skeleton_AnimBlueprint_C) == 0x000A50, "Wrong size on UTrader_Body_Skeleton_AnimBlueprint_C");
static_assert(offsetof(UTrader_Body_Skeleton_AnimBlueprint_C, UberGraphFrame) == 0x000350, "Member 'UTrader_Body_Skeleton_AnimBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTrader_Body_Skeleton_AnimBlueprint_C, __AnimBlueprintMutables) == 0x000358, "Member 'UTrader_Body_Skeleton_AnimBlueprint_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UTrader_Body_Skeleton_AnimBlueprint_C, AnimBlueprintExtension_PropertyAccess) == 0x000360, "Member 'UTrader_Body_Skeleton_AnimBlueprint_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UTrader_Body_Skeleton_AnimBlueprint_C, AnimBlueprintExtension_Base) == 0x000368, "Member 'UTrader_Body_Skeleton_AnimBlueprint_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UTrader_Body_Skeleton_AnimBlueprint_C, AnimGraphNode_Slot_1) == 0x000370, "Member 'UTrader_Body_Skeleton_AnimBlueprint_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UTrader_Body_Skeleton_AnimBlueprint_C, AnimGraphNode_SaveCachedPose_1) == 0x0003B8, "Member 'UTrader_Body_Skeleton_AnimBlueprint_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UTrader_Body_Skeleton_AnimBlueprint_C, AnimGraphNode_UseCachedPose_1) == 0x0004C0, "Member 'UTrader_Body_Skeleton_AnimBlueprint_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UTrader_Body_Skeleton_AnimBlueprint_C, AnimGraphNode_Slot) == 0x0004E8, "Member 'UTrader_Body_Skeleton_AnimBlueprint_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UTrader_Body_Skeleton_AnimBlueprint_C, AnimGraphNode_SaveCachedPose) == 0x000530, "Member 'UTrader_Body_Skeleton_AnimBlueprint_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UTrader_Body_Skeleton_AnimBlueprint_C, AnimGraphNode_UseCachedPose) == 0x000638, "Member 'UTrader_Body_Skeleton_AnimBlueprint_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UTrader_Body_Skeleton_AnimBlueprint_C, AnimGraphNode_TransitionResult_1) == 0x000660, "Member 'UTrader_Body_Skeleton_AnimBlueprint_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UTrader_Body_Skeleton_AnimBlueprint_C, AnimGraphNode_SequencePlayer_3) == 0x000688, "Member 'UTrader_Body_Skeleton_AnimBlueprint_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UTrader_Body_Skeleton_AnimBlueprint_C, AnimGraphNode_StateResult_3) == 0x0006D0, "Member 'UTrader_Body_Skeleton_AnimBlueprint_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UTrader_Body_Skeleton_AnimBlueprint_C, AnimGraphNode_SequencePlayer_2) == 0x0006F0, "Member 'UTrader_Body_Skeleton_AnimBlueprint_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UTrader_Body_Skeleton_AnimBlueprint_C, AnimGraphNode_StateResult_2) == 0x000738, "Member 'UTrader_Body_Skeleton_AnimBlueprint_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UTrader_Body_Skeleton_AnimBlueprint_C, AnimGraphNode_StateMachine_1) == 0x000758, "Member 'UTrader_Body_Skeleton_AnimBlueprint_C::AnimGraphNode_StateMachine_1' has a wrong offset!");
static_assert(offsetof(UTrader_Body_Skeleton_AnimBlueprint_C, AnimGraphNode_TransitionResult) == 0x000820, "Member 'UTrader_Body_Skeleton_AnimBlueprint_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UTrader_Body_Skeleton_AnimBlueprint_C, AnimGraphNode_SequencePlayer_1) == 0x000848, "Member 'UTrader_Body_Skeleton_AnimBlueprint_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UTrader_Body_Skeleton_AnimBlueprint_C, AnimGraphNode_StateResult_1) == 0x000890, "Member 'UTrader_Body_Skeleton_AnimBlueprint_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UTrader_Body_Skeleton_AnimBlueprint_C, AnimGraphNode_SequencePlayer) == 0x0008B0, "Member 'UTrader_Body_Skeleton_AnimBlueprint_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UTrader_Body_Skeleton_AnimBlueprint_C, AnimGraphNode_StateResult) == 0x0008F8, "Member 'UTrader_Body_Skeleton_AnimBlueprint_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UTrader_Body_Skeleton_AnimBlueprint_C, AnimGraphNode_StateMachine) == 0x000918, "Member 'UTrader_Body_Skeleton_AnimBlueprint_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UTrader_Body_Skeleton_AnimBlueprint_C, AnimGraphNode_BlendListByBool) == 0x0009E0, "Member 'UTrader_Body_Skeleton_AnimBlueprint_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UTrader_Body_Skeleton_AnimBlueprint_C, AnimGraphNode_Root) == 0x000A28, "Member 'UTrader_Body_Skeleton_AnimBlueprint_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UTrader_Body_Skeleton_AnimBlueprint_C, bSurvInteracted) == 0x000A48, "Member 'UTrader_Body_Skeleton_AnimBlueprint_C::bSurvInteracted' has a wrong offset!");

}

