#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TrailerFunctions

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "BPE_Weapon_Type_structs.hpp"
#include "StatType_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass TrailerFunctions.TrailerFunctions_C
// 0x0080 (0x0310 - 0x0290)
class ATrailerFunctions_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UW_AimHit_C*                            AimHitWidget;                                      // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUIW_CrosshairTrailer_C*                CrosshairWidget;                                   // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ADirectionalLight*                      DirectLight;                                       // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotator1;                                          // 0x02B8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               Rotator2;                                          // 0x02D0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UWBP_Crosshair_C*                       CrossHair;                                         // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentAmmo;                                       // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxAmmo;                                           // 0x02F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMPMainContainerBox_C*                  TestLootPOint;                                     // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class ACutscenePersAnim_C*                    MainCutscenePers;                                  // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	bool                                          CurrentAim;                                        // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBPE_Weapon_Type                              LastWeapon_Type;                                   // 0x0309(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddItems3_1();
	void ADdItems_3_2();
	void ADdItems_3_3();
	void CallCraftWindow();
	void ChangeHelmet();
	void ChangeJacket();
	void ChangePants();
	void ExecuteUbergraph_TrailerFunctions(int32 EntryPoint);
	void FireAlarm();
	void GetAllItemFromLoot(class AMPMainContainerBox_C* CurrentFocusedContainer);
	void HideAlarmUI();
	void HideCrosshairDot(bool Hide);
	void HitTrigger();
	void InitTrailerUI();
	void KillTrigger();
	void MakeHUDHidden(bool IsHidden);
	void OnBlendOut_29E92DBE47219323DBEDC6AFD2817FE2(class FName NotifyName);
	void OnCompleted_29E92DBE47219323DBEDC6AFD2817FE2(class FName NotifyName);
	void OnInterrupted_29E92DBE47219323DBEDC6AFD2817FE2(class FName NotifyName);
	void OnNotifyBegin_29E92DBE47219323DBEDC6AFD2817FE2(class FName NotifyName);
	void OnNotifyEnd_29E92DBE47219323DBEDC6AFD2817FE2(class FName NotifyName);
	void OpenInventory();
	void OpenLootPoint(class AMPMainContainerBox_C* CurrentFocusedContainer, bool Open);
	void OpenLootPoint_V2(const class FText& LPName, bool Open, class AMPMainContainerBox_C** LP);
	void PlayerDamage(double Damage);
	void ReceiveBeginPlay();
	void RemoveCrosshairDot();
	void SetAimOff();
	void SetAimOn(EBPE_Weapon_Type WeaponType);
	void SetAmmo(int32 AK, int32 Glock);
	void SetDamage();
	void SetFuelLevel(double Fuel);
	void SetHUDVisibility(bool IsVisible);
	void SetReloading(double Duration);
	void SetStaminaUse(bool StaminaUse);
	void SetStat(const EStatType Key, const double Value);
	void SetWarming(bool IsWarming);
	void SetWeaponAmmoCount(int32 Param_CurrentAmmo, int32 Param_MaxAmmo);
	void SetWeaponType();
	void ShootEvent();
	void Show(bool Param_Show);
	void ShowAlarmUI();
	void ShowCarRepair(bool Condition);
	void ShowF(bool Condition);
	void ShowHoldF(bool HoldF);
	void ShowHoldFWithTime(bool HoldF, double HoldTime);
	void ShowWeaponWidget(bool NewVisible);
	void ShowWorkbenchUI();
	void Tf();
	void TrailManagerAttach();
	void UltraSkySetAnimate(bool Animate_Time_of_Day);
	void UltraSkySetTimeOfDay(double Time_of_Day);
	void UpdateCarRepair();
	void UpdateHoldF();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TrailerFunctions_C">();
	}
	static class ATrailerFunctions_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATrailerFunctions_C>();
	}
};
static_assert(alignof(ATrailerFunctions_C) == 0x000008, "Wrong alignment on ATrailerFunctions_C");
static_assert(sizeof(ATrailerFunctions_C) == 0x000310, "Wrong size on ATrailerFunctions_C");
static_assert(offsetof(ATrailerFunctions_C, UberGraphFrame) == 0x000290, "Member 'ATrailerFunctions_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATrailerFunctions_C, DefaultSceneRoot) == 0x000298, "Member 'ATrailerFunctions_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ATrailerFunctions_C, AimHitWidget) == 0x0002A0, "Member 'ATrailerFunctions_C::AimHitWidget' has a wrong offset!");
static_assert(offsetof(ATrailerFunctions_C, CrosshairWidget) == 0x0002A8, "Member 'ATrailerFunctions_C::CrosshairWidget' has a wrong offset!");
static_assert(offsetof(ATrailerFunctions_C, DirectLight) == 0x0002B0, "Member 'ATrailerFunctions_C::DirectLight' has a wrong offset!");
static_assert(offsetof(ATrailerFunctions_C, Rotator1) == 0x0002B8, "Member 'ATrailerFunctions_C::Rotator1' has a wrong offset!");
static_assert(offsetof(ATrailerFunctions_C, Rotator2) == 0x0002D0, "Member 'ATrailerFunctions_C::Rotator2' has a wrong offset!");
static_assert(offsetof(ATrailerFunctions_C, CrossHair) == 0x0002E8, "Member 'ATrailerFunctions_C::CrossHair' has a wrong offset!");
static_assert(offsetof(ATrailerFunctions_C, CurrentAmmo) == 0x0002F0, "Member 'ATrailerFunctions_C::CurrentAmmo' has a wrong offset!");
static_assert(offsetof(ATrailerFunctions_C, MaxAmmo) == 0x0002F4, "Member 'ATrailerFunctions_C::MaxAmmo' has a wrong offset!");
static_assert(offsetof(ATrailerFunctions_C, TestLootPOint) == 0x0002F8, "Member 'ATrailerFunctions_C::TestLootPOint' has a wrong offset!");
static_assert(offsetof(ATrailerFunctions_C, MainCutscenePers) == 0x000300, "Member 'ATrailerFunctions_C::MainCutscenePers' has a wrong offset!");
static_assert(offsetof(ATrailerFunctions_C, CurrentAim) == 0x000308, "Member 'ATrailerFunctions_C::CurrentAim' has a wrong offset!");
static_assert(offsetof(ATrailerFunctions_C, LastWeapon_Type) == 0x000309, "Member 'ATrailerFunctions_C::LastWeapon_Type' has a wrong offset!");

}

