#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TrailerFunctions

#include "Basic.hpp"

#include "FItemInfo_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "StatType_structs.hpp"
#include "ContainerPickupsInfo_structs.hpp"
#include "BPE_Weapon_Type_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function TrailerFunctions.TrailerFunctions_C.ChangeHelmet
// 0x0018 (0x0018 - 0x0000)
struct TrailerFunctions_C_ChangeHelmet final
{
public:
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TrailerFunctions_C_ChangeHelmet) == 0x000008, "Wrong alignment on TrailerFunctions_C_ChangeHelmet");
static_assert(sizeof(TrailerFunctions_C_ChangeHelmet) == 0x000018, "Wrong size on TrailerFunctions_C_ChangeHelmet");
static_assert(offsetof(TrailerFunctions_C_ChangeHelmet, CallFunc_GetPlayerPawn_ReturnValue) == 0x000000, "Member 'TrailerFunctions_C_ChangeHelmet::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ChangeHelmet, K2Node_DynamicCast_AsSurvival_Player) == 0x000008, "Member 'TrailerFunctions_C_ChangeHelmet::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ChangeHelmet, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'TrailerFunctions_C_ChangeHelmet::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function TrailerFunctions.TrailerFunctions_C.ChangeJacket
// 0x0018 (0x0018 - 0x0000)
struct TrailerFunctions_C_ChangeJacket final
{
public:
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TrailerFunctions_C_ChangeJacket) == 0x000008, "Wrong alignment on TrailerFunctions_C_ChangeJacket");
static_assert(sizeof(TrailerFunctions_C_ChangeJacket) == 0x000018, "Wrong size on TrailerFunctions_C_ChangeJacket");
static_assert(offsetof(TrailerFunctions_C_ChangeJacket, CallFunc_GetPlayerPawn_ReturnValue) == 0x000000, "Member 'TrailerFunctions_C_ChangeJacket::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ChangeJacket, K2Node_DynamicCast_AsSurvival_Player) == 0x000008, "Member 'TrailerFunctions_C_ChangeJacket::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ChangeJacket, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'TrailerFunctions_C_ChangeJacket::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function TrailerFunctions.TrailerFunctions_C.ChangePants
// 0x0018 (0x0018 - 0x0000)
struct TrailerFunctions_C_ChangePants final
{
public:
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TrailerFunctions_C_ChangePants) == 0x000008, "Wrong alignment on TrailerFunctions_C_ChangePants");
static_assert(sizeof(TrailerFunctions_C_ChangePants) == 0x000018, "Wrong size on TrailerFunctions_C_ChangePants");
static_assert(offsetof(TrailerFunctions_C_ChangePants, CallFunc_GetPlayerPawn_ReturnValue) == 0x000000, "Member 'TrailerFunctions_C_ChangePants::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ChangePants, K2Node_DynamicCast_AsSurvival_Player) == 0x000008, "Member 'TrailerFunctions_C_ChangePants::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ChangePants, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'TrailerFunctions_C_ChangePants::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function TrailerFunctions.TrailerFunctions_C.ExecuteUbergraph_TrailerFunctions
// 0x0978 (0x0978 - 0x0000)
struct TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x003C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x006C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x007C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0086(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0087(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Workbench_C*                       CallFunc_Create_ReturnValue;                       // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Damage;                         // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_GameHUD_C*                          K2Node_DynamicCast_AsBP_Game_HUD;                  // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetStat_Value;                            // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AMainBanditAI_C*>                CallFunc_GetAllActorsOfClass_OutActors;            // 0x00F0(0x0010)(ReferenceParm)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SetStat_ReturnValue;                      // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Condition_1;                    // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue_1;                     // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_GameHUD_C*                          K2Node_DynamicCast_AsBP_Game_HUD_1;                // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUD*                                   CallFunc_GetHUD_ReturnValue_2;                     // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_GameHUD_C*                          K2Node_DynamicCast_AsBP_Game_HUD_2;                // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_HoldF_1;                        // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15A[0x6];                                      // 0x015A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue_3;                     // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_GameHUD_C*                          K2Node_DynamicCast_AsBP_Game_HUD_3;                // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMPMainContainerBox_C*                  K2Node_CustomEvent_CurrentFocusedContainer;        // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player_1;            // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJSI_Slot_C*                            CallFunc_Array_Get_Item;                           // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AD[0x3];                                      // 0x01AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC;                  // 0x01C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC_1;                // 0x01D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetCraftWindowOpened_Success;             // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetCraftWindowOpened_Success_1;           // 0x01EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EB[0x5];                                      // 0x01EB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC_2;                // 0x01F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC_3;                // 0x0208(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCraftWindowOpened_Opened;              // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21A[0x6];                                      // 0x021A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_CraftWindow_C*                      CallFunc_GetCraftWidget_NewCraftWidget;            // 0x0220(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Show;                           // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_5;        // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Hide;                           // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUD*                                   CallFunc_GetHUD_ReturnValue_4;                     // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameHUD_C>        K2Node_DynamicCast_AsBPI_Game_HUD;                 // 0x0248(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_GameHUD_C>        K2Node_DynamicCast_AsBPI_Game_HUD_1;               // 0x0260(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_GameHUD_C*                          K2Node_DynamicCast_AsBP_Game_HUD_4;                // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Condition;                      // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_282[0x6];                                      // 0x0282(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_6;        // 0x0288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue_5;                     // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_7;        // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_GameHUD_C*                          K2Node_DynamicCast_AsBP_Game_HUD_5;                // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_13;                    // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUD*                                   CallFunc_GetHUD_ReturnValue_6;                     // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_GameHUD_C*                          K2Node_DynamicCast_AsBP_Game_HUD_6;                // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_14;                    // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_HoldF;                          // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C2[0x6];                                      // 0x02C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_HoldTime;                       // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_TrailsManager_C*>            CallFunc_GetAllActorsOfClass_OutActors_1;          // 0x02D0(0x0010)(ReferenceParm)
	class ABP_TrailsManager_C*                    CallFunc_Array_Get_Item_1;                         // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_8;        // 0x02E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToActor_ReturnValue;             // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC_4;                // 0x02F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_15;                    // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_309[0x3];                                      // 0x0309(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_PlayerMain_C*                      CallFunc_GetPlayerGUI_GUI;                         // 0x0310(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AMainBanditAI_C*                        CallFunc_Array_Get_Item_2;                         // 0x0318(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Fuel;                           // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ACutsceneCar_SD45_C*>            CallFunc_GetAllActorsOfClass_OutActors_2;          // 0x0328(0x0010)(ReferenceParm)
	class ACutsceneCar_SD45_C*                    CallFunc_Array_Get_Item_3;                         // 0x0338(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_1;              // 0x0340(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player_2;            // 0x0348(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_16;                    // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_9;        // 0x0358(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemByName_ReturnedCount;              // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_AimHit_C*                            CallFunc_Create_ReturnValue_1;                     // 0x0368(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemByName_ReturnedCount_1;            // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemByName_ReturnedCount_2;            // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemByName_ReturnedCount_3;            // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37C[0x4];                                      // 0x037C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FContainerPickupsInfo>          K2Node_MakeArray_Array;                            // 0x0380(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class ABP_HouseAlarm_C*>               CallFunc_GetAllActorsOfClass_OutActors_3;          // 0x0390(0x0010)(ReferenceParm)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A1[0x7];                                      // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_HouseAlarm_C*                       CallFunc_Array_Get_Item_4;                         // 0x03A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B1[0x3];                                      // 0x03B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x03B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B9[0x3];                                      // 0x03B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x03BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_AK;                             // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Glock;                          // 0x03C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_2;              // 0x03C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player_3;            // 0x03D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_17;                    // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D9[0x3];                                      // 0x03D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetItemCountByName_ReturnedCount;         // 0x03DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E4[0x4];                                      // 0x03E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x03E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemByName_ReturnedCount_4;            // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x03F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F5[0x3];                                      // 0x03F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetItemCountByName_ReturnedCount_1;       // 0x03F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x03FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0400(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemByName_ReturnedCount_5;            // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40C[0x4];                                      // 0x040C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraShakeBase*                       CallFunc_StartCameraShake_ReturnValue;             // 0x0410(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           K2Node_MakeArray_Array_1;                          // 0x0418(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item_5;                         // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_434[0x4];                                      // 0x0434(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             CallFunc_GetDataTableRowFromName_OutRow;           // 0x0438(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0658(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0659(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_JSAddItem_Ad;                             // 0x065A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65B[0x5];                                      // 0x065B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_MakeArray_Array_2;                          // 0x0660(0x0010)(ReferenceParm)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0670(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_671[0x3];                                      // 0x0671(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0674(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FContainerPickupsInfo>          K2Node_MakeArray_Array_3;                          // 0x0678(0x0010)(ReferenceParm, ContainsInstancedReference)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0688(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_689[0x7];                                      // 0x0689(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_3;              // 0x0690(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player_4;            // 0x0698(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_18;                    // 0x06A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A1[0x3];                                      // 0x06A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetItemByName_ReturnedCount_6;            // 0x06A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_10;       // 0x06A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsVisible;                      // 0x06B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B1[0x7];                                      // 0x06B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC_5;                // 0x06B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_19;                    // 0x06C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C9[0x7];                                      // 0x06C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_PlayerMain_C*                      CallFunc_GetPlayerGUI_GUI_1;                       // 0x06D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x06D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D9[0x7];                                      // 0x06D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_Duration;                       // 0x06E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x06E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_6;                         // 0x06EC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F4[0x4];                                      // 0x06F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x06F8(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0918(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0919(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_JSAddItem_Ad_1;                           // 0x091A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91B[0x1];                                      // 0x091B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x091C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_isHidden;                       // 0x0920(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_921[0x7];                                      // 0x0921(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_11;       // 0x0928(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC_6;                // 0x0930(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_20;                    // 0x0940(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0941(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_942[0x6];                                      // 0x0942(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUD*                                   CallFunc_GetHUD_ReturnValue_7;                     // 0x0948(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0950(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_GameHUD_C*                          K2Node_DynamicCast_AsBP_Game_HUD_7;                // 0x0958(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_21;                    // 0x0960(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0961(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_962[0x6];                                      // 0x0962(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_12;       // 0x0968(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x0970(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x0974(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions) == 0x000008, "Wrong alignment on TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions");
static_assert(sizeof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions) == 0x000978, "Wrong size on TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, EntryPoint) == 0x000000, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::EntryPoint' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, K2Node_CustomEvent_NotifyName_4) == 0x000004, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, K2Node_CustomEvent_NotifyName_3) == 0x00001C, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, K2Node_CreateDelegate_OutputDelegate_1) == 0x000024, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, K2Node_CustomEvent_NotifyName_2) == 0x000034, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, K2Node_CreateDelegate_OutputDelegate_2) == 0x00003C, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, K2Node_CustomEvent_NotifyName_1) == 0x00004C, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, K2Node_CreateDelegate_OutputDelegate_3) == 0x000054, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, K2Node_CustomEvent_NotifyName) == 0x000064, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, K2Node_CreateDelegate_OutputDelegate_4) == 0x00006C, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, Temp_name_Variable) == 0x00007C, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, Temp_bool_Variable) == 0x000084, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, Temp_byte_Variable) == 0x000085, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, Temp_byte_Variable_1) == 0x000086, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, Temp_bool_Variable_1) == 0x000087, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, Temp_byte_Variable_2) == 0x000088, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, Temp_byte_Variable_3) == 0x000089, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, CallFunc_Create_ReturnValue) == 0x000090, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, Temp_int_Variable) == 0x000098, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, CallFunc_Add_IntInt_ReturnValue) == 0x00009C, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, Temp_bool_Variable_2) == 0x0000A0, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, CallFunc_GetPlayerController_ReturnValue) == 0x0000A8, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, K2Node_CustomEvent_Damage) == 0x0000B0, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, CallFunc_GetHUD_ReturnValue) == 0x0000B8, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, CallFunc_GetPlayerCharacter_ReturnValue) == 0x0000C0, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, K2Node_DynamicCast_AsBP_Game_HUD) == 0x0000C8, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::K2Node_DynamicCast_AsBP_Game_HUD' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, K2Node_DynamicCast_bSuccess) == 0x0000D0, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, K2Node_DynamicCast_AsSurvival_Player) == 0x0000D8, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, K2Node_DynamicCast_bSuccess_1) == 0x0000E0, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, CallFunc_GetStat_Value) == 0x0000E8, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::CallFunc_GetStat_Value' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, CallFunc_GetAllActorsOfClass_OutActors) == 0x0000F0, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000100, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, CallFunc_Array_Length_ReturnValue) == 0x000108, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, CallFunc_SetStat_ReturnValue) == 0x000110, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::CallFunc_SetStat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, K2Node_CustomEvent_Condition_1) == 0x000118, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::K2Node_CustomEvent_Condition_1' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, CallFunc_GetPlayerController_ReturnValue_1) == 0x000120, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, CallFunc_GetHUD_ReturnValue_1) == 0x000128, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::CallFunc_GetHUD_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, CallFunc_GetPlayerController_ReturnValue_2) == 0x000130, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, K2Node_DynamicCast_AsBP_Game_HUD_1) == 0x000138, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::K2Node_DynamicCast_AsBP_Game_HUD_1' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, K2Node_DynamicCast_bSuccess_2) == 0x000140, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, CallFunc_GetHUD_ReturnValue_2) == 0x000148, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::CallFunc_GetHUD_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, K2Node_DynamicCast_AsBP_Game_HUD_2) == 0x000150, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::K2Node_DynamicCast_AsBP_Game_HUD_2' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, K2Node_DynamicCast_bSuccess_3) == 0x000158, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, K2Node_CustomEvent_HoldF_1) == 0x000159, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::K2Node_CustomEvent_HoldF_1' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, CallFunc_GetPlayerController_ReturnValue_3) == 0x000160, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, CallFunc_GetHUD_ReturnValue_3) == 0x000168, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::CallFunc_GetHUD_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, K2Node_DynamicCast_AsBP_Game_HUD_3) == 0x000170, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::K2Node_DynamicCast_AsBP_Game_HUD_3' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, K2Node_DynamicCast_bSuccess_4) == 0x000178, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, K2Node_CustomEvent_CurrentFocusedContainer) == 0x000180, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::K2Node_CustomEvent_CurrentFocusedContainer' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, CallFunc_GetPlayerPawn_ReturnValue) == 0x000188, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, K2Node_DynamicCast_AsSurvival_Player_1) == 0x000190, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::K2Node_DynamicCast_AsSurvival_Player_1' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, K2Node_DynamicCast_bSuccess_5) == 0x000198, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, CallFunc_Array_Get_Item) == 0x0001A0, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, CallFunc_Array_Length_ReturnValue_1) == 0x0001A8, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, CallFunc_Greater_IntInt_ReturnValue) == 0x0001AC, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, CallFunc_RandomFloatInRange_ReturnValue) == 0x0001B0, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, CallFunc_GetPlayerController_ReturnValue_4) == 0x0001B8, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::CallFunc_GetPlayerController_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, K2Node_DynamicCast_AsBPI_Surv_PC) == 0x0001C0, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::K2Node_DynamicCast_AsBPI_Surv_PC' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, K2Node_DynamicCast_bSuccess_6) == 0x0001D0, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, K2Node_DynamicCast_AsBPI_Surv_PC_1) == 0x0001D8, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::K2Node_DynamicCast_AsBPI_Surv_PC_1' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, K2Node_DynamicCast_bSuccess_7) == 0x0001E8, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions, CallFunc_SetCraftWindowOpened_Success) == 0x0001E9, "Member 'TrailerFunctions_C_ExecuteUbergraph_TrailerFunctions::CallFunc_SetCraftWindowOpened_Success' has a wrong offset!");
