#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_CraftWindow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_CraftWindow.UI_CraftWindow_C
// 0x01D0 (0x0450 - 0x0280)
class UUI_CraftWindow_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowAnim_2;                                        // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ChangeContent_Anim;                                // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowAnim;                                          // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBackgroundBlur*                        BackgroundBlur_Craft;                              // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_NewWindow;                             // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Cost;                                // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_NeededItemsList;                     // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_56;                                          // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_CraftBG;                                     // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_IconsBG;                                     // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Light;                                       // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichTextBlock_MatNeededInfo;                       // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Description;                                  // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Name;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_PageName;                                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ItemDescription;                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ItemName;                                // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ItemType;                                // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Categories;                            // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CraftItem_C*                         W_CraftItem;                                       // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CraftItem_C*                         W_CraftItem_1;                                     // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CraftItem_C*                         W_CraftItem_2;                                     // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CraftItem_C*                         W_CraftItem_3;                                     // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CraftItem_C*                         W_CraftItem_4;                                     // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CraftItem_C*                         W_CraftItem_5;                                     // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CraftItem_C*                         W_CraftItem_6;                                     // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CraftItem_C*                         W_CraftItem_7;                                     // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_HintButtonCircular_C*                W_HintButtonCircular;                              // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_HintButtonNew_C*                     W_HintButtonNew_Close;                             // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_HintButtonNew_C*                     W_HintButtonNew_Close_1;                           // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_HintButtonNew_C*                     W_HintButtonNew_Craft;                             // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_InventoryCapacity_C*                 W_InventoryCapacity;                               // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CraftErrorMessage_C*               WBP_CraftErrorMessage;                             // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ResourceCounter_C*                 WBP_ResourceCounter_Chemical;                      // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ResourceCounter_C*                 WBP_ResourceCounter_Metal;                         // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ResourceCounter_C*                 WBP_ResourceCounter_Rag;                           // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Opened;                                            // 0x03A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             CraftWindowOpened;                                 // 0x03B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             CraftWindowClosed;                                 // 0x03C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             CraftProcessStarted;                               // 0x03D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             CraftProcessEnded;                                 // 0x03E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class UW_CraftItem_C*>                 CraftItemWidgets;                                  // 0x03F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UW_CraftItem_C*                         SelectedCraftItem;                                 // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<bool>                                  CanCraft;                                          // 0x0408(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UW_CraftIngredient_C*>           CraftIngredientWidgets;                            // 0x0418(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          IsEnded;                                           // 0x0428(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_429[0x7];                                      // 0x0429(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_CraftCategory_C*>           Categories;                                        // 0x0430(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UWBP_CraftCategory_C*                   CurrentSelection;                                  // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Inited;                                            // 0x0448(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsMessageVisible_1;                                // 0x0449(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsMessageVisible_2;                                // 0x044A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__W_HintButtonCircular_K2Node_ComponentBoundEvent_1_OnFilled__DelegateSignature();
	void BndEvt__W_HintButtonCircular_K2Node_ComponentBoundEvent_5_OnPressed__DelegateSignature();
	void BndEvt__W_HintButtonCircular_K2Node_ComponentBoundEvent_6_OnReleased__DelegateSignature();
	void BndEvt__W_HintButtonNew_Close_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();
	void CantCraft(TArray<bool>& HasCountOfItems);
	void Close();
	void CloseWindow();
	void CraftEnd();
	void CraftItem(class FName ItemName);
	void CraftItemClicked(class UW_CraftItem_C* Widget);
	void CraftProcessEnded__DelegateSignature();
	void CraftProcessStarted__DelegateSignature();
	void CraftStart();
	void CraftWindowClosed__DelegateSignature();
	void CraftWindowOpened__DelegateSignature();
	void CreateCategoryEntry(class FName CategoryName);
	void ExecuteUbergraph_UI_CraftWindow(int32 EntryPoint);
	struct FLinearColor Get_W_HintButtonNew_Craft_ColorAndOpacity_0();
	void InitCategories();
	void MakeHUDHidden(bool IsHidden);
	void OnCraftFinished(class UWBP_CraftItem_C* Item);
	void OnInitialized();
	void OnNotEnoughResources(class UWBP_CraftItem_C* Item);
	void OnNotEnoughSpace(class UWBP_CraftItem_C* Item);
	void OnSelectedCategory(class UWBP_CraftCategory_C* Category);
	void OnSelectedCategoryItem(class UWBP_CraftCategory_C* Category, class UWBP_CraftItem_C* Item);
	void Open();
	void OpenWindow();
	void PreConstruct(bool IsDesignTime);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UpdateIngredients(const TArray<struct FS_NeedItems>& Ingredients, const TArray<bool>& AvailableResources);
	void UpdateItemsCount();
	void UpdateSelectedItem();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_CraftWindow_C">();
	}
	static class UUI_CraftWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_CraftWindow_C>();
	}
};
static_assert(alignof(UUI_CraftWindow_C) == 0x000008, "Wrong alignment on UUI_CraftWindow_C");
static_assert(sizeof(UUI_CraftWindow_C) == 0x000450, "Wrong size on UUI_CraftWindow_C");
static_assert(offsetof(UUI_CraftWindow_C, UberGraphFrame) == 0x000280, "Member 'UUI_CraftWindow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_CraftWindow_C, ShowAnim_2) == 0x000288, "Member 'UUI_CraftWindow_C::ShowAnim_2' has a wrong offset!");
static_assert(offsetof(UUI_CraftWindow_C, ChangeContent_Anim) == 0x000290, "Member 'UUI_CraftWindow_C::ChangeContent_Anim' has a wrong offset!");
static_assert(offsetof(UUI_CraftWindow_C, ShowAnim) == 0x000298, "Member 'UUI_CraftWindow_C::ShowAnim' has a wrong offset!");
static_assert(offsetof(UUI_CraftWindow_C, BackgroundBlur_Craft) == 0x0002A0, "Member 'UUI_CraftWindow_C::BackgroundBlur_Craft' has a wrong offset!");
static_assert(offsetof(UUI_CraftWindow_C, CanvasPanel_NewWindow) == 0x0002A8, "Member 'UUI_CraftWindow_C::CanvasPanel_NewWindow' has a wrong offset!");
static_assert(offsetof(UUI_CraftWindow_C, HorizontalBox_Cost) == 0x0002B0, "Member 'UUI_CraftWindow_C::HorizontalBox_Cost' has a wrong offset!");
static_assert(offsetof(UUI_CraftWindow_C, HorizontalBox_NeededItemsList) == 0x0002B8, "Member 'UUI_CraftWindow_C::HorizontalBox_NeededItemsList' has a wrong offset!");
static_assert(offsetof(UUI_CraftWindow_C, Image_56) == 0x0002C0, "Member 'UUI_CraftWindow_C::Image_56' has a wrong offset!");
static_assert(offsetof(UUI_CraftWindow_C, Image_CraftBG) == 0x0002C8, "Member 'UUI_CraftWindow_C::Image_CraftBG' has a wrong offset!");
static_assert(offsetof(UUI_CraftWindow_C, Image_IconsBG) == 0x0002D0, "Member 'UUI_CraftWindow_C::Image_IconsBG' has a wrong offset!");
static_assert(offsetof(UUI_CraftWindow_C, Image_Light) == 0x0002D8, "Member 'UUI_CraftWindow_C::Image_Light' has a wrong offset!");
static_assert(offsetof(UUI_CraftWindow_C, RichTextBlock_MatNeededInfo) == 0x0002E0, "Member 'UUI_CraftWindow_C::RichTextBlock_MatNeededInfo' has a wrong offset!");
static_assert(offsetof(UUI_CraftWindow_C, Text_Description) == 0x0002E8, "Member 'UUI_CraftWindow_C::Text_Description' has a wrong offset!");
static_assert(offsetof(UUI_CraftWindow_C, Text_Name) == 0x0002F0, "Member 'UUI_CraftWindow_C::Text_Name' has a wrong offset!");
static_assert(offsetof(UUI_CraftWindow_C, Text_PageName) == 0x0002F8, "Member 'UUI_CraftWindow_C::Text_PageName' has a wrong offset!");
static_assert(offsetof(UUI_CraftWindow_C, TextBlock_ItemDescription) == 0x000300, "Member 'UUI_CraftWindow_C::TextBlock_ItemDescription' has a wrong offset!");
static_assert(offsetof(UUI_CraftWindow_C, TextBlock_ItemName) == 0x000308, "Member 'UUI_CraftWindow_C::TextBlock_ItemName' has a wrong offset!");
static_assert(offsetof(UUI_CraftWindow_C, TextBlock_ItemType) == 0x000310, "Member 'UUI_CraftWindow_C::TextBlock_ItemType' has a wrong offset!");
static_assert(offsetof(UUI_CraftWindow_C, VerticalBox_Categories) == 0x000318, "Member 'UUI_CraftWindow_C::VerticalBox_Categories' has a wrong offset!");
static_assert(offsetof(UUI_CraftWindow_C, W_CraftItem) == 0x000320, "Member 'UUI_CraftWindow_C::W_CraftItem' has a wrong offset!");
static_assert(offsetof(UUI_CraftWindow_C, W_CraftItem_1) == 0x000328, "Member 'UUI_CraftWindow_C::W_CraftItem_1' has a wrong offset!");
static_assert(offsetof(UUI_CraftWindow_C, W_CraftItem_2) == 0x000330, "Member 'UUI_CraftWindow_C::W_CraftItem_2' has a wrong offset!");
static_assert(offsetof(UUI_CraftWindow_C, W_CraftItem_3) == 0x000338, "Member 'UUI_CraftWindow_C::W_CraftItem_3' has a wrong offset!");
static_assert(offsetof(UUI_CraftWindow_C, W_CraftItem_4) == 0x000340, "Member 'UUI_CraftWindow_C::W_CraftItem_4' has a wrong offset!");
static_assert(offsetof(UUI_CraftWindow_C, W_CraftItem_5) == 0x000348, "Member 'UUI_CraftWindow_C::W_CraftItem_5' has a wrong offset!");
static_assert(offsetof(UUI_CraftWindow_C, W_CraftItem_6) == 0x000350, "Member 'UUI_CraftWindow_C::W_CraftItem_6' has a wrong offset!");
static_assert(offsetof(UUI_CraftWindow_C, W_CraftItem_7) == 0x000358, "Member 'UUI_CraftWindow_C::W_CraftItem_7' has a wrong offset!");
static_assert(offsetof(UUI_CraftWindow_C, W_HintButtonCircular) == 0x000360, "Member 'UUI_CraftWindow_C::W_HintButtonCircular' has a wrong offset!");
static_assert(offsetof(UUI_CraftWindow_C, W_HintButtonNew_Close) == 0x000368, "Member 'UUI_CraftWindow_C::W_HintButtonNew_Close' has a wrong offset!");
static_assert(offsetof(UUI_CraftWindow_C, W_HintButtonNew_Close_1) == 0x000370, "Member 'UUI_CraftWindow_C::W_HintButtonNew_Close_1' has a wrong offset!");
static_assert(offsetof(UUI_CraftWindow_C, W_HintButtonNew_Craft) == 0x000378, "Member 'UUI_CraftWindow_C::W_HintButtonNew_Craft' has a wrong offset!");
static_assert(offsetof(UUI_CraftWindow_C, W_InventoryCapacity) == 0x000380, "Member 'UUI_CraftWindow_C::W_InventoryCapacity' has a wrong offset!");
static_assert(offsetof(UUI_CraftWindow_C, WBP_CraftErrorMessage) == 0x000388, "Member 'UUI_CraftWindow_C::WBP_CraftErrorMessage' has a wrong offset!");
static_assert(offsetof(UUI_CraftWindow_C, WBP_ResourceCounter_Chemical) == 0x000390, "Member 'UUI_CraftWindow_C::WBP_ResourceCounter_Chemical' has a wrong offset!");
static_assert(offsetof(UUI_CraftWindow_C, WBP_ResourceCounter_Metal) == 0x000398, "Member 'UUI_CraftWindow_C::WBP_ResourceCounter_Metal' has a wrong offset!");
static_assert(offsetof(UUI_CraftWindow_C, WBP_ResourceCounter_Rag) == 0x0003A0, "Member 'UUI_CraftWindow_C::WBP_ResourceCounter_Rag' has a wrong offset!");
static_assert(offsetof(UUI_CraftWindow_C, Opened) == 0x0003A8, "Member 'UUI_CraftWindow_C::Opened' has a wrong offset!");
static_assert(offsetof(UUI_CraftWindow_C, CraftWindowOpened) == 0x0003B0, "Member 'UUI_CraftWindow_C::CraftWindowOpened' has a wrong offset!");
static_assert(offsetof(UUI_CraftWindow_C, CraftWindowClosed) == 0x0003C0, "Member 'UUI_CraftWindow_C::CraftWindowClosed' has a wrong offset!");
static_assert(offsetof(UUI_CraftWindow_C, CraftProcessStarted) == 0x0003D0, "Member 'UUI_CraftWindow_C::CraftProcessStarted' has a wrong offset!");
static_assert(offsetof(UUI_CraftWindow_C, CraftProcessEnded) == 0x0003E0, "Member 'UUI_CraftWindow_C::CraftProcessEnded' has a wrong offset!");
static_assert(offsetof(UUI_CraftWindow_C, CraftItemWidgets) == 0x0003F0, "Member 'UUI_CraftWindow_C::CraftItemWidgets' has a wrong offset!");
static_assert(offsetof(UUI_CraftWindow_C, SelectedCraftItem) == 0x000400, "Member 'UUI_CraftWindow_C::SelectedCraftItem' has a wrong offset!");
static_assert(offsetof(UUI_CraftWindow_C, CanCraft) == 0x000408, "Member 'UUI_CraftWindow_C::CanCraft' has a wrong offset!");
static_assert(offsetof(UUI_CraftWindow_C, CraftIngredientWidgets) == 0x000418, "Member 'UUI_CraftWindow_C::CraftIngredientWidgets' has a wrong offset!");
static_assert(offsetof(UUI_CraftWindow_C, IsEnded) == 0x000428, "Member 'UUI_CraftWindow_C::IsEnded' has a wrong offset!");
static_assert(offsetof(UUI_CraftWindow_C, Categories) == 0x000430, "Member 'UUI_CraftWindow_C::Categories' has a wrong offset!");
static_assert(offsetof(UUI_CraftWindow_C, CurrentSelection) == 0x000440, "Member 'UUI_CraftWindow_C::CurrentSelection' has a wrong offset!");
static_assert(offsetof(UUI_CraftWindow_C, Inited) == 0x000448, "Member 'UUI_CraftWindow_C::Inited' has a wrong offset!");
static_assert(offsetof(UUI_CraftWindow_C, IsMessageVisible_1) == 0x000449, "Member 'UUI_CraftWindow_C::IsMessageVisible_1' has a wrong offset!");
static_assert(offsetof(UUI_CraftWindow_C, IsMessageVisible_2) == 0x00044A, "Member 'UUI_CraftWindow_C::IsMessageVisible_2' has a wrong offset!");

}

