#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIHelper

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UIHelper.UIHelper_C.RenderTextToMaterial
// 0x0088 (0x0088 - 0x0000)
struct UIHelper_C_RenderTextToMaterial final
{
public:
	class UCanvas*                                Canvas;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         SizeX;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SizeY;                                             // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 RenderText;                                        // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               TextMaterial;                                      // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   ParameterName;                                     // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               CanvasRenderTarget2D;                              // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              TextScreenPosition;                                // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              TextScale;                                         // 0x0048(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFont*                                  RenderFont;                                        // 0x0058(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0060(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIHelper_C_RenderTextToMaterial) == 0x000008, "Wrong alignment on UIHelper_C_RenderTextToMaterial");
static_assert(sizeof(UIHelper_C_RenderTextToMaterial) == 0x000088, "Wrong size on UIHelper_C_RenderTextToMaterial");
static_assert(offsetof(UIHelper_C_RenderTextToMaterial, Canvas) == 0x000000, "Member 'UIHelper_C_RenderTextToMaterial::Canvas' has a wrong offset!");
static_assert(offsetof(UIHelper_C_RenderTextToMaterial, SizeX) == 0x000008, "Member 'UIHelper_C_RenderTextToMaterial::SizeX' has a wrong offset!");
static_assert(offsetof(UIHelper_C_RenderTextToMaterial, SizeY) == 0x00000C, "Member 'UIHelper_C_RenderTextToMaterial::SizeY' has a wrong offset!");
static_assert(offsetof(UIHelper_C_RenderTextToMaterial, RenderText) == 0x000010, "Member 'UIHelper_C_RenderTextToMaterial::RenderText' has a wrong offset!");
static_assert(offsetof(UIHelper_C_RenderTextToMaterial, TextMaterial) == 0x000020, "Member 'UIHelper_C_RenderTextToMaterial::TextMaterial' has a wrong offset!");
static_assert(offsetof(UIHelper_C_RenderTextToMaterial, ParameterName) == 0x000028, "Member 'UIHelper_C_RenderTextToMaterial::ParameterName' has a wrong offset!");
static_assert(offsetof(UIHelper_C_RenderTextToMaterial, CanvasRenderTarget2D) == 0x000030, "Member 'UIHelper_C_RenderTextToMaterial::CanvasRenderTarget2D' has a wrong offset!");
static_assert(offsetof(UIHelper_C_RenderTextToMaterial, TextScreenPosition) == 0x000038, "Member 'UIHelper_C_RenderTextToMaterial::TextScreenPosition' has a wrong offset!");
static_assert(offsetof(UIHelper_C_RenderTextToMaterial, TextScale) == 0x000048, "Member 'UIHelper_C_RenderTextToMaterial::TextScale' has a wrong offset!");
static_assert(offsetof(UIHelper_C_RenderTextToMaterial, RenderFont) == 0x000058, "Member 'UIHelper_C_RenderTextToMaterial::RenderFont' has a wrong offset!");
static_assert(offsetof(UIHelper_C_RenderTextToMaterial, __WorldContext) == 0x000060, "Member 'UIHelper_C_RenderTextToMaterial::__WorldContext' has a wrong offset!");
static_assert(offsetof(UIHelper_C_RenderTextToMaterial, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000068, "Member 'UIHelper_C_RenderTextToMaterial::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIHelper_C_RenderTextToMaterial, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000070, "Member 'UIHelper_C_RenderTextToMaterial::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIHelper_C_RenderTextToMaterial, CallFunc_MakeVector2D_ReturnValue) == 0x000078, "Member 'UIHelper_C_RenderTextToMaterial::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

}

