#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_CrosshairTrailer

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function UIW_CrosshairTrailer.UIW_CrosshairTrailer_C.AimEvent
// 0x0001 (0x0001 - 0x0000)
struct UIW_CrosshairTrailer_C_AimEvent final
{
public:
	bool                                          Aim;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_CrosshairTrailer_C_AimEvent) == 0x000001, "Wrong alignment on UIW_CrosshairTrailer_C_AimEvent");
static_assert(sizeof(UIW_CrosshairTrailer_C_AimEvent) == 0x000001, "Wrong size on UIW_CrosshairTrailer_C_AimEvent");
static_assert(offsetof(UIW_CrosshairTrailer_C_AimEvent, Aim) == 0x000000, "Member 'UIW_CrosshairTrailer_C_AimEvent::Aim' has a wrong offset!");

// Function UIW_CrosshairTrailer.UIW_CrosshairTrailer_C.AimScale
// 0x0008 (0x0008 - 0x0000)
struct UIW_CrosshairTrailer_C_AimScale final
{
public:
	double                                        UpScale;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_CrosshairTrailer_C_AimScale) == 0x000008, "Wrong alignment on UIW_CrosshairTrailer_C_AimScale");
static_assert(sizeof(UIW_CrosshairTrailer_C_AimScale) == 0x000008, "Wrong size on UIW_CrosshairTrailer_C_AimScale");
static_assert(offsetof(UIW_CrosshairTrailer_C_AimScale, UpScale) == 0x000000, "Member 'UIW_CrosshairTrailer_C_AimScale::UpScale' has a wrong offset!");

// Function UIW_CrosshairTrailer.UIW_CrosshairTrailer_C.ExecuteUbergraph_UIW_CrosshairTrailer
// 0x0190 (0x0190 - 0x0000)
struct UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FInterpTo_ReturnValue;                    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_ReloadDuration;                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x004C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue_2;       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue_3;       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_Constant_ReturnValue;           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_1;                   // 0x008C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FInterpTo_Constant_ReturnValue_1;         // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue_4;       // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_2;                   // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Aim;                            // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_Percent;                        // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue;              // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F2[0x6];                                       // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_UpScale;                        // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0108(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0118(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0130(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0140(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1;  // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_ReloadAlpha_ImplicitCast;       // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_A_ImplicitCast;                  // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_Constant_Current_ImplicitCast;  // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_Constant_Current_ImplicitCast_1; // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_A_ImplicitCast_1;                // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_A_ImplicitCast_2;                // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_LinearColorLerp_Alpha_ImplicitCast;       // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer) == 0x000008, "Wrong alignment on UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer");
static_assert(sizeof(UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer) == 0x000190, "Wrong size on UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer");
static_assert(offsetof(UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer, EntryPoint) == 0x000000, "Member 'UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000008, "Member 'UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000010, "Member 'UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer, CallFunc_FInterpTo_ReturnValue) == 0x000018, "Member 'UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000020, "Member 'UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer, K2Node_CustomEvent_ReloadDuration) == 0x000028, "Member 'UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer::K2Node_CustomEvent_ReloadDuration' has a wrong offset!");
static_assert(offsetof(UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000030, "Member 'UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer, CallFunc_Not_PreBool_ReturnValue) == 0x000031, "Member 'UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer, CallFunc_GetWorldDeltaSeconds_ReturnValue_1) == 0x000038, "Member 'UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer::CallFunc_GetWorldDeltaSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000040, "Member 'UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000048, "Member 'UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer, K2Node_MakeStruct_LinearColor) == 0x00004C, "Member 'UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer, CallFunc_GetWorldDeltaSeconds_ReturnValue_2) == 0x000060, "Member 'UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer::CallFunc_GetWorldDeltaSeconds_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000068, "Member 'UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000070, "Member 'UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer, CallFunc_GetWorldDeltaSeconds_ReturnValue_3) == 0x000078, "Member 'UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer::CallFunc_GetWorldDeltaSeconds_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer, CallFunc_FInterpTo_Constant_ReturnValue) == 0x000080, "Member 'UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer::CallFunc_FInterpTo_Constant_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x000088, "Member 'UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer, K2Node_MakeStruct_LinearColor_1) == 0x00008C, "Member 'UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer::K2Node_MakeStruct_LinearColor_1' has a wrong offset!");
static_assert(offsetof(UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer, CallFunc_FInterpTo_Constant_ReturnValue_1) == 0x0000A0, "Member 'UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer::CallFunc_FInterpTo_Constant_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer, CallFunc_GetWorldDeltaSeconds_ReturnValue_4) == 0x0000A8, "Member 'UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer::CallFunc_GetWorldDeltaSeconds_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer, K2Node_MakeStruct_LinearColor_2) == 0x0000B0, "Member 'UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer::K2Node_MakeStruct_LinearColor_2' has a wrong offset!");
static_assert(offsetof(UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0000C0, "Member 'UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer, K2Node_CustomEvent_Aim) == 0x0000C8, "Member 'UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer::K2Node_CustomEvent_Aim' has a wrong offset!");
static_assert(offsetof(UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer, K2Node_CustomEvent_Percent) == 0x0000D0, "Member 'UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer::K2Node_CustomEvent_Percent' has a wrong offset!");
static_assert(offsetof(UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000D8, "Member 'UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer, CallFunc_LinearColorLerp_ReturnValue) == 0x0000E0, "Member 'UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer::CallFunc_LinearColorLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000F0, "Member 'UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer, CallFunc_BooleanAND_ReturnValue) == 0x0000F1, "Member 'UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer, K2Node_CustomEvent_UpScale) == 0x0000F8, "Member 'UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer::K2Node_CustomEvent_UpScale' has a wrong offset!");
static_assert(offsetof(UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000100, "Member 'UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer, K2Node_CreateDelegate_OutputDelegate) == 0x000108, "Member 'UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000118, "Member 'UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer, CallFunc_PlayAnimation_ReturnValue) == 0x000120, "Member 'UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer, CallFunc_PlayAnimation_ReturnValue_1) == 0x000128, "Member 'UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer, K2Node_CreateDelegate_OutputDelegate_1) == 0x000130, "Member 'UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000140, "Member 'UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x000148, "Member 'UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1) == 0x00014C, "Member 'UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer, K2Node_VariableSet_ReloadAlpha_ImplicitCast) == 0x000150, "Member 'UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer::K2Node_VariableSet_ReloadAlpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer, K2Node_MakeStruct_A_ImplicitCast) == 0x000158, "Member 'UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer::K2Node_MakeStruct_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000160, "Member 'UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer, CallFunc_FInterpTo_Constant_Current_ImplicitCast) == 0x000168, "Member 'UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer::CallFunc_FInterpTo_Constant_Current_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer, CallFunc_FInterpTo_Constant_Current_ImplicitCast_1) == 0x000170, "Member 'UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer::CallFunc_FInterpTo_Constant_Current_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x000178, "Member 'UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer, K2Node_MakeStruct_A_ImplicitCast_1) == 0x000180, "Member 'UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer::K2Node_MakeStruct_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer, K2Node_MakeStruct_A_ImplicitCast_2) == 0x000184, "Member 'UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer::K2Node_MakeStruct_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer, CallFunc_LinearColorLerp_Alpha_ImplicitCast) == 0x000188, "Member 'UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer::CallFunc_LinearColorLerp_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x00018C, "Member 'UIW_CrosshairTrailer_C_ExecuteUbergraph_UIW_CrosshairTrailer::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function UIW_CrosshairTrailer.UIW_CrosshairTrailer_C.ReloadEvent
// 0x0008 (0x0008 - 0x0000)
struct UIW_CrosshairTrailer_C_ReloadEvent final
{
public:
	double                                        Param_ReloadDuration;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_CrosshairTrailer_C_ReloadEvent) == 0x000008, "Wrong alignment on UIW_CrosshairTrailer_C_ReloadEvent");
static_assert(sizeof(UIW_CrosshairTrailer_C_ReloadEvent) == 0x000008, "Wrong size on UIW_CrosshairTrailer_C_ReloadEvent");
static_assert(offsetof(UIW_CrosshairTrailer_C_ReloadEvent, Param_ReloadDuration) == 0x000000, "Member 'UIW_CrosshairTrailer_C_ReloadEvent::Param_ReloadDuration' has a wrong offset!");

// Function UIW_CrosshairTrailer.UIW_CrosshairTrailer_C.SetProgress
// 0x0008 (0x0008 - 0x0000)
struct UIW_CrosshairTrailer_C_SetProgress final
{
public:
	double                                        Percent;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_CrosshairTrailer_C_SetProgress) == 0x000008, "Wrong alignment on UIW_CrosshairTrailer_C_SetProgress");
static_assert(sizeof(UIW_CrosshairTrailer_C_SetProgress) == 0x000008, "Wrong size on UIW_CrosshairTrailer_C_SetProgress");
static_assert(offsetof(UIW_CrosshairTrailer_C_SetProgress, Percent) == 0x000000, "Member 'UIW_CrosshairTrailer_C_SetProgress::Percent' has a wrong offset!");

// Function UIW_CrosshairTrailer.UIW_CrosshairTrailer_C.SetSpacersSize
// 0x0008 (0x0008 - 0x0000)
struct UIW_CrosshairTrailer_C_SetSpacersSize final
{
public:
	double                                        NewSize;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_CrosshairTrailer_C_SetSpacersSize) == 0x000008, "Wrong alignment on UIW_CrosshairTrailer_C_SetSpacersSize");
static_assert(sizeof(UIW_CrosshairTrailer_C_SetSpacersSize) == 0x000008, "Wrong size on UIW_CrosshairTrailer_C_SetSpacersSize");
static_assert(offsetof(UIW_CrosshairTrailer_C_SetSpacersSize, NewSize) == 0x000000, "Member 'UIW_CrosshairTrailer_C_SetSpacersSize::NewSize' has a wrong offset!");

}

