#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Bunker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_Bunker.UIW_Bunker_C
// 0x0078 (0x02F8 - 0x0280)
class UUIW_Bunker_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BGImage;                                           // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             BigText;                                           // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                CloseButton;                                       // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_129;                                         // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SimpleText;                                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text;                                              // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           TextWindow;                                        // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsNeedToShowBlackImage;                            // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        LerpAlpha;                                         // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Speed;                                             // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsNeedToHideBlackIMage;                            // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        BigTextDuration;                                   // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SimpleTextDuration;                                // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Siblings;                                          // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__Button_88_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_UIW_Bunker(int32 EntryPoint);
	void HideBlackScreen();
	void HideBlackScreenEx();
	void ShowBigText(const class FString& Param_Text);
	void ShowBlackImage();
	void ShowBlackScreenEx();
	void ShowSimpleText(const class FString& Param_Text);
	void ShowTextWindow(const class FString& Param_Text);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_Bunker_C">();
	}
	static class UUIW_Bunker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_Bunker_C>();
	}
};
static_assert(alignof(UUIW_Bunker_C) == 0x000008, "Wrong alignment on UUIW_Bunker_C");
static_assert(sizeof(UUIW_Bunker_C) == 0x0002F8, "Wrong size on UUIW_Bunker_C");
static_assert(offsetof(UUIW_Bunker_C, UberGraphFrame) == 0x000280, "Member 'UUIW_Bunker_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_Bunker_C, BGImage) == 0x000288, "Member 'UUIW_Bunker_C::BGImage' has a wrong offset!");
static_assert(offsetof(UUIW_Bunker_C, BigText) == 0x000290, "Member 'UUIW_Bunker_C::BigText' has a wrong offset!");
static_assert(offsetof(UUIW_Bunker_C, CloseButton) == 0x000298, "Member 'UUIW_Bunker_C::CloseButton' has a wrong offset!");
static_assert(offsetof(UUIW_Bunker_C, Image_129) == 0x0002A0, "Member 'UUIW_Bunker_C::Image_129' has a wrong offset!");
static_assert(offsetof(UUIW_Bunker_C, SimpleText) == 0x0002A8, "Member 'UUIW_Bunker_C::SimpleText' has a wrong offset!");
static_assert(offsetof(UUIW_Bunker_C, Text) == 0x0002B0, "Member 'UUIW_Bunker_C::Text' has a wrong offset!");
static_assert(offsetof(UUIW_Bunker_C, TextWindow) == 0x0002B8, "Member 'UUIW_Bunker_C::TextWindow' has a wrong offset!");
static_assert(offsetof(UUIW_Bunker_C, IsNeedToShowBlackImage) == 0x0002C0, "Member 'UUIW_Bunker_C::IsNeedToShowBlackImage' has a wrong offset!");
static_assert(offsetof(UUIW_Bunker_C, LerpAlpha) == 0x0002C8, "Member 'UUIW_Bunker_C::LerpAlpha' has a wrong offset!");
static_assert(offsetof(UUIW_Bunker_C, Speed) == 0x0002D0, "Member 'UUIW_Bunker_C::Speed' has a wrong offset!");
static_assert(offsetof(UUIW_Bunker_C, IsNeedToHideBlackIMage) == 0x0002D8, "Member 'UUIW_Bunker_C::IsNeedToHideBlackIMage' has a wrong offset!");
static_assert(offsetof(UUIW_Bunker_C, BigTextDuration) == 0x0002E0, "Member 'UUIW_Bunker_C::BigTextDuration' has a wrong offset!");
static_assert(offsetof(UUIW_Bunker_C, SimpleTextDuration) == 0x0002E8, "Member 'UUIW_Bunker_C::SimpleTextDuration' has a wrong offset!");
static_assert(offsetof(UUIW_Bunker_C, Siblings) == 0x0002F0, "Member 'UUIW_Bunker_C::Siblings' has a wrong offset!");

}

