#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_CarStats

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_CarStats.UIW_CarStats_C
// 0x0080 (0x0300 - 0x0280)
class UUIW_CarStats_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeOut;                                           // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_Main;                                  // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_56;                                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_FuelScale;                                   // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Triangle;                                    // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_Durability;                            // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_Fuel;                                  // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CarBoost_C*                          W_CarBoost;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CarSnowCamera_C*                     W_CarSnowCamera;                                   // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPC_CarStatsComponent_C*               CarStatComponentRef;                               // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Fading;                                            // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CurrentFillDurabilityValue;                        // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              In_Position;                                       // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Close();
	void ExecuteUbergraph_UIW_CarStats(int32 EntryPoint);
	void Open();
	void PlayBoostingAnim();
	void SetVehicleStats(class AActor* Vehicle);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UpdateFuelTriangle();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_CarStats_C">();
	}
	static class UUIW_CarStats_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_CarStats_C>();
	}
};
static_assert(alignof(UUIW_CarStats_C) == 0x000008, "Wrong alignment on UUIW_CarStats_C");
static_assert(sizeof(UUIW_CarStats_C) == 0x000300, "Wrong size on UUIW_CarStats_C");
static_assert(offsetof(UUIW_CarStats_C, UberGraphFrame) == 0x000280, "Member 'UUIW_CarStats_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_CarStats_C, FadeIn) == 0x000288, "Member 'UUIW_CarStats_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UUIW_CarStats_C, FadeOut) == 0x000290, "Member 'UUIW_CarStats_C::FadeOut' has a wrong offset!");
static_assert(offsetof(UUIW_CarStats_C, CanvasPanel_Main) == 0x000298, "Member 'UUIW_CarStats_C::CanvasPanel_Main' has a wrong offset!");
static_assert(offsetof(UUIW_CarStats_C, Image_56) == 0x0002A0, "Member 'UUIW_CarStats_C::Image_56' has a wrong offset!");
static_assert(offsetof(UUIW_CarStats_C, Image_FuelScale) == 0x0002A8, "Member 'UUIW_CarStats_C::Image_FuelScale' has a wrong offset!");
static_assert(offsetof(UUIW_CarStats_C, Image_Triangle) == 0x0002B0, "Member 'UUIW_CarStats_C::Image_Triangle' has a wrong offset!");
static_assert(offsetof(UUIW_CarStats_C, ProgressBar_Durability) == 0x0002B8, "Member 'UUIW_CarStats_C::ProgressBar_Durability' has a wrong offset!");
static_assert(offsetof(UUIW_CarStats_C, ProgressBar_Fuel) == 0x0002C0, "Member 'UUIW_CarStats_C::ProgressBar_Fuel' has a wrong offset!");
static_assert(offsetof(UUIW_CarStats_C, W_CarBoost) == 0x0002C8, "Member 'UUIW_CarStats_C::W_CarBoost' has a wrong offset!");
static_assert(offsetof(UUIW_CarStats_C, W_CarSnowCamera) == 0x0002D0, "Member 'UUIW_CarStats_C::W_CarSnowCamera' has a wrong offset!");
static_assert(offsetof(UUIW_CarStats_C, CarStatComponentRef) == 0x0002D8, "Member 'UUIW_CarStats_C::CarStatComponentRef' has a wrong offset!");
static_assert(offsetof(UUIW_CarStats_C, Fading) == 0x0002E0, "Member 'UUIW_CarStats_C::Fading' has a wrong offset!");
static_assert(offsetof(UUIW_CarStats_C, CurrentFillDurabilityValue) == 0x0002E8, "Member 'UUIW_CarStats_C::CurrentFillDurabilityValue' has a wrong offset!");
static_assert(offsetof(UUIW_CarStats_C, In_Position) == 0x0002F0, "Member 'UUIW_CarStats_C::In_Position' has a wrong offset!");

}

