#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_MainMenuV2

#include "Basic.hpp"


namespace SDK::Params
{

// Function UIW_MainMenuV2.UIW_MainMenuV2_C.ExecuteUbergraph_UIW_MainMenuV2
// 0x0030 (0x0030 - 0x0000)
struct UIW_MainMenuV2_C_ExecuteUbergraph_UIW_MainMenuV2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0008(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_MainMenuV2_C_ExecuteUbergraph_UIW_MainMenuV2) == 0x000008, "Wrong alignment on UIW_MainMenuV2_C_ExecuteUbergraph_UIW_MainMenuV2");
static_assert(sizeof(UIW_MainMenuV2_C_ExecuteUbergraph_UIW_MainMenuV2) == 0x000030, "Wrong size on UIW_MainMenuV2_C_ExecuteUbergraph_UIW_MainMenuV2");
static_assert(offsetof(UIW_MainMenuV2_C_ExecuteUbergraph_UIW_MainMenuV2, EntryPoint) == 0x000000, "Member 'UIW_MainMenuV2_C_ExecuteUbergraph_UIW_MainMenuV2::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_MainMenuV2_C_ExecuteUbergraph_UIW_MainMenuV2, CallFunc_GetText_ReturnValue) == 0x000008, "Member 'UIW_MainMenuV2_C_ExecuteUbergraph_UIW_MainMenuV2::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_MainMenuV2_C_ExecuteUbergraph_UIW_MainMenuV2, CallFunc_Conv_TextToString_ReturnValue) == 0x000020, "Member 'UIW_MainMenuV2_C_ExecuteUbergraph_UIW_MainMenuV2::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

// Function UIW_MainMenuV2.UIW_MainMenuV2_C.SetErrorText
// 0x0028 (0x0028 - 0x0000)
struct UIW_MainMenuV2_C_SetErrorText final
{
public:
	class FString                                 Text;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0010(0x0018)()
};
static_assert(alignof(UIW_MainMenuV2_C_SetErrorText) == 0x000008, "Wrong alignment on UIW_MainMenuV2_C_SetErrorText");
static_assert(sizeof(UIW_MainMenuV2_C_SetErrorText) == 0x000028, "Wrong size on UIW_MainMenuV2_C_SetErrorText");
static_assert(offsetof(UIW_MainMenuV2_C_SetErrorText, Text) == 0x000000, "Member 'UIW_MainMenuV2_C_SetErrorText::Text' has a wrong offset!");
static_assert(offsetof(UIW_MainMenuV2_C_SetErrorText, CallFunc_Conv_StringToText_ReturnValue) == 0x000010, "Member 'UIW_MainMenuV2_C_SetErrorText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function UIW_MainMenuV2.UIW_MainMenuV2_C.SetHUD
// 0x0008 (0x0008 - 0x0000)
struct UIW_MainMenuV2_C_SetHUD final
{
public:
	class AHUD_MainMenu_C*                        Param_HUD;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_MainMenuV2_C_SetHUD) == 0x000008, "Wrong alignment on UIW_MainMenuV2_C_SetHUD");
static_assert(sizeof(UIW_MainMenuV2_C_SetHUD) == 0x000008, "Wrong size on UIW_MainMenuV2_C_SetHUD");
static_assert(offsetof(UIW_MainMenuV2_C_SetHUD, Param_HUD) == 0x000000, "Member 'UIW_MainMenuV2_C_SetHUD::Param_HUD' has a wrong offset!");

// Function UIW_MainMenuV2.UIW_MainMenuV2_C.SetInfoText
// 0x0028 (0x0028 - 0x0000)
struct UIW_MainMenuV2_C_SetInfoText final
{
public:
	class FString                                 Text;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0010(0x0018)()
};
static_assert(alignof(UIW_MainMenuV2_C_SetInfoText) == 0x000008, "Wrong alignment on UIW_MainMenuV2_C_SetInfoText");
static_assert(sizeof(UIW_MainMenuV2_C_SetInfoText) == 0x000028, "Wrong size on UIW_MainMenuV2_C_SetInfoText");
static_assert(offsetof(UIW_MainMenuV2_C_SetInfoText, Text) == 0x000000, "Member 'UIW_MainMenuV2_C_SetInfoText::Text' has a wrong offset!");
static_assert(offsetof(UIW_MainMenuV2_C_SetInfoText, CallFunc_Conv_StringToText_ReturnValue) == 0x000010, "Member 'UIW_MainMenuV2_C_SetInfoText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function UIW_MainMenuV2.UIW_MainMenuV2_C.SetResponseErrorText
// 0x0028 (0x0028 - 0x0000)
struct UIW_MainMenuV2_C_SetResponseErrorText final
{
public:
	class FString                                 Text;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0010(0x0018)()
};
static_assert(alignof(UIW_MainMenuV2_C_SetResponseErrorText) == 0x000008, "Wrong alignment on UIW_MainMenuV2_C_SetResponseErrorText");
static_assert(sizeof(UIW_MainMenuV2_C_SetResponseErrorText) == 0x000028, "Wrong size on UIW_MainMenuV2_C_SetResponseErrorText");
static_assert(offsetof(UIW_MainMenuV2_C_SetResponseErrorText, Text) == 0x000000, "Member 'UIW_MainMenuV2_C_SetResponseErrorText::Text' has a wrong offset!");
static_assert(offsetof(UIW_MainMenuV2_C_SetResponseErrorText, CallFunc_Conv_StringToText_ReturnValue) == 0x000010, "Member 'UIW_MainMenuV2_C_SetResponseErrorText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function UIW_MainMenuV2.UIW_MainMenuV2_C.SetResponseText
// 0x0028 (0x0028 - 0x0000)
struct UIW_MainMenuV2_C_SetResponseText final
{
public:
	class FString                                 Text;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0010(0x0018)()
};
static_assert(alignof(UIW_MainMenuV2_C_SetResponseText) == 0x000008, "Wrong alignment on UIW_MainMenuV2_C_SetResponseText");
static_assert(sizeof(UIW_MainMenuV2_C_SetResponseText) == 0x000028, "Wrong size on UIW_MainMenuV2_C_SetResponseText");
static_assert(offsetof(UIW_MainMenuV2_C_SetResponseText, Text) == 0x000000, "Member 'UIW_MainMenuV2_C_SetResponseText::Text' has a wrong offset!");
static_assert(offsetof(UIW_MainMenuV2_C_SetResponseText, CallFunc_Conv_StringToText_ReturnValue) == 0x000010, "Member 'UIW_MainMenuV2_C_SetResponseText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

}

