#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Sprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_Sprint.UIW_Sprint_C
// 0x00C0 (0x0340 - 0x0280)
class UUIW_Sprint_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowBlinkCanvas;                                   // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowBlink;                                         // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowHide_Anim;                                     // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_0;                                     // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_44;                                          // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_StaminaBar;                                  // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_StaminaBar;                            // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPC_PlayerStatsComponent_C*            PlayerStats;                                       // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UFMODAudioComponent*                    SprintSound;                                       // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                             BreathingSound;                                    // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               BarMaterial;                                       // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                DefaultOffsetProgressBar;                          // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FMargin                                DefaultOffsetImage44;                              // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FMargin                                DefaultOffsetImageStaminaBar;                      // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FTimerHandle                           TimeToHideStamina;                                 // 0x0310(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        StaminaLastFrame;                                  // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Num_Loops_to_Play;                                 // 0x0320(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_324[0x4];                                      // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPC_PlayerStatsComponent_C*            BPC_Player_Stats_Component;                        // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Hided;                                             // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvPC_C*                              As_Surv_PC;                                        // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_UIW_Sprint(int32 EntryPoint);
	void Finished_09C2590744618E2201A67CB7616E53DA();
	void Finished_D8BFD81D415A4A7561D80EACB52DAB70();
	void Hide();
	void IsDialogueOpen(bool* NewParam);
	void PreConstruct(bool IsDesignTime);
	void ResetStaminaShow();
	void SetDefaultSize();
	void Show();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Update_Stamina_Bar(class UBPC_PlayerStatsComponent_C* PlayerStatsRef, double DeltaTime);
	void UpdateSizeMinus(double StaminaMax);
	void UpdateSizePlus(double StaminaMax);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_Sprint_C">();
	}
	static class UUIW_Sprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_Sprint_C>();
	}
};
static_assert(alignof(UUIW_Sprint_C) == 0x000008, "Wrong alignment on UUIW_Sprint_C");
static_assert(sizeof(UUIW_Sprint_C) == 0x000340, "Wrong size on UUIW_Sprint_C");
static_assert(offsetof(UUIW_Sprint_C, UberGraphFrame) == 0x000280, "Member 'UUIW_Sprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_Sprint_C, ShowBlinkCanvas) == 0x000288, "Member 'UUIW_Sprint_C::ShowBlinkCanvas' has a wrong offset!");
static_assert(offsetof(UUIW_Sprint_C, ShowBlink) == 0x000290, "Member 'UUIW_Sprint_C::ShowBlink' has a wrong offset!");
static_assert(offsetof(UUIW_Sprint_C, ShowHide_Anim) == 0x000298, "Member 'UUIW_Sprint_C::ShowHide_Anim' has a wrong offset!");
static_assert(offsetof(UUIW_Sprint_C, CanvasPanel_0) == 0x0002A0, "Member 'UUIW_Sprint_C::CanvasPanel_0' has a wrong offset!");
static_assert(offsetof(UUIW_Sprint_C, Image_44) == 0x0002A8, "Member 'UUIW_Sprint_C::Image_44' has a wrong offset!");
static_assert(offsetof(UUIW_Sprint_C, Image_StaminaBar) == 0x0002B0, "Member 'UUIW_Sprint_C::Image_StaminaBar' has a wrong offset!");
static_assert(offsetof(UUIW_Sprint_C, ProgressBar_StaminaBar) == 0x0002B8, "Member 'UUIW_Sprint_C::ProgressBar_StaminaBar' has a wrong offset!");
static_assert(offsetof(UUIW_Sprint_C, PlayerStats) == 0x0002C0, "Member 'UUIW_Sprint_C::PlayerStats' has a wrong offset!");
static_assert(offsetof(UUIW_Sprint_C, SprintSound) == 0x0002C8, "Member 'UUIW_Sprint_C::SprintSound' has a wrong offset!");
static_assert(offsetof(UUIW_Sprint_C, BreathingSound) == 0x0002D0, "Member 'UUIW_Sprint_C::BreathingSound' has a wrong offset!");
static_assert(offsetof(UUIW_Sprint_C, BarMaterial) == 0x0002D8, "Member 'UUIW_Sprint_C::BarMaterial' has a wrong offset!");
static_assert(offsetof(UUIW_Sprint_C, DefaultOffsetProgressBar) == 0x0002E0, "Member 'UUIW_Sprint_C::DefaultOffsetProgressBar' has a wrong offset!");
static_assert(offsetof(UUIW_Sprint_C, DefaultOffsetImage44) == 0x0002F0, "Member 'UUIW_Sprint_C::DefaultOffsetImage44' has a wrong offset!");
static_assert(offsetof(UUIW_Sprint_C, DefaultOffsetImageStaminaBar) == 0x000300, "Member 'UUIW_Sprint_C::DefaultOffsetImageStaminaBar' has a wrong offset!");
static_assert(offsetof(UUIW_Sprint_C, TimeToHideStamina) == 0x000310, "Member 'UUIW_Sprint_C::TimeToHideStamina' has a wrong offset!");
static_assert(offsetof(UUIW_Sprint_C, StaminaLastFrame) == 0x000318, "Member 'UUIW_Sprint_C::StaminaLastFrame' has a wrong offset!");
static_assert(offsetof(UUIW_Sprint_C, Num_Loops_to_Play) == 0x000320, "Member 'UUIW_Sprint_C::Num_Loops_to_Play' has a wrong offset!");
static_assert(offsetof(UUIW_Sprint_C, BPC_Player_Stats_Component) == 0x000328, "Member 'UUIW_Sprint_C::BPC_Player_Stats_Component' has a wrong offset!");
static_assert(offsetof(UUIW_Sprint_C, Hided) == 0x000330, "Member 'UUIW_Sprint_C::Hided' has a wrong offset!");
static_assert(offsetof(UUIW_Sprint_C, As_Surv_PC) == 0x000338, "Member 'UUIW_Sprint_C::As_Surv_PC' has a wrong offset!");

}

