#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_FlashGrenade

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UIW_FlashGrenade.UIW_FlashGrenade_C.ExecuteUbergraph_UIW_FlashGrenade
// 0x0010 (0x0010 - 0x0000)
struct UIW_FlashGrenade_C_ExecuteUbergraph_UIW_FlashGrenade final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UWidgetAnimation*                 K2Node_Event_Animation;                            // 0x0008(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_FlashGrenade_C_ExecuteUbergraph_UIW_FlashGrenade) == 0x000008, "Wrong alignment on UIW_FlashGrenade_C_ExecuteUbergraph_UIW_FlashGrenade");
static_assert(sizeof(UIW_FlashGrenade_C_ExecuteUbergraph_UIW_FlashGrenade) == 0x000010, "Wrong size on UIW_FlashGrenade_C_ExecuteUbergraph_UIW_FlashGrenade");
static_assert(offsetof(UIW_FlashGrenade_C_ExecuteUbergraph_UIW_FlashGrenade, EntryPoint) == 0x000000, "Member 'UIW_FlashGrenade_C_ExecuteUbergraph_UIW_FlashGrenade::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_FlashGrenade_C_ExecuteUbergraph_UIW_FlashGrenade, K2Node_Event_Animation) == 0x000008, "Member 'UIW_FlashGrenade_C_ExecuteUbergraph_UIW_FlashGrenade::K2Node_Event_Animation' has a wrong offset!");

// Function UIW_FlashGrenade.UIW_FlashGrenade_C.GetBrush_0
// 0x00E0 (0x00E0 - 0x0000)
struct UIW_FlashGrenade_C_GetBrush_0 final
{
public:
	struct FSlateBrush                            ReturnValue;                                       // 0x0000(0x00D0)(Parm, OutParm, ReturnParm)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_FlashGrenade_C_GetBrush_0) == 0x000010, "Wrong alignment on UIW_FlashGrenade_C_GetBrush_0");
static_assert(sizeof(UIW_FlashGrenade_C_GetBrush_0) == 0x0000E0, "Wrong size on UIW_FlashGrenade_C_GetBrush_0");
static_assert(offsetof(UIW_FlashGrenade_C_GetBrush_0, ReturnValue) == 0x000000, "Member 'UIW_FlashGrenade_C_GetBrush_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_FlashGrenade_C_GetBrush_0, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0000D0, "Member 'UIW_FlashGrenade_C_GetBrush_0::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function UIW_FlashGrenade.UIW_FlashGrenade_C.OnAnimationFinished
// 0x0008 (0x0008 - 0x0000)
struct UIW_FlashGrenade_C_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_FlashGrenade_C_OnAnimationFinished) == 0x000008, "Wrong alignment on UIW_FlashGrenade_C_OnAnimationFinished");
static_assert(sizeof(UIW_FlashGrenade_C_OnAnimationFinished) == 0x000008, "Wrong size on UIW_FlashGrenade_C_OnAnimationFinished");
static_assert(offsetof(UIW_FlashGrenade_C_OnAnimationFinished, Animation) == 0x000000, "Member 'UIW_FlashGrenade_C_OnAnimationFinished::Animation' has a wrong offset!");

}

