#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_CarStats

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UIW_CarStats.UIW_CarStats_C.ExecuteUbergraph_UIW_CarStats
// 0x00B8 (0x00B8 - 0x0000)
struct UIW_CarStats_C_ExecuteUbergraph_UIW_CarStats final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_Vehicle_C>          K2Node_DynamicCast_AsI_Vehicle;                    // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPC_CarStatsComponent_C*               CallFunc_GetCarStatsComponent_CarStats;            // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0028(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Vehicle;                        // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_Vehicle_C>          K2Node_DynamicCast_AsI_Vehicle_1;                  // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetBoostInfo_BoostTIme;                   // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetBoostInfo_BoostCooldownTime;           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_CarStats_C_ExecuteUbergraph_UIW_CarStats) == 0x000008, "Wrong alignment on UIW_CarStats_C_ExecuteUbergraph_UIW_CarStats");
static_assert(sizeof(UIW_CarStats_C_ExecuteUbergraph_UIW_CarStats) == 0x0000B8, "Wrong size on UIW_CarStats_C_ExecuteUbergraph_UIW_CarStats");
static_assert(offsetof(UIW_CarStats_C_ExecuteUbergraph_UIW_CarStats, EntryPoint) == 0x000000, "Member 'UIW_CarStats_C_ExecuteUbergraph_UIW_CarStats::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_CarStats_C_ExecuteUbergraph_UIW_CarStats, K2Node_DynamicCast_AsI_Vehicle) == 0x000008, "Member 'UIW_CarStats_C_ExecuteUbergraph_UIW_CarStats::K2Node_DynamicCast_AsI_Vehicle' has a wrong offset!");
static_assert(offsetof(UIW_CarStats_C_ExecuteUbergraph_UIW_CarStats, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'UIW_CarStats_C_ExecuteUbergraph_UIW_CarStats::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIW_CarStats_C_ExecuteUbergraph_UIW_CarStats, CallFunc_GetCarStatsComponent_CarStats) == 0x000020, "Member 'UIW_CarStats_C_ExecuteUbergraph_UIW_CarStats::CallFunc_GetCarStatsComponent_CarStats' has a wrong offset!");
static_assert(offsetof(UIW_CarStats_C_ExecuteUbergraph_UIW_CarStats, K2Node_Event_MyGeometry) == 0x000028, "Member 'UIW_CarStats_C_ExecuteUbergraph_UIW_CarStats::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_CarStats_C_ExecuteUbergraph_UIW_CarStats, K2Node_Event_InDeltaTime) == 0x000060, "Member 'UIW_CarStats_C_ExecuteUbergraph_UIW_CarStats::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(UIW_CarStats_C_ExecuteUbergraph_UIW_CarStats, CallFunc_PlayAnimation_ReturnValue) == 0x000068, "Member 'UIW_CarStats_C_ExecuteUbergraph_UIW_CarStats::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CarStats_C_ExecuteUbergraph_UIW_CarStats, CallFunc_PlayAnimation_ReturnValue_1) == 0x000070, "Member 'UIW_CarStats_C_ExecuteUbergraph_UIW_CarStats::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_CarStats_C_ExecuteUbergraph_UIW_CarStats, K2Node_CustomEvent_Vehicle) == 0x000078, "Member 'UIW_CarStats_C_ExecuteUbergraph_UIW_CarStats::K2Node_CustomEvent_Vehicle' has a wrong offset!");
static_assert(offsetof(UIW_CarStats_C_ExecuteUbergraph_UIW_CarStats, CallFunc_GetOwner_ReturnValue) == 0x000080, "Member 'UIW_CarStats_C_ExecuteUbergraph_UIW_CarStats::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CarStats_C_ExecuteUbergraph_UIW_CarStats, K2Node_DynamicCast_AsI_Vehicle_1) == 0x000088, "Member 'UIW_CarStats_C_ExecuteUbergraph_UIW_CarStats::K2Node_DynamicCast_AsI_Vehicle_1' has a wrong offset!");
static_assert(offsetof(UIW_CarStats_C_ExecuteUbergraph_UIW_CarStats, K2Node_DynamicCast_bSuccess_1) == 0x000098, "Member 'UIW_CarStats_C_ExecuteUbergraph_UIW_CarStats::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UIW_CarStats_C_ExecuteUbergraph_UIW_CarStats, CallFunc_GetBoostInfo_BoostTIme) == 0x0000A0, "Member 'UIW_CarStats_C_ExecuteUbergraph_UIW_CarStats::CallFunc_GetBoostInfo_BoostTIme' has a wrong offset!");
static_assert(offsetof(UIW_CarStats_C_ExecuteUbergraph_UIW_CarStats, CallFunc_GetBoostInfo_BoostCooldownTime) == 0x0000A8, "Member 'UIW_CarStats_C_ExecuteUbergraph_UIW_CarStats::CallFunc_GetBoostInfo_BoostCooldownTime' has a wrong offset!");
static_assert(offsetof(UIW_CarStats_C_ExecuteUbergraph_UIW_CarStats, CallFunc_Delay_Duration_ImplicitCast) == 0x0000B0, "Member 'UIW_CarStats_C_ExecuteUbergraph_UIW_CarStats::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");

// Function UIW_CarStats.UIW_CarStats_C.SetVehicleStats
// 0x0008 (0x0008 - 0x0000)
struct UIW_CarStats_C_SetVehicleStats final
{
public:
	class AActor*                                 Vehicle;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_CarStats_C_SetVehicleStats) == 0x000008, "Wrong alignment on UIW_CarStats_C_SetVehicleStats");
static_assert(sizeof(UIW_CarStats_C_SetVehicleStats) == 0x000008, "Wrong size on UIW_CarStats_C_SetVehicleStats");
static_assert(offsetof(UIW_CarStats_C_SetVehicleStats, Vehicle) == 0x000000, "Member 'UIW_CarStats_C_SetVehicleStats::Vehicle' has a wrong offset!");

// Function UIW_CarStats.UIW_CarStats_C.Tick
// 0x003C (0x003C - 0x0000)
struct UIW_CarStats_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_CarStats_C_Tick) == 0x000004, "Wrong alignment on UIW_CarStats_C_Tick");
static_assert(sizeof(UIW_CarStats_C_Tick) == 0x00003C, "Wrong size on UIW_CarStats_C_Tick");
static_assert(offsetof(UIW_CarStats_C_Tick, MyGeometry) == 0x000000, "Member 'UIW_CarStats_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_CarStats_C_Tick, InDeltaTime) == 0x000038, "Member 'UIW_CarStats_C_Tick::InDeltaTime' has a wrong offset!");

// Function UIW_CarStats.UIW_CarStats_C.UpdateFuelTriangle
// 0x0028 (0x0028 - 0x0000)
struct UIW_CarStats_C_UpdateFuelTriangle final
{
public:
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_Value_ImplicitCast;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_CarStats_C_UpdateFuelTriangle) == 0x000008, "Wrong alignment on UIW_CarStats_C_UpdateFuelTriangle");
static_assert(sizeof(UIW_CarStats_C_UpdateFuelTriangle) == 0x000028, "Wrong size on UIW_CarStats_C_UpdateFuelTriangle");
static_assert(offsetof(UIW_CarStats_C_UpdateFuelTriangle, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000000, "Member 'UIW_CarStats_C_UpdateFuelTriangle::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CarStats_C_UpdateFuelTriangle, CallFunc_MapRangeClamped_ReturnValue) == 0x000008, "Member 'UIW_CarStats_C_UpdateFuelTriangle::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CarStats_C_UpdateFuelTriangle, CallFunc_MakeVector2D_ReturnValue) == 0x000010, "Member 'UIW_CarStats_C_UpdateFuelTriangle::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CarStats_C_UpdateFuelTriangle, CallFunc_MapRangeClamped_Value_ImplicitCast) == 0x000020, "Member 'UIW_CarStats_C_UpdateFuelTriangle::CallFunc_MapRangeClamped_Value_ImplicitCast' has a wrong offset!");

}

