#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Damage

#include "Basic.hpp"


namespace SDK::Params
{

// Function UIW_Damage.UIW_Damage_C.ExecuteUbergraph_UIW_Damage
// 0x0090 (0x0090 - 0x0000)
struct UIW_Damage_C_ExecuteUbergraph_UIW_Damage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue_1;    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      K2Node_CustomEvent_Player;                         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_1;                 // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetCriticalHealthValue_CriticalHealthValue; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue_2;    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue;      // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue_1;       // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_CriticalValue;                  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_2;                 // 0x005F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_3;                 // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       K2Node_Select_Default;                             // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       K2Node_Select_Default_1;                           // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast; // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_1; // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Damage_C_ExecuteUbergraph_UIW_Damage) == 0x000008, "Wrong alignment on UIW_Damage_C_ExecuteUbergraph_UIW_Damage");
static_assert(sizeof(UIW_Damage_C_ExecuteUbergraph_UIW_Damage) == 0x000090, "Wrong size on UIW_Damage_C_ExecuteUbergraph_UIW_Damage");
static_assert(offsetof(UIW_Damage_C_ExecuteUbergraph_UIW_Damage, EntryPoint) == 0x000000, "Member 'UIW_Damage_C_ExecuteUbergraph_UIW_Damage::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_Damage_C_ExecuteUbergraph_UIW_Damage, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000004, "Member 'UIW_Damage_C_ExecuteUbergraph_UIW_Damage::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Damage_C_ExecuteUbergraph_UIW_Damage, CallFunc_EqualEqual_DoubleDouble_ReturnValue_1) == 0x000005, "Member 'UIW_Damage_C_ExecuteUbergraph_UIW_Damage::CallFunc_EqualEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Damage_C_ExecuteUbergraph_UIW_Damage, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000008, "Member 'UIW_Damage_C_ExecuteUbergraph_UIW_Damage::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Damage_C_ExecuteUbergraph_UIW_Damage, CallFunc_BooleanAND_ReturnValue) == 0x00000C, "Member 'UIW_Damage_C_ExecuteUbergraph_UIW_Damage::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Damage_C_ExecuteUbergraph_UIW_Damage, CallFunc_BooleanAND_ReturnValue_1) == 0x00000D, "Member 'UIW_Damage_C_ExecuteUbergraph_UIW_Damage::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Damage_C_ExecuteUbergraph_UIW_Damage, K2Node_CustomEvent_Player) == 0x000010, "Member 'UIW_Damage_C_ExecuteUbergraph_UIW_Damage::K2Node_CustomEvent_Player' has a wrong offset!");
static_assert(offsetof(UIW_Damage_C_ExecuteUbergraph_UIW_Damage, K2Node_SwitchInteger_CmpSuccess) == 0x000018, "Member 'UIW_Damage_C_ExecuteUbergraph_UIW_Damage::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UIW_Damage_C_ExecuteUbergraph_UIW_Damage, K2Node_SwitchInteger_CmpSuccess_1) == 0x000019, "Member 'UIW_Damage_C_ExecuteUbergraph_UIW_Damage::K2Node_SwitchInteger_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(UIW_Damage_C_ExecuteUbergraph_UIW_Damage, CallFunc_GetCriticalHealthValue_CriticalHealthValue) == 0x000020, "Member 'UIW_Damage_C_ExecuteUbergraph_UIW_Damage::CallFunc_GetCriticalHealthValue_CriticalHealthValue' has a wrong offset!");
static_assert(offsetof(UIW_Damage_C_ExecuteUbergraph_UIW_Damage, CallFunc_EqualEqual_DoubleDouble_ReturnValue_2) == 0x000028, "Member 'UIW_Damage_C_ExecuteUbergraph_UIW_Damage::CallFunc_EqualEqual_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_Damage_C_ExecuteUbergraph_UIW_Damage, CallFunc_BooleanOR_ReturnValue) == 0x000029, "Member 'UIW_Damage_C_ExecuteUbergraph_UIW_Damage::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Damage_C_ExecuteUbergraph_UIW_Damage, CallFunc_PlayAnimation_ReturnValue) == 0x000030, "Member 'UIW_Damage_C_ExecuteUbergraph_UIW_Damage::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Damage_C_ExecuteUbergraph_UIW_Damage, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000038, "Member 'UIW_Damage_C_ExecuteUbergraph_UIW_Damage::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Damage_C_ExecuteUbergraph_UIW_Damage, CallFunc_GetAnimationCurrentTime_ReturnValue) == 0x00003C, "Member 'UIW_Damage_C_ExecuteUbergraph_UIW_Damage::CallFunc_GetAnimationCurrentTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Damage_C_ExecuteUbergraph_UIW_Damage, CallFunc_PlayAnimation_ReturnValue_1) == 0x000040, "Member 'UIW_Damage_C_ExecuteUbergraph_UIW_Damage::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Damage_C_ExecuteUbergraph_UIW_Damage, CallFunc_RandomIntegerInRange_ReturnValue_1) == 0x000048, "Member 'UIW_Damage_C_ExecuteUbergraph_UIW_Damage::CallFunc_RandomIntegerInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Damage_C_ExecuteUbergraph_UIW_Damage, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00004C, "Member 'UIW_Damage_C_ExecuteUbergraph_UIW_Damage::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Damage_C_ExecuteUbergraph_UIW_Damage, K2Node_CustomEvent_CriticalValue) == 0x000050, "Member 'UIW_Damage_C_ExecuteUbergraph_UIW_Damage::K2Node_CustomEvent_CriticalValue' has a wrong offset!");
static_assert(offsetof(UIW_Damage_C_ExecuteUbergraph_UIW_Damage, Temp_int_Variable) == 0x000058, "Member 'UIW_Damage_C_ExecuteUbergraph_UIW_Damage::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UIW_Damage_C_ExecuteUbergraph_UIW_Damage, CallFunc_BooleanAND_ReturnValue_2) == 0x00005C, "Member 'UIW_Damage_C_ExecuteUbergraph_UIW_Damage::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_Damage_C_ExecuteUbergraph_UIW_Damage, CallFunc_BooleanAND_ReturnValue_3) == 0x00005D, "Member 'UIW_Damage_C_ExecuteUbergraph_UIW_Damage::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_Damage_C_ExecuteUbergraph_UIW_Damage, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x00005E, "Member 'UIW_Damage_C_ExecuteUbergraph_UIW_Damage::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Damage_C_ExecuteUbergraph_UIW_Damage, K2Node_SwitchInteger_CmpSuccess_2) == 0x00005F, "Member 'UIW_Damage_C_ExecuteUbergraph_UIW_Damage::K2Node_SwitchInteger_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(UIW_Damage_C_ExecuteUbergraph_UIW_Damage, K2Node_SwitchInteger_CmpSuccess_3) == 0x000060, "Member 'UIW_Damage_C_ExecuteUbergraph_UIW_Damage::K2Node_SwitchInteger_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(UIW_Damage_C_ExecuteUbergraph_UIW_Damage, Temp_int_Variable_1) == 0x000064, "Member 'UIW_Damage_C_ExecuteUbergraph_UIW_Damage::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(UIW_Damage_C_ExecuteUbergraph_UIW_Damage, K2Node_Select_Default) == 0x000068, "Member 'UIW_Damage_C_ExecuteUbergraph_UIW_Damage::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UIW_Damage_C_ExecuteUbergraph_UIW_Damage, CallFunc_PlayAnimation_ReturnValue_2) == 0x000070, "Member 'UIW_Damage_C_ExecuteUbergraph_UIW_Damage::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_Damage_C_ExecuteUbergraph_UIW_Damage, K2Node_Select_Default_1) == 0x000078, "Member 'UIW_Damage_C_ExecuteUbergraph_UIW_Damage::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(UIW_Damage_C_ExecuteUbergraph_UIW_Damage, CallFunc_PlayAnimation_ReturnValue_3) == 0x000080, "Member 'UIW_Damage_C_ExecuteUbergraph_UIW_Damage::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_Damage_C_ExecuteUbergraph_UIW_Damage, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast) == 0x000088, "Member 'UIW_Damage_C_ExecuteUbergraph_UIW_Damage::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UIW_Damage_C_ExecuteUbergraph_UIW_Damage, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_1) == 0x00008C, "Member 'UIW_Damage_C_ExecuteUbergraph_UIW_Damage::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_1' has a wrong offset!");

// Function UIW_Damage.UIW_Damage_C.HealthChange
// 0x0008 (0x0008 - 0x0000)
struct UIW_Damage_C_HealthChange final
{
public:
	double                                        CriticalValue;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Damage_C_HealthChange) == 0x000008, "Wrong alignment on UIW_Damage_C_HealthChange");
static_assert(sizeof(UIW_Damage_C_HealthChange) == 0x000008, "Wrong size on UIW_Damage_C_HealthChange");
static_assert(offsetof(UIW_Damage_C_HealthChange, CriticalValue) == 0x000000, "Member 'UIW_Damage_C_HealthChange::CriticalValue' has a wrong offset!");

// Function UIW_Damage.UIW_Damage_C.Initialize
// 0x0008 (0x0008 - 0x0000)
struct UIW_Damage_C_Initialize final
{
public:
	class ASurvivalPlayer_C*                      Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Damage_C_Initialize) == 0x000008, "Wrong alignment on UIW_Damage_C_Initialize");
static_assert(sizeof(UIW_Damage_C_Initialize) == 0x000008, "Wrong size on UIW_Damage_C_Initialize");
static_assert(offsetof(UIW_Damage_C_Initialize, Player) == 0x000000, "Member 'UIW_Damage_C_Initialize::Player' has a wrong offset!");

}

