#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_MainMenuV2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_MainMenuV2.UIW_MainMenuV2_C
// 0x0048 (0x02C8 - 0x0280)
class UUIW_MainMenuV2_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_930;                                        // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                DirectConnectButton;                               // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableText*                          IPAddressText;                                     // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextError;                                         // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextInfo;                                          // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextResponse;                                      // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextResponseError;                                 // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AHUD_MainMenu_C*                        HUD;                                               // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__Button_930_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__DirectConnectButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_UIW_MainMenuV2(int32 EntryPoint);
	void SetErrorText(const class FString& Text);
	void SetHUD(class AHUD_MainMenu_C* Param_HUD);
	void SetInfoText(const class FString& Text);
	void SetResponseErrorText(const class FString& Text);
	void SetResponseText(const class FString& Text);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_MainMenuV2_C">();
	}
	static class UUIW_MainMenuV2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_MainMenuV2_C>();
	}
};
static_assert(alignof(UUIW_MainMenuV2_C) == 0x000008, "Wrong alignment on UUIW_MainMenuV2_C");
static_assert(sizeof(UUIW_MainMenuV2_C) == 0x0002C8, "Wrong size on UUIW_MainMenuV2_C");
static_assert(offsetof(UUIW_MainMenuV2_C, UberGraphFrame) == 0x000280, "Member 'UUIW_MainMenuV2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_MainMenuV2_C, Button_930) == 0x000288, "Member 'UUIW_MainMenuV2_C::Button_930' has a wrong offset!");
static_assert(offsetof(UUIW_MainMenuV2_C, DirectConnectButton) == 0x000290, "Member 'UUIW_MainMenuV2_C::DirectConnectButton' has a wrong offset!");
static_assert(offsetof(UUIW_MainMenuV2_C, IPAddressText) == 0x000298, "Member 'UUIW_MainMenuV2_C::IPAddressText' has a wrong offset!");
static_assert(offsetof(UUIW_MainMenuV2_C, TextError) == 0x0002A0, "Member 'UUIW_MainMenuV2_C::TextError' has a wrong offset!");
static_assert(offsetof(UUIW_MainMenuV2_C, TextInfo) == 0x0002A8, "Member 'UUIW_MainMenuV2_C::TextInfo' has a wrong offset!");
static_assert(offsetof(UUIW_MainMenuV2_C, TextResponse) == 0x0002B0, "Member 'UUIW_MainMenuV2_C::TextResponse' has a wrong offset!");
static_assert(offsetof(UUIW_MainMenuV2_C, TextResponseError) == 0x0002B8, "Member 'UUIW_MainMenuV2_C::TextResponseError' has a wrong offset!");
static_assert(offsetof(UUIW_MainMenuV2_C, HUD) == 0x0002C0, "Member 'UUIW_MainMenuV2_C::HUD' has a wrong offset!");

}

