#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ultra_Dynamic_Sky_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function Ultra_Dynamic_Sky_BP.Ultra_Dynamic_Sky_BP_C.EnterTradeBunker
// 0x0001 (0x0001 - 0x0000)
struct Ultra_Dynamic_Sky_BP_C_EnterTradeBunker final
{
public:
	bool                                          Enter;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Sky_BP_C_EnterTradeBunker) == 0x000001, "Wrong alignment on Ultra_Dynamic_Sky_BP_C_EnterTradeBunker");
static_assert(sizeof(Ultra_Dynamic_Sky_BP_C_EnterTradeBunker) == 0x000001, "Wrong size on Ultra_Dynamic_Sky_BP_C_EnterTradeBunker");
static_assert(offsetof(Ultra_Dynamic_Sky_BP_C_EnterTradeBunker, Enter) == 0x000000, "Member 'Ultra_Dynamic_Sky_BP_C_EnterTradeBunker::Enter' has a wrong offset!");

// Function Ultra_Dynamic_Sky_BP.Ultra_Dynamic_Sky_BP_C.ExecuteUbergraph_Ultra_Dynamic_Sky_BP
// 0x000C (0x000C - 0x0000)
struct Ultra_Dynamic_Sky_BP_C_ExecuteUbergraph_Ultra_Dynamic_Sky_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Enter;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Sky_BP_C_ExecuteUbergraph_Ultra_Dynamic_Sky_BP) == 0x000004, "Wrong alignment on Ultra_Dynamic_Sky_BP_C_ExecuteUbergraph_Ultra_Dynamic_Sky_BP");
static_assert(sizeof(Ultra_Dynamic_Sky_BP_C_ExecuteUbergraph_Ultra_Dynamic_Sky_BP) == 0x00000C, "Wrong size on Ultra_Dynamic_Sky_BP_C_ExecuteUbergraph_Ultra_Dynamic_Sky_BP");
static_assert(offsetof(Ultra_Dynamic_Sky_BP_C_ExecuteUbergraph_Ultra_Dynamic_Sky_BP, EntryPoint) == 0x000000, "Member 'Ultra_Dynamic_Sky_BP_C_ExecuteUbergraph_Ultra_Dynamic_Sky_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_BP_C_ExecuteUbergraph_Ultra_Dynamic_Sky_BP, K2Node_CustomEvent_Enter) == 0x000004, "Member 'Ultra_Dynamic_Sky_BP_C_ExecuteUbergraph_Ultra_Dynamic_Sky_BP::K2Node_CustomEvent_Enter' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_BP_C_ExecuteUbergraph_Ultra_Dynamic_Sky_BP, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'Ultra_Dynamic_Sky_BP_C_ExecuteUbergraph_Ultra_Dynamic_Sky_BP::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function Ultra_Dynamic_Sky_BP.Ultra_Dynamic_Sky_BP_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Ultra_Dynamic_Sky_BP_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Sky_BP_C_ReceiveTick) == 0x000004, "Wrong alignment on Ultra_Dynamic_Sky_BP_C_ReceiveTick");
static_assert(sizeof(Ultra_Dynamic_Sky_BP_C_ReceiveTick) == 0x000004, "Wrong size on Ultra_Dynamic_Sky_BP_C_ReceiveTick");
static_assert(offsetof(Ultra_Dynamic_Sky_BP_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Ultra_Dynamic_Sky_BP_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

