#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ultra_Dynamic_Weather_Interface

#include "Basic.hpp"

#include "UDS_Season_structs.hpp"


namespace SDK::Params
{

// Function Ultra_Dynamic_Weather_Interface.Ultra_Dynamic_Weather_Interface_C.Get Intended Cloud Direction
// 0x0008 (0x0008 - 0x0000)
struct Ultra_Dynamic_Weather_Interface_C_Get_Intended_Cloud_Direction final
{
public:
	double                                        Intended_Cloud_Direction;                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Weather_Interface_C_Get_Intended_Cloud_Direction) == 0x000008, "Wrong alignment on Ultra_Dynamic_Weather_Interface_C_Get_Intended_Cloud_Direction");
static_assert(sizeof(Ultra_Dynamic_Weather_Interface_C_Get_Intended_Cloud_Direction) == 0x000008, "Wrong size on Ultra_Dynamic_Weather_Interface_C_Get_Intended_Cloud_Direction");
static_assert(offsetof(Ultra_Dynamic_Weather_Interface_C_Get_Intended_Cloud_Direction, Intended_Cloud_Direction) == 0x000000, "Member 'Ultra_Dynamic_Weather_Interface_C_Get_Intended_Cloud_Direction::Intended_Cloud_Direction' has a wrong offset!");

// Function Ultra_Dynamic_Weather_Interface.Ultra_Dynamic_Weather_Interface_C.Get Intended Cloud Speed
// 0x0008 (0x0008 - 0x0000)
struct Ultra_Dynamic_Weather_Interface_C_Get_Intended_Cloud_Speed final
{
public:
	double                                        Intended_Cloud_Speed;                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Weather_Interface_C_Get_Intended_Cloud_Speed) == 0x000008, "Wrong alignment on Ultra_Dynamic_Weather_Interface_C_Get_Intended_Cloud_Speed");
static_assert(sizeof(Ultra_Dynamic_Weather_Interface_C_Get_Intended_Cloud_Speed) == 0x000008, "Wrong size on Ultra_Dynamic_Weather_Interface_C_Get_Intended_Cloud_Speed");
static_assert(offsetof(Ultra_Dynamic_Weather_Interface_C_Get_Intended_Cloud_Speed, Intended_Cloud_Speed) == 0x000000, "Member 'Ultra_Dynamic_Weather_Interface_C_Get_Intended_Cloud_Speed::Intended_Cloud_Speed' has a wrong offset!");

// Function Ultra_Dynamic_Weather_Interface.Ultra_Dynamic_Weather_Interface_C.Set Current Season
// 0x0001 (0x0001 - 0x0000)
struct Ultra_Dynamic_Weather_Interface_C_Set_Current_Season final
{
public:
	EUDS_Season                                   Season;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Weather_Interface_C_Set_Current_Season) == 0x000001, "Wrong alignment on Ultra_Dynamic_Weather_Interface_C_Set_Current_Season");
static_assert(sizeof(Ultra_Dynamic_Weather_Interface_C_Set_Current_Season) == 0x000001, "Wrong size on Ultra_Dynamic_Weather_Interface_C_Set_Current_Season");
static_assert(offsetof(Ultra_Dynamic_Weather_Interface_C_Set_Current_Season, Season) == 0x000000, "Member 'Ultra_Dynamic_Weather_Interface_C_Set_Current_Season::Season' has a wrong offset!");

// Function Ultra_Dynamic_Weather_Interface.Ultra_Dynamic_Weather_Interface_C.Update Cloud Coverage from UDS
// 0x0008 (0x0008 - 0x0000)
struct Ultra_Dynamic_Weather_Interface_C_Update_Cloud_Coverage_from_UDS final
{
public:
	double                                        Cloud_Coverage;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Weather_Interface_C_Update_Cloud_Coverage_from_UDS) == 0x000008, "Wrong alignment on Ultra_Dynamic_Weather_Interface_C_Update_Cloud_Coverage_from_UDS");
static_assert(sizeof(Ultra_Dynamic_Weather_Interface_C_Update_Cloud_Coverage_from_UDS) == 0x000008, "Wrong size on Ultra_Dynamic_Weather_Interface_C_Update_Cloud_Coverage_from_UDS");
static_assert(offsetof(Ultra_Dynamic_Weather_Interface_C_Update_Cloud_Coverage_from_UDS, Cloud_Coverage) == 0x000000, "Member 'Ultra_Dynamic_Weather_Interface_C_Update_Cloud_Coverage_from_UDS::Cloud_Coverage' has a wrong offset!");

}

