#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UniversalMarkerSystem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UniversalMarkerSystem.UniversalMarkerSystem_C.BndEvt__LootPoint_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct UniversalMarkerSystem_C_BndEvt__LootPoint_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(UniversalMarkerSystem_C_BndEvt__LootPoint_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on UniversalMarkerSystem_C_BndEvt__LootPoint_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(UniversalMarkerSystem_C_BndEvt__LootPoint_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on UniversalMarkerSystem_C_BndEvt__LootPoint_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(UniversalMarkerSystem_C_BndEvt__LootPoint_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'UniversalMarkerSystem_C_BndEvt__LootPoint_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_BndEvt__LootPoint_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'UniversalMarkerSystem_C_BndEvt__LootPoint_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_BndEvt__LootPoint_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'UniversalMarkerSystem_C_BndEvt__LootPoint_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_BndEvt__LootPoint_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'UniversalMarkerSystem_C_BndEvt__LootPoint_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_BndEvt__LootPoint_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'UniversalMarkerSystem_C_BndEvt__LootPoint_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_BndEvt__LootPoint_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'UniversalMarkerSystem_C_BndEvt__LootPoint_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function UniversalMarkerSystem.UniversalMarkerSystem_C.BndEvt__LootPoint_Sphere_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct UniversalMarkerSystem_C_BndEvt__LootPoint_Sphere_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UniversalMarkerSystem_C_BndEvt__LootPoint_Sphere_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on UniversalMarkerSystem_C_BndEvt__LootPoint_Sphere_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(UniversalMarkerSystem_C_BndEvt__LootPoint_Sphere_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on UniversalMarkerSystem_C_BndEvt__LootPoint_Sphere_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(UniversalMarkerSystem_C_BndEvt__LootPoint_Sphere_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'UniversalMarkerSystem_C_BndEvt__LootPoint_Sphere_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_BndEvt__LootPoint_Sphere_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'UniversalMarkerSystem_C_BndEvt__LootPoint_Sphere_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_BndEvt__LootPoint_Sphere_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'UniversalMarkerSystem_C_BndEvt__LootPoint_Sphere_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_BndEvt__LootPoint_Sphere_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'UniversalMarkerSystem_C_BndEvt__LootPoint_Sphere_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function UniversalMarkerSystem.UniversalMarkerSystem_C.ExecuteUbergraph_UniversalMarkerSystem
// 0x0540 (0x0540 - 0x0000)
struct UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Visible;                        // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue;                    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRenderOpacity_ReturnValue;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue_1;                // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOverlappingActor_ReturnValue;           // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0088(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player_1;            // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AA[0x6];                                      // 0x01AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player_2;            // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_1;        // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F2[0x6];                                      // 0x01F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetParentActor_ReturnValue;               // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue_1;                  // 0x0200(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0208(0x0010)(ConstParm, ReferenceParm)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0218(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue_2;                  // 0x0308(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_MarkerSystemWidget_C*              K2Node_DynamicCast_AsWBP_Marker_System_Widget;     // 0x0310(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue_3;                  // 0x0320(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0328(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0330(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue_1;          // 0x0348(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0360(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0370(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameHUD_C>        K2Node_DynamicCast_AsBPI_Game_HUD;                 // 0x0380(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_391[0x7];                                      // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0398(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsShopWidgetOpen_IsOpen;                  // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_GameHUD_C>        K2Node_DynamicCast_AsBPI_Game_HUD_1;               // 0x03B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStashWidgetOpen_IsStashOpen;            // 0x03C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x03C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C3[0x5];                                      // 0x03C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x03C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x03E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetViewportSize_ReturnValue;              // 0x03E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_ProjectWorldLocationToWidgetPosition_ScreenPosition; // 0x03F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ProjectWorldLocationToWidgetPosition_ReturnValue; // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_409[0x7];                                      // 0x0409(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X;                          // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0431(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0432(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_2;       // 0x0433(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_3;       // 0x0434(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0435(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0436(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0437(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_439[0x7];                                      // 0x0439(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0440(0x00D0)()
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_4;       // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_511[0x7];                                      // 0x0511(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0518(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_Value_ImplicitCast;       // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x0530(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem) == 0x000010, "Wrong alignment on UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem");
static_assert(sizeof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem) == 0x000540, "Wrong size on UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, EntryPoint) == 0x000000, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::EntryPoint' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, Temp_bool_IsClosed_Variable) == 0x000004, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, Temp_bool_Has_Been_Initd_Variable) == 0x000005, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, Temp_bool_Has_Been_Initd_Variable_1) == 0x000006, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, K2Node_CustomEvent_Visible) == 0x00000C, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::K2Node_CustomEvent_Visible' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, CallFunc_GetWidget_ReturnValue) == 0x000010, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::CallFunc_GetWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, CallFunc_GetRenderOpacity_ReturnValue) == 0x000018, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::CallFunc_GetRenderOpacity_ReturnValue' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, CallFunc_K2_SetTimer_ReturnValue) == 0x000020, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, Temp_bool_IsClosed_Variable_1) == 0x000028, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, CallFunc_K2_SetTimer_ReturnValue_1) == 0x000030, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::CallFunc_K2_SetTimer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000038, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, CallFunc_IsOverlappingActor_ReturnValue) == 0x000040, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::CallFunc_IsOverlappingActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000048, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, CallFunc_GetPlayerPawn_ReturnValue) == 0x000060, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000068, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000070, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000078, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000080, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, K2Node_ComponentBoundEvent_bFromSweep) == 0x000084, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, K2Node_ComponentBoundEvent_SweepResult) == 0x000088, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, K2Node_DynamicCast_AsSurvival_Player) == 0x000170, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, K2Node_DynamicCast_bSuccess) == 0x000178, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, K2Node_DynamicCast_AsSurvival_Player_1) == 0x000180, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::K2Node_DynamicCast_AsSurvival_Player_1' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, K2Node_DynamicCast_bSuccess_1) == 0x000188, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, CallFunc_GetController_ReturnValue) == 0x000190, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, CallFunc_IsLocallyControlled_ReturnValue) == 0x000198, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, K2Node_DynamicCast_AsPlayer_Controller) == 0x0001A0, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::K2Node_DynamicCast_AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, K2Node_DynamicCast_bSuccess_2) == 0x0001A8, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, CallFunc_IsValid_ReturnValue) == 0x0001A9, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, CallFunc_GetCameraLocation_ReturnValue) == 0x0001B0, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::CallFunc_GetCameraLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0001C8, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, K2Node_ComponentBoundEvent_OtherActor) == 0x0001D0, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, K2Node_ComponentBoundEvent_OtherComp) == 0x0001D8, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x0001E0, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, K2Node_DynamicCast_AsSurvival_Player_2) == 0x0001E8, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::K2Node_DynamicCast_AsSurvival_Player_2' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, K2Node_DynamicCast_bSuccess_3) == 0x0001F0, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, CallFunc_IsLocallyControlled_ReturnValue_1) == 0x0001F1, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::CallFunc_IsLocallyControlled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, CallFunc_GetParentActor_ReturnValue) == 0x0001F8, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::CallFunc_GetParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, CallFunc_GetWidget_ReturnValue_1) == 0x000200, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::CallFunc_GetWidget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, K2Node_MakeArray_Array) == 0x000208, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, CallFunc_LineTraceSingle_OutHit) == 0x000218, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, CallFunc_LineTraceSingle_ReturnValue) == 0x000300, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, CallFunc_GetWidget_ReturnValue_2) == 0x000308, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::CallFunc_GetWidget_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, K2Node_DynamicCast_AsWBP_Marker_System_Widget) == 0x000310, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::K2Node_DynamicCast_AsWBP_Marker_System_Widget' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, K2Node_DynamicCast_bSuccess_4) == 0x000318, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, CallFunc_GetWidget_ReturnValue_3) == 0x000320, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::CallFunc_GetWidget_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, CallFunc_GetPlayerController_ReturnValue) == 0x000328, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000330, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, CallFunc_GetCameraLocation_ReturnValue_1) == 0x000348, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::CallFunc_GetCameraLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, CallFunc_GetPlayerController_ReturnValue_1) == 0x000360, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, CallFunc_Vector_Distance_ReturnValue) == 0x000368, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, CallFunc_GetHUD_ReturnValue) == 0x000370, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000378, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, K2Node_DynamicCast_AsBPI_Game_HUD) == 0x000380, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::K2Node_DynamicCast_AsBPI_Game_HUD' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, K2Node_DynamicCast_bSuccess_5) == 0x000390, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, CallFunc_MakeVector2D_ReturnValue) == 0x000398, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, CallFunc_IsShopWidgetOpen_IsOpen) == 0x0003A8, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::CallFunc_IsShopWidgetOpen_IsOpen' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, K2Node_DynamicCast_AsBPI_Game_HUD_1) == 0x0003B0, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::K2Node_DynamicCast_AsBPI_Game_HUD_1' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, K2Node_DynamicCast_bSuccess_6) == 0x0003C0, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, CallFunc_IsStashWidgetOpen_IsStashOpen) == 0x0003C1, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::CallFunc_IsStashWidgetOpen_IsStashOpen' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, CallFunc_BooleanOR_ReturnValue) == 0x0003C2, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0003C8, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, CallFunc_GetPlayerController_ReturnValue_2) == 0x0003E0, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, CallFunc_GetViewportSize_ReturnValue) == 0x0003E8, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::CallFunc_GetViewportSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, CallFunc_ProjectWorldLocationToWidgetPosition_ScreenPosition) == 0x0003F8, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::CallFunc_ProjectWorldLocationToWidgetPosition_ScreenPosition' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, CallFunc_ProjectWorldLocationToWidgetPosition_ReturnValue) == 0x000408, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::CallFunc_ProjectWorldLocationToWidgetPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, CallFunc_BreakVector2D_X) == 0x000410, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, CallFunc_BreakVector2D_Y) == 0x000418, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, CallFunc_BreakVector2D_X_1) == 0x000420, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, CallFunc_BreakVector2D_Y_1) == 0x000428, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000430, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000431, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000432, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, CallFunc_Greater_DoubleDouble_ReturnValue_2) == 0x000433, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::CallFunc_Greater_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, CallFunc_Greater_DoubleDouble_ReturnValue_3) == 0x000434, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::CallFunc_Greater_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, CallFunc_BooleanAND_ReturnValue) == 0x000435, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, CallFunc_BooleanAND_ReturnValue_1) == 0x000436, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000437, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, CallFunc_BooleanAND_ReturnValue_2) == 0x000438, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, K2Node_MakeStruct_SlateBrush) == 0x000440, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, CallFunc_Greater_DoubleDouble_ReturnValue_4) == 0x000510, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::CallFunc_Greater_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, CallFunc_MapRangeClamped_ReturnValue) == 0x000518, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, CallFunc_MapRangeClamped_Value_ImplicitCast) == 0x000520, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::CallFunc_MapRangeClamped_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000528, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast) == 0x000530, "Member 'UniversalMarkerSystem_C_ExecuteUbergraph_UniversalMarkerSystem::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast' has a wrong offset!");

// Function UniversalMarkerSystem.UniversalMarkerSystem_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct UniversalMarkerSystem_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UniversalMarkerSystem_C_ReceiveTick) == 0x000004, "Wrong alignment on UniversalMarkerSystem_C_ReceiveTick");
static_assert(sizeof(UniversalMarkerSystem_C_ReceiveTick) == 0x000004, "Wrong size on UniversalMarkerSystem_C_ReceiveTick");
static_assert(offsetof(UniversalMarkerSystem_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'UniversalMarkerSystem_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function UniversalMarkerSystem.UniversalMarkerSystem_C.UserConstructionScript
// 0x0004 (0x0004 - 0x0000)
struct UniversalMarkerSystem_C_UserConstructionScript final
{
public:
	float                                         CallFunc_SetSphereRadius_InSphereRadius_ImplicitCast; // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UniversalMarkerSystem_C_UserConstructionScript) == 0x000004, "Wrong alignment on UniversalMarkerSystem_C_UserConstructionScript");
static_assert(sizeof(UniversalMarkerSystem_C_UserConstructionScript) == 0x000004, "Wrong size on UniversalMarkerSystem_C_UserConstructionScript");
static_assert(offsetof(UniversalMarkerSystem_C_UserConstructionScript, CallFunc_SetSphereRadius_InSphereRadius_ImplicitCast) == 0x000000, "Member 'UniversalMarkerSystem_C_UserConstructionScript::CallFunc_SetSphereRadius_InSphereRadius_ImplicitCast' has a wrong offset!");

// Function UniversalMarkerSystem.UniversalMarkerSystem_C.WidgetVisibility
// 0x0001 (0x0001 - 0x0000)
struct UniversalMarkerSystem_C_WidgetVisibility final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UniversalMarkerSystem_C_WidgetVisibility) == 0x000001, "Wrong alignment on UniversalMarkerSystem_C_WidgetVisibility");
static_assert(sizeof(UniversalMarkerSystem_C_WidgetVisibility) == 0x000001, "Wrong size on UniversalMarkerSystem_C_WidgetVisibility");
static_assert(offsetof(UniversalMarkerSystem_C_WidgetVisibility, Visible) == 0x000000, "Member 'UniversalMarkerSystem_C_WidgetVisibility::Visible' has a wrong offset!");

}

