#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Vehicle_ExhaustController

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Vehicle_ExhaustController.Vehicle_ExhaustController_C.ExecuteUbergraph_Vehicle_ExhaustController
// 0x00F8 (0x00F8 - 0x0000)
struct Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children;           // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USceneComponent*                        CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               K2Node_DynamicCast_AsCascade_Particle_System_Component; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_RPM;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Throttle;                       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Active;                         // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_1;            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children_1;         // 0x00B0(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_Array_Get_Item_1;                         // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               K2Node_DynamicCast_AsCascade_Particle_System_Component_1; // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA[0x2];                                       // 0x00DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_Array_Get_Item_2;                         // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController) == 0x000008, "Wrong alignment on Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController");
static_assert(sizeof(Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController) == 0x0000F8, "Wrong size on Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController");
static_assert(offsetof(Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController, EntryPoint) == 0x000000, "Member 'Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController::EntryPoint' has a wrong offset!");
static_assert(offsetof(Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController, Temp_int_Array_Index_Variable) == 0x000008, "Member 'Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController, Temp_int_Array_Index_Variable_1) == 0x000010, "Member 'Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController, Temp_int_Loop_Counter_Variable_1) == 0x000014, "Member 'Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController, CallFunc_Add_IntInt_ReturnValue_1) == 0x000018, "Member 'Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController, Temp_int_Array_Index_Variable_2) == 0x00001C, "Member 'Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController, CallFunc_GetChildrenComponents_Children) == 0x000020, "Member 'Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController::CallFunc_GetChildrenComponents_Children' has a wrong offset!");
static_assert(offsetof(Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController, CallFunc_Array_Get_Item) == 0x000030, "Member 'Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController, K2Node_DynamicCast_AsCascade_Particle_System_Component) == 0x000040, "Member 'Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController::K2Node_DynamicCast_AsCascade_Particle_System_Component' has a wrong offset!");
static_assert(offsetof(Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController, K2Node_CustomEvent_RPM) == 0x000050, "Member 'Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController::K2Node_CustomEvent_RPM' has a wrong offset!");
static_assert(offsetof(Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController, K2Node_CustomEvent_Throttle) == 0x000058, "Member 'Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController::K2Node_CustomEvent_Throttle' has a wrong offset!");
static_assert(offsetof(Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController, K2Node_CustomEvent_Active) == 0x000060, "Member 'Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController::K2Node_CustomEvent_Active' has a wrong offset!");
static_assert(offsetof(Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController, CallFunc_MapRangeClamped_ReturnValue) == 0x000068, "Member 'Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController, CallFunc_MapRangeClamped_ReturnValue_1) == 0x000070, "Member 'Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController::CallFunc_MapRangeClamped_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController, CallFunc_MakeVector_ReturnValue) == 0x000078, "Member 'Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController, CallFunc_MakeVector_ReturnValue_1) == 0x000090, "Member 'Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController, CallFunc_Array_Add_ReturnValue) == 0x0000A8, "Member 'Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController, CallFunc_GetChildrenComponents_Children_1) == 0x0000B0, "Member 'Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController::CallFunc_GetChildrenComponents_Children_1' has a wrong offset!");
static_assert(offsetof(Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController, Temp_int_Loop_Counter_Variable_2) == 0x0000C0, "Member 'Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController, CallFunc_Array_Get_Item_1) == 0x0000C8, "Member 'Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController, K2Node_DynamicCast_AsCascade_Particle_System_Component_1) == 0x0000D0, "Member 'Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController::K2Node_DynamicCast_AsCascade_Particle_System_Component_1' has a wrong offset!");
static_assert(offsetof(Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController, K2Node_DynamicCast_bSuccess_1) == 0x0000D8, "Member 'Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController, CallFunc_Less_IntInt_ReturnValue) == 0x0000D9, "Member 'Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000DC, "Member 'Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController, CallFunc_Array_Length_ReturnValue_1) == 0x0000E0, "Member 'Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000E4, "Member 'Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController, CallFunc_Array_Get_Item_2) == 0x0000E8, "Member 'Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController, CallFunc_Array_Length_ReturnValue_2) == 0x0000F0, "Member 'Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000F4, "Member 'Vehicle_ExhaustController_C_ExecuteUbergraph_Vehicle_ExhaustController::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");

// Function Vehicle_ExhaustController.Vehicle_ExhaustController_C.UpdateExhaustSmoke
// 0x0018 (0x0018 - 0x0000)
struct Vehicle_ExhaustController_C_UpdateExhaustSmoke final
{
public:
	double                                        RPM;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Throttle;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Active;                                            // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Vehicle_ExhaustController_C_UpdateExhaustSmoke) == 0x000008, "Wrong alignment on Vehicle_ExhaustController_C_UpdateExhaustSmoke");
static_assert(sizeof(Vehicle_ExhaustController_C_UpdateExhaustSmoke) == 0x000018, "Wrong size on Vehicle_ExhaustController_C_UpdateExhaustSmoke");
static_assert(offsetof(Vehicle_ExhaustController_C_UpdateExhaustSmoke, RPM) == 0x000000, "Member 'Vehicle_ExhaustController_C_UpdateExhaustSmoke::RPM' has a wrong offset!");
static_assert(offsetof(Vehicle_ExhaustController_C_UpdateExhaustSmoke, Throttle) == 0x000008, "Member 'Vehicle_ExhaustController_C_UpdateExhaustSmoke::Throttle' has a wrong offset!");
static_assert(offsetof(Vehicle_ExhaustController_C_UpdateExhaustSmoke, Active) == 0x000010, "Member 'Vehicle_ExhaustController_C_UpdateExhaustSmoke::Active' has a wrong offset!");

}

