#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Vehicle_LightController

#include "Basic.hpp"


namespace SDK::Params
{

// Function Vehicle_LightController.Vehicle_LightController_C.ExecuteUbergraph_Vehicle_LightController
// 0x0040 (0x0040 - 0x0000)
struct Vehicle_LightController_C_ExecuteUbergraph_Vehicle_LightController final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children;           // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USceneComponent*                        CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULightComponent*                        K2Node_DynamicCast_AsLight_Component;              // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Vehicle_LightController_C_ExecuteUbergraph_Vehicle_LightController) == 0x000008, "Wrong alignment on Vehicle_LightController_C_ExecuteUbergraph_Vehicle_LightController");
static_assert(sizeof(Vehicle_LightController_C_ExecuteUbergraph_Vehicle_LightController) == 0x000040, "Wrong size on Vehicle_LightController_C_ExecuteUbergraph_Vehicle_LightController");
static_assert(offsetof(Vehicle_LightController_C_ExecuteUbergraph_Vehicle_LightController, EntryPoint) == 0x000000, "Member 'Vehicle_LightController_C_ExecuteUbergraph_Vehicle_LightController::EntryPoint' has a wrong offset!");
static_assert(offsetof(Vehicle_LightController_C_ExecuteUbergraph_Vehicle_LightController, Temp_int_Array_Index_Variable) == 0x000004, "Member 'Vehicle_LightController_C_ExecuteUbergraph_Vehicle_LightController::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Vehicle_LightController_C_ExecuteUbergraph_Vehicle_LightController, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'Vehicle_LightController_C_ExecuteUbergraph_Vehicle_LightController::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Vehicle_LightController_C_ExecuteUbergraph_Vehicle_LightController, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'Vehicle_LightController_C_ExecuteUbergraph_Vehicle_LightController::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Vehicle_LightController_C_ExecuteUbergraph_Vehicle_LightController, CallFunc_GetChildrenComponents_Children) == 0x000010, "Member 'Vehicle_LightController_C_ExecuteUbergraph_Vehicle_LightController::CallFunc_GetChildrenComponents_Children' has a wrong offset!");
static_assert(offsetof(Vehicle_LightController_C_ExecuteUbergraph_Vehicle_LightController, CallFunc_Array_Get_Item) == 0x000020, "Member 'Vehicle_LightController_C_ExecuteUbergraph_Vehicle_LightController::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Vehicle_LightController_C_ExecuteUbergraph_Vehicle_LightController, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'Vehicle_LightController_C_ExecuteUbergraph_Vehicle_LightController::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Vehicle_LightController_C_ExecuteUbergraph_Vehicle_LightController, K2Node_DynamicCast_AsLight_Component) == 0x000030, "Member 'Vehicle_LightController_C_ExecuteUbergraph_Vehicle_LightController::K2Node_DynamicCast_AsLight_Component' has a wrong offset!");
static_assert(offsetof(Vehicle_LightController_C_ExecuteUbergraph_Vehicle_LightController, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'Vehicle_LightController_C_ExecuteUbergraph_Vehicle_LightController::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Vehicle_LightController_C_ExecuteUbergraph_Vehicle_LightController, CallFunc_Less_IntInt_ReturnValue) == 0x000039, "Member 'Vehicle_LightController_C_ExecuteUbergraph_Vehicle_LightController::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Vehicle_LightController_C_ExecuteUbergraph_Vehicle_LightController, CallFunc_Array_Add_ReturnValue) == 0x00003C, "Member 'Vehicle_LightController_C_ExecuteUbergraph_Vehicle_LightController::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function Vehicle_LightController.Vehicle_LightController_C.GetIntensity
// 0x0008 (0x0008 - 0x0000)
struct Vehicle_LightController_C_GetIntensity final
{
public:
	double                                        Param_Intensity;                                   // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Vehicle_LightController_C_GetIntensity) == 0x000008, "Wrong alignment on Vehicle_LightController_C_GetIntensity");
static_assert(sizeof(Vehicle_LightController_C_GetIntensity) == 0x000008, "Wrong size on Vehicle_LightController_C_GetIntensity");
static_assert(offsetof(Vehicle_LightController_C_GetIntensity, Param_Intensity) == 0x000000, "Member 'Vehicle_LightController_C_GetIntensity::Param_Intensity' has a wrong offset!");

// Function Vehicle_LightController.Vehicle_LightController_C.HasActiveLights
// 0x0002 (0x0002 - 0x0000)
struct Vehicle_LightController_C_HasActiveLights final
{
public:
	bool                                          Active;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Vehicle_LightController_C_HasActiveLights) == 0x000001, "Wrong alignment on Vehicle_LightController_C_HasActiveLights");
static_assert(sizeof(Vehicle_LightController_C_HasActiveLights) == 0x000002, "Wrong size on Vehicle_LightController_C_HasActiveLights");
static_assert(offsetof(Vehicle_LightController_C_HasActiveLights, Active) == 0x000000, "Member 'Vehicle_LightController_C_HasActiveLights::Active' has a wrong offset!");
static_assert(offsetof(Vehicle_LightController_C_HasActiveLights, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000001, "Member 'Vehicle_LightController_C_HasActiveLights::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");

// Function Vehicle_LightController.Vehicle_LightController_C.Illuminate
// 0x0030 (0x0030 - 0x0000)
struct Vehicle_LightController_C_Illuminate final
{
public:
	double                                        Param_Intensity;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULightComponent*                        CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetIntensity_NewIntensity_ImplicitCast;   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Vehicle_LightController_C_Illuminate) == 0x000008, "Wrong alignment on Vehicle_LightController_C_Illuminate");
static_assert(sizeof(Vehicle_LightController_C_Illuminate) == 0x000030, "Wrong size on Vehicle_LightController_C_Illuminate");
static_assert(offsetof(Vehicle_LightController_C_Illuminate, Param_Intensity) == 0x000000, "Member 'Vehicle_LightController_C_Illuminate::Param_Intensity' has a wrong offset!");
static_assert(offsetof(Vehicle_LightController_C_Illuminate, CallFunc_NotEqual_DoubleDouble_ReturnValue) == 0x000008, "Member 'Vehicle_LightController_C_Illuminate::CallFunc_NotEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Vehicle_LightController_C_Illuminate, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'Vehicle_LightController_C_Illuminate::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Vehicle_LightController_C_Illuminate, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'Vehicle_LightController_C_Illuminate::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Vehicle_LightController_C_Illuminate, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'Vehicle_LightController_C_Illuminate::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Vehicle_LightController_C_Illuminate, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'Vehicle_LightController_C_Illuminate::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Vehicle_LightController_C_Illuminate, CallFunc_Array_Get_Item) == 0x000020, "Member 'Vehicle_LightController_C_Illuminate::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Vehicle_LightController_C_Illuminate, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'Vehicle_LightController_C_Illuminate::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Vehicle_LightController_C_Illuminate, CallFunc_SetIntensity_NewIntensity_ImplicitCast) == 0x00002C, "Member 'Vehicle_LightController_C_Illuminate::CallFunc_SetIntensity_NewIntensity_ImplicitCast' has a wrong offset!");

}

