#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Vehicle_Wheel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "VehicleSystemPlugin_structs.hpp"
#include "SpeedUnit_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SurfaceEffectConfig_structs.hpp"


namespace SDK::Params
{

// Function Vehicle_Wheel.Vehicle_Wheel_C.Attach
// 0x0005 (0x0005 - 0x0000)
struct Vehicle_Wheel_C_Attach final
{
public:
	bool                                          Param_ResetPosition;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Force;                                             // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Vehicle_Wheel_C_Attach) == 0x000001, "Wrong alignment on Vehicle_Wheel_C_Attach");
static_assert(sizeof(Vehicle_Wheel_C_Attach) == 0x000005, "Wrong size on Vehicle_Wheel_C_Attach");
static_assert(offsetof(Vehicle_Wheel_C_Attach, Param_ResetPosition) == 0x000000, "Member 'Vehicle_Wheel_C_Attach::Param_ResetPosition' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_Attach, Force) == 0x000001, "Member 'Vehicle_Wheel_C_Attach::Force' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_Attach, Temp_bool_Variable) == 0x000002, "Member 'Vehicle_Wheel_C_Attach::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_Attach, Temp_bool_Variable_1) == 0x000003, "Member 'Vehicle_Wheel_C_Attach::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_Attach, K2Node_Select_Default) == 0x000004, "Member 'Vehicle_Wheel_C_Attach::K2Node_Select_Default' has a wrong offset!");

// Function Vehicle_Wheel.Vehicle_Wheel_C.BreakAttachment
// 0x0010 (0x0010 - 0x0000)
struct Vehicle_Wheel_C_BreakAttachment final
{
public:
	class UPrimitiveComponent*                    CallFunc_GetWheelMesh_WheelMesh;                   // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EWheelMode                                    CallFunc_GetWheelMode_ReturnValue;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Vehicle_Wheel_C_BreakAttachment) == 0x000008, "Wrong alignment on Vehicle_Wheel_C_BreakAttachment");
static_assert(sizeof(Vehicle_Wheel_C_BreakAttachment) == 0x000010, "Wrong size on Vehicle_Wheel_C_BreakAttachment");
static_assert(offsetof(Vehicle_Wheel_C_BreakAttachment, CallFunc_GetWheelMesh_WheelMesh) == 0x000000, "Member 'Vehicle_Wheel_C_BreakAttachment::CallFunc_GetWheelMesh_WheelMesh' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_BreakAttachment, CallFunc_GetWheelMode_ReturnValue) == 0x000008, "Member 'Vehicle_Wheel_C_BreakAttachment::CallFunc_GetWheelMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_BreakAttachment, K2Node_SwitchEnum_CmpSuccess) == 0x000009, "Member 'Vehicle_Wheel_C_BreakAttachment::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function Vehicle_Wheel.Vehicle_Wheel_C.CalculateSkidAmount
// 0x0068 (0x0068 - 0x0000)
struct Vehicle_Wheel_C_CalculateSkidAmount final
{
public:
	struct FVector                                WheelVelocity;                                     // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetWheelVelocity_ReturnValue;             // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector3f_X;                          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector3f_Y;                          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector3f_Z;                          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsLocked_isLocked;                     // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSizeXY_ReturnValue;                      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector3f                              CallFunc_BreakVector3f_InVec_ImplicitCast;         // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_A_ImplicitCast;                       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Vehicle_Wheel_C_CalculateSkidAmount) == 0x000008, "Wrong alignment on Vehicle_Wheel_C_CalculateSkidAmount");
static_assert(sizeof(Vehicle_Wheel_C_CalculateSkidAmount) == 0x000068, "Wrong size on Vehicle_Wheel_C_CalculateSkidAmount");
static_assert(offsetof(Vehicle_Wheel_C_CalculateSkidAmount, WheelVelocity) == 0x000000, "Member 'Vehicle_Wheel_C_CalculateSkidAmount::WheelVelocity' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_CalculateSkidAmount, CallFunc_GetWheelVelocity_ReturnValue) == 0x000018, "Member 'Vehicle_Wheel_C_CalculateSkidAmount::CallFunc_GetWheelVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_CalculateSkidAmount, CallFunc_BreakVector3f_X) == 0x000030, "Member 'Vehicle_Wheel_C_CalculateSkidAmount::CallFunc_BreakVector3f_X' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_CalculateSkidAmount, CallFunc_BreakVector3f_Y) == 0x000034, "Member 'Vehicle_Wheel_C_CalculateSkidAmount::CallFunc_BreakVector3f_Y' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_CalculateSkidAmount, CallFunc_BreakVector3f_Z) == 0x000038, "Member 'Vehicle_Wheel_C_CalculateSkidAmount::CallFunc_BreakVector3f_Z' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_CalculateSkidAmount, CallFunc_GetIsLocked_isLocked) == 0x00003C, "Member 'Vehicle_Wheel_C_CalculateSkidAmount::CallFunc_GetIsLocked_isLocked' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_CalculateSkidAmount, CallFunc_Abs_ReturnValue) == 0x000040, "Member 'Vehicle_Wheel_C_CalculateSkidAmount::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_CalculateSkidAmount, CallFunc_VSizeXY_ReturnValue) == 0x000048, "Member 'Vehicle_Wheel_C_CalculateSkidAmount::CallFunc_VSizeXY_ReturnValue' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_CalculateSkidAmount, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000050, "Member 'Vehicle_Wheel_C_CalculateSkidAmount::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_CalculateSkidAmount, CallFunc_BreakVector3f_InVec_ImplicitCast) == 0x000054, "Member 'Vehicle_Wheel_C_CalculateSkidAmount::CallFunc_BreakVector3f_InVec_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_CalculateSkidAmount, CallFunc_Abs_A_ImplicitCast) == 0x000060, "Member 'Vehicle_Wheel_C_CalculateSkidAmount::CallFunc_Abs_A_ImplicitCast' has a wrong offset!");

// Function Vehicle_Wheel.Vehicle_Wheel_C.CalculateSkidDirection
// 0x0168 (0x0168 - 0x0000)
struct Vehicle_Wheel_C_CalculateSkidDirection final
{
public:
	struct FVector                                Velocity;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               WheelForward;                                      // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               MarkDirection;                                     // 0x0030(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          VelocityInverted;                                  // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               RelativeVelocity;                                  // 0x0050(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue_1;            // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_NormalizedDeltaRotator_ReturnValue;       // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               K2Node_Select_Default;                             // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_2;                      // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_2;                     // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_2;                       // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Abs_A_ImplicitCast;                       // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_Value_ImplicitCast;       // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Vehicle_Wheel_C_CalculateSkidDirection) == 0x000008, "Wrong alignment on Vehicle_Wheel_C_CalculateSkidDirection");
static_assert(sizeof(Vehicle_Wheel_C_CalculateSkidDirection) == 0x000168, "Wrong size on Vehicle_Wheel_C_CalculateSkidDirection");
static_assert(offsetof(Vehicle_Wheel_C_CalculateSkidDirection, Velocity) == 0x000000, "Member 'Vehicle_Wheel_C_CalculateSkidDirection::Velocity' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_CalculateSkidDirection, WheelForward) == 0x000018, "Member 'Vehicle_Wheel_C_CalculateSkidDirection::WheelForward' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_CalculateSkidDirection, MarkDirection) == 0x000030, "Member 'Vehicle_Wheel_C_CalculateSkidDirection::MarkDirection' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_CalculateSkidDirection, VelocityInverted) == 0x000048, "Member 'Vehicle_Wheel_C_CalculateSkidDirection::VelocityInverted' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_CalculateSkidDirection, RelativeVelocity) == 0x000050, "Member 'Vehicle_Wheel_C_CalculateSkidDirection::RelativeVelocity' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_CalculateSkidDirection, CallFunc_ComposeRotators_ReturnValue) == 0x000068, "Member 'Vehicle_Wheel_C_CalculateSkidDirection::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_CalculateSkidDirection, CallFunc_BreakRotator_Roll) == 0x000080, "Member 'Vehicle_Wheel_C_CalculateSkidDirection::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_CalculateSkidDirection, CallFunc_BreakRotator_Pitch) == 0x000084, "Member 'Vehicle_Wheel_C_CalculateSkidDirection::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_CalculateSkidDirection, CallFunc_BreakRotator_Yaw) == 0x000088, "Member 'Vehicle_Wheel_C_CalculateSkidDirection::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_CalculateSkidDirection, CallFunc_ComposeRotators_ReturnValue_1) == 0x000090, "Member 'Vehicle_Wheel_C_CalculateSkidDirection::CallFunc_ComposeRotators_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_CalculateSkidDirection, CallFunc_Abs_ReturnValue) == 0x0000A8, "Member 'Vehicle_Wheel_C_CalculateSkidDirection::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_CalculateSkidDirection, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0000B0, "Member 'Vehicle_Wheel_C_CalculateSkidDirection::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_CalculateSkidDirection, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x0000B8, "Member 'Vehicle_Wheel_C_CalculateSkidDirection::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_CalculateSkidDirection, CallFunc_NormalizedDeltaRotator_ReturnValue) == 0x0000D0, "Member 'Vehicle_Wheel_C_CalculateSkidDirection::CallFunc_NormalizedDeltaRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_CalculateSkidDirection, Temp_bool_Variable) == 0x0000E8, "Member 'Vehicle_Wheel_C_CalculateSkidDirection::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_CalculateSkidDirection, K2Node_Select_Default) == 0x0000F0, "Member 'Vehicle_Wheel_C_CalculateSkidDirection::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_CalculateSkidDirection, CallFunc_BreakRotator_Roll_1) == 0x000108, "Member 'Vehicle_Wheel_C_CalculateSkidDirection::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_CalculateSkidDirection, CallFunc_BreakRotator_Pitch_1) == 0x00010C, "Member 'Vehicle_Wheel_C_CalculateSkidDirection::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_CalculateSkidDirection, CallFunc_BreakRotator_Yaw_1) == 0x000110, "Member 'Vehicle_Wheel_C_CalculateSkidDirection::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_CalculateSkidDirection, CallFunc_BreakRotator_Roll_2) == 0x000114, "Member 'Vehicle_Wheel_C_CalculateSkidDirection::CallFunc_BreakRotator_Roll_2' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_CalculateSkidDirection, CallFunc_BreakRotator_Pitch_2) == 0x000118, "Member 'Vehicle_Wheel_C_CalculateSkidDirection::CallFunc_BreakRotator_Pitch_2' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_CalculateSkidDirection, CallFunc_BreakRotator_Yaw_2) == 0x00011C, "Member 'Vehicle_Wheel_C_CalculateSkidDirection::CallFunc_BreakRotator_Yaw_2' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_CalculateSkidDirection, CallFunc_MapRangeClamped_ReturnValue) == 0x000120, "Member 'Vehicle_Wheel_C_CalculateSkidDirection::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_CalculateSkidDirection, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000128, "Member 'Vehicle_Wheel_C_CalculateSkidDirection::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_CalculateSkidDirection, CallFunc_MakeRotator_ReturnValue) == 0x000130, "Member 'Vehicle_Wheel_C_CalculateSkidDirection::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_CalculateSkidDirection, CallFunc_Abs_A_ImplicitCast) == 0x000148, "Member 'Vehicle_Wheel_C_CalculateSkidDirection::CallFunc_Abs_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_CalculateSkidDirection, CallFunc_MapRangeClamped_Value_ImplicitCast) == 0x000150, "Member 'Vehicle_Wheel_C_CalculateSkidDirection::CallFunc_MapRangeClamped_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_CalculateSkidDirection, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x000158, "Member 'Vehicle_Wheel_C_CalculateSkidDirection::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_CalculateSkidDirection, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x000160, "Member 'Vehicle_Wheel_C_CalculateSkidDirection::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");

// Function Vehicle_Wheel.Vehicle_Wheel_C.ChangePassiveState
// 0x0001 (0x0001 - 0x0000)
struct Vehicle_Wheel_C_ChangePassiveState final
{
public:
	bool                                          NewPassive;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Vehicle_Wheel_C_ChangePassiveState) == 0x000001, "Wrong alignment on Vehicle_Wheel_C_ChangePassiveState");
static_assert(sizeof(Vehicle_Wheel_C_ChangePassiveState) == 0x000001, "Wrong size on Vehicle_Wheel_C_ChangePassiveState");
static_assert(offsetof(Vehicle_Wheel_C_ChangePassiveState, NewPassive) == 0x000000, "Member 'Vehicle_Wheel_C_ChangePassiveState::NewPassive' has a wrong offset!");

// Function Vehicle_Wheel.Vehicle_Wheel_C.ChangeStaticMesh
// 0x0070 (0x0070 - 0x0000)
struct Vehicle_Wheel_C_ChangeStaticMesh final
{
public:
	class UStaticMesh*                            NewMesh;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   WheelMeshComp;                                     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         CallFunc_GetVehicleMesh_Mesh;                      // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSimulatingPhysics_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    CallFunc_CreateWheelMesh_NewMesh;                  // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue;                 // 0x0048(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   K2Node_DynamicCast_AsStatic_Mesh_Component;        // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Vehicle_Wheel_C_ChangeStaticMesh) == 0x000008, "Wrong alignment on Vehicle_Wheel_C_ChangeStaticMesh");
static_assert(sizeof(Vehicle_Wheel_C_ChangeStaticMesh) == 0x000070, "Wrong size on Vehicle_Wheel_C_ChangeStaticMesh");
static_assert(offsetof(Vehicle_Wheel_C_ChangeStaticMesh, NewMesh) == 0x000000, "Member 'Vehicle_Wheel_C_ChangeStaticMesh::NewMesh' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_ChangeStaticMesh, WheelMeshComp) == 0x000008, "Member 'Vehicle_Wheel_C_ChangeStaticMesh::WheelMeshComp' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_ChangeStaticMesh, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'Vehicle_Wheel_C_ChangeStaticMesh::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_ChangeStaticMesh, Temp_int_Array_Index_Variable) == 0x000014, "Member 'Vehicle_Wheel_C_ChangeStaticMesh::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_ChangeStaticMesh, CallFunc_IsValid_ReturnValue_1) == 0x000018, "Member 'Vehicle_Wheel_C_ChangeStaticMesh::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_ChangeStaticMesh, CallFunc_IsValid_ReturnValue_2) == 0x000019, "Member 'Vehicle_Wheel_C_ChangeStaticMesh::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_ChangeStaticMesh, CallFunc_GetVehicleMesh_Mesh) == 0x000020, "Member 'Vehicle_Wheel_C_ChangeStaticMesh::CallFunc_GetVehicleMesh_Mesh' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_ChangeStaticMesh, CallFunc_IsSimulatingPhysics_ReturnValue) == 0x000028, "Member 'Vehicle_Wheel_C_ChangeStaticMesh::CallFunc_IsSimulatingPhysics_ReturnValue' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_ChangeStaticMesh, CallFunc_CreateWheelMesh_NewMesh) == 0x000030, "Member 'Vehicle_Wheel_C_ChangeStaticMesh::CallFunc_CreateWheelMesh_NewMesh' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_ChangeStaticMesh, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'Vehicle_Wheel_C_ChangeStaticMesh::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_ChangeStaticMesh, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'Vehicle_Wheel_C_ChangeStaticMesh::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_ChangeStaticMesh, CallFunc_SetStaticMesh_ReturnValue) == 0x000040, "Member 'Vehicle_Wheel_C_ChangeStaticMesh::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_ChangeStaticMesh, CallFunc_GetMaterials_ReturnValue) == 0x000048, "Member 'Vehicle_Wheel_C_ChangeStaticMesh::CallFunc_GetMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_ChangeStaticMesh, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'Vehicle_Wheel_C_ChangeStaticMesh::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_ChangeStaticMesh, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'Vehicle_Wheel_C_ChangeStaticMesh::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_ChangeStaticMesh, K2Node_DynamicCast_AsStatic_Mesh_Component) == 0x000060, "Member 'Vehicle_Wheel_C_ChangeStaticMesh::K2Node_DynamicCast_AsStatic_Mesh_Component' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_ChangeStaticMesh, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'Vehicle_Wheel_C_ChangeStaticMesh::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function Vehicle_Wheel.Vehicle_Wheel_C.CleanupForDestroy
// 0x0001 (0x0001 - 0x0000)
struct Vehicle_Wheel_C_CleanupForDestroy final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Vehicle_Wheel_C_CleanupForDestroy) == 0x000001, "Wrong alignment on Vehicle_Wheel_C_CleanupForDestroy");
static_assert(sizeof(Vehicle_Wheel_C_CleanupForDestroy) == 0x000001, "Wrong size on Vehicle_Wheel_C_CleanupForDestroy");
static_assert(offsetof(Vehicle_Wheel_C_CleanupForDestroy, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'Vehicle_Wheel_C_CleanupForDestroy::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function Vehicle_Wheel.Vehicle_Wheel_C.CleanupSkidParticle
// 0x0001 (0x0001 - 0x0000)
struct Vehicle_Wheel_C_CleanupSkidParticle final
{
public:
	bool                                          CallFunc_GetHasContact_ReturnValue;                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Vehicle_Wheel_C_CleanupSkidParticle) == 0x000001, "Wrong alignment on Vehicle_Wheel_C_CleanupSkidParticle");
static_assert(sizeof(Vehicle_Wheel_C_CleanupSkidParticle) == 0x000001, "Wrong size on Vehicle_Wheel_C_CleanupSkidParticle");
static_assert(offsetof(Vehicle_Wheel_C_CleanupSkidParticle, CallFunc_GetHasContact_ReturnValue) == 0x000000, "Member 'Vehicle_Wheel_C_CleanupSkidParticle::CallFunc_GetHasContact_ReturnValue' has a wrong offset!");

// Function Vehicle_Wheel.Vehicle_Wheel_C.ClearActiveParticle
// 0x0001 (0x0001 - 0x0000)
struct Vehicle_Wheel_C_ClearActiveParticle final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Vehicle_Wheel_C_ClearActiveParticle) == 0x000001, "Wrong alignment on Vehicle_Wheel_C_ClearActiveParticle");
static_assert(sizeof(Vehicle_Wheel_C_ClearActiveParticle) == 0x000001, "Wrong size on Vehicle_Wheel_C_ClearActiveParticle");
static_assert(offsetof(Vehicle_Wheel_C_ClearActiveParticle, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'Vehicle_Wheel_C_ClearActiveParticle::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function Vehicle_Wheel.Vehicle_Wheel_C.Construct
// 0x00B0 (0x00B0 - 0x0000)
struct Vehicle_Wheel_C_Construct final
{
public:
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_GetChildComponent_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVehicle_Wheel_C*                       K2Node_DynamicCast_AsVehicle_Wheel;                // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetRelativeTransform_ReturnValue;         // 0x0020(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_DynamicCast_AsPrimitive_Component;          // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_GetAttachParent_ReturnValue;              // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_DynamicCast_AsPrimitive_Component_1;        // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Vehicle_Wheel_C_Construct) == 0x000010, "Wrong alignment on Vehicle_Wheel_C_Construct");
static_assert(sizeof(Vehicle_Wheel_C_Construct) == 0x0000B0, "Wrong size on Vehicle_Wheel_C_Construct");
static_assert(offsetof(Vehicle_Wheel_C_Construct, CallFunc_Not_PreBool_ReturnValue) == 0x000000, "Member 'Vehicle_Wheel_C_Construct::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_Construct, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'Vehicle_Wheel_C_Construct::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_Construct, CallFunc_GetChildComponent_ReturnValue) == 0x000008, "Member 'Vehicle_Wheel_C_Construct::CallFunc_GetChildComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_Construct, K2Node_DynamicCast_AsVehicle_Wheel) == 0x000010, "Member 'Vehicle_Wheel_C_Construct::K2Node_DynamicCast_AsVehicle_Wheel' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_Construct, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'Vehicle_Wheel_C_Construct::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_Construct, CallFunc_GetRelativeTransform_ReturnValue) == 0x000020, "Member 'Vehicle_Wheel_C_Construct::CallFunc_GetRelativeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_Construct, K2Node_DynamicCast_AsPrimitive_Component) == 0x000080, "Member 'Vehicle_Wheel_C_Construct::K2Node_DynamicCast_AsPrimitive_Component' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_Construct, K2Node_DynamicCast_bSuccess_1) == 0x000088, "Member 'Vehicle_Wheel_C_Construct::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_Construct, CallFunc_GetAttachParent_ReturnValue) == 0x000090, "Member 'Vehicle_Wheel_C_Construct::CallFunc_GetAttachParent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_Construct, K2Node_DynamicCast_AsPrimitive_Component_1) == 0x000098, "Member 'Vehicle_Wheel_C_Construct::K2Node_DynamicCast_AsPrimitive_Component_1' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_Construct, K2Node_DynamicCast_bSuccess_2) == 0x0000A0, "Member 'Vehicle_Wheel_C_Construct::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function Vehicle_Wheel.Vehicle_Wheel_C.CreatePhysConstraints
// 0x0020 (0x0020 - 0x0000)
struct Vehicle_Wheel_C_CreatePhysConstraints final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UVehicleConstraint*                     CallFunc_CreateNewConstraint_VehicleConstraint;    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_1;       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVehicleConstraint*                     CallFunc_CreateNewConstraint_VehicleConstraint_1;  // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Vehicle_Wheel_C_CreatePhysConstraints) == 0x000008, "Wrong alignment on Vehicle_Wheel_C_CreatePhysConstraints");
static_assert(sizeof(Vehicle_Wheel_C_CreatePhysConstraints) == 0x000020, "Wrong size on Vehicle_Wheel_C_CreatePhysConstraints");
static_assert(offsetof(Vehicle_Wheel_C_CreatePhysConstraints, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'Vehicle_Wheel_C_CreatePhysConstraints::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_CreatePhysConstraints, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'Vehicle_Wheel_C_CreatePhysConstraints::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_CreatePhysConstraints, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000002, "Member 'Vehicle_Wheel_C_CreatePhysConstraints::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_CreatePhysConstraints, CallFunc_CreateNewConstraint_VehicleConstraint) == 0x000008, "Member 'Vehicle_Wheel_C_CreatePhysConstraints::CallFunc_CreateNewConstraint_VehicleConstraint' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_CreatePhysConstraints, CallFunc_K2_AttachToComponent_ReturnValue_1) == 0x000010, "Member 'Vehicle_Wheel_C_CreatePhysConstraints::CallFunc_K2_AttachToComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_CreatePhysConstraints, CallFunc_CreateNewConstraint_VehicleConstraint_1) == 0x000018, "Member 'Vehicle_Wheel_C_CreatePhysConstraints::CallFunc_CreateNewConstraint_VehicleConstraint_1' has a wrong offset!");

// Function Vehicle_Wheel.Vehicle_Wheel_C.CreateWheelController
// 0x0070 (0x0070 - 0x0000)
struct Vehicle_Wheel_C_CreateWheelController final
{
public:
	struct FTransform                             CallFunc_GetRelativeTransform_ReturnValue;         // 0x0000(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_CreateNewWheelController_Mesh;            // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Vehicle_Wheel_C_CreateWheelController) == 0x000010, "Wrong alignment on Vehicle_Wheel_C_CreateWheelController");
static_assert(sizeof(Vehicle_Wheel_C_CreateWheelController) == 0x000070, "Wrong size on Vehicle_Wheel_C_CreateWheelController");
static_assert(offsetof(Vehicle_Wheel_C_CreateWheelController, CallFunc_GetRelativeTransform_ReturnValue) == 0x000000, "Member 'Vehicle_Wheel_C_CreateWheelController::CallFunc_GetRelativeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_CreateWheelController, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'Vehicle_Wheel_C_CreateWheelController::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_CreateWheelController, CallFunc_CreateNewWheelController_Mesh) == 0x000068, "Member 'Vehicle_Wheel_C_CreateWheelController::CallFunc_CreateNewWheelController_Mesh' has a wrong offset!");

// Function Vehicle_Wheel.Vehicle_Wheel_C.DebugWarningOrError
// 0x0078 (0x0078 - 0x0000)
struct Vehicle_Wheel_C_DebugWarningOrError final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Error_;                                            // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Vehicle_Wheel_C_DebugWarningOrError) == 0x000008, "Wrong alignment on Vehicle_Wheel_C_DebugWarningOrError");
static_assert(sizeof(Vehicle_Wheel_C_DebugWarningOrError) == 0x000078, "Wrong size on Vehicle_Wheel_C_DebugWarningOrError");
static_assert(offsetof(Vehicle_Wheel_C_DebugWarningOrError, Message) == 0x000000, "Member 'Vehicle_Wheel_C_DebugWarningOrError::Message' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_DebugWarningOrError, Error_) == 0x000010, "Member 'Vehicle_Wheel_C_DebugWarningOrError::Error_' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_DebugWarningOrError, Temp_bool_Variable) == 0x000011, "Member 'Vehicle_Wheel_C_DebugWarningOrError::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_DebugWarningOrError, Temp_struct_Variable) == 0x000014, "Member 'Vehicle_Wheel_C_DebugWarningOrError::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_DebugWarningOrError, Temp_struct_Variable_1) == 0x000024, "Member 'Vehicle_Wheel_C_DebugWarningOrError::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_DebugWarningOrError, CallFunc_GetDisplayName_ReturnValue) == 0x000038, "Member 'Vehicle_Wheel_C_DebugWarningOrError::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_DebugWarningOrError, K2Node_Select_Default) == 0x000048, "Member 'Vehicle_Wheel_C_DebugWarningOrError::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_DebugWarningOrError, CallFunc_Concat_StrStr_ReturnValue) == 0x000058, "Member 'Vehicle_Wheel_C_DebugWarningOrError::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_DebugWarningOrError, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000068, "Member 'Vehicle_Wheel_C_DebugWarningOrError::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");

// Function Vehicle_Wheel.Vehicle_Wheel_C.DestroyPhysConstraints
// 0x0003 (0x0003 - 0x0000)
struct Vehicle_Wheel_C_DestroyPhysConstraints final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Vehicle_Wheel_C_DestroyPhysConstraints) == 0x000001, "Wrong alignment on Vehicle_Wheel_C_DestroyPhysConstraints");
static_assert(sizeof(Vehicle_Wheel_C_DestroyPhysConstraints) == 0x000003, "Wrong size on Vehicle_Wheel_C_DestroyPhysConstraints");
static_assert(offsetof(Vehicle_Wheel_C_DestroyPhysConstraints, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'Vehicle_Wheel_C_DestroyPhysConstraints::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_DestroyPhysConstraints, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'Vehicle_Wheel_C_DestroyPhysConstraints::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_DestroyPhysConstraints, CallFunc_IsValid_ReturnValue_2) == 0x000002, "Member 'Vehicle_Wheel_C_DestroyPhysConstraints::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function Vehicle_Wheel.Vehicle_Wheel_C.Detach
// 0x0001 (0x0001 - 0x0000)
struct Vehicle_Wheel_C_Detach final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Vehicle_Wheel_C_Detach) == 0x000001, "Wrong alignment on Vehicle_Wheel_C_Detach");
static_assert(sizeof(Vehicle_Wheel_C_Detach) == 0x000001, "Wrong size on Vehicle_Wheel_C_Detach");
static_assert(offsetof(Vehicle_Wheel_C_Detach, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'Vehicle_Wheel_C_Detach::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function Vehicle_Wheel.Vehicle_Wheel_C.ExecuteUbergraph_Vehicle_Wheel
// 0x000C (0x000C - 0x0000)
struct Vehicle_Wheel_C_ExecuteUbergraph_Vehicle_Wheel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_NewPassive;                     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Vehicle_Wheel_C_ExecuteUbergraph_Vehicle_Wheel) == 0x000004, "Wrong alignment on Vehicle_Wheel_C_ExecuteUbergraph_Vehicle_Wheel");
static_assert(sizeof(Vehicle_Wheel_C_ExecuteUbergraph_Vehicle_Wheel) == 0x00000C, "Wrong size on Vehicle_Wheel_C_ExecuteUbergraph_Vehicle_Wheel");
static_assert(offsetof(Vehicle_Wheel_C_ExecuteUbergraph_Vehicle_Wheel, EntryPoint) == 0x000000, "Member 'Vehicle_Wheel_C_ExecuteUbergraph_Vehicle_Wheel::EntryPoint' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_ExecuteUbergraph_Vehicle_Wheel, K2Node_CustomEvent_NewPassive) == 0x000004, "Member 'Vehicle_Wheel_C_ExecuteUbergraph_Vehicle_Wheel::K2Node_CustomEvent_NewPassive' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_ExecuteUbergraph_Vehicle_Wheel, K2Node_Event_EndPlayReason) == 0x000005, "Member 'Vehicle_Wheel_C_ExecuteUbergraph_Vehicle_Wheel::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_ExecuteUbergraph_Vehicle_Wheel, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'Vehicle_Wheel_C_ExecuteUbergraph_Vehicle_Wheel::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function Vehicle_Wheel.Vehicle_Wheel_C.GetBrakePressure
// 0x0010 (0x0010 - 0x0000)
struct Vehicle_Wheel_C_GetBrakePressure final
{
public:
	double                                        BrakePressure;                                     // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_FunctionResult_BrakePressure_ImplicitCast;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Vehicle_Wheel_C_GetBrakePressure) == 0x000008, "Wrong alignment on Vehicle_Wheel_C_GetBrakePressure");
static_assert(sizeof(Vehicle_Wheel_C_GetBrakePressure) == 0x000010, "Wrong size on Vehicle_Wheel_C_GetBrakePressure");
static_assert(offsetof(Vehicle_Wheel_C_GetBrakePressure, BrakePressure) == 0x000000, "Member 'Vehicle_Wheel_C_GetBrakePressure::BrakePressure' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_GetBrakePressure, K2Node_FunctionResult_BrakePressure_ImplicitCast) == 0x000008, "Member 'Vehicle_Wheel_C_GetBrakePressure::K2Node_FunctionResult_BrakePressure_ImplicitCast' has a wrong offset!");

// Function Vehicle_Wheel.Vehicle_Wheel_C.GetConstraints
// 0x0010 (0x0010 - 0x0000)
struct Vehicle_Wheel_C_GetConstraints final
{
public:
	class UVehicleConstraint*                     Param_TurnConstraint;                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVehicleConstraint*                     Param_SpringConstraint;                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Vehicle_Wheel_C_GetConstraints) == 0x000008, "Wrong alignment on Vehicle_Wheel_C_GetConstraints");
static_assert(sizeof(Vehicle_Wheel_C_GetConstraints) == 0x000010, "Wrong size on Vehicle_Wheel_C_GetConstraints");
static_assert(offsetof(Vehicle_Wheel_C_GetConstraints, Param_TurnConstraint) == 0x000000, "Member 'Vehicle_Wheel_C_GetConstraints::Param_TurnConstraint' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_GetConstraints, Param_SpringConstraint) == 0x000008, "Member 'Vehicle_Wheel_C_GetConstraints::Param_SpringConstraint' has a wrong offset!");

// Function Vehicle_Wheel.Vehicle_Wheel_C.GetEffectsForSurface
// 0x0058 (0x0058 - 0x0000)
struct Vehicle_Wheel_C_GetEffectsForSurface final
{
public:
	EPhysicalSurface                              Surface;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Param_SkidSound;                                   // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        Param_SkidParticle;                                // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        FoundParticle;                                     // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             FoundSound;                                        // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x1];                                       // 0x002B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSurfaceEffectConfig                   CallFunc_Array_Get_Item;                           // 0x0038(0x0018)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Vehicle_Wheel_C_GetEffectsForSurface) == 0x000008, "Wrong alignment on Vehicle_Wheel_C_GetEffectsForSurface");
static_assert(sizeof(Vehicle_Wheel_C_GetEffectsForSurface) == 0x000058, "Wrong size on Vehicle_Wheel_C_GetEffectsForSurface");
static_assert(offsetof(Vehicle_Wheel_C_GetEffectsForSurface, Surface) == 0x000000, "Member 'Vehicle_Wheel_C_GetEffectsForSurface::Surface' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_GetEffectsForSurface, Param_SkidSound) == 0x000008, "Member 'Vehicle_Wheel_C_GetEffectsForSurface::Param_SkidSound' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_GetEffectsForSurface, Param_SkidParticle) == 0x000010, "Member 'Vehicle_Wheel_C_GetEffectsForSurface::Param_SkidParticle' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_GetEffectsForSurface, FoundParticle) == 0x000018, "Member 'Vehicle_Wheel_C_GetEffectsForSurface::FoundParticle' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_GetEffectsForSurface, FoundSound) == 0x000020, "Member 'Vehicle_Wheel_C_GetEffectsForSurface::FoundSound' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_GetEffectsForSurface, Temp_bool_True_if_break_was_hit_Variable) == 0x000028, "Member 'Vehicle_Wheel_C_GetEffectsForSurface::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_GetEffectsForSurface, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000029, "Member 'Vehicle_Wheel_C_GetEffectsForSurface::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_GetEffectsForSurface, CallFunc_Not_PreBool_ReturnValue) == 0x00002A, "Member 'Vehicle_Wheel_C_GetEffectsForSurface::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_GetEffectsForSurface, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'Vehicle_Wheel_C_GetEffectsForSurface::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_GetEffectsForSurface, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'Vehicle_Wheel_C_GetEffectsForSurface::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_GetEffectsForSurface, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'Vehicle_Wheel_C_GetEffectsForSurface::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_GetEffectsForSurface, CallFunc_Array_Get_Item) == 0x000038, "Member 'Vehicle_Wheel_C_GetEffectsForSurface::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_GetEffectsForSurface, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'Vehicle_Wheel_C_GetEffectsForSurface::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Vehicle_Wheel_C_GetEffectsForSurface, CallFunc_Less_IntInt_ReturnValue) == 0x000054, "Member 'Vehicle_Wheel_C_GetEffectsForSurface::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
