#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VehicleStat

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass VehicleStat.VehicleStat_C
// 0x0050 (0x02D0 - 0x0280)
class UVehicleStat_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             StatInfo;                                          // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             StatName;                                          // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          MainStat;                                          // 0x0298(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Stat_Name;                                         // 0x02A0(0x0018)(Edit, BlueprintVisible)
	class FText                                   Stat_Info;                                         // 0x02B8(0x0018)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_VehicleStat(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetInfo(const class FText& InText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"VehicleStat_C">();
	}
	static class UVehicleStat_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVehicleStat_C>();
	}
};
static_assert(alignof(UVehicleStat_C) == 0x000008, "Wrong alignment on UVehicleStat_C");
static_assert(sizeof(UVehicleStat_C) == 0x0002D0, "Wrong size on UVehicleStat_C");
static_assert(offsetof(UVehicleStat_C, UberGraphFrame) == 0x000280, "Member 'UVehicleStat_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UVehicleStat_C, StatInfo) == 0x000288, "Member 'UVehicleStat_C::StatInfo' has a wrong offset!");
static_assert(offsetof(UVehicleStat_C, StatName) == 0x000290, "Member 'UVehicleStat_C::StatName' has a wrong offset!");
static_assert(offsetof(UVehicleStat_C, MainStat) == 0x000298, "Member 'UVehicleStat_C::MainStat' has a wrong offset!");
static_assert(offsetof(UVehicleStat_C, Stat_Name) == 0x0002A0, "Member 'UVehicleStat_C::Stat_Name' has a wrong offset!");
static_assert(offsetof(UVehicleStat_C, Stat_Info) == 0x0002B8, "Member 'UVehicleStat_C::Stat_Info' has a wrong offset!");

}

