#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VelocityBlend

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct VelocityBlend.VelocityBlend
// 0x0010 (0x0010 - 0x0000)
struct FVelocityBlend final
{
public:
	float                                         F_2_A0C9E5DA40077901CD1543A982F747E9;              // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         B_4_7007D08B40D994FF120C07AC9D1464DD;              // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         L_6_1725724F42A40EA650EB3DB199AE2789;              // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         R_8_0A344B594D4F492893F0C88675AFD701;              // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FVelocityBlend) == 0x000004, "Wrong alignment on FVelocityBlend");
static_assert(sizeof(FVelocityBlend) == 0x000010, "Wrong size on FVelocityBlend");
static_assert(offsetof(FVelocityBlend, F_2_A0C9E5DA40077901CD1543A982F747E9) == 0x000000, "Member 'FVelocityBlend::F_2_A0C9E5DA40077901CD1543A982F747E9' has a wrong offset!");
static_assert(offsetof(FVelocityBlend, B_4_7007D08B40D994FF120C07AC9D1464DD) == 0x000004, "Member 'FVelocityBlend::B_4_7007D08B40D994FF120C07AC9D1464DD' has a wrong offset!");
static_assert(offsetof(FVelocityBlend, L_6_1725724F42A40EA650EB3DB199AE2789) == 0x000008, "Member 'FVelocityBlend::L_6_1725724F42A40EA650EB3DB199AE2789' has a wrong offset!");
static_assert(offsetof(FVelocityBlend, R_8_0A344B594D4F492893F0C88675AFD701) == 0x00000C, "Member 'FVelocityBlend::R_8_0A344B594D4F492893F0C88675AFD701' has a wrong offset!");

}

