#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VoiceMessageSpeaker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass VoiceMessageSpeaker.VoiceMessageSpeaker_C
// 0x0020 (0x02B0 - 0x0290)
class AVoiceMessageSpeaker_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFMODAudioComponent*                    FMODAudio;                                         // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_VoiceMessageSpeaker(int32 EntryPoint);
	void OnEnablePC();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"VoiceMessageSpeaker_C">();
	}
	static class AVoiceMessageSpeaker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AVoiceMessageSpeaker_C>();
	}
};
static_assert(alignof(AVoiceMessageSpeaker_C) == 0x000008, "Wrong alignment on AVoiceMessageSpeaker_C");
static_assert(sizeof(AVoiceMessageSpeaker_C) == 0x0002B0, "Wrong size on AVoiceMessageSpeaker_C");
static_assert(offsetof(AVoiceMessageSpeaker_C, UberGraphFrame) == 0x000290, "Member 'AVoiceMessageSpeaker_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AVoiceMessageSpeaker_C, FMODAudio) == 0x000298, "Member 'AVoiceMessageSpeaker_C::FMODAudio' has a wrong offset!");
static_assert(offsetof(AVoiceMessageSpeaker_C, StaticMesh) == 0x0002A0, "Member 'AVoiceMessageSpeaker_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AVoiceMessageSpeaker_C, DefaultSceneRoot) == 0x0002A8, "Member 'AVoiceMessageSpeaker_C::DefaultSceneRoot' has a wrong offset!");

}

