#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VoiceMessagePCInteract

#include "Basic.hpp"


namespace SDK::Params
{

// Function VoiceMessagePCInteract.VoiceMessagePCInteract_C.CallClientInteractWithWindow
// 0x0010 (0x0010 - 0x0000)
struct VoiceMessagePCInteract_C_CallClientInteractWithWindow final
{
public:
	class FString                                 Param_Text;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(VoiceMessagePCInteract_C_CallClientInteractWithWindow) == 0x000008, "Wrong alignment on VoiceMessagePCInteract_C_CallClientInteractWithWindow");
static_assert(sizeof(VoiceMessagePCInteract_C_CallClientInteractWithWindow) == 0x000010, "Wrong size on VoiceMessagePCInteract_C_CallClientInteractWithWindow");
static_assert(offsetof(VoiceMessagePCInteract_C_CallClientInteractWithWindow, Param_Text) == 0x000000, "Member 'VoiceMessagePCInteract_C_CallClientInteractWithWindow::Param_Text' has a wrong offset!");

// Function VoiceMessagePCInteract.VoiceMessagePCInteract_C.ExecuteUbergraph_VoiceMessagePCInteract
// 0x0040 (0x0040 - 0x0000)
struct VoiceMessagePCInteract_C_ExecuteUbergraph_VoiceMessagePCInteract final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameHUD_C>        K2Node_DynamicCast_AsBPI_Game_HUD;                 // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_PlayerMain_C*                      CallFunc_GetGUI_GUI;                               // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_Event_Text;                                 // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(VoiceMessagePCInteract_C_ExecuteUbergraph_VoiceMessagePCInteract) == 0x000008, "Wrong alignment on VoiceMessagePCInteract_C_ExecuteUbergraph_VoiceMessagePCInteract");
static_assert(sizeof(VoiceMessagePCInteract_C_ExecuteUbergraph_VoiceMessagePCInteract) == 0x000040, "Wrong size on VoiceMessagePCInteract_C_ExecuteUbergraph_VoiceMessagePCInteract");
static_assert(offsetof(VoiceMessagePCInteract_C_ExecuteUbergraph_VoiceMessagePCInteract, EntryPoint) == 0x000000, "Member 'VoiceMessagePCInteract_C_ExecuteUbergraph_VoiceMessagePCInteract::EntryPoint' has a wrong offset!");
static_assert(offsetof(VoiceMessagePCInteract_C_ExecuteUbergraph_VoiceMessagePCInteract, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'VoiceMessagePCInteract_C_ExecuteUbergraph_VoiceMessagePCInteract::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceMessagePCInteract_C_ExecuteUbergraph_VoiceMessagePCInteract, K2Node_DynamicCast_AsBPI_Game_HUD) == 0x000010, "Member 'VoiceMessagePCInteract_C_ExecuteUbergraph_VoiceMessagePCInteract::K2Node_DynamicCast_AsBPI_Game_HUD' has a wrong offset!");
static_assert(offsetof(VoiceMessagePCInteract_C_ExecuteUbergraph_VoiceMessagePCInteract, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'VoiceMessagePCInteract_C_ExecuteUbergraph_VoiceMessagePCInteract::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(VoiceMessagePCInteract_C_ExecuteUbergraph_VoiceMessagePCInteract, CallFunc_GetGUI_GUI) == 0x000028, "Member 'VoiceMessagePCInteract_C_ExecuteUbergraph_VoiceMessagePCInteract::CallFunc_GetGUI_GUI' has a wrong offset!");
static_assert(offsetof(VoiceMessagePCInteract_C_ExecuteUbergraph_VoiceMessagePCInteract, K2Node_Event_Text) == 0x000030, "Member 'VoiceMessagePCInteract_C_ExecuteUbergraph_VoiceMessagePCInteract::K2Node_Event_Text' has a wrong offset!");

}

