#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Ammo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "BPE_FireMode_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Ammo.W_Ammo_C
// 0x0088 (0x0308 - 0x0280)
class UW_Ammo_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ExpandArmorPiercingRoundsIcon;                     // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HideAll;                                           // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowAll;                                           // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SwichFireMode;                                     // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowFIreMode;                                      // 0x02A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowAmmo;                                          // 0x02B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             FireMode;                                          // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Ammo;                                // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Content;                             // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_AP;                                      // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_CurrentAmmo;                             // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_TotalAmmo;                               // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_TabsWindow_C*                        TabsWidget;                                        // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          ForcedShowStat;                                    // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           SwitchFireModeTimerHandle;                         // 0x02F8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          AmmoClassShowed;                                   // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_Ammo(int32 EntryPoint);
	void ForcedAllStat(bool Enabled);
	void Hide_AmmoCount();
	void HideAllStat();
	void HideFiremode();
	void PlayAnimation__ByCondition_(class UWidgetAnimation* Animation, EUMGSequencePlayMode PlayMode, bool RestoreState, bool* Result);
	void PreConstruct(bool IsDesignTime);
	void SequenceEvent__ENTRYPOINTW_Ammo();
	void SequenceEvent__ENTRYPOINTW_Ammo_0();
	void SetWeaponStated(bool Damaged);
	void Show_FireMode();
	void ShowAllStat();
	void ShowAmmoClass(bool Show);
	void ShowAmmoCount();
	void StopAnimations(TArray<class UWidgetAnimation*>& Animations);
	void SweitchFireModeBeginTrackEvent();
	void SweitchFireModeEndTrackEvent();
	void SwitchFireType(EBPE_FireMode Param_FireMode);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Ammo_C">();
	}
	static class UW_Ammo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Ammo_C>();
	}
};
static_assert(alignof(UW_Ammo_C) == 0x000008, "Wrong alignment on UW_Ammo_C");
static_assert(sizeof(UW_Ammo_C) == 0x000308, "Wrong size on UW_Ammo_C");
static_assert(offsetof(UW_Ammo_C, UberGraphFrame) == 0x000280, "Member 'UW_Ammo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Ammo_C, ExpandArmorPiercingRoundsIcon) == 0x000288, "Member 'UW_Ammo_C::ExpandArmorPiercingRoundsIcon' has a wrong offset!");
static_assert(offsetof(UW_Ammo_C, HideAll) == 0x000290, "Member 'UW_Ammo_C::HideAll' has a wrong offset!");
static_assert(offsetof(UW_Ammo_C, ShowAll) == 0x000298, "Member 'UW_Ammo_C::ShowAll' has a wrong offset!");
static_assert(offsetof(UW_Ammo_C, SwichFireMode) == 0x0002A0, "Member 'UW_Ammo_C::SwichFireMode' has a wrong offset!");
static_assert(offsetof(UW_Ammo_C, ShowFIreMode) == 0x0002A8, "Member 'UW_Ammo_C::ShowFIreMode' has a wrong offset!");
static_assert(offsetof(UW_Ammo_C, ShowAmmo) == 0x0002B0, "Member 'UW_Ammo_C::ShowAmmo' has a wrong offset!");
static_assert(offsetof(UW_Ammo_C, FireMode) == 0x0002B8, "Member 'UW_Ammo_C::FireMode' has a wrong offset!");
static_assert(offsetof(UW_Ammo_C, HorizontalBox_Ammo) == 0x0002C0, "Member 'UW_Ammo_C::HorizontalBox_Ammo' has a wrong offset!");
static_assert(offsetof(UW_Ammo_C, HorizontalBox_Content) == 0x0002C8, "Member 'UW_Ammo_C::HorizontalBox_Content' has a wrong offset!");
static_assert(offsetof(UW_Ammo_C, TextBlock_AP) == 0x0002D0, "Member 'UW_Ammo_C::TextBlock_AP' has a wrong offset!");
static_assert(offsetof(UW_Ammo_C, TextBlock_CurrentAmmo) == 0x0002D8, "Member 'UW_Ammo_C::TextBlock_CurrentAmmo' has a wrong offset!");
static_assert(offsetof(UW_Ammo_C, TextBlock_TotalAmmo) == 0x0002E0, "Member 'UW_Ammo_C::TextBlock_TotalAmmo' has a wrong offset!");
static_assert(offsetof(UW_Ammo_C, TabsWidget) == 0x0002E8, "Member 'UW_Ammo_C::TabsWidget' has a wrong offset!");
static_assert(offsetof(UW_Ammo_C, ForcedShowStat) == 0x0002F0, "Member 'UW_Ammo_C::ForcedShowStat' has a wrong offset!");
static_assert(offsetof(UW_Ammo_C, SwitchFireModeTimerHandle) == 0x0002F8, "Member 'UW_Ammo_C::SwitchFireModeTimerHandle' has a wrong offset!");
static_assert(offsetof(UW_Ammo_C, AmmoClassShowed) == 0x000300, "Member 'UW_Ammo_C::AmmoClassShowed' has a wrong offset!");

}

