#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_AttachmentSlotForItemInfo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FItemInfo_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_AttachmentSlotForItemInfo.W_AttachmentSlotForItemInfo_C
// 0x0230 (0x04B0 - 0x0280)
class UW_AttachmentSlotForItemInfo_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_Attachment;                                  // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FFItemInfo                             ItemInfo;                                          // 0x0290(0x0220)(Edit, BlueprintVisible, ContainsInstancedReference, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Destruct();
	void ExecuteUbergraph_W_AttachmentSlotForItemInfo(int32 EntryPoint);
	void OnLoaded_C5FD10384E65BA740097389A491EAA64(class UObject* Loaded);
	void PreConstruct(bool IsDesignTime);
	void Reset();
	void SetImage(class UObject* Image);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_AttachmentSlotForItemInfo_C">();
	}
	static class UW_AttachmentSlotForItemInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_AttachmentSlotForItemInfo_C>();
	}
};
static_assert(alignof(UW_AttachmentSlotForItemInfo_C) == 0x000008, "Wrong alignment on UW_AttachmentSlotForItemInfo_C");
static_assert(sizeof(UW_AttachmentSlotForItemInfo_C) == 0x0004B0, "Wrong size on UW_AttachmentSlotForItemInfo_C");
static_assert(offsetof(UW_AttachmentSlotForItemInfo_C, UberGraphFrame) == 0x000280, "Member 'UW_AttachmentSlotForItemInfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_AttachmentSlotForItemInfo_C, Image_Attachment) == 0x000288, "Member 'UW_AttachmentSlotForItemInfo_C::Image_Attachment' has a wrong offset!");
static_assert(offsetof(UW_AttachmentSlotForItemInfo_C, ItemInfo) == 0x000290, "Member 'UW_AttachmentSlotForItemInfo_C::ItemInfo' has a wrong offset!");

}

