#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_AttachmentSlotForItemInfo

#include "Basic.hpp"

#include "FItemInfo_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_AttachmentSlotForItemInfo.W_AttachmentSlotForItemInfo_C.ExecuteUbergraph_W_AttachmentSlotForItemInfo
// 0x0640 (0x0640 - 0x0000)
struct W_AttachmentSlotForItemInfo_C_ExecuteUbergraph_W_AttachmentSlotForItemInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             CallFunc_GetDataTableRowFromName_OutRow;           // 0x0008(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_238[0x8];                                      // 0x0238(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0240(0x00D0)()
	struct FFItemInfo                             K2Node_MakeStruct_FItemInfo;                       // 0x0310(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0530(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_531[0x7];                                      // 0x0531(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Image;                          // 0x0538(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0540(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_541[0xF];                                      // 0x0541(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_1;                    // 0x0550(0x00D0)()
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0620(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0630(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_AttachmentSlotForItemInfo_C_ExecuteUbergraph_W_AttachmentSlotForItemInfo) == 0x000010, "Wrong alignment on W_AttachmentSlotForItemInfo_C_ExecuteUbergraph_W_AttachmentSlotForItemInfo");
static_assert(sizeof(W_AttachmentSlotForItemInfo_C_ExecuteUbergraph_W_AttachmentSlotForItemInfo) == 0x000640, "Wrong size on W_AttachmentSlotForItemInfo_C_ExecuteUbergraph_W_AttachmentSlotForItemInfo");
static_assert(offsetof(W_AttachmentSlotForItemInfo_C_ExecuteUbergraph_W_AttachmentSlotForItemInfo, EntryPoint) == 0x000000, "Member 'W_AttachmentSlotForItemInfo_C_ExecuteUbergraph_W_AttachmentSlotForItemInfo::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_AttachmentSlotForItemInfo_C_ExecuteUbergraph_W_AttachmentSlotForItemInfo, CallFunc_GetDataTableRowFromName_OutRow) == 0x000008, "Member 'W_AttachmentSlotForItemInfo_C_ExecuteUbergraph_W_AttachmentSlotForItemInfo::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(W_AttachmentSlotForItemInfo_C_ExecuteUbergraph_W_AttachmentSlotForItemInfo, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000228, "Member 'W_AttachmentSlotForItemInfo_C_ExecuteUbergraph_W_AttachmentSlotForItemInfo::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_AttachmentSlotForItemInfo_C_ExecuteUbergraph_W_AttachmentSlotForItemInfo, Temp_object_Variable) == 0x000230, "Member 'W_AttachmentSlotForItemInfo_C_ExecuteUbergraph_W_AttachmentSlotForItemInfo::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(W_AttachmentSlotForItemInfo_C_ExecuteUbergraph_W_AttachmentSlotForItemInfo, K2Node_MakeStruct_SlateBrush) == 0x000240, "Member 'W_AttachmentSlotForItemInfo_C_ExecuteUbergraph_W_AttachmentSlotForItemInfo::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(W_AttachmentSlotForItemInfo_C_ExecuteUbergraph_W_AttachmentSlotForItemInfo, K2Node_MakeStruct_FItemInfo) == 0x000310, "Member 'W_AttachmentSlotForItemInfo_C_ExecuteUbergraph_W_AttachmentSlotForItemInfo::K2Node_MakeStruct_FItemInfo' has a wrong offset!");
static_assert(offsetof(W_AttachmentSlotForItemInfo_C_ExecuteUbergraph_W_AttachmentSlotForItemInfo, K2Node_Event_IsDesignTime) == 0x000530, "Member 'W_AttachmentSlotForItemInfo_C_ExecuteUbergraph_W_AttachmentSlotForItemInfo::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_AttachmentSlotForItemInfo_C_ExecuteUbergraph_W_AttachmentSlotForItemInfo, K2Node_CustomEvent_Image) == 0x000538, "Member 'W_AttachmentSlotForItemInfo_C_ExecuteUbergraph_W_AttachmentSlotForItemInfo::K2Node_CustomEvent_Image' has a wrong offset!");
static_assert(offsetof(W_AttachmentSlotForItemInfo_C_ExecuteUbergraph_W_AttachmentSlotForItemInfo, CallFunc_IsValid_ReturnValue) == 0x000540, "Member 'W_AttachmentSlotForItemInfo_C_ExecuteUbergraph_W_AttachmentSlotForItemInfo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_AttachmentSlotForItemInfo_C_ExecuteUbergraph_W_AttachmentSlotForItemInfo, K2Node_MakeStruct_SlateBrush_1) == 0x000550, "Member 'W_AttachmentSlotForItemInfo_C_ExecuteUbergraph_W_AttachmentSlotForItemInfo::K2Node_MakeStruct_SlateBrush_1' has a wrong offset!");
static_assert(offsetof(W_AttachmentSlotForItemInfo_C_ExecuteUbergraph_W_AttachmentSlotForItemInfo, K2Node_CreateDelegate_OutputDelegate) == 0x000620, "Member 'W_AttachmentSlotForItemInfo_C_ExecuteUbergraph_W_AttachmentSlotForItemInfo::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_AttachmentSlotForItemInfo_C_ExecuteUbergraph_W_AttachmentSlotForItemInfo, K2Node_CustomEvent_Loaded) == 0x000630, "Member 'W_AttachmentSlotForItemInfo_C_ExecuteUbergraph_W_AttachmentSlotForItemInfo::K2Node_CustomEvent_Loaded' has a wrong offset!");

// Function W_AttachmentSlotForItemInfo.W_AttachmentSlotForItemInfo_C.OnLoaded_C5FD10384E65BA740097389A491EAA64
// 0x0008 (0x0008 - 0x0000)
struct W_AttachmentSlotForItemInfo_C_OnLoaded_C5FD10384E65BA740097389A491EAA64 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_AttachmentSlotForItemInfo_C_OnLoaded_C5FD10384E65BA740097389A491EAA64) == 0x000008, "Wrong alignment on W_AttachmentSlotForItemInfo_C_OnLoaded_C5FD10384E65BA740097389A491EAA64");
static_assert(sizeof(W_AttachmentSlotForItemInfo_C_OnLoaded_C5FD10384E65BA740097389A491EAA64) == 0x000008, "Wrong size on W_AttachmentSlotForItemInfo_C_OnLoaded_C5FD10384E65BA740097389A491EAA64");
static_assert(offsetof(W_AttachmentSlotForItemInfo_C_OnLoaded_C5FD10384E65BA740097389A491EAA64, Loaded) == 0x000000, "Member 'W_AttachmentSlotForItemInfo_C_OnLoaded_C5FD10384E65BA740097389A491EAA64::Loaded' has a wrong offset!");

// Function W_AttachmentSlotForItemInfo.W_AttachmentSlotForItemInfo_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_AttachmentSlotForItemInfo_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_AttachmentSlotForItemInfo_C_PreConstruct) == 0x000001, "Wrong alignment on W_AttachmentSlotForItemInfo_C_PreConstruct");
static_assert(sizeof(W_AttachmentSlotForItemInfo_C_PreConstruct) == 0x000001, "Wrong size on W_AttachmentSlotForItemInfo_C_PreConstruct");
static_assert(offsetof(W_AttachmentSlotForItemInfo_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_AttachmentSlotForItemInfo_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_AttachmentSlotForItemInfo.W_AttachmentSlotForItemInfo_C.SetImage
// 0x0008 (0x0008 - 0x0000)
struct W_AttachmentSlotForItemInfo_C_SetImage final
{
public:
	class UObject*                                Image;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(W_AttachmentSlotForItemInfo_C_SetImage) == 0x000008, "Wrong alignment on W_AttachmentSlotForItemInfo_C_SetImage");
static_assert(sizeof(W_AttachmentSlotForItemInfo_C_SetImage) == 0x000008, "Wrong size on W_AttachmentSlotForItemInfo_C_SetImage");
static_assert(offsetof(W_AttachmentSlotForItemInfo_C_SetImage, Image) == 0x000000, "Member 'W_AttachmentSlotForItemInfo_C_SetImage::Image' has a wrong offset!");

}

