#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_BaseItemInfo

#include "Basic.hpp"

#include "PickupAttachments_structs.hpp"
#include "BPS_WeaponData_structs.hpp"
#include "ST_WeaponMaxValue_structs.hpp"
#include "SlateCore_structs.hpp"
#include "S_Attachment_structs.hpp"
#include "AttachmentInfo_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FItemInfo_structs.hpp"
#include "ContainerPickupsInfo_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function W_BaseItemInfo.W_BaseItemInfo_C.AddAttachmentEffects
// 0x01A8 (0x01A8 - 0x0000)
struct W_BaseItemInfo_C_AddAttachmentEffects final
{
public:
	double                                        Power;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        EffectiveRange;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Stability;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FIring_Rate;                                       // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PowerModdifu;                                      // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        EffectiveRangeModdifu;                             // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StabilityModdifu;                                  // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FIring_RateModdifu;                                // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxFiring_Rate;                                    // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxStability;                                      // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxEffectiveRange;                                 // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxPower;                                          // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_2;                        // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FST_WeaponMaxValue                     CallFunc_GetDataTableRowFromName_OutRow;           // 0x0090(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_EffectRowForItemInfo_C*              CallFunc_Create_ReturnValue;                       // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_EffectRowForItemInfo_C*              CallFunc_Create_ReturnValue_1;                     // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_EffectRowForItemInfo_C*              CallFunc_Create_ReturnValue_2;                     // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_EffectRowForItemInfo_C*              CallFunc_Create_ReturnValue_3;                     // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_MathExpression_ReturnValue;                 // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_MathExpression_ReturnValue_1;               // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_MathExpression_ReturnValue_2;               // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_MathExpression_ReturnValue_3;               // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_MathExpression_ReturnValue_4;               // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_MathExpression_ReturnValue_5;               // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_MathExpression_ReturnValue_6;               // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_MathExpression_ReturnValue_7;               // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0118(0x0018)(ConstParm)
	struct FMargin                                K2Node_MakeStruct_Margin_3;                        // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable_1;                              // 0x0148(0x0018)(ConstParm)
	class FText                                   Temp_text_Variable_2;                              // 0x0160(0x0018)(ConstParm)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_1;      // 0x0178(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_2;      // 0x0180(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable_3;                              // 0x0188(0x0018)(ConstParm)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_3;      // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_BaseItemInfo_C_AddAttachmentEffects) == 0x000008, "Wrong alignment on W_BaseItemInfo_C_AddAttachmentEffects");
static_assert(sizeof(W_BaseItemInfo_C_AddAttachmentEffects) == 0x0001A8, "Wrong size on W_BaseItemInfo_C_AddAttachmentEffects");
static_assert(offsetof(W_BaseItemInfo_C_AddAttachmentEffects, Power) == 0x000000, "Member 'W_BaseItemInfo_C_AddAttachmentEffects::Power' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttachmentEffects, EffectiveRange) == 0x000008, "Member 'W_BaseItemInfo_C_AddAttachmentEffects::EffectiveRange' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttachmentEffects, Stability) == 0x000010, "Member 'W_BaseItemInfo_C_AddAttachmentEffects::Stability' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttachmentEffects, FIring_Rate) == 0x000018, "Member 'W_BaseItemInfo_C_AddAttachmentEffects::FIring_Rate' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttachmentEffects, PowerModdifu) == 0x000020, "Member 'W_BaseItemInfo_C_AddAttachmentEffects::PowerModdifu' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttachmentEffects, EffectiveRangeModdifu) == 0x000028, "Member 'W_BaseItemInfo_C_AddAttachmentEffects::EffectiveRangeModdifu' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttachmentEffects, StabilityModdifu) == 0x000030, "Member 'W_BaseItemInfo_C_AddAttachmentEffects::StabilityModdifu' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttachmentEffects, FIring_RateModdifu) == 0x000038, "Member 'W_BaseItemInfo_C_AddAttachmentEffects::FIring_RateModdifu' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttachmentEffects, MaxFiring_Rate) == 0x000040, "Member 'W_BaseItemInfo_C_AddAttachmentEffects::MaxFiring_Rate' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttachmentEffects, MaxStability) == 0x000048, "Member 'W_BaseItemInfo_C_AddAttachmentEffects::MaxStability' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttachmentEffects, MaxEffectiveRange) == 0x000050, "Member 'W_BaseItemInfo_C_AddAttachmentEffects::MaxEffectiveRange' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttachmentEffects, MaxPower) == 0x000058, "Member 'W_BaseItemInfo_C_AddAttachmentEffects::MaxPower' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttachmentEffects, K2Node_MakeStruct_Margin) == 0x000060, "Member 'W_BaseItemInfo_C_AddAttachmentEffects::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttachmentEffects, K2Node_MakeStruct_Margin_1) == 0x000070, "Member 'W_BaseItemInfo_C_AddAttachmentEffects::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttachmentEffects, K2Node_MakeStruct_Margin_2) == 0x000080, "Member 'W_BaseItemInfo_C_AddAttachmentEffects::K2Node_MakeStruct_Margin_2' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttachmentEffects, CallFunc_GetDataTableRowFromName_OutRow) == 0x000090, "Member 'W_BaseItemInfo_C_AddAttachmentEffects::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttachmentEffects, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000B0, "Member 'W_BaseItemInfo_C_AddAttachmentEffects::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttachmentEffects, CallFunc_Create_ReturnValue) == 0x0000B8, "Member 'W_BaseItemInfo_C_AddAttachmentEffects::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttachmentEffects, CallFunc_Create_ReturnValue_1) == 0x0000C0, "Member 'W_BaseItemInfo_C_AddAttachmentEffects::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttachmentEffects, CallFunc_Create_ReturnValue_2) == 0x0000C8, "Member 'W_BaseItemInfo_C_AddAttachmentEffects::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttachmentEffects, CallFunc_Create_ReturnValue_3) == 0x0000D0, "Member 'W_BaseItemInfo_C_AddAttachmentEffects::CallFunc_Create_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttachmentEffects, K2Node_MathExpression_ReturnValue) == 0x0000D8, "Member 'W_BaseItemInfo_C_AddAttachmentEffects::K2Node_MathExpression_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttachmentEffects, K2Node_MathExpression_ReturnValue_1) == 0x0000E0, "Member 'W_BaseItemInfo_C_AddAttachmentEffects::K2Node_MathExpression_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttachmentEffects, K2Node_MathExpression_ReturnValue_2) == 0x0000E8, "Member 'W_BaseItemInfo_C_AddAttachmentEffects::K2Node_MathExpression_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttachmentEffects, K2Node_MathExpression_ReturnValue_3) == 0x0000F0, "Member 'W_BaseItemInfo_C_AddAttachmentEffects::K2Node_MathExpression_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttachmentEffects, K2Node_MathExpression_ReturnValue_4) == 0x0000F8, "Member 'W_BaseItemInfo_C_AddAttachmentEffects::K2Node_MathExpression_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttachmentEffects, K2Node_MathExpression_ReturnValue_5) == 0x000100, "Member 'W_BaseItemInfo_C_AddAttachmentEffects::K2Node_MathExpression_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttachmentEffects, K2Node_MathExpression_ReturnValue_6) == 0x000108, "Member 'W_BaseItemInfo_C_AddAttachmentEffects::K2Node_MathExpression_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttachmentEffects, K2Node_MathExpression_ReturnValue_7) == 0x000110, "Member 'W_BaseItemInfo_C_AddAttachmentEffects::K2Node_MathExpression_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttachmentEffects, Temp_text_Variable) == 0x000118, "Member 'W_BaseItemInfo_C_AddAttachmentEffects::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttachmentEffects, K2Node_MakeStruct_Margin_3) == 0x000130, "Member 'W_BaseItemInfo_C_AddAttachmentEffects::K2Node_MakeStruct_Margin_3' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttachmentEffects, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000140, "Member 'W_BaseItemInfo_C_AddAttachmentEffects::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttachmentEffects, Temp_text_Variable_1) == 0x000148, "Member 'W_BaseItemInfo_C_AddAttachmentEffects::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttachmentEffects, Temp_text_Variable_2) == 0x000160, "Member 'W_BaseItemInfo_C_AddAttachmentEffects::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttachmentEffects, CallFunc_AddChildToVerticalBox_ReturnValue_1) == 0x000178, "Member 'W_BaseItemInfo_C_AddAttachmentEffects::CallFunc_AddChildToVerticalBox_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttachmentEffects, CallFunc_AddChildToVerticalBox_ReturnValue_2) == 0x000180, "Member 'W_BaseItemInfo_C_AddAttachmentEffects::CallFunc_AddChildToVerticalBox_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttachmentEffects, Temp_text_Variable_3) == 0x000188, "Member 'W_BaseItemInfo_C_AddAttachmentEffects::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttachmentEffects, CallFunc_AddChildToVerticalBox_ReturnValue_3) == 0x0001A0, "Member 'W_BaseItemInfo_C_AddAttachmentEffects::CallFunc_AddChildToVerticalBox_ReturnValue_3' has a wrong offset!");

// Function W_BaseItemInfo.W_BaseItemInfo_C.AddAttacmentsToGridPanel
// 0x0378 (0x0378 - 0x0000)
struct W_BaseItemInfo_C_AddAttacmentsToGridPanel final
{
public:
	struct FPickupAttachments                     PickupAttachments;                                 // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	class FName                                   WeaponName;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FIring_Rate;                                       // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Stability;                                         // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        EffectiveRange;                                    // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Power;                                             // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasAttachment;                                    // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentSlotIndex;                                  // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAttachmentInfo                        CallFunc_Array_Get_Item;                           // 0x0054(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_Attachment                          CallFunc_GetDataTableRowFromName_OutRow;           // 0x0068(0x0080)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FIndBaseStatsWepaon_Power;                // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FIndBaseStatsWepaon_Effective_Range;      // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FIndBaseStatsWepaon_Stability;            // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFItemInfo                             CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0108(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x033C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0340(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_AttachmentSlotForItemInfo_C*         K2Node_DynamicCast_AsW_Attachment_Slot_for_Item_Info; // 0x0348(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_2;           // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_3;           // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_BaseItemInfo_C_AddAttacmentsToGridPanel) == 0x000008, "Wrong alignment on W_BaseItemInfo_C_AddAttacmentsToGridPanel");
static_assert(sizeof(W_BaseItemInfo_C_AddAttacmentsToGridPanel) == 0x000378, "Wrong size on W_BaseItemInfo_C_AddAttacmentsToGridPanel");
static_assert(offsetof(W_BaseItemInfo_C_AddAttacmentsToGridPanel, PickupAttachments) == 0x000000, "Member 'W_BaseItemInfo_C_AddAttacmentsToGridPanel::PickupAttachments' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttacmentsToGridPanel, WeaponName) == 0x000010, "Member 'W_BaseItemInfo_C_AddAttacmentsToGridPanel::WeaponName' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttacmentsToGridPanel, FIring_Rate) == 0x000018, "Member 'W_BaseItemInfo_C_AddAttacmentsToGridPanel::FIring_Rate' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttacmentsToGridPanel, Stability) == 0x000020, "Member 'W_BaseItemInfo_C_AddAttacmentsToGridPanel::Stability' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttacmentsToGridPanel, EffectiveRange) == 0x000028, "Member 'W_BaseItemInfo_C_AddAttacmentsToGridPanel::EffectiveRange' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttacmentsToGridPanel, Power) == 0x000030, "Member 'W_BaseItemInfo_C_AddAttacmentsToGridPanel::Power' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttacmentsToGridPanel, bHasAttachment) == 0x000038, "Member 'W_BaseItemInfo_C_AddAttacmentsToGridPanel::bHasAttachment' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttacmentsToGridPanel, CurrentSlotIndex) == 0x00003C, "Member 'W_BaseItemInfo_C_AddAttacmentsToGridPanel::CurrentSlotIndex' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttacmentsToGridPanel, Temp_int_Loop_Counter_Variable) == 0x000040, "Member 'W_BaseItemInfo_C_AddAttacmentsToGridPanel::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttacmentsToGridPanel, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'W_BaseItemInfo_C_AddAttacmentsToGridPanel::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttacmentsToGridPanel, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'W_BaseItemInfo_C_AddAttacmentsToGridPanel::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttacmentsToGridPanel, CallFunc_Less_IntInt_ReturnValue) == 0x00004C, "Member 'W_BaseItemInfo_C_AddAttacmentsToGridPanel::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttacmentsToGridPanel, Temp_int_Array_Index_Variable) == 0x000050, "Member 'W_BaseItemInfo_C_AddAttacmentsToGridPanel::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttacmentsToGridPanel, CallFunc_Array_Get_Item) == 0x000054, "Member 'W_BaseItemInfo_C_AddAttacmentsToGridPanel::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttacmentsToGridPanel, CallFunc_GetDataTableRowFromName_OutRow) == 0x000068, "Member 'W_BaseItemInfo_C_AddAttacmentsToGridPanel::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttacmentsToGridPanel, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000E8, "Member 'W_BaseItemInfo_C_AddAttacmentsToGridPanel::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttacmentsToGridPanel, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000E9, "Member 'W_BaseItemInfo_C_AddAttacmentsToGridPanel::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttacmentsToGridPanel, CallFunc_FIndBaseStatsWepaon_Power) == 0x0000F0, "Member 'W_BaseItemInfo_C_AddAttacmentsToGridPanel::CallFunc_FIndBaseStatsWepaon_Power' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttacmentsToGridPanel, CallFunc_FIndBaseStatsWepaon_Effective_Range) == 0x0000F8, "Member 'W_BaseItemInfo_C_AddAttacmentsToGridPanel::CallFunc_FIndBaseStatsWepaon_Effective_Range' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttacmentsToGridPanel, CallFunc_FIndBaseStatsWepaon_Stability) == 0x000100, "Member 'W_BaseItemInfo_C_AddAttacmentsToGridPanel::CallFunc_FIndBaseStatsWepaon_Stability' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttacmentsToGridPanel, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000108, "Member 'W_BaseItemInfo_C_AddAttacmentsToGridPanel::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttacmentsToGridPanel, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000328, "Member 'W_BaseItemInfo_C_AddAttacmentsToGridPanel::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttacmentsToGridPanel, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000330, "Member 'W_BaseItemInfo_C_AddAttacmentsToGridPanel::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttacmentsToGridPanel, CallFunc_Add_IntInt_ReturnValue_1) == 0x000338, "Member 'W_BaseItemInfo_C_AddAttacmentsToGridPanel::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttacmentsToGridPanel, Temp_int_Variable) == 0x00033C, "Member 'W_BaseItemInfo_C_AddAttacmentsToGridPanel::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttacmentsToGridPanel, CallFunc_GetChildAt_ReturnValue) == 0x000340, "Member 'W_BaseItemInfo_C_AddAttacmentsToGridPanel::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttacmentsToGridPanel, K2Node_DynamicCast_AsW_Attachment_Slot_for_Item_Info) == 0x000348, "Member 'W_BaseItemInfo_C_AddAttacmentsToGridPanel::K2Node_DynamicCast_AsW_Attachment_Slot_for_Item_Info' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttacmentsToGridPanel, K2Node_DynamicCast_bSuccess) == 0x000350, "Member 'W_BaseItemInfo_C_AddAttacmentsToGridPanel::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttacmentsToGridPanel, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000358, "Member 'W_BaseItemInfo_C_AddAttacmentsToGridPanel::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttacmentsToGridPanel, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000360, "Member 'W_BaseItemInfo_C_AddAttacmentsToGridPanel::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttacmentsToGridPanel, CallFunc_Add_DoubleDouble_ReturnValue_2) == 0x000368, "Member 'W_BaseItemInfo_C_AddAttacmentsToGridPanel::CallFunc_Add_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddAttacmentsToGridPanel, CallFunc_Add_DoubleDouble_ReturnValue_3) == 0x000370, "Member 'W_BaseItemInfo_C_AddAttacmentsToGridPanel::CallFunc_Add_DoubleDouble_ReturnValue_3' has a wrong offset!");

// Function W_BaseItemInfo.W_BaseItemInfo_C.AddItemEffects
// 0x0078 (0x0078 - 0x0000)
struct W_BaseItemInfo_C_AddItemEffects final
{
public:
	class UW_EffectRowForItemInfo_C*              CallFunc_Create_ReturnValue;                       // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_EffectRowForItemInfo_C*              CallFunc_Create_ReturnValue_1;                     // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_EffectRowForItemInfo_C*              CallFunc_Create_ReturnValue_2;                     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0018(0x0018)(ConstParm)
	class FText                                   Temp_text_Variable_1;                              // 0x0030(0x0018)(ConstParm)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_1;      // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable_2;                              // 0x0058(0x0018)(ConstParm)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_2;      // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_BaseItemInfo_C_AddItemEffects) == 0x000008, "Wrong alignment on W_BaseItemInfo_C_AddItemEffects");
static_assert(sizeof(W_BaseItemInfo_C_AddItemEffects) == 0x000078, "Wrong size on W_BaseItemInfo_C_AddItemEffects");
static_assert(offsetof(W_BaseItemInfo_C_AddItemEffects, CallFunc_Create_ReturnValue) == 0x000000, "Member 'W_BaseItemInfo_C_AddItemEffects::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddItemEffects, CallFunc_Create_ReturnValue_1) == 0x000008, "Member 'W_BaseItemInfo_C_AddItemEffects::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddItemEffects, CallFunc_Create_ReturnValue_2) == 0x000010, "Member 'W_BaseItemInfo_C_AddItemEffects::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddItemEffects, Temp_text_Variable) == 0x000018, "Member 'W_BaseItemInfo_C_AddItemEffects::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddItemEffects, Temp_text_Variable_1) == 0x000030, "Member 'W_BaseItemInfo_C_AddItemEffects::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddItemEffects, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000048, "Member 'W_BaseItemInfo_C_AddItemEffects::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddItemEffects, CallFunc_AddChildToVerticalBox_ReturnValue_1) == 0x000050, "Member 'W_BaseItemInfo_C_AddItemEffects::CallFunc_AddChildToVerticalBox_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddItemEffects, Temp_text_Variable_2) == 0x000058, "Member 'W_BaseItemInfo_C_AddItemEffects::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_AddItemEffects, CallFunc_AddChildToVerticalBox_ReturnValue_2) == 0x000070, "Member 'W_BaseItemInfo_C_AddItemEffects::CallFunc_AddChildToVerticalBox_ReturnValue_2' has a wrong offset!");

// Function W_BaseItemInfo.W_BaseItemInfo_C.CalculateIndex
// 0x0034 (0x0034 - 0x0000)
struct W_BaseItemInfo_C_CalculateIndex final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Row;                                               // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Column;                                            // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CachedIndex;                                       // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_BaseItemInfo_C_CalculateIndex) == 0x000004, "Wrong alignment on W_BaseItemInfo_C_CalculateIndex");
static_assert(sizeof(W_BaseItemInfo_C_CalculateIndex) == 0x000034, "Wrong size on W_BaseItemInfo_C_CalculateIndex");
static_assert(offsetof(W_BaseItemInfo_C_CalculateIndex, Param_Index) == 0x000000, "Member 'W_BaseItemInfo_C_CalculateIndex::Param_Index' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_CalculateIndex, Row) == 0x000004, "Member 'W_BaseItemInfo_C_CalculateIndex::Row' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_CalculateIndex, Column) == 0x000008, "Member 'W_BaseItemInfo_C_CalculateIndex::Column' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_CalculateIndex, CachedIndex) == 0x00000C, "Member 'W_BaseItemInfo_C_CalculateIndex::CachedIndex' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_CalculateIndex, Temp_int_Variable) == 0x000010, "Member 'W_BaseItemInfo_C_CalculateIndex::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_CalculateIndex, Temp_int_Variable_1) == 0x000014, "Member 'W_BaseItemInfo_C_CalculateIndex::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_CalculateIndex, Temp_int_Variable_2) == 0x000018, "Member 'W_BaseItemInfo_C_CalculateIndex::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_CalculateIndex, CallFunc_Subtract_IntInt_ReturnValue) == 0x00001C, "Member 'W_BaseItemInfo_C_CalculateIndex::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_CalculateIndex, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'W_BaseItemInfo_C_CalculateIndex::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_CalculateIndex, CallFunc_Add_IntInt_ReturnValue_1) == 0x000024, "Member 'W_BaseItemInfo_C_CalculateIndex::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_CalculateIndex, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000028, "Member 'W_BaseItemInfo_C_CalculateIndex::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_CalculateIndex, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'W_BaseItemInfo_C_CalculateIndex::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_CalculateIndex, CallFunc_Less_IntInt_ReturnValue_1) == 0x00002D, "Member 'W_BaseItemInfo_C_CalculateIndex::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_CalculateIndex, CallFunc_Add_IntInt_ReturnValue_2) == 0x000030, "Member 'W_BaseItemInfo_C_CalculateIndex::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");

// Function W_BaseItemInfo.W_BaseItemInfo_C.ExecuteUbergraph_W_BaseItemInfo
// 0x0438 (0x0438 - 0x0000)
struct W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_BaseContainer_C*                     CallFunc_GetParentContainer_ParentContainer;       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_BaseContainer_C*                     CallFunc_GetParentContainer_ParentContainer_1;     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UW_BaseSlot_C* SlotRef, class UW_BaseDragWidget_C* DragWidget)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetEquipmentMark_ReturnValue;             // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FContainerPickupsInfo                  CallFunc_GetPickupInfo_PickupInfo;                 // 0x0030(0x0068)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FFItemInfo                             CallFunc_ConvertPickupItemToItemInfoFunc_ItemInfo; // 0x0098(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x02B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x02BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x02BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x02BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x02BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BE[0x2];                                      // 0x02BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRenderOpacity_ReturnValue;             // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x02C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x02C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C6[0x2];                                      // 0x02C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_BaseSlot_C*                          K2Node_CustomEvent_ItemSlot;                       // 0x02C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_Text;                           // 0x02D0(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x02E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0318(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0330(0x0018)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0349(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x034A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x034B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x034C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x034D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x034E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_6;        // 0x034F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0351(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0352(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x0353(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x0354(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_355[0x3];                                      // 0x0355(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0358(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_7;        // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_369[0x7];                                      // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0370(0x0018)()
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_389[0x7];                                      // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x03B8(0x0018)()
	int32                                         CallFunc_Round_ReturnValue;                        // 0x03D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D4[0x4];                                      // 0x03D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x03D8(0x0018)()
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_BaseContainer_C*                     CallFunc_GetParentContainer_ParentContainer_2;     // 0x03F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_BaseSlot_C*                          K2Node_CustomEvent_SlotRef;                        // 0x0400(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_BaseDragWidget_C*                    K2Node_CustomEvent_DragWidget;                     // 0x0408(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UW_BaseSlot_C* SlotRef, class UW_BaseDragWidget_C* DragWidget)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0410(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UW_BaseSlot_C* SlotRef, class UW_BaseDragWidget_C* DragWidget)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0420(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast;    // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo) == 0x000008, "Wrong alignment on W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo");
static_assert(sizeof(W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo) == 0x000438, "Wrong size on W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo");
static_assert(offsetof(W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo, EntryPoint) == 0x000000, "Member 'W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo, CallFunc_IsValid_ReturnValue_1) == 0x000005, "Member 'W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo, CallFunc_GetParentContainer_ParentContainer) == 0x000008, "Member 'W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo::CallFunc_GetParentContainer_ParentContainer' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo, CallFunc_GetParentContainer_ParentContainer_1) == 0x000010, "Member 'W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo::CallFunc_GetParentContainer_ParentContainer_1' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo, CallFunc_IsValid_ReturnValue_2) == 0x000028, "Member 'W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo, CallFunc_GetEquipmentMark_ReturnValue) == 0x000029, "Member 'W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo::CallFunc_GetEquipmentMark_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo, CallFunc_GetPickupInfo_PickupInfo) == 0x000030, "Member 'W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo::CallFunc_GetPickupInfo_PickupInfo' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo, CallFunc_ConvertPickupItemToItemInfoFunc_ItemInfo) == 0x000098, "Member 'W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo::CallFunc_ConvertPickupItemToItemInfoFunc_ItemInfo' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0002B8, "Member 'W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo, Temp_byte_Variable) == 0x0002B9, "Member 'W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo, Temp_byte_Variable_1) == 0x0002BA, "Member 'W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo, Temp_bool_Variable) == 0x0002BB, "Member 'W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo, CallFunc_Not_PreBool_ReturnValue) == 0x0002BC, "Member 'W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo, CallFunc_Not_PreBool_ReturnValue_1) == 0x0002BD, "Member 'W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo, CallFunc_GetRenderOpacity_ReturnValue) == 0x0002C0, "Member 'W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo::CallFunc_GetRenderOpacity_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x0002C4, "Member 'W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo, CallFunc_Not_PreBool_ReturnValue_2) == 0x0002C5, "Member 'W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo, K2Node_CustomEvent_ItemSlot) == 0x0002C8, "Member 'W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo::K2Node_CustomEvent_ItemSlot' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo, K2Node_CustomEvent_Text) == 0x0002D0, "Member 'W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo::K2Node_CustomEvent_Text' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo, CallFunc_PlayAnimationForward_ReturnValue) == 0x0002E8, "Member 'W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0002F0, "Member 'W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0002F8, "Member 'W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo, CallFunc_Not_PreBool_ReturnValue_3) == 0x000300, "Member 'W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000308, "Member 'W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo, CallFunc_FTrunc_ReturnValue) == 0x000310, "Member 'W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo, CallFunc_FTrunc_ReturnValue_1) == 0x000314, "Member 'W_BaseItemInfo_C_ExecuteUbergraph_W_BaseItemInfo::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
