#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_BaseSplitWidget

#include "Basic.hpp"

#include "ContainerPickupsInfo_structs.hpp"
#include "E_BaseContainerType_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FItemInfo_structs.hpp"
#include "FMODStudio_structs.hpp"


namespace SDK::Params
{

// Function W_BaseSplitWidget.W_BaseSplitWidget_C.BndEvt__W_BaseSplitWidget_Slider_Craft_K2Node_ComponentBoundEvent_6_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_BaseSplitWidget_C_BndEvt__W_BaseSplitWidget_Slider_Craft_K2Node_ComponentBoundEvent_6_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_BaseSplitWidget_C_BndEvt__W_BaseSplitWidget_Slider_Craft_K2Node_ComponentBoundEvent_6_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on W_BaseSplitWidget_C_BndEvt__W_BaseSplitWidget_Slider_Craft_K2Node_ComponentBoundEvent_6_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(W_BaseSplitWidget_C_BndEvt__W_BaseSplitWidget_Slider_Craft_K2Node_ComponentBoundEvent_6_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on W_BaseSplitWidget_C_BndEvt__W_BaseSplitWidget_Slider_Craft_K2Node_ComponentBoundEvent_6_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(W_BaseSplitWidget_C_BndEvt__W_BaseSplitWidget_Slider_Craft_K2Node_ComponentBoundEvent_6_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'W_BaseSplitWidget_C_BndEvt__W_BaseSplitWidget_Slider_Craft_K2Node_ComponentBoundEvent_6_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function W_BaseSplitWidget.W_BaseSplitWidget_C.ExecuteUbergraph_W_BaseSplitWidget
// 0x0590 (0x0590 - 0x0000)
struct W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPaperSprite*                           K2Node_DynamicCast_AsPaper_Sprite;                 // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_MakeBrushFromSprite_ReturnValue;          // 0x0030(0x00D0)()
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0105(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_106[0x2];                                      // 0x0106(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_Value;                          // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue;           // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0120(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0130(0x0018)()
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_2;           // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0158(0x0018)()
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_3;           // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue_1;                      // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue_2;                      // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_4;           // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x0198(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_3;             // 0x01B0(0x0018)()
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_5;           // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x01E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E6[0x2];                                      // 0x01E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_6;           // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FA[0x6];                                      // 0x01FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0208(0x0018)()
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_1;          // 0x0228(0x0018)()
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value;                  // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue_3;                      // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_4;             // 0x0250(0x0018)()
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_5;      // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_2;          // 0x0270(0x0018)()
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_6;      // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_7;      // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_1;     // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_7;           // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FContainerPickupsInfo                  CallFunc_GetDataOfHostedItem_DataOfHostedItem;     // 0x02B8(0x0068)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FFItemInfo                             CallFunc_ConvertPickupItemToItemInfoFunc_ItemInfo; // 0x0320(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0540(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_WSliderValue_ImplicitCast;      // 0x0550(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_554[0x4];                                      // 0x0554(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0558(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x0560(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x0568(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast_1;   // 0x0570(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_WSliderValue_ImplicitCast_1;    // 0x0578(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_WSliderValue_ImplicitCast_2;    // 0x057C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetMaxValue_InValue_ImplicitCast;         // 0x0580(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget) == 0x000010, "Wrong alignment on W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget");
static_assert(sizeof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget) == 0x000590, "Wrong size on W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, EntryPoint) == 0x000000, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000008, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, K2Node_CustomEvent_Loaded) == 0x000010, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, Temp_object_Variable) == 0x000018, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, K2Node_DynamicCast_AsPaper_Sprite) == 0x000020, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::K2Node_DynamicCast_AsPaper_Sprite' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, CallFunc_MakeBrushFromSprite_ReturnValue) == 0x000030, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::CallFunc_MakeBrushFromSprite_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, CallFunc_Round_ReturnValue) == 0x000100, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000104, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000105, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, K2Node_CustomEvent_Value) == 0x000108, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::K2Node_CustomEvent_Value' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000110, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, CallFunc_InRange_FloatFloat_ReturnValue) == 0x000118, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::CallFunc_InRange_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, CallFunc_MakeVector2D_ReturnValue) == 0x000120, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, CallFunc_Conv_IntToText_ReturnValue) == 0x000130, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000148, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, CallFunc_Conv_IntToDouble_ReturnValue_2) == 0x000150, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::CallFunc_Conv_IntToDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000158, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, CallFunc_Conv_IntToDouble_ReturnValue_3) == 0x000170, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::CallFunc_Conv_IntToDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000178, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, CallFunc_Round_ReturnValue_1) == 0x000180, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::CallFunc_Round_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, CallFunc_Round_ReturnValue_2) == 0x000184, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::CallFunc_Round_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, CallFunc_Conv_IntToDouble_ReturnValue_4) == 0x000188, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::CallFunc_Conv_IntToDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, CallFunc_Clamp_ReturnValue) == 0x000190, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, CallFunc_Conv_IntToText_ReturnValue_2) == 0x000198, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::CallFunc_Conv_IntToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, CallFunc_Conv_IntToText_ReturnValue_3) == 0x0001B0, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::CallFunc_Conv_IntToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, CallFunc_PlayEvent2D_ReturnValue) == 0x0001C8, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::CallFunc_PlayEvent2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, CallFunc_Add_IntInt_ReturnValue) == 0x0001D0, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, CallFunc_Conv_IntToDouble_ReturnValue_5) == 0x0001D8, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::CallFunc_Conv_IntToDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, CallFunc_Subtract_IntInt_ReturnValue) == 0x0001E0, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0001E4, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x0001E5, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, CallFunc_FTrunc_ReturnValue) == 0x0001E8, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, CallFunc_Multiply_IntInt_ReturnValue) == 0x0001EC, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, CallFunc_Conv_IntToDouble_ReturnValue_6) == 0x0001F0, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::CallFunc_Conv_IntToDouble_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, CallFunc_Greater_IntInt_ReturnValue) == 0x0001F8, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, K2Node_Event_IsDesignTime) == 0x0001F9, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000200, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000208, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x000220, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, CallFunc_Conv_DoubleToText_ReturnValue_1) == 0x000228, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::CallFunc_Conv_DoubleToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, CallFunc_Multiply_DoubleDouble_ReturnValue_4) == 0x000240, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::CallFunc_Multiply_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, K2Node_ComponentBoundEvent_Value) == 0x000248, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, CallFunc_Round_ReturnValue_3) == 0x00024C, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::CallFunc_Round_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, CallFunc_Conv_IntToText_ReturnValue_4) == 0x000250, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::CallFunc_Conv_IntToText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, CallFunc_Multiply_DoubleDouble_ReturnValue_5) == 0x000268, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::CallFunc_Multiply_DoubleDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, CallFunc_Conv_DoubleToText_ReturnValue_2) == 0x000270, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::CallFunc_Conv_DoubleToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, CallFunc_Multiply_DoubleDouble_ReturnValue_6) == 0x000288, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::CallFunc_Multiply_DoubleDouble_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, CallFunc_Multiply_DoubleDouble_ReturnValue_7) == 0x000290, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::CallFunc_Multiply_DoubleDouble_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, CallFunc_LessEqual_DoubleDouble_ReturnValue_1) == 0x000298, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::CallFunc_LessEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0002A0, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, CallFunc_IsValid_ReturnValue) == 0x0002A8, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, CallFunc_Conv_IntToDouble_ReturnValue_7) == 0x0002B0, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::CallFunc_Conv_IntToDouble_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, CallFunc_GetDataOfHostedItem_DataOfHostedItem) == 0x0002B8, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::CallFunc_GetDataOfHostedItem_DataOfHostedItem' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, CallFunc_ConvertPickupItemToItemInfoFunc_ItemInfo) == 0x000320, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::CallFunc_ConvertPickupItemToItemInfoFunc_ItemInfo' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000540, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, K2Node_VariableSet_WSliderValue_ImplicitCast) == 0x000550, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::K2Node_VariableSet_WSliderValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000558, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x000560, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, CallFunc_Multiply_DoubleDouble_B_ImplicitCast) == 0x000568, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::CallFunc_Multiply_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, CallFunc_Multiply_DoubleDouble_B_ImplicitCast_1) == 0x000570, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::CallFunc_Multiply_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, K2Node_VariableSet_WSliderValue_ImplicitCast_1) == 0x000578, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::K2Node_VariableSet_WSliderValue_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, K2Node_VariableSet_WSliderValue_ImplicitCast_2) == 0x00057C, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::K2Node_VariableSet_WSliderValue_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget, CallFunc_SetMaxValue_InValue_ImplicitCast) == 0x000580, "Member 'W_BaseSplitWidget_C_ExecuteUbergraph_W_BaseSplitWidget::CallFunc_SetMaxValue_InValue_ImplicitCast' has a wrong offset!");

// Function W_BaseSplitWidget.W_BaseSplitWidget_C.Get_Slider_Craft_Value_0
// 0x0008 (0x0008 - 0x0000)
struct W_BaseSplitWidget_C_Get_Slider_Craft_Value_0 final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SliderValue;                                       // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_BaseSplitWidget_C_Get_Slider_Craft_Value_0) == 0x000004, "Wrong alignment on W_BaseSplitWidget_C_Get_Slider_Craft_Value_0");
static_assert(sizeof(W_BaseSplitWidget_C_Get_Slider_Craft_Value_0) == 0x000008, "Wrong size on W_BaseSplitWidget_C_Get_Slider_Craft_Value_0");
static_assert(offsetof(W_BaseSplitWidget_C_Get_Slider_Craft_Value_0, ReturnValue) == 0x000000, "Member 'W_BaseSplitWidget_C_Get_Slider_Craft_Value_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_Get_Slider_Craft_Value_0, SliderValue) == 0x000004, "Member 'W_BaseSplitWidget_C_Get_Slider_Craft_Value_0::SliderValue' has a wrong offset!");

// Function W_BaseSplitWidget.W_BaseSplitWidget_C.OnCounterValueChanged
// 0x0008 (0x0008 - 0x0000)
struct W_BaseSplitWidget_C_OnCounterValueChanged final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_BaseSplitWidget_C_OnCounterValueChanged) == 0x000008, "Wrong alignment on W_BaseSplitWidget_C_OnCounterValueChanged");
static_assert(sizeof(W_BaseSplitWidget_C_OnCounterValueChanged) == 0x000008, "Wrong size on W_BaseSplitWidget_C_OnCounterValueChanged");
static_assert(offsetof(W_BaseSplitWidget_C_OnCounterValueChanged, Value) == 0x000000, "Member 'W_BaseSplitWidget_C_OnCounterValueChanged::Value' has a wrong offset!");

// Function W_BaseSplitWidget.W_BaseSplitWidget_C.OnKeyDown
// 0x0200 (0x0200 - 0x0000)
struct W_BaseSplitWidget_C_OnKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0078(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   PressedKey;                                        // 0x0130(0x0018)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0148(0x00B8)()
};
static_assert(alignof(W_BaseSplitWidget_C_OnKeyDown) == 0x000008, "Wrong alignment on W_BaseSplitWidget_C_OnKeyDown");
static_assert(sizeof(W_BaseSplitWidget_C_OnKeyDown) == 0x000200, "Wrong size on W_BaseSplitWidget_C_OnKeyDown");
static_assert(offsetof(W_BaseSplitWidget_C_OnKeyDown, MyGeometry) == 0x000000, "Member 'W_BaseSplitWidget_C_OnKeyDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_OnKeyDown, InKeyEvent) == 0x000038, "Member 'W_BaseSplitWidget_C_OnKeyDown::InKeyEvent' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_OnKeyDown, ReturnValue) == 0x000078, "Member 'W_BaseSplitWidget_C_OnKeyDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_OnKeyDown, PressedKey) == 0x000130, "Member 'W_BaseSplitWidget_C_OnKeyDown::PressedKey' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_OnKeyDown, CallFunc_Unhandled_ReturnValue) == 0x000148, "Member 'W_BaseSplitWidget_C_OnKeyDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");

// Function W_BaseSplitWidget.W_BaseSplitWidget_C.OnLoaded_F0AAAC4E4253A377D49B7B843E39F351
// 0x0008 (0x0008 - 0x0000)
struct W_BaseSplitWidget_C_OnLoaded_F0AAAC4E4253A377D49B7B843E39F351 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_BaseSplitWidget_C_OnLoaded_F0AAAC4E4253A377D49B7B843E39F351) == 0x000008, "Wrong alignment on W_BaseSplitWidget_C_OnLoaded_F0AAAC4E4253A377D49B7B843E39F351");
static_assert(sizeof(W_BaseSplitWidget_C_OnLoaded_F0AAAC4E4253A377D49B7B843E39F351) == 0x000008, "Wrong size on W_BaseSplitWidget_C_OnLoaded_F0AAAC4E4253A377D49B7B843E39F351");
static_assert(offsetof(W_BaseSplitWidget_C_OnLoaded_F0AAAC4E4253A377D49B7B843E39F351, Loaded) == 0x000000, "Member 'W_BaseSplitWidget_C_OnLoaded_F0AAAC4E4253A377D49B7B843E39F351::Loaded' has a wrong offset!");

// Function W_BaseSplitWidget.W_BaseSplitWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_BaseSplitWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_BaseSplitWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_BaseSplitWidget_C_PreConstruct");
static_assert(sizeof(W_BaseSplitWidget_C_PreConstruct) == 0x000001, "Wrong size on W_BaseSplitWidget_C_PreConstruct");
static_assert(offsetof(W_BaseSplitWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_BaseSplitWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_BaseSplitWidget.W_BaseSplitWidget_C.SplitWidget_OnAcceptFull__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct W_BaseSplitWidget_C_SplitWidget_OnAcceptFull__DelegateSignature final
{
public:
	class UW_BaseSlot_C*                          RecipientSlot;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_BaseContainer_C*                     SenderContainer;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_BaseSplitWidget_C_SplitWidget_OnAcceptFull__DelegateSignature) == 0x000008, "Wrong alignment on W_BaseSplitWidget_C_SplitWidget_OnAcceptFull__DelegateSignature");
static_assert(sizeof(W_BaseSplitWidget_C_SplitWidget_OnAcceptFull__DelegateSignature) == 0x000010, "Wrong size on W_BaseSplitWidget_C_SplitWidget_OnAcceptFull__DelegateSignature");
static_assert(offsetof(W_BaseSplitWidget_C_SplitWidget_OnAcceptFull__DelegateSignature, RecipientSlot) == 0x000000, "Member 'W_BaseSplitWidget_C_SplitWidget_OnAcceptFull__DelegateSignature::RecipientSlot' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_SplitWidget_OnAcceptFull__DelegateSignature, SenderContainer) == 0x000008, "Member 'W_BaseSplitWidget_C_SplitWidget_OnAcceptFull__DelegateSignature::SenderContainer' has a wrong offset!");

// Function W_BaseSplitWidget.W_BaseSplitWidget_C.SplitWidget_OnAcceptSplit__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_BaseSplitWidget_C_SplitWidget_OnAcceptSplit__DelegateSignature final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_BaseSlot_C*                          RecipientSlot;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_BaseContainer_C*                     SenderContainer;                                   // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_BaseSplitWidget_C_SplitWidget_OnAcceptSplit__DelegateSignature) == 0x000008, "Wrong alignment on W_BaseSplitWidget_C_SplitWidget_OnAcceptSplit__DelegateSignature");
static_assert(sizeof(W_BaseSplitWidget_C_SplitWidget_OnAcceptSplit__DelegateSignature) == 0x000018, "Wrong size on W_BaseSplitWidget_C_SplitWidget_OnAcceptSplit__DelegateSignature");
static_assert(offsetof(W_BaseSplitWidget_C_SplitWidget_OnAcceptSplit__DelegateSignature, Count) == 0x000000, "Member 'W_BaseSplitWidget_C_SplitWidget_OnAcceptSplit__DelegateSignature::Count' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_SplitWidget_OnAcceptSplit__DelegateSignature, RecipientSlot) == 0x000008, "Member 'W_BaseSplitWidget_C_SplitWidget_OnAcceptSplit__DelegateSignature::RecipientSlot' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_SplitWidget_OnAcceptSplit__DelegateSignature, SenderContainer) == 0x000010, "Member 'W_BaseSplitWidget_C_SplitWidget_OnAcceptSplit__DelegateSignature::SenderContainer' has a wrong offset!");

// Function W_BaseSplitWidget.W_BaseSplitWidget_C.SplitWidget_OnCancel__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_BaseSplitWidget_C_SplitWidget_OnCancel__DelegateSignature final
{
public:
	class UW_BaseContainer_C*                     SenderContainer;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_BaseSplitWidget_C_SplitWidget_OnCancel__DelegateSignature) == 0x000008, "Wrong alignment on W_BaseSplitWidget_C_SplitWidget_OnCancel__DelegateSignature");
static_assert(sizeof(W_BaseSplitWidget_C_SplitWidget_OnCancel__DelegateSignature) == 0x000008, "Wrong size on W_BaseSplitWidget_C_SplitWidget_OnCancel__DelegateSignature");
static_assert(offsetof(W_BaseSplitWidget_C_SplitWidget_OnCancel__DelegateSignature, SenderContainer) == 0x000000, "Member 'W_BaseSplitWidget_C_SplitWidget_OnCancel__DelegateSignature::SenderContainer' has a wrong offset!");

// Function W_BaseSplitWidget.W_BaseSplitWidget_C.GetSenderContainerType
// 0x0002 (0x0002 - 0x0000)
struct W_BaseSplitWidget_C_GetSenderContainerType final
{
public:
	E_BaseContainerType                           ContainerType;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BaseContainerType                           CallFunc_GetContainerType_ContainerType;           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_BaseSplitWidget_C_GetSenderContainerType) == 0x000001, "Wrong alignment on W_BaseSplitWidget_C_GetSenderContainerType");
static_assert(sizeof(W_BaseSplitWidget_C_GetSenderContainerType) == 0x000002, "Wrong size on W_BaseSplitWidget_C_GetSenderContainerType");
static_assert(offsetof(W_BaseSplitWidget_C_GetSenderContainerType, ContainerType) == 0x000000, "Member 'W_BaseSplitWidget_C_GetSenderContainerType::ContainerType' has a wrong offset!");
static_assert(offsetof(W_BaseSplitWidget_C_GetSenderContainerType, CallFunc_GetContainerType_ContainerType) == 0x000001, "Member 'W_BaseSplitWidget_C_GetSenderContainerType::CallFunc_GetContainerType_ContainerType' has a wrong offset!");

}

