#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_BaseContainer

#include "Basic.hpp"

#include "FItemInfo_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "ContainerPickupsInfo_structs.hpp"
#include "E_BaseContainerType_structs.hpp"
#include "F_SlotSettings_structs.hpp"
#include "InputCore_structs.hpp"
#include "E_SlotStatus_structs.hpp"


namespace SDK::Params
{

// Function W_BaseContainer.W_BaseContainer_C.AddHostedData
// 0x0010 (0x0010 - 0x0000)
struct W_BaseContainer_C_AddHostedData final
{
public:
	class UW_BaseSlot_C*                          Param_Slot;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          RemoveHostFromContainer;                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_BaseContainer_C_AddHostedData) == 0x000008, "Wrong alignment on W_BaseContainer_C_AddHostedData");
static_assert(sizeof(W_BaseContainer_C_AddHostedData) == 0x000010, "Wrong size on W_BaseContainer_C_AddHostedData");
static_assert(offsetof(W_BaseContainer_C_AddHostedData, Param_Slot) == 0x000000, "Member 'W_BaseContainer_C_AddHostedData::Param_Slot' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_AddHostedData, RemoveHostFromContainer) == 0x000008, "Member 'W_BaseContainer_C_AddHostedData::RemoveHostFromContainer' has a wrong offset!");

// Function W_BaseContainer.W_BaseContainer_C.AddItemBySlotIndex
// 0x02C8 (0x02C8 - 0x0000)
struct W_BaseContainer_C_AddItemBySlotIndex final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FContainerPickupsInfo                  Item;                                              // 0x0008(0x0068)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
	struct FFItemInfo                             CallFunc_ConvertPickupItemToItemInfoFunc_ItemInfo; // 0x0070(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0290(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_BaseSlot_C*                          K2Node_DynamicCast_AsW_Base_Slot;                  // 0x0298(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X;                          // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue_1;                      // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_BaseContainer_C_AddItemBySlotIndex) == 0x000008, "Wrong alignment on W_BaseContainer_C_AddItemBySlotIndex");
static_assert(sizeof(W_BaseContainer_C_AddItemBySlotIndex) == 0x0002C8, "Wrong size on W_BaseContainer_C_AddItemBySlotIndex");
static_assert(offsetof(W_BaseContainer_C_AddItemBySlotIndex, Param_Index) == 0x000000, "Member 'W_BaseContainer_C_AddItemBySlotIndex::Param_Index' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_AddItemBySlotIndex, Item) == 0x000008, "Member 'W_BaseContainer_C_AddItemBySlotIndex::Item' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_AddItemBySlotIndex, CallFunc_ConvertPickupItemToItemInfoFunc_ItemInfo) == 0x000070, "Member 'W_BaseContainer_C_AddItemBySlotIndex::CallFunc_ConvertPickupItemToItemInfoFunc_ItemInfo' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_AddItemBySlotIndex, CallFunc_GetChildAt_ReturnValue) == 0x000290, "Member 'W_BaseContainer_C_AddItemBySlotIndex::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_AddItemBySlotIndex, K2Node_DynamicCast_AsW_Base_Slot) == 0x000298, "Member 'W_BaseContainer_C_AddItemBySlotIndex::K2Node_DynamicCast_AsW_Base_Slot' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_AddItemBySlotIndex, K2Node_DynamicCast_bSuccess) == 0x0002A0, "Member 'W_BaseContainer_C_AddItemBySlotIndex::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_AddItemBySlotIndex, CallFunc_BreakVector2D_X) == 0x0002A8, "Member 'W_BaseContainer_C_AddItemBySlotIndex::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_AddItemBySlotIndex, CallFunc_BreakVector2D_Y) == 0x0002B0, "Member 'W_BaseContainer_C_AddItemBySlotIndex::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_AddItemBySlotIndex, CallFunc_Round_ReturnValue) == 0x0002B8, "Member 'W_BaseContainer_C_AddItemBySlotIndex::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_AddItemBySlotIndex, CallFunc_Round_ReturnValue_1) == 0x0002BC, "Member 'W_BaseContainer_C_AddItemBySlotIndex::CallFunc_Round_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_AddItemBySlotIndex, CallFunc_SelectInt_ReturnValue) == 0x0002C0, "Member 'W_BaseContainer_C_AddItemBySlotIndex::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_AddItemBySlotIndex, CallFunc_SelectInt_ReturnValue_1) == 0x0002C4, "Member 'W_BaseContainer_C_AddItemBySlotIndex::CallFunc_SelectInt_ReturnValue_1' has a wrong offset!");

// Function W_BaseContainer.W_BaseContainer_C.AddItemSomewhere
// 0x0500 (0x0500 - 0x0000)
struct W_BaseContainer_C_AddItemSomewhere final
{
public:
	struct FContainerPickupsInfo                  Item;                                              // 0x0000(0x0068)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         NewIndex;                                          // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OldIndex;                                          // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_BaseSlot_C*                          NewSlot;                                           // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanAddItem_Can;                           // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanAddItem_ToStack;                       // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             CallFunc_ConvertPickupItemToItemInfoFunc_ItemInfo; // 0x0080(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSlotIndex_SlotIndex;                   // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue_1;                      // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             CallFunc_ConvertPickupItemToItemInfoFunc_ItemInfo_1; // 0x02C0(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetEmptySlot_EmptySlotFound_;             // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E1[0x7];                                      // 0x04E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_BaseSlot_C*                          CallFunc_GetEmptySlot_SlotRef;                     // 0x04E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_BaseSlot_C*                          CallFunc_GetSlotByItemId_Slot_Ref;                 // 0x04F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSlotByItemId_SlotFound_;               // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_BaseContainer_C_AddItemSomewhere) == 0x000008, "Wrong alignment on W_BaseContainer_C_AddItemSomewhere");
static_assert(sizeof(W_BaseContainer_C_AddItemSomewhere) == 0x000500, "Wrong size on W_BaseContainer_C_AddItemSomewhere");
static_assert(offsetof(W_BaseContainer_C_AddItemSomewhere, Item) == 0x000000, "Member 'W_BaseContainer_C_AddItemSomewhere::Item' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_AddItemSomewhere, NewIndex) == 0x000068, "Member 'W_BaseContainer_C_AddItemSomewhere::NewIndex' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_AddItemSomewhere, OldIndex) == 0x00006C, "Member 'W_BaseContainer_C_AddItemSomewhere::OldIndex' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_AddItemSomewhere, NewSlot) == 0x000070, "Member 'W_BaseContainer_C_AddItemSomewhere::NewSlot' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_AddItemSomewhere, CallFunc_CanAddItem_Can) == 0x000078, "Member 'W_BaseContainer_C_AddItemSomewhere::CallFunc_CanAddItem_Can' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_AddItemSomewhere, CallFunc_CanAddItem_ToStack) == 0x000079, "Member 'W_BaseContainer_C_AddItemSomewhere::CallFunc_CanAddItem_ToStack' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_AddItemSomewhere, CallFunc_ConvertPickupItemToItemInfoFunc_ItemInfo) == 0x000080, "Member 'W_BaseContainer_C_AddItemSomewhere::CallFunc_ConvertPickupItemToItemInfoFunc_ItemInfo' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_AddItemSomewhere, CallFunc_BreakVector2D_X) == 0x0002A0, "Member 'W_BaseContainer_C_AddItemSomewhere::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_AddItemSomewhere, CallFunc_BreakVector2D_Y) == 0x0002A8, "Member 'W_BaseContainer_C_AddItemSomewhere::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_AddItemSomewhere, CallFunc_GetSlotIndex_SlotIndex) == 0x0002B0, "Member 'W_BaseContainer_C_AddItemSomewhere::CallFunc_GetSlotIndex_SlotIndex' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_AddItemSomewhere, CallFunc_Round_ReturnValue) == 0x0002B4, "Member 'W_BaseContainer_C_AddItemSomewhere::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_AddItemSomewhere, CallFunc_Round_ReturnValue_1) == 0x0002B8, "Member 'W_BaseContainer_C_AddItemSomewhere::CallFunc_Round_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_AddItemSomewhere, CallFunc_ConvertPickupItemToItemInfoFunc_ItemInfo_1) == 0x0002C0, "Member 'W_BaseContainer_C_AddItemSomewhere::CallFunc_ConvertPickupItemToItemInfoFunc_ItemInfo_1' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_AddItemSomewhere, CallFunc_GetEmptySlot_EmptySlotFound_) == 0x0004E0, "Member 'W_BaseContainer_C_AddItemSomewhere::CallFunc_GetEmptySlot_EmptySlotFound_' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_AddItemSomewhere, CallFunc_GetEmptySlot_SlotRef) == 0x0004E8, "Member 'W_BaseContainer_C_AddItemSomewhere::CallFunc_GetEmptySlot_SlotRef' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_AddItemSomewhere, CallFunc_GetSlotByItemId_Slot_Ref) == 0x0004F0, "Member 'W_BaseContainer_C_AddItemSomewhere::CallFunc_GetSlotByItemId_Slot_Ref' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_AddItemSomewhere, CallFunc_GetSlotByItemId_SlotFound_) == 0x0004F8, "Member 'W_BaseContainer_C_AddItemSomewhere::CallFunc_GetSlotByItemId_SlotFound_' has a wrong offset!");

// Function W_BaseContainer.W_BaseContainer_C.AddSplitedItemToSlot
// 0x00F8 (0x00F8 - 0x0000)
struct W_BaseContainer_C_AddSplitedItemToSlot final
{
public:
	int32                                         SplitCount;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_BaseSlot_C*                          RecipientSlot;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         RecipientSlotIndex;                                // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SenderSlotIndex;                                   // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FContainerPickupsInfo                  NewItemData;                                       // 0x0018(0x0068)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FContainerPickupsInfo                  K2Node_Copy_ReturnValue;                           // 0x0088(0x0068)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_GetSlotIndex_SlotIndex;                   // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_BaseContainer_C_AddSplitedItemToSlot) == 0x000008, "Wrong alignment on W_BaseContainer_C_AddSplitedItemToSlot");
static_assert(sizeof(W_BaseContainer_C_AddSplitedItemToSlot) == 0x0000F8, "Wrong size on W_BaseContainer_C_AddSplitedItemToSlot");
static_assert(offsetof(W_BaseContainer_C_AddSplitedItemToSlot, SplitCount) == 0x000000, "Member 'W_BaseContainer_C_AddSplitedItemToSlot::SplitCount' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_AddSplitedItemToSlot, RecipientSlot) == 0x000008, "Member 'W_BaseContainer_C_AddSplitedItemToSlot::RecipientSlot' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_AddSplitedItemToSlot, RecipientSlotIndex) == 0x000010, "Member 'W_BaseContainer_C_AddSplitedItemToSlot::RecipientSlotIndex' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_AddSplitedItemToSlot, SenderSlotIndex) == 0x000014, "Member 'W_BaseContainer_C_AddSplitedItemToSlot::SenderSlotIndex' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_AddSplitedItemToSlot, NewItemData) == 0x000018, "Member 'W_BaseContainer_C_AddSplitedItemToSlot::NewItemData' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_AddSplitedItemToSlot, CallFunc_Subtract_IntInt_ReturnValue) == 0x000080, "Member 'W_BaseContainer_C_AddSplitedItemToSlot::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_AddSplitedItemToSlot, K2Node_Copy_ReturnValue) == 0x000088, "Member 'W_BaseContainer_C_AddSplitedItemToSlot::K2Node_Copy_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_AddSplitedItemToSlot, CallFunc_GetSlotIndex_SlotIndex) == 0x0000F0, "Member 'W_BaseContainer_C_AddSplitedItemToSlot::CallFunc_GetSlotIndex_SlotIndex' has a wrong offset!");

// Function W_BaseContainer.W_BaseContainer_C.BindSplitWidgetEvents
// 0x0008 (0x0008 - 0x0000)
struct W_BaseContainer_C_BindSplitWidgetEvents final
{
public:
	class UW_BaseSplitWidget_C*                   SplitWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_BaseContainer_C_BindSplitWidgetEvents) == 0x000008, "Wrong alignment on W_BaseContainer_C_BindSplitWidgetEvents");
static_assert(sizeof(W_BaseContainer_C_BindSplitWidgetEvents) == 0x000008, "Wrong size on W_BaseContainer_C_BindSplitWidgetEvents");
static_assert(offsetof(W_BaseContainer_C_BindSplitWidgetEvents, SplitWidget) == 0x000000, "Member 'W_BaseContainer_C_BindSplitWidgetEvents::SplitWidget' has a wrong offset!");

// Function W_BaseContainer.W_BaseContainer_C.CalculateHighlighterDim
// 0x0088 (0x0088 - 0x0000)
struct W_BaseContainer_C_CalculateHighlighterDim final
{
public:
	TArray<class UW_BaseSlot_C*>                  Slots;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FVector2D                              Dimention;                                         // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_BaseSlot_C*                          CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSlotIndex_SlotIndex;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_BaseSlot_C*                          CallFunc_Array_Get_Item_1;                         // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSlotLocationByIndex_ColumnIndex_;      // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSlotLocationByIndex_RowIndex_;         // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSlotIndex_SlotIndex_1;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSlotLocationByIndex_ColumnIndex__1;    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSlotLocationByIndex_RowIndex__1;       // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_BaseContainer_C_CalculateHighlighterDim) == 0x000008, "Wrong alignment on W_BaseContainer_C_CalculateHighlighterDim");
static_assert(sizeof(W_BaseContainer_C_CalculateHighlighterDim) == 0x000088, "Wrong size on W_BaseContainer_C_CalculateHighlighterDim");
static_assert(offsetof(W_BaseContainer_C_CalculateHighlighterDim, Slots) == 0x000000, "Member 'W_BaseContainer_C_CalculateHighlighterDim::Slots' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_CalculateHighlighterDim, Dimention) == 0x000010, "Member 'W_BaseContainer_C_CalculateHighlighterDim::Dimention' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_CalculateHighlighterDim, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'W_BaseContainer_C_CalculateHighlighterDim::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_CalculateHighlighterDim, CallFunc_Array_Get_Item) == 0x000028, "Member 'W_BaseContainer_C_CalculateHighlighterDim::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_CalculateHighlighterDim, CallFunc_Subtract_IntInt_ReturnValue) == 0x000030, "Member 'W_BaseContainer_C_CalculateHighlighterDim::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_CalculateHighlighterDim, CallFunc_GetSlotIndex_SlotIndex) == 0x000034, "Member 'W_BaseContainer_C_CalculateHighlighterDim::CallFunc_GetSlotIndex_SlotIndex' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_CalculateHighlighterDim, CallFunc_Array_Get_Item_1) == 0x000038, "Member 'W_BaseContainer_C_CalculateHighlighterDim::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_CalculateHighlighterDim, CallFunc_GetSlotLocationByIndex_ColumnIndex_) == 0x000040, "Member 'W_BaseContainer_C_CalculateHighlighterDim::CallFunc_GetSlotLocationByIndex_ColumnIndex_' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_CalculateHighlighterDim, CallFunc_GetSlotLocationByIndex_RowIndex_) == 0x000044, "Member 'W_BaseContainer_C_CalculateHighlighterDim::CallFunc_GetSlotLocationByIndex_RowIndex_' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_CalculateHighlighterDim, CallFunc_GetSlotIndex_SlotIndex_1) == 0x000048, "Member 'W_BaseContainer_C_CalculateHighlighterDim::CallFunc_GetSlotIndex_SlotIndex_1' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_CalculateHighlighterDim, CallFunc_GetSlotLocationByIndex_ColumnIndex__1) == 0x00004C, "Member 'W_BaseContainer_C_CalculateHighlighterDim::CallFunc_GetSlotLocationByIndex_ColumnIndex__1' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_CalculateHighlighterDim, CallFunc_GetSlotLocationByIndex_RowIndex__1) == 0x000050, "Member 'W_BaseContainer_C_CalculateHighlighterDim::CallFunc_GetSlotLocationByIndex_RowIndex__1' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_CalculateHighlighterDim, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000054, "Member 'W_BaseContainer_C_CalculateHighlighterDim::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_CalculateHighlighterDim, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x000058, "Member 'W_BaseContainer_C_CalculateHighlighterDim::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_CalculateHighlighterDim, CallFunc_Add_IntInt_ReturnValue) == 0x00005C, "Member 'W_BaseContainer_C_CalculateHighlighterDim::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_CalculateHighlighterDim, CallFunc_Add_IntInt_ReturnValue_1) == 0x000060, "Member 'W_BaseContainer_C_CalculateHighlighterDim::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_CalculateHighlighterDim, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000068, "Member 'W_BaseContainer_C_CalculateHighlighterDim::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_CalculateHighlighterDim, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000070, "Member 'W_BaseContainer_C_CalculateHighlighterDim::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_CalculateHighlighterDim, CallFunc_MakeVector2D_ReturnValue) == 0x000078, "Member 'W_BaseContainer_C_CalculateHighlighterDim::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

// Function W_BaseContainer.W_BaseContainer_C.CalculateHighlighterPosition
// 0x0070 (0x0070 - 0x0000)
struct W_BaseContainer_C_CalculateHighlighterPosition final
{
public:
	TArray<class UW_BaseSlot_C*>                  HighlightedSlots;                                  // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FVector2D                              ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_BaseSlot_C*                          CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSlotIndex_SlotIndex;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSlotLocationByIndex_ColumnIndex_;      // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSlotLocationByIndex_RowIndex_;         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue_1;            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue_2;            // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue_3;            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_BaseContainer_C_CalculateHighlighterPosition) == 0x000008, "Wrong alignment on W_BaseContainer_C_CalculateHighlighterPosition");
static_assert(sizeof(W_BaseContainer_C_CalculateHighlighterPosition) == 0x000070, "Wrong size on W_BaseContainer_C_CalculateHighlighterPosition");
static_assert(offsetof(W_BaseContainer_C_CalculateHighlighterPosition, HighlightedSlots) == 0x000000, "Member 'W_BaseContainer_C_CalculateHighlighterPosition::HighlightedSlots' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_CalculateHighlighterPosition, ReturnValue) == 0x000010, "Member 'W_BaseContainer_C_CalculateHighlighterPosition::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_CalculateHighlighterPosition, CallFunc_Array_Get_Item) == 0x000020, "Member 'W_BaseContainer_C_CalculateHighlighterPosition::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_CalculateHighlighterPosition, CallFunc_GetSlotIndex_SlotIndex) == 0x000028, "Member 'W_BaseContainer_C_CalculateHighlighterPosition::CallFunc_GetSlotIndex_SlotIndex' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_CalculateHighlighterPosition, CallFunc_GetSlotLocationByIndex_ColumnIndex_) == 0x00002C, "Member 'W_BaseContainer_C_CalculateHighlighterPosition::CallFunc_GetSlotLocationByIndex_ColumnIndex_' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_CalculateHighlighterPosition, CallFunc_GetSlotLocationByIndex_RowIndex_) == 0x000030, "Member 'W_BaseContainer_C_CalculateHighlighterPosition::CallFunc_GetSlotLocationByIndex_RowIndex_' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_CalculateHighlighterPosition, CallFunc_Multiply_IntInt_ReturnValue) == 0x000034, "Member 'W_BaseContainer_C_CalculateHighlighterPosition::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_CalculateHighlighterPosition, CallFunc_Multiply_IntInt_ReturnValue_1) == 0x000038, "Member 'W_BaseContainer_C_CalculateHighlighterPosition::CallFunc_Multiply_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_CalculateHighlighterPosition, CallFunc_Multiply_IntInt_ReturnValue_2) == 0x00003C, "Member 'W_BaseContainer_C_CalculateHighlighterPosition::CallFunc_Multiply_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_CalculateHighlighterPosition, CallFunc_Multiply_IntInt_ReturnValue_3) == 0x000040, "Member 'W_BaseContainer_C_CalculateHighlighterPosition::CallFunc_Multiply_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_CalculateHighlighterPosition, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'W_BaseContainer_C_CalculateHighlighterPosition::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_CalculateHighlighterPosition, CallFunc_Add_IntInt_ReturnValue_1) == 0x000048, "Member 'W_BaseContainer_C_CalculateHighlighterPosition::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_CalculateHighlighterPosition, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000050, "Member 'W_BaseContainer_C_CalculateHighlighterPosition::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_CalculateHighlighterPosition, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000058, "Member 'W_BaseContainer_C_CalculateHighlighterPosition::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_CalculateHighlighterPosition, CallFunc_MakeVector2D_ReturnValue) == 0x000060, "Member 'W_BaseContainer_C_CalculateHighlighterPosition::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

// Function W_BaseContainer.W_BaseContainer_C.Can Drop On Slot
// 0x0050 (0x0050 - 0x0000)
struct W_BaseContainer_C_Can_Drop_On_Slot final
{
public:
	class UW_BaseContainer_C*                     SenderContainer;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_BaseSlot_C*                          RecipientSlot;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Can;                                               // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHostedItemRotate__Rotated;              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_ContainerOwner_C>   K2Node_DynamicCast_AsI_Container_Owner;            // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanDrop_Can;                              // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue;       // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSizeOfHostedItem_X;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSizeOfHostedItem_Y;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindAndCheckTargetLocation_CanDrop;       // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UW_BaseSlot_C*>                  CallFunc_FindAndCheckTargetLocation_TargetSlotsArray; // 0x0038(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_BaseContainer_C_Can_Drop_On_Slot) == 0x000008, "Wrong alignment on W_BaseContainer_C_Can_Drop_On_Slot");
static_assert(sizeof(W_BaseContainer_C_Can_Drop_On_Slot) == 0x000050, "Wrong size on W_BaseContainer_C_Can_Drop_On_Slot");
static_assert(offsetof(W_BaseContainer_C_Can_Drop_On_Slot, SenderContainer) == 0x000000, "Member 'W_BaseContainer_C_Can_Drop_On_Slot::SenderContainer' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_Can_Drop_On_Slot, RecipientSlot) == 0x000008, "Member 'W_BaseContainer_C_Can_Drop_On_Slot::RecipientSlot' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_Can_Drop_On_Slot, Can) == 0x000010, "Member 'W_BaseContainer_C_Can_Drop_On_Slot::Can' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_Can_Drop_On_Slot, CallFunc_IsHostedItemRotate__Rotated) == 0x000011, "Member 'W_BaseContainer_C_Can_Drop_On_Slot::CallFunc_IsHostedItemRotate__Rotated' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_Can_Drop_On_Slot, K2Node_DynamicCast_AsI_Container_Owner) == 0x000018, "Member 'W_BaseContainer_C_Can_Drop_On_Slot::K2Node_DynamicCast_AsI_Container_Owner' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_Can_Drop_On_Slot, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'W_BaseContainer_C_Can_Drop_On_Slot::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_Can_Drop_On_Slot, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'W_BaseContainer_C_Can_Drop_On_Slot::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_Can_Drop_On_Slot, CallFunc_CanDrop_Can) == 0x00002A, "Member 'W_BaseContainer_C_Can_Drop_On_Slot::CallFunc_CanDrop_Can' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_Can_Drop_On_Slot, CallFunc_DoesImplementInterface_ReturnValue) == 0x00002B, "Member 'W_BaseContainer_C_Can_Drop_On_Slot::CallFunc_DoesImplementInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_Can_Drop_On_Slot, CallFunc_GetSizeOfHostedItem_X) == 0x00002C, "Member 'W_BaseContainer_C_Can_Drop_On_Slot::CallFunc_GetSizeOfHostedItem_X' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_Can_Drop_On_Slot, CallFunc_GetSizeOfHostedItem_Y) == 0x000030, "Member 'W_BaseContainer_C_Can_Drop_On_Slot::CallFunc_GetSizeOfHostedItem_Y' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_Can_Drop_On_Slot, CallFunc_FindAndCheckTargetLocation_CanDrop) == 0x000034, "Member 'W_BaseContainer_C_Can_Drop_On_Slot::CallFunc_FindAndCheckTargetLocation_CanDrop' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_Can_Drop_On_Slot, CallFunc_FindAndCheckTargetLocation_TargetSlotsArray) == 0x000038, "Member 'W_BaseContainer_C_Can_Drop_On_Slot::CallFunc_FindAndCheckTargetLocation_TargetSlotsArray' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_Can_Drop_On_Slot, CallFunc_BooleanAND_ReturnValue) == 0x000048, "Member 'W_BaseContainer_C_Can_Drop_On_Slot::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function W_BaseContainer.W_BaseContainer_C.Can Stack On Slot
// 0x0290 (0x0290 - 0x0000)
struct W_BaseContainer_C_Can_Stack_On_Slot final
{
public:
	struct FFItemInfo                             SenderItemInfo;                                    // 0x0000(0x0220)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
	class UW_BaseSlot_C*                          RecipientSlot;                                     // 0x0220(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         ItemSizeX;                                         // 0x0228(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ItemSizeY;                                         // 0x022C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRotated;                                         // 0x0230(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Canstack;                                          // 0x0231(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_232[0x6];                                      // 0x0232(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UW_BaseSlot_C*>                  TargetSlotsArray;                                  // 0x0238(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<class UW_BaseSlot_C*>                  SlotsArray;                                        // 0x0248(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSlotIndex_SlotIndex;                   // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemId_ItemID;                         // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UW_BaseSlot_C*>                  CallFunc_FindEnvirons_Slots;                       // 0x0270(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_281[0x3];                                      // 0x0281(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCount_MaxStack;                        // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCount_Count;                           // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanStack_CanStack;                        // 0x028C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x028D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_BaseContainer_C_Can_Stack_On_Slot) == 0x000008, "Wrong alignment on W_BaseContainer_C_Can_Stack_On_Slot");
static_assert(sizeof(W_BaseContainer_C_Can_Stack_On_Slot) == 0x000290, "Wrong size on W_BaseContainer_C_Can_Stack_On_Slot");
static_assert(offsetof(W_BaseContainer_C_Can_Stack_On_Slot, SenderItemInfo) == 0x000000, "Member 'W_BaseContainer_C_Can_Stack_On_Slot::SenderItemInfo' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_Can_Stack_On_Slot, RecipientSlot) == 0x000220, "Member 'W_BaseContainer_C_Can_Stack_On_Slot::RecipientSlot' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_Can_Stack_On_Slot, ItemSizeX) == 0x000228, "Member 'W_BaseContainer_C_Can_Stack_On_Slot::ItemSizeX' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_Can_Stack_On_Slot, ItemSizeY) == 0x00022C, "Member 'W_BaseContainer_C_Can_Stack_On_Slot::ItemSizeY' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_Can_Stack_On_Slot, IsRotated) == 0x000230, "Member 'W_BaseContainer_C_Can_Stack_On_Slot::IsRotated' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_Can_Stack_On_Slot, Canstack) == 0x000231, "Member 'W_BaseContainer_C_Can_Stack_On_Slot::Canstack' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_Can_Stack_On_Slot, TargetSlotsArray) == 0x000238, "Member 'W_BaseContainer_C_Can_Stack_On_Slot::TargetSlotsArray' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_Can_Stack_On_Slot, SlotsArray) == 0x000248, "Member 'W_BaseContainer_C_Can_Stack_On_Slot::SlotsArray' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_Can_Stack_On_Slot, CallFunc_SelectInt_ReturnValue) == 0x000258, "Member 'W_BaseContainer_C_Can_Stack_On_Slot::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_Can_Stack_On_Slot, CallFunc_SelectInt_ReturnValue_1) == 0x00025C, "Member 'W_BaseContainer_C_Can_Stack_On_Slot::CallFunc_SelectInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_Can_Stack_On_Slot, CallFunc_Array_Add_ReturnValue) == 0x000260, "Member 'W_BaseContainer_C_Can_Stack_On_Slot::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_Can_Stack_On_Slot, CallFunc_GetSlotIndex_SlotIndex) == 0x000264, "Member 'W_BaseContainer_C_Can_Stack_On_Slot::CallFunc_GetSlotIndex_SlotIndex' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_Can_Stack_On_Slot, CallFunc_GetItemId_ItemID) == 0x000268, "Member 'W_BaseContainer_C_Can_Stack_On_Slot::CallFunc_GetItemId_ItemID' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_Can_Stack_On_Slot, CallFunc_FindEnvirons_Slots) == 0x000270, "Member 'W_BaseContainer_C_Can_Stack_On_Slot::CallFunc_FindEnvirons_Slots' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_Can_Stack_On_Slot, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000280, "Member 'W_BaseContainer_C_Can_Stack_On_Slot::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_Can_Stack_On_Slot, CallFunc_GetCount_MaxStack) == 0x000284, "Member 'W_BaseContainer_C_Can_Stack_On_Slot::CallFunc_GetCount_MaxStack' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_Can_Stack_On_Slot, CallFunc_GetCount_Count) == 0x000288, "Member 'W_BaseContainer_C_Can_Stack_On_Slot::CallFunc_GetCount_Count' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_Can_Stack_On_Slot, CallFunc_CanStack_CanStack) == 0x00028C, "Member 'W_BaseContainer_C_Can_Stack_On_Slot::CallFunc_CanStack_CanStack' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_Can_Stack_On_Slot, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00028D, "Member 'W_BaseContainer_C_Can_Stack_On_Slot::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");

// Function W_BaseContainer.W_BaseContainer_C.CanDrag
// 0x0028 (0x0028 - 0x0000)
struct W_BaseContainer_C_CanDrag final
{
public:
	class UW_BaseSlot_C*                          Param_Slot;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Can;                                               // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasItem_Has;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue;       // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_ContainerOwner_C>   K2Node_DynamicCast_AsI_Container_Owner;            // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanDrag_can;                              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_BaseContainer_C_CanDrag) == 0x000008, "Wrong alignment on W_BaseContainer_C_CanDrag");
static_assert(sizeof(W_BaseContainer_C_CanDrag) == 0x000028, "Wrong size on W_BaseContainer_C_CanDrag");
static_assert(offsetof(W_BaseContainer_C_CanDrag, Param_Slot) == 0x000000, "Member 'W_BaseContainer_C_CanDrag::Param_Slot' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_CanDrag, Can) == 0x000008, "Member 'W_BaseContainer_C_CanDrag::Can' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_CanDrag, CallFunc_HasItem_Has) == 0x000009, "Member 'W_BaseContainer_C_CanDrag::CallFunc_HasItem_Has' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_CanDrag, CallFunc_IsValid_ReturnValue) == 0x00000A, "Member 'W_BaseContainer_C_CanDrag::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_CanDrag, CallFunc_DoesImplementInterface_ReturnValue) == 0x00000B, "Member 'W_BaseContainer_C_CanDrag::CallFunc_DoesImplementInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_CanDrag, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00000C, "Member 'W_BaseContainer_C_CanDrag::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_CanDrag, K2Node_DynamicCast_AsI_Container_Owner) == 0x000010, "Member 'W_BaseContainer_C_CanDrag::K2Node_DynamicCast_AsI_Container_Owner' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_CanDrag, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'W_BaseContainer_C_CanDrag::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_CanDrag, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000021, "Member 'W_BaseContainer_C_CanDrag::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_CanDrag, CallFunc_BooleanOR_ReturnValue) == 0x000022, "Member 'W_BaseContainer_C_CanDrag::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_CanDrag, CallFunc_BooleanAND_ReturnValue) == 0x000023, "Member 'W_BaseContainer_C_CanDrag::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_CanDrag, CallFunc_CanDrag_can) == 0x000024, "Member 'W_BaseContainer_C_CanDrag::CallFunc_CanDrag_can' has a wrong offset!");

// Function W_BaseContainer.W_BaseContainer_C.CanDragItem
// 0x0030 (0x0030 - 0x0000)
struct W_BaseContainer_C_CanDragItem final
{
public:
	class UW_BaseSlot_C*                          Param_Slot;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelWidget*                           CallFunc_GetParent_ReturnValue;                    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue;       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_ContainerOwner_C>   K2Node_DynamicCast_AsI_Container_Owner;            // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanDrag_can;                              // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_BaseContainer_C_CanDragItem) == 0x000008, "Wrong alignment on W_BaseContainer_C_CanDragItem");
static_assert(sizeof(W_BaseContainer_C_CanDragItem) == 0x000030, "Wrong size on W_BaseContainer_C_CanDragItem");
static_assert(offsetof(W_BaseContainer_C_CanDragItem, Param_Slot) == 0x000000, "Member 'W_BaseContainer_C_CanDragItem::Param_Slot' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_CanDragItem, CallFunc_GetParent_ReturnValue) == 0x000008, "Member 'W_BaseContainer_C_CanDragItem::CallFunc_GetParent_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_CanDragItem, CallFunc_DoesImplementInterface_ReturnValue) == 0x000010, "Member 'W_BaseContainer_C_CanDragItem::CallFunc_DoesImplementInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_CanDragItem, K2Node_DynamicCast_AsI_Container_Owner) == 0x000018, "Member 'W_BaseContainer_C_CanDragItem::K2Node_DynamicCast_AsI_Container_Owner' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_CanDragItem, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'W_BaseContainer_C_CanDragItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_CanDragItem, CallFunc_CanDrag_can) == 0x000029, "Member 'W_BaseContainer_C_CanDragItem::CallFunc_CanDrag_can' has a wrong offset!");

// Function W_BaseContainer.W_BaseContainer_C.ChangeCountOfHostedItem
// 0x0004 (0x0004 - 0x0000)
struct W_BaseContainer_C_ChangeCountOfHostedItem final
{
public:
	int32                                         NewCount;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_BaseContainer_C_ChangeCountOfHostedItem) == 0x000004, "Wrong alignment on W_BaseContainer_C_ChangeCountOfHostedItem");
static_assert(sizeof(W_BaseContainer_C_ChangeCountOfHostedItem) == 0x000004, "Wrong size on W_BaseContainer_C_ChangeCountOfHostedItem");
static_assert(offsetof(W_BaseContainer_C_ChangeCountOfHostedItem, NewCount) == 0x000000, "Member 'W_BaseContainer_C_ChangeCountOfHostedItem::NewCount' has a wrong offset!");

// Function W_BaseContainer.W_BaseContainer_C.ChangeItemCount
// 0x0018 (0x0018 - 0x0000)
struct W_BaseContainer_C_ChangeItemCount final
{
public:
	int32                                         SlotIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewCount;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_BaseSlot_C*                          CallFunc_Map_Find_Value;                           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_BaseContainer_C_ChangeItemCount) == 0x000008, "Wrong alignment on W_BaseContainer_C_ChangeItemCount");
static_assert(sizeof(W_BaseContainer_C_ChangeItemCount) == 0x000018, "Wrong size on W_BaseContainer_C_ChangeItemCount");
static_assert(offsetof(W_BaseContainer_C_ChangeItemCount, SlotIndex) == 0x000000, "Member 'W_BaseContainer_C_ChangeItemCount::SlotIndex' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_ChangeItemCount, NewCount) == 0x000004, "Member 'W_BaseContainer_C_ChangeItemCount::NewCount' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_ChangeItemCount, CallFunc_Map_Find_Value) == 0x000008, "Member 'W_BaseContainer_C_ChangeItemCount::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(W_BaseContainer_C_ChangeItemCount, CallFunc_Map_Find_ReturnValue) == 0x000010, "Member 'W_BaseContainer_C_ChangeItemCount::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function W_BaseContainer.W_BaseContainer_C.ClearContainer
// 0x0048 (0x0048 - 0x0000)
struct W_BaseContainer_C_ClearContainer final
{
public:
