#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_BaseSlot

#include "Basic.hpp"

#include "ContainerPickupsInfo_structs.hpp"
#include "E_SlotStatus_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FItemInfo_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "E_ItemColorTypes_structs.hpp"
#include "FMODStudio_structs.hpp"


namespace SDK::Params
{

// Function W_BaseSlot.W_BaseSlot_C.AddCount
// 0x0238 (0x0238 - 0x0000)
struct W_BaseSlot_C_AddCount final
{
public:
	int32                                         Param_AddCount;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewCount;                                          // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCount_MaxStack;                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCount_Count;                           // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFItemInfo                             CallFunc_ConvertPickupItemToItemInfoFunc_ItemInfo; // 0x0010(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0234(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_BaseSlot_C_AddCount) == 0x000008, "Wrong alignment on W_BaseSlot_C_AddCount");
static_assert(sizeof(W_BaseSlot_C_AddCount) == 0x000238, "Wrong size on W_BaseSlot_C_AddCount");
static_assert(offsetof(W_BaseSlot_C_AddCount, Param_AddCount) == 0x000000, "Member 'W_BaseSlot_C_AddCount::Param_AddCount' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_AddCount, NewCount) == 0x000004, "Member 'W_BaseSlot_C_AddCount::NewCount' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_AddCount, CallFunc_GetCount_MaxStack) == 0x000008, "Member 'W_BaseSlot_C_AddCount::CallFunc_GetCount_MaxStack' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_AddCount, CallFunc_GetCount_Count) == 0x00000C, "Member 'W_BaseSlot_C_AddCount::CallFunc_GetCount_Count' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_AddCount, CallFunc_ConvertPickupItemToItemInfoFunc_ItemInfo) == 0x000010, "Member 'W_BaseSlot_C_AddCount::CallFunc_ConvertPickupItemToItemInfoFunc_ItemInfo' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_AddCount, CallFunc_Add_IntInt_ReturnValue) == 0x000230, "Member 'W_BaseSlot_C_AddCount::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_AddCount, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000234, "Member 'W_BaseSlot_C_AddCount::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function W_BaseSlot.W_BaseSlot_C.AddItem
// 0x0068 (0x0068 - 0x0000)
struct W_BaseSlot_C_AddItem final
{
public:
	struct FContainerPickupsInfo                  Param_PickupInfo;                                  // 0x0000(0x0068)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(W_BaseSlot_C_AddItem) == 0x000008, "Wrong alignment on W_BaseSlot_C_AddItem");
static_assert(sizeof(W_BaseSlot_C_AddItem) == 0x000068, "Wrong size on W_BaseSlot_C_AddItem");
static_assert(offsetof(W_BaseSlot_C_AddItem, Param_PickupInfo) == 0x000000, "Member 'W_BaseSlot_C_AddItem::Param_PickupInfo' has a wrong offset!");

// Function W_BaseSlot.W_BaseSlot_C.Canstack
// 0x0001 (0x0001 - 0x0000)
struct W_BaseSlot_C_Canstack final
{
public:
	bool                                          Param_Canstack;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_BaseSlot_C_Canstack) == 0x000001, "Wrong alignment on W_BaseSlot_C_Canstack");
static_assert(sizeof(W_BaseSlot_C_Canstack) == 0x000001, "Wrong size on W_BaseSlot_C_Canstack");
static_assert(offsetof(W_BaseSlot_C_Canstack, Param_Canstack) == 0x000000, "Member 'W_BaseSlot_C_Canstack::Param_Canstack' has a wrong offset!");

// Function W_BaseSlot.W_BaseSlot_C.Change Sell Status
// 0x0004 (0x0004 - 0x0000)
struct W_BaseSlot_C_Change_Sell_Status final
{
public:
	E_SlotStatus                                  Param_Status;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsItemPriceless_ReturnValue;              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_BaseSlot_C_Change_Sell_Status) == 0x000001, "Wrong alignment on W_BaseSlot_C_Change_Sell_Status");
static_assert(sizeof(W_BaseSlot_C_Change_Sell_Status) == 0x000004, "Wrong size on W_BaseSlot_C_Change_Sell_Status");
static_assert(offsetof(W_BaseSlot_C_Change_Sell_Status, Param_Status) == 0x000000, "Member 'W_BaseSlot_C_Change_Sell_Status::Param_Status' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_Change_Sell_Status, CallFunc_IsItemPriceless_ReturnValue) == 0x000001, "Member 'W_BaseSlot_C_Change_Sell_Status::CallFunc_IsItemPriceless_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_Change_Sell_Status, K2Node_SwitchEnum_CmpSuccess) == 0x000002, "Member 'W_BaseSlot_C_Change_Sell_Status::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_Change_Sell_Status, CallFunc_IsValid_ReturnValue) == 0x000003, "Member 'W_BaseSlot_C_Change_Sell_Status::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function W_BaseSlot.W_BaseSlot_C.ChangeCount
// 0x02A8 (0x02A8 - 0x0000)
struct W_BaseSlot_C_ChangeCount final
{
public:
	int32                                         NewCount;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0010(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ReferenceParm)
	struct FFItemInfo                             CallFunc_ConvertPickupItemToItemInfoFunc_ItemInfo; // 0x0070(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0290(0x0018)()
};
static_assert(alignof(W_BaseSlot_C_ChangeCount) == 0x000008, "Wrong alignment on W_BaseSlot_C_ChangeCount");
static_assert(sizeof(W_BaseSlot_C_ChangeCount) == 0x0002A8, "Wrong size on W_BaseSlot_C_ChangeCount");
static_assert(offsetof(W_BaseSlot_C_ChangeCount, NewCount) == 0x000000, "Member 'W_BaseSlot_C_ChangeCount::NewCount' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ChangeCount, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000008, "Member 'W_BaseSlot_C_ChangeCount::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ChangeCount, K2Node_MakeStruct_FormatArgumentData) == 0x000010, "Member 'W_BaseSlot_C_ChangeCount::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ChangeCount, K2Node_MakeArray_Array) == 0x000060, "Member 'W_BaseSlot_C_ChangeCount::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ChangeCount, CallFunc_ConvertPickupItemToItemInfoFunc_ItemInfo) == 0x000070, "Member 'W_BaseSlot_C_ChangeCount::CallFunc_ConvertPickupItemToItemInfoFunc_ItemInfo' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ChangeCount, CallFunc_Format_ReturnValue) == 0x000290, "Member 'W_BaseSlot_C_ChangeCount::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function W_BaseSlot.W_BaseSlot_C.ChangeStatus
// 0x0004 (0x0004 - 0x0000)
struct W_BaseSlot_C_ChangeStatus final
{
public:
	E_SlotStatus                                  Param_Status;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsItemPriceless_ReturnValue;              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_BaseSlot_C_ChangeStatus) == 0x000001, "Wrong alignment on W_BaseSlot_C_ChangeStatus");
static_assert(sizeof(W_BaseSlot_C_ChangeStatus) == 0x000004, "Wrong size on W_BaseSlot_C_ChangeStatus");
static_assert(offsetof(W_BaseSlot_C_ChangeStatus, Param_Status) == 0x000000, "Member 'W_BaseSlot_C_ChangeStatus::Param_Status' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ChangeStatus, CallFunc_IsItemPriceless_ReturnValue) == 0x000001, "Member 'W_BaseSlot_C_ChangeStatus::CallFunc_IsItemPriceless_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ChangeStatus, K2Node_SwitchEnum_CmpSuccess) == 0x000002, "Member 'W_BaseSlot_C_ChangeStatus::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ChangeStatus, CallFunc_IsValid_ReturnValue) == 0x000003, "Member 'W_BaseSlot_C_ChangeStatus::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function W_BaseSlot.W_BaseSlot_C.ExecuteUbergraph_W_BaseSlot
// 0x13C0 (0x13C0 - 0x0000)
struct W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             CallFunc_ConvertPickupItemToItemInfoFunc_ItemInfo; // 0x0018(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0238(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0250(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x0260(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_2;           // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0280(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0298(0x0018)()
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_3;           // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x02B8(0x0018)()
	struct FContainerPickupsInfo                  K2Node_MakeStruct_ContainerPickupsInfo;            // 0x02D0(0x0068)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FPointerEvent                          K2Node_Event_PointerEvent_2;                       // 0x0338(0x0078)(ConstParm)
	class UDragDropOperation*                     K2Node_Event_Operation_2;                          // 0x03B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry_1;                         // 0x03B8(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_PointerEvent_1;                       // 0x03F0(0x0078)()
	class UDragDropOperation*                     K2Node_Event_Operation_1;                          // 0x0468(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPointerEvent                          K2Node_Event_PointerEvent;                         // 0x0470(0x0078)()
	class UDragDropOperation*                     K2Node_Event_Operation;                            // 0x04E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_BaseDragOperation_C*                K2Node_DynamicCast_AsBP_Base_Drag_Operation;       // 0x04F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F9[0x3];                                      // 0x04F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_4;                            // 0x04FC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50C[0x4];                                      // 0x050C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             CallFunc_ConvertPickupItemToItemInfoFunc_ItemInfo_1; // 0x0510(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0730(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_731[0x3];                                      // 0x0731(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0734(0x0038)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_76C[0x4];                                      // 0x076C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0770(0x0078)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x07E8(0x0078)(ConstParm)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0860(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0861(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_862[0x2];                                      // 0x0862(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_5;                            // 0x0864(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0874(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0875(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_876[0x2];                                      // 0x0876(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_6;                            // 0x0878(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0888(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_889[0x7];                                      // 0x0889(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_GetSlotBrushes_Hover2_Brush;              // 0x0890(0x00D0)()
	struct FSlateBrush                            CallFunc_GetSlotBrushes_Hover_Brush;               // 0x0960(0x00D0)()
	struct FSlateBrush                            CallFunc_GetSlotBrushes_BG_Brush;                  // 0x0A30(0x00D0)()
	struct FSlateBrush                            CallFunc_GetSlotBrushes_Gradient_Brush;            // 0x0B00(0x00D0)()
	struct FSlateBrush                            CallFunc_GetSlotBrushes_Highlight_Brush;           // 0x0BD0(0x00D0)()
	struct FSlateBrush                            CallFunc_GetSlotBrushes_Item_Brush;                // 0x0CA0(0x00D0)()
	struct FContainerPickupsInfo                  K2Node_CustomEvent_PickupInfo;                     // 0x0D70(0x0068)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_7;                            // 0x0DD8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFItemInfo                             K2Node_MakeStruct_FItemInfo;                       // 0x0DE8(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	class UDragDropOperation*                     K2Node_CustomEvent_DragDropOperation;              // 0x1008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_BaseDragOperation_C*                K2Node_DynamicCast_AsBP_Base_Drag_Operation_1;     // 0x1010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x1018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1019[0x7];                                     // 0x1019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             CallFunc_ConvertPickupItemToItemInfoFunc_ItemInfo_2; // 0x1020(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	E_ItemColorTypes                              Temp_byte_Variable;                                // 0x1240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1241[0x7];                                     // 0x1241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x1248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x1250(0x0050)(HasGetValueTypeHash)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x12A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x12A8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x12B8(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x12D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12D1[0x3];                                     // 0x12D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_8;                            // 0x12D4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x12E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_4;           // 0x12E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x12F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12F1[0x3];                                     // 0x12F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x12F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x12F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x12F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12FA[0x6];                                     // 0x12FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x1300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x1308(0x0018)()
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x1320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_1;          // 0x1328(0x0018)()
	struct FLinearColor                           Temp_struct_Variable_9;                            // 0x1340(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x1350(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x1360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_2;          // 0x1368(0x0018)()
	float                                         CallFunc_GetRenderOpacity_ReturnValue;             // 0x1380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRenderOpacity_ReturnValue_1;           // 0x1384(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x1388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x1389(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x138A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_138B[0x5];                                     // 0x138B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x1390(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x1398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1399[0x7];                                     // 0x1399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x13A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x13A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_1;    // 0x13B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot) == 0x000010, "Wrong alignment on W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot");
static_assert(sizeof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot) == 0x0013C0, "Wrong size on W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, EntryPoint) == 0x000000, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, Temp_struct_Variable) == 0x000004, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, CallFunc_ConvertPickupItemToItemInfoFunc_ItemInfo) == 0x000018, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::CallFunc_ConvertPickupItemToItemInfoFunc_ItemInfo' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, Temp_struct_Variable_1) == 0x000238, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000248, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, Temp_struct_Variable_2) == 0x000250, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, Temp_struct_Variable_3) == 0x000260, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000270, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, CallFunc_Conv_IntToDouble_ReturnValue_2) == 0x000278, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::CallFunc_Conv_IntToDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, CallFunc_Conv_IntToText_ReturnValue) == 0x000280, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000298, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, CallFunc_Conv_IntToDouble_ReturnValue_3) == 0x0002B0, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::CallFunc_Conv_IntToDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, CallFunc_Conv_IntToText_ReturnValue_2) == 0x0002B8, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::CallFunc_Conv_IntToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, K2Node_MakeStruct_ContainerPickupsInfo) == 0x0002D0, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::K2Node_MakeStruct_ContainerPickupsInfo' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, K2Node_Event_PointerEvent_2) == 0x000338, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::K2Node_Event_PointerEvent_2' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, K2Node_Event_Operation_2) == 0x0003B0, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::K2Node_Event_Operation_2' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, K2Node_Event_MyGeometry_1) == 0x0003B8, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::K2Node_Event_MyGeometry_1' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, K2Node_Event_PointerEvent_1) == 0x0003F0, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::K2Node_Event_PointerEvent_1' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, K2Node_Event_Operation_1) == 0x000468, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::K2Node_Event_Operation_1' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, K2Node_Event_PointerEvent) == 0x000470, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::K2Node_Event_PointerEvent' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, K2Node_Event_Operation) == 0x0004E8, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::K2Node_Event_Operation' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, K2Node_DynamicCast_AsBP_Base_Drag_Operation) == 0x0004F0, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::K2Node_DynamicCast_AsBP_Base_Drag_Operation' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, K2Node_DynamicCast_bSuccess) == 0x0004F8, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, Temp_struct_Variable_4) == 0x0004FC, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, CallFunc_ConvertPickupItemToItemInfoFunc_ItemInfo_1) == 0x000510, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::CallFunc_ConvertPickupItemToItemInfoFunc_ItemInfo_1' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, CallFunc_IsValid_ReturnValue) == 0x000730, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, K2Node_Event_MyGeometry) == 0x000734, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, K2Node_Event_MouseEvent_1) == 0x000770, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, K2Node_Event_MouseEvent) == 0x0007E8, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, K2Node_SwitchEnum_CmpSuccess) == 0x000860, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, K2Node_Event_IsDesignTime) == 0x000861, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, Temp_struct_Variable_5) == 0x000864, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000874, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, CallFunc_IsValid_ReturnValue_1) == 0x000875, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, Temp_struct_Variable_6) == 0x000878, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::Temp_struct_Variable_6' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000888, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, CallFunc_GetSlotBrushes_Hover2_Brush) == 0x000890, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::CallFunc_GetSlotBrushes_Hover2_Brush' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, CallFunc_GetSlotBrushes_Hover_Brush) == 0x000960, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::CallFunc_GetSlotBrushes_Hover_Brush' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, CallFunc_GetSlotBrushes_BG_Brush) == 0x000A30, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::CallFunc_GetSlotBrushes_BG_Brush' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, CallFunc_GetSlotBrushes_Gradient_Brush) == 0x000B00, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::CallFunc_GetSlotBrushes_Gradient_Brush' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, CallFunc_GetSlotBrushes_Highlight_Brush) == 0x000BD0, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::CallFunc_GetSlotBrushes_Highlight_Brush' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, CallFunc_GetSlotBrushes_Item_Brush) == 0x000CA0, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::CallFunc_GetSlotBrushes_Item_Brush' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, K2Node_CustomEvent_PickupInfo) == 0x000D70, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::K2Node_CustomEvent_PickupInfo' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, Temp_struct_Variable_7) == 0x000DD8, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::Temp_struct_Variable_7' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, K2Node_MakeStruct_FItemInfo) == 0x000DE8, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::K2Node_MakeStruct_FItemInfo' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, K2Node_CustomEvent_DragDropOperation) == 0x001008, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::K2Node_CustomEvent_DragDropOperation' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, K2Node_DynamicCast_AsBP_Base_Drag_Operation_1) == 0x001010, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::K2Node_DynamicCast_AsBP_Base_Drag_Operation_1' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, K2Node_DynamicCast_bSuccess_1) == 0x001018, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, CallFunc_ConvertPickupItemToItemInfoFunc_ItemInfo_2) == 0x001020, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::CallFunc_ConvertPickupItemToItemInfoFunc_ItemInfo_2' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, Temp_byte_Variable) == 0x001240, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, CallFunc_Conv_IntToInt64_ReturnValue) == 0x001248, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, K2Node_MakeStruct_FormatArgumentData) == 0x001250, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, CallFunc_PlayEvent2D_ReturnValue) == 0x0012A0, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::CallFunc_PlayEvent2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, K2Node_MakeArray_Array) == 0x0012A8, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, CallFunc_Format_ReturnValue) == 0x0012B8, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, CallFunc_IsValid_ReturnValue_2) == 0x0012D0, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, Temp_struct_Variable_8) == 0x0012D4, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::Temp_struct_Variable_8' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, CallFunc_Add_IntInt_ReturnValue) == 0x0012E4, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, CallFunc_Conv_IntToDouble_ReturnValue_4) == 0x0012E8, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::CallFunc_Conv_IntToDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x0012F0, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, CallFunc_Subtract_IntInt_ReturnValue) == 0x0012F4, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0012F8, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, CallFunc_IsValid_ReturnValue_3) == 0x0012F9, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x001300, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, CallFunc_Conv_DoubleToText_ReturnValue) == 0x001308, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x001320, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, CallFunc_Conv_DoubleToText_ReturnValue_1) == 0x001328, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::CallFunc_Conv_DoubleToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, Temp_struct_Variable_9) == 0x001340, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::Temp_struct_Variable_9' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, K2Node_Select_Default) == 0x001350, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x001360, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, CallFunc_Conv_DoubleToText_ReturnValue_2) == 0x001368, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::CallFunc_Conv_DoubleToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, CallFunc_GetRenderOpacity_ReturnValue) == 0x001380, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::CallFunc_GetRenderOpacity_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, CallFunc_GetRenderOpacity_ReturnValue_1) == 0x001384, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::CallFunc_GetRenderOpacity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x001388, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x001389, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, CallFunc_IsValid_ReturnValue_4) == 0x00138A, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, CallFunc_PlayAnimationForward_ReturnValue) == 0x001390, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x001398, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, CallFunc_PlayAnimationReverse_ReturnValue) == 0x0013A0, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x0013A8, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot, CallFunc_Greater_DoubleDouble_A_ImplicitCast_1) == 0x0013B0, "Member 'W_BaseSlot_C_ExecuteUbergraph_W_BaseSlot::CallFunc_Greater_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");

// Function W_BaseSlot.W_BaseSlot_C.Get Pivot Index
// 0x0148 (0x0148 - 0x0000)
struct W_BaseSlot_C_Get_Pivot_Index final
{
public:
	struct FVector2D                              Param_DragOffset;                                  // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumberOfCellsInRow;                                // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumberOfCellsInColumn;                             // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Y_Location;                                        // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        X_Location;                                        // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSlotSize_SlotSize;                     // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRotated__Result;                        // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NormalizeToRange_ReturnValue;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NormalizeToRange_ReturnValue_1;           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_1;     // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_2;     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_3;     // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_2;           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_4;     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_3;           // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_5;     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_4;           // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F2[0x6];                                       // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_6;     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_5;           // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_2;                  // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_5;      // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_7;     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue_3;                  // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_4;          // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x012B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_5;          // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x012D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_6;          // 0x012E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_7;          // 0x012F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_8;          // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_9;          // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0133(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_10;         // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_11;         // 0x0135(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_12;         // 0x0136(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x0137(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_13;         // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetItemSlotDimension_X;                   // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemSlotDimension_Y;                   // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_BaseSlot_C_Get_Pivot_Index) == 0x000008, "Wrong alignment on W_BaseSlot_C_Get_Pivot_Index");
static_assert(sizeof(W_BaseSlot_C_Get_Pivot_Index) == 0x000148, "Wrong size on W_BaseSlot_C_Get_Pivot_Index");
static_assert(offsetof(W_BaseSlot_C_Get_Pivot_Index, Param_DragOffset) == 0x000000, "Member 'W_BaseSlot_C_Get_Pivot_Index::Param_DragOffset' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_Get_Pivot_Index, Param_Index) == 0x000010, "Member 'W_BaseSlot_C_Get_Pivot_Index::Param_Index' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_Get_Pivot_Index, NumberOfCellsInRow) == 0x000014, "Member 'W_BaseSlot_C_Get_Pivot_Index::NumberOfCellsInRow' has a wrong offset!");
static_assert(offsetof(W_BaseSlot_C_Get_Pivot_Index, NumberOfCellsInColumn) == 0x000018, "Member 'W_BaseSlot_C_Get_Pivot_Index::NumberOfCellsInColumn' has a wrong offset!");
