#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_BaseSplitWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_BaseContainerType_structs.hpp"
#include "ContainerPickupsInfo_structs.hpp"
#include "FItemInfo_structs.hpp"
#include "InputCore_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_BaseSplitWidget.W_BaseSplitWidget_C
// 0x0490 (0x0710 - 0x0280)
class UW_BaseSplitWidget_C : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_Minus;                                      // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Minus_1;                                    // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Plus;                                       // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Plus_1;                                     // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Components;                          // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Money;                               // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_230;                                         // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_365;                                         // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BG1;                                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BorderOfNumber;                              // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_item;                                        // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Money;                                       // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Separator;                                   // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USlider*                                Slider_Base;                                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_CurrentCounter;                               // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_ItemDescription;                              // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_ItemName;                                     // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_TotalPrice;                                   // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_CurrentCount;                            // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ItemName;                                // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Money;                                   // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_WhatToDo;                                // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlockWhattodo;                                 // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_BaseDialogueButton_C*                W_BaseDialogButton_Accept;                         // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_BaseDialogueButton_C*                W_BaseDialogButton_Decline;                        // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_BaseDialogueButton_C*                W_BaseDialogueButton_Cancel;                       // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_BaseDialogueButton_C*                W_BaseDialogueButton_Craft;                        // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_HintButtonNew_C*                     W_HintButtonLess;                                  // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_HintButtonNew_C*                     W_HintButtonMax;                                   // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_HintButtonNew_C*                     W_HintButtonMore;                                  // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_0;                                  // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        MaxValue;                                          // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFItemInfo                             Item;                                              // 0x0388(0x0220)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CurrentValue;                                      // 0x05A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AC[0x4];                                      // 0x05AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             SplitWidget_OnCancel;                              // 0x05B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             SplitWidget_OnAcceptSplit;                         // 0x05C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UW_BaseContainer_C*                     CachedSenderContainer;                             // 0x05D0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UW_BaseSlot_C*                          CachedRecipientSlot;                               // 0x05D8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             SplitWidget_OnAcceptFull;                          // 0x05E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   TextForAcceptButton;                               // 0x05F0(0x0018)(Edit, BlueprintVisible)
	struct FContainerPickupsInfo                  ItemData;                                          // 0x0608(0x0068)(Edit, BlueprintVisible, ContainsInstancedReference, ExposeOnSpawn, HasGetValueTypeHash)
	struct FKey                                   AcceptKey;                                         // 0x0670(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, HasGetValueTypeHash)
	struct FKey                                   CancelKey;                                         // 0x0688(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, HasGetValueTypeHash)
	TMap<class FString, TSoftObjectPtr<class UPaperSprite>> KeyMap;                                            // 0x06A0(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	class FText                                   Text_Block_What;                                   // 0x06F0(0x0018)(Edit, BlueprintVisible)
	float                                         WSliderValue;                                      // 0x0708(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StepSlide;                                         // 0x070C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AcceptEvent();
	void AcceptFullEvent();
	void BndEvt__W_BaseSplitWidget_Button_Minus_1_K2Node_ComponentBoundEvent_4_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__W_BaseSplitWidget_Button_Minus_K2Node_ComponentBoundEvent_12_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__W_BaseSplitWidget_Button_Plus_1_K2Node_ComponentBoundEvent_3_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__W_BaseSplitWidget_Button_Plus_K2Node_ComponentBoundEvent_13_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__W_BaseSplitWidget_Slider_Craft_K2Node_ComponentBoundEvent_6_OnFloatValueChangedEvent__DelegateSignature(float Value);
	void BndEvt__W_BaseSplitWidget_W_BaseDialogButton_Accept_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature();
	void BndEvt__W_BaseSplitWidget_W_BaseDialogButton_Decline_K2Node_ComponentBoundEvent_7_OnPressed__DelegateSignature();
	void BndEvt__W_BaseSplitWidget_W_BaseDialogueButton_Cancel_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature();
	void BndEvt__W_BaseSplitWidget_W_BaseDialogueButton_Craft_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature();
	void BndEvt__W_BaseSplitWidget_W_HintButtonLess_K2Node_ComponentBoundEvent_9_OnPressed__DelegateSignature();
	void BndEvt__W_BaseSplitWidget_W_HintButtonMax_K2Node_ComponentBoundEvent_14_OnPressed__DelegateSignature();
	void BndEvt__W_BaseSplitWidget_W_HintButtonMore_K2Node_ComponentBoundEvent_15_OnPressed__DelegateSignature();
	void ButtonLess();
	void ButtonMax();
	void ButtonMore();
	void CancelEvent();
	void Construct();
	void ExecuteUbergraph_W_BaseSplitWidget(int32 EntryPoint);
	float Get_Slider_Craft_Value_0();
	void OnCounterValueChanged(double Value);
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void OnLoaded_F0AAAC4E4253A377D49B7B843E39F351(class UObject* Loaded);
	void PreConstruct(bool IsDesignTime);
	void SplitWidget_OnAcceptFull__DelegateSignature(class UW_BaseSlot_C* RecipientSlot, class UW_BaseContainer_C* SenderContainer);
	void SplitWidget_OnAcceptSplit__DelegateSignature(int32 Count, class UW_BaseSlot_C* RecipientSlot, class UW_BaseContainer_C* SenderContainer);
	void SplitWidget_OnCancel__DelegateSignature(class UW_BaseContainer_C* SenderContainer);

	void GetSenderContainerType(E_BaseContainerType* ContainerType) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_BaseSplitWidget_C">();
	}
	static class UW_BaseSplitWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_BaseSplitWidget_C>();
	}
};
static_assert(alignof(UW_BaseSplitWidget_C) == 0x000008, "Wrong alignment on UW_BaseSplitWidget_C");
static_assert(sizeof(UW_BaseSplitWidget_C) == 0x000710, "Wrong size on UW_BaseSplitWidget_C");
static_assert(offsetof(UW_BaseSplitWidget_C, UberGraphFrame) == 0x000280, "Member 'UW_BaseSplitWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_BaseSplitWidget_C, Button_Minus) == 0x000288, "Member 'UW_BaseSplitWidget_C::Button_Minus' has a wrong offset!");
static_assert(offsetof(UW_BaseSplitWidget_C, Button_Minus_1) == 0x000290, "Member 'UW_BaseSplitWidget_C::Button_Minus_1' has a wrong offset!");
static_assert(offsetof(UW_BaseSplitWidget_C, Button_Plus) == 0x000298, "Member 'UW_BaseSplitWidget_C::Button_Plus' has a wrong offset!");
static_assert(offsetof(UW_BaseSplitWidget_C, Button_Plus_1) == 0x0002A0, "Member 'UW_BaseSplitWidget_C::Button_Plus_1' has a wrong offset!");
static_assert(offsetof(UW_BaseSplitWidget_C, HorizontalBox_Components) == 0x0002A8, "Member 'UW_BaseSplitWidget_C::HorizontalBox_Components' has a wrong offset!");
static_assert(offsetof(UW_BaseSplitWidget_C, HorizontalBox_Money) == 0x0002B0, "Member 'UW_BaseSplitWidget_C::HorizontalBox_Money' has a wrong offset!");
static_assert(offsetof(UW_BaseSplitWidget_C, Image_230) == 0x0002B8, "Member 'UW_BaseSplitWidget_C::Image_230' has a wrong offset!");
static_assert(offsetof(UW_BaseSplitWidget_C, Image_365) == 0x0002C0, "Member 'UW_BaseSplitWidget_C::Image_365' has a wrong offset!");
static_assert(offsetof(UW_BaseSplitWidget_C, Image_BG1) == 0x0002C8, "Member 'UW_BaseSplitWidget_C::Image_BG1' has a wrong offset!");
static_assert(offsetof(UW_BaseSplitWidget_C, Image_BorderOfNumber) == 0x0002D0, "Member 'UW_BaseSplitWidget_C::Image_BorderOfNumber' has a wrong offset!");
static_assert(offsetof(UW_BaseSplitWidget_C, Image_item) == 0x0002D8, "Member 'UW_BaseSplitWidget_C::Image_item' has a wrong offset!");
static_assert(offsetof(UW_BaseSplitWidget_C, Image_Money) == 0x0002E0, "Member 'UW_BaseSplitWidget_C::Image_Money' has a wrong offset!");
static_assert(offsetof(UW_BaseSplitWidget_C, Image_Separator) == 0x0002E8, "Member 'UW_BaseSplitWidget_C::Image_Separator' has a wrong offset!");
static_assert(offsetof(UW_BaseSplitWidget_C, Slider_Base) == 0x0002F0, "Member 'UW_BaseSplitWidget_C::Slider_Base' has a wrong offset!");
static_assert(offsetof(UW_BaseSplitWidget_C, Text_CurrentCounter) == 0x0002F8, "Member 'UW_BaseSplitWidget_C::Text_CurrentCounter' has a wrong offset!");
static_assert(offsetof(UW_BaseSplitWidget_C, Text_ItemDescription) == 0x000300, "Member 'UW_BaseSplitWidget_C::Text_ItemDescription' has a wrong offset!");
static_assert(offsetof(UW_BaseSplitWidget_C, Text_ItemName) == 0x000308, "Member 'UW_BaseSplitWidget_C::Text_ItemName' has a wrong offset!");
static_assert(offsetof(UW_BaseSplitWidget_C, Text_TotalPrice) == 0x000310, "Member 'UW_BaseSplitWidget_C::Text_TotalPrice' has a wrong offset!");
static_assert(offsetof(UW_BaseSplitWidget_C, TextBlock_CurrentCount) == 0x000318, "Member 'UW_BaseSplitWidget_C::TextBlock_CurrentCount' has a wrong offset!");
static_assert(offsetof(UW_BaseSplitWidget_C, TextBlock_ItemName) == 0x000320, "Member 'UW_BaseSplitWidget_C::TextBlock_ItemName' has a wrong offset!");
static_assert(offsetof(UW_BaseSplitWidget_C, TextBlock_Money) == 0x000328, "Member 'UW_BaseSplitWidget_C::TextBlock_Money' has a wrong offset!");
static_assert(offsetof(UW_BaseSplitWidget_C, TextBlock_WhatToDo) == 0x000330, "Member 'UW_BaseSplitWidget_C::TextBlock_WhatToDo' has a wrong offset!");
static_assert(offsetof(UW_BaseSplitWidget_C, TextBlockWhattodo) == 0x000338, "Member 'UW_BaseSplitWidget_C::TextBlockWhattodo' has a wrong offset!");
static_assert(offsetof(UW_BaseSplitWidget_C, W_BaseDialogButton_Accept) == 0x000340, "Member 'UW_BaseSplitWidget_C::W_BaseDialogButton_Accept' has a wrong offset!");
static_assert(offsetof(UW_BaseSplitWidget_C, W_BaseDialogButton_Decline) == 0x000348, "Member 'UW_BaseSplitWidget_C::W_BaseDialogButton_Decline' has a wrong offset!");
static_assert(offsetof(UW_BaseSplitWidget_C, W_BaseDialogueButton_Cancel) == 0x000350, "Member 'UW_BaseSplitWidget_C::W_BaseDialogueButton_Cancel' has a wrong offset!");
static_assert(offsetof(UW_BaseSplitWidget_C, W_BaseDialogueButton_Craft) == 0x000358, "Member 'UW_BaseSplitWidget_C::W_BaseDialogueButton_Craft' has a wrong offset!");
static_assert(offsetof(UW_BaseSplitWidget_C, W_HintButtonLess) == 0x000360, "Member 'UW_BaseSplitWidget_C::W_HintButtonLess' has a wrong offset!");
static_assert(offsetof(UW_BaseSplitWidget_C, W_HintButtonMax) == 0x000368, "Member 'UW_BaseSplitWidget_C::W_HintButtonMax' has a wrong offset!");
static_assert(offsetof(UW_BaseSplitWidget_C, W_HintButtonMore) == 0x000370, "Member 'UW_BaseSplitWidget_C::W_HintButtonMore' has a wrong offset!");
static_assert(offsetof(UW_BaseSplitWidget_C, WidgetSwitcher_0) == 0x000378, "Member 'UW_BaseSplitWidget_C::WidgetSwitcher_0' has a wrong offset!");
static_assert(offsetof(UW_BaseSplitWidget_C, MaxValue) == 0x000380, "Member 'UW_BaseSplitWidget_C::MaxValue' has a wrong offset!");
static_assert(offsetof(UW_BaseSplitWidget_C, Item) == 0x000388, "Member 'UW_BaseSplitWidget_C::Item' has a wrong offset!");
static_assert(offsetof(UW_BaseSplitWidget_C, CurrentValue) == 0x0005A8, "Member 'UW_BaseSplitWidget_C::CurrentValue' has a wrong offset!");
static_assert(offsetof(UW_BaseSplitWidget_C, SplitWidget_OnCancel) == 0x0005B0, "Member 'UW_BaseSplitWidget_C::SplitWidget_OnCancel' has a wrong offset!");
static_assert(offsetof(UW_BaseSplitWidget_C, SplitWidget_OnAcceptSplit) == 0x0005C0, "Member 'UW_BaseSplitWidget_C::SplitWidget_OnAcceptSplit' has a wrong offset!");
static_assert(offsetof(UW_BaseSplitWidget_C, CachedSenderContainer) == 0x0005D0, "Member 'UW_BaseSplitWidget_C::CachedSenderContainer' has a wrong offset!");
static_assert(offsetof(UW_BaseSplitWidget_C, CachedRecipientSlot) == 0x0005D8, "Member 'UW_BaseSplitWidget_C::CachedRecipientSlot' has a wrong offset!");
static_assert(offsetof(UW_BaseSplitWidget_C, SplitWidget_OnAcceptFull) == 0x0005E0, "Member 'UW_BaseSplitWidget_C::SplitWidget_OnAcceptFull' has a wrong offset!");
static_assert(offsetof(UW_BaseSplitWidget_C, TextForAcceptButton) == 0x0005F0, "Member 'UW_BaseSplitWidget_C::TextForAcceptButton' has a wrong offset!");
static_assert(offsetof(UW_BaseSplitWidget_C, ItemData) == 0x000608, "Member 'UW_BaseSplitWidget_C::ItemData' has a wrong offset!");
static_assert(offsetof(UW_BaseSplitWidget_C, AcceptKey) == 0x000670, "Member 'UW_BaseSplitWidget_C::AcceptKey' has a wrong offset!");
static_assert(offsetof(UW_BaseSplitWidget_C, CancelKey) == 0x000688, "Member 'UW_BaseSplitWidget_C::CancelKey' has a wrong offset!");
static_assert(offsetof(UW_BaseSplitWidget_C, KeyMap) == 0x0006A0, "Member 'UW_BaseSplitWidget_C::KeyMap' has a wrong offset!");
static_assert(offsetof(UW_BaseSplitWidget_C, Text_Block_What) == 0x0006F0, "Member 'UW_BaseSplitWidget_C::Text_Block_What' has a wrong offset!");
static_assert(offsetof(UW_BaseSplitWidget_C, WSliderValue) == 0x000708, "Member 'UW_BaseSplitWidget_C::WSliderValue' has a wrong offset!");
static_assert(offsetof(UW_BaseSplitWidget_C, StepSlide) == 0x00070C, "Member 'UW_BaseSplitWidget_C::StepSlide' has a wrong offset!");

}

