#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_BaseItemInfo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FItemInfo_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_BaseItemInfo.W_BaseItemInfo_C
// 0x0310 (0x0590 - 0x0280)
class UW_BaseItemInfo_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowAnim;                                          // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UW_EffectRowForItemInfo_C*              DebugEffectRow01;                                  // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_EffectRowForItemInfo_C*              DebugEffectRow02;                                  // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_EffectRowForItemInfo_C*              DebugEffectRow03;                                  // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_EffectRowForItemInfo_C*              DebugEffectRow04;                                  // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_AttachmentsPanel;                    // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Durability;                          // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Type;                                // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Weight;                              // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_457;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_EquipmentMark;                               // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_Durability;                            // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Grid;                                      // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Root;                                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Desc;                                    // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Durability;                              // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ItemName;                                // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ItemType;                                // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Price;                                   // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_SlotDemention;                           // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Weight;                                  // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Effects;                               // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsHidden;                                          // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJSI_Slot_C*                            Item_Slot;                                         // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFItemInfo                             Item_Info;                                         // 0x0348(0x0220)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x0568(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bIsTickAllowed;                                    // 0x0580(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_581[0x7];                                      // 0x0581(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_BaseSlot_C*                          SlotRef;                                           // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void AddAttachmentEffects(double Power, double EffectiveRange, double Stability, double FIring_Rate, double PowerModdifu, double EffectiveRangeModdifu, double StabilityModdifu, double FIring_RateModdifu);
	void AddAttacmentsToGridPanel(const struct FPickupAttachments& PickupAttachments, class FName WeaponName);
	void AddItemEffects();
	void CalculateIndex(int32& Param_Index, int32* Row, int32* Column);
	void Construct();
	void ExecuteUbergraph_W_BaseItemInfo(int32 EntryPoint);
	void FIndBaseStatsWepaon(class FName Param_Name, double* Power, double* Effective_Range, double* Stability);
	void HideItemDescription();
	void HideItemDiscriptionImmediately();
	void ResetImageAttachments();
	void SetEquipmentMark(bool Param_IsVisible);
	void ShowInfo(class UW_BaseSlot_C* ItemSlot, const class FText& Param_Text);
	void SlotEvent_DragStarted_Binding(class UW_BaseSlot_C* Param_SlotRef, class UW_BaseDragWidget_C* DragWidget);
	void UpdateWidgetPosition(class UWidget* Widget);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_BaseItemInfo_C">();
	}
	static class UW_BaseItemInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_BaseItemInfo_C>();
	}
};
static_assert(alignof(UW_BaseItemInfo_C) == 0x000008, "Wrong alignment on UW_BaseItemInfo_C");
static_assert(sizeof(UW_BaseItemInfo_C) == 0x000590, "Wrong size on UW_BaseItemInfo_C");
static_assert(offsetof(UW_BaseItemInfo_C, UberGraphFrame) == 0x000280, "Member 'UW_BaseItemInfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_BaseItemInfo_C, ShowAnim) == 0x000288, "Member 'UW_BaseItemInfo_C::ShowAnim' has a wrong offset!");
static_assert(offsetof(UW_BaseItemInfo_C, DebugEffectRow01) == 0x000290, "Member 'UW_BaseItemInfo_C::DebugEffectRow01' has a wrong offset!");
static_assert(offsetof(UW_BaseItemInfo_C, DebugEffectRow02) == 0x000298, "Member 'UW_BaseItemInfo_C::DebugEffectRow02' has a wrong offset!");
static_assert(offsetof(UW_BaseItemInfo_C, DebugEffectRow03) == 0x0002A0, "Member 'UW_BaseItemInfo_C::DebugEffectRow03' has a wrong offset!");
static_assert(offsetof(UW_BaseItemInfo_C, DebugEffectRow04) == 0x0002A8, "Member 'UW_BaseItemInfo_C::DebugEffectRow04' has a wrong offset!");
static_assert(offsetof(UW_BaseItemInfo_C, HorizontalBox_AttachmentsPanel) == 0x0002B0, "Member 'UW_BaseItemInfo_C::HorizontalBox_AttachmentsPanel' has a wrong offset!");
static_assert(offsetof(UW_BaseItemInfo_C, HorizontalBox_Durability) == 0x0002B8, "Member 'UW_BaseItemInfo_C::HorizontalBox_Durability' has a wrong offset!");
static_assert(offsetof(UW_BaseItemInfo_C, HorizontalBox_Type) == 0x0002C0, "Member 'UW_BaseItemInfo_C::HorizontalBox_Type' has a wrong offset!");
static_assert(offsetof(UW_BaseItemInfo_C, HorizontalBox_Weight) == 0x0002C8, "Member 'UW_BaseItemInfo_C::HorizontalBox_Weight' has a wrong offset!");
static_assert(offsetof(UW_BaseItemInfo_C, Image_457) == 0x0002D0, "Member 'UW_BaseItemInfo_C::Image_457' has a wrong offset!");
static_assert(offsetof(UW_BaseItemInfo_C, Image_EquipmentMark) == 0x0002D8, "Member 'UW_BaseItemInfo_C::Image_EquipmentMark' has a wrong offset!");
static_assert(offsetof(UW_BaseItemInfo_C, ProgressBar_Durability) == 0x0002E0, "Member 'UW_BaseItemInfo_C::ProgressBar_Durability' has a wrong offset!");
static_assert(offsetof(UW_BaseItemInfo_C, SizeBox_Grid) == 0x0002E8, "Member 'UW_BaseItemInfo_C::SizeBox_Grid' has a wrong offset!");
static_assert(offsetof(UW_BaseItemInfo_C, SizeBox_Root) == 0x0002F0, "Member 'UW_BaseItemInfo_C::SizeBox_Root' has a wrong offset!");
static_assert(offsetof(UW_BaseItemInfo_C, TextBlock_Desc) == 0x0002F8, "Member 'UW_BaseItemInfo_C::TextBlock_Desc' has a wrong offset!");
static_assert(offsetof(UW_BaseItemInfo_C, TextBlock_Durability) == 0x000300, "Member 'UW_BaseItemInfo_C::TextBlock_Durability' has a wrong offset!");
static_assert(offsetof(UW_BaseItemInfo_C, TextBlock_ItemName) == 0x000308, "Member 'UW_BaseItemInfo_C::TextBlock_ItemName' has a wrong offset!");
static_assert(offsetof(UW_BaseItemInfo_C, TextBlock_ItemType) == 0x000310, "Member 'UW_BaseItemInfo_C::TextBlock_ItemType' has a wrong offset!");
static_assert(offsetof(UW_BaseItemInfo_C, TextBlock_Price) == 0x000318, "Member 'UW_BaseItemInfo_C::TextBlock_Price' has a wrong offset!");
static_assert(offsetof(UW_BaseItemInfo_C, TextBlock_SlotDemention) == 0x000320, "Member 'UW_BaseItemInfo_C::TextBlock_SlotDemention' has a wrong offset!");
static_assert(offsetof(UW_BaseItemInfo_C, TextBlock_Weight) == 0x000328, "Member 'UW_BaseItemInfo_C::TextBlock_Weight' has a wrong offset!");
static_assert(offsetof(UW_BaseItemInfo_C, VerticalBox_Effects) == 0x000330, "Member 'UW_BaseItemInfo_C::VerticalBox_Effects' has a wrong offset!");
static_assert(offsetof(UW_BaseItemInfo_C, IsHidden) == 0x000338, "Member 'UW_BaseItemInfo_C::IsHidden' has a wrong offset!");
static_assert(offsetof(UW_BaseItemInfo_C, Item_Slot) == 0x000340, "Member 'UW_BaseItemInfo_C::Item_Slot' has a wrong offset!");
static_assert(offsetof(UW_BaseItemInfo_C, Item_Info) == 0x000348, "Member 'UW_BaseItemInfo_C::Item_Info' has a wrong offset!");
static_assert(offsetof(UW_BaseItemInfo_C, Text) == 0x000568, "Member 'UW_BaseItemInfo_C::Text' has a wrong offset!");
static_assert(offsetof(UW_BaseItemInfo_C, bIsTickAllowed) == 0x000580, "Member 'UW_BaseItemInfo_C::bIsTickAllowed' has a wrong offset!");
static_assert(offsetof(UW_BaseItemInfo_C, SlotRef) == 0x000588, "Member 'UW_BaseItemInfo_C::SlotRef' has a wrong offset!");

}

