#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_BlackScreen

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FMODStudio_structs.hpp"
#include "F_LoadingScreenHints_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function W_BlackScreen.W_BlackScreen_C.Close
// 0x0001 (0x0001 - 0x0000)
struct W_BlackScreen_C_Close final
{
public:
	bool                                          OnCar;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_BlackScreen_C_Close) == 0x000001, "Wrong alignment on W_BlackScreen_C_Close");
static_assert(sizeof(W_BlackScreen_C_Close) == 0x000001, "Wrong size on W_BlackScreen_C_Close");
static_assert(offsetof(W_BlackScreen_C_Close, OnCar) == 0x000000, "Member 'W_BlackScreen_C_Close::OnCar' has a wrong offset!");

// Function W_BlackScreen.W_BlackScreen_C.ExecuteUbergraph_W_BlackScreen
// 0x0660 (0x0660 - 0x0000)
struct W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USurvivalGameInstance*                  K2Node_DynamicCast_AsSurvival_Game_Instance;       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_GameHUD_C*                          K2Node_DynamicCast_AsBP_Game_HUD;                  // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USurvivalGameInstance*                  K2Node_DynamicCast_AsSurvival_Game_Instance_1;     // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0058(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Random_OutItem;                     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FF_LoadingScreenHints                  CallFunc_GetDataTableRowFromName_OutRow;           // 0x0078(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00A8(0x0010)(ReferenceParm)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames_1;       // 0x00B8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00C8(0x0018)()
	class FName                                   CallFunc_Array_Random_OutItem_1;                   // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex_1;                  // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00F0(0x0050)(HasGetValueTypeHash)
	struct FF_LoadingScreenHints                  CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0140(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0160(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0170(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0190(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x01A8(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x01C0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x01D0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x01E8(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x0238(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_3;                     // 0x0248(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_4;                          // 0x0260(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_4;                     // 0x0270(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0288(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_5;                          // 0x02D8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_5;                     // 0x02E8(0x0018)()
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_6;                          // 0x0308(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_6;                     // 0x0318(0x0018)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0330(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0340(0x0050)(HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0390(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_7;                          // 0x0398(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_7;                     // 0x03A8(0x0018)()
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_1;                // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x03C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x03D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x03E8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x03F8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_Text;                           // 0x0400(0x0018)()
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0420(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_429[0x7];                                      // 0x0429(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvPC_C*                              K2Node_DynamicCast_AsSurv_PC;                      // 0x0430(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_OnCar;                          // 0x0439(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_WithoutShade;                   // 0x043A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43B[0x5];                                      // 0x043B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0440(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0448(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvPC_C*                              K2Node_DynamicCast_AsSurv_PC_1;                    // 0x0458(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1;  // 0x0461(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_462[0x6];                                      // 0x0462(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_1;          // 0x0468(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x0480(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_8;                          // 0x04D0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_8;                     // 0x04E0(0x0018)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x04F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0500(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAVS_VehicleMaster_C*                   K2Node_DynamicCast_AsAVS_Vehicle_Master;           // 0x0508(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_511[0x7];                                      // 0x0511(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0518(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0520(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_521[0x7];                                      // 0x0521(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayerCutsceneComponent_C*             CallFunc_GetComponentByClass_ReturnValue;          // 0x0528(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      CallFunc_Array_Get_Item;                           // 0x0530(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0538(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayerCutsceneComponent_C*             CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0548(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x0550(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_1;                 // 0x0558(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_5;        // 0x0560(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player_1;            // 0x0568(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_571[0x7];                                      // 0x0571(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_2;                 // 0x0578(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0580(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player_2;            // 0x05E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x05E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E9[0x7];                                      // 0x05E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x05F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0608(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0620(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayerCutsceneComponent_C*             CallFunc_GetComponentByClass_ReturnValue_2;        // 0x0638(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPlayerCutsceneComponent_C*             CallFunc_GetComponentByClass_ReturnValue_3;        // 0x0640(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0648(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen) == 0x000010, "Wrong alignment on W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen");
static_assert(sizeof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen) == 0x000660, "Wrong size on W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, EntryPoint) == 0x000000, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, K2Node_DynamicCast_AsSurvival_Game_Instance) == 0x000010, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::K2Node_DynamicCast_AsSurvival_Game_Instance' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, CallFunc_GetPlayerController_ReturnValue) == 0x000020, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, CallFunc_GetHUD_ReturnValue) == 0x000028, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, K2Node_DynamicCast_AsBP_Game_HUD) == 0x000030, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::K2Node_DynamicCast_AsBP_Game_HUD' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, CallFunc_GetGameInstance_ReturnValue_1) == 0x000040, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, K2Node_DynamicCast_AsSurvival_Game_Instance_1) == 0x000048, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::K2Node_DynamicCast_AsSurvival_Game_Instance_1' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, K2Node_DynamicCast_bSuccess_2) == 0x000050, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000058, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, CallFunc_Array_Random_OutItem) == 0x000068, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, CallFunc_Array_Random_OutIndex) == 0x000070, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, CallFunc_GetDataTableRowFromName_OutRow) == 0x000078, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000090, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, CallFunc_PlayAnimationForward_ReturnValue) == 0x000098, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, CallFunc_PlayAnimation_ReturnValue) == 0x0000A0, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, K2Node_MakeArray_Array) == 0x0000A8, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, CallFunc_GetDataTableRowNames_OutRowNames_1) == 0x0000B8, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::CallFunc_GetDataTableRowNames_OutRowNames_1' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, CallFunc_Format_ReturnValue) == 0x0000C8, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, CallFunc_Array_Random_OutItem_1) == 0x0000E0, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::CallFunc_Array_Random_OutItem_1' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, CallFunc_Array_Random_OutIndex_1) == 0x0000E8, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::CallFunc_Array_Random_OutIndex_1' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, K2Node_MakeStruct_FormatArgumentData) == 0x0000F0, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000140, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000158, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, K2Node_MakeArray_Array_1) == 0x000160, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, CallFunc_Format_ReturnValue_1) == 0x000170, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000188, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, K2Node_CreateDelegate_OutputDelegate) == 0x000190, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, CallFunc_PlayAnimation_ReturnValue_1) == 0x0001A0, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, CallFunc_Conv_DoubleToText_ReturnValue) == 0x0001A8, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, K2Node_MakeArray_Array_2) == 0x0001C0, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, CallFunc_Format_ReturnValue_2) == 0x0001D0, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, K2Node_MakeStruct_FormatArgumentData_1) == 0x0001E8, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, K2Node_MakeArray_Array_3) == 0x000238, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, CallFunc_Format_ReturnValue_3) == 0x000248, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::CallFunc_Format_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, K2Node_MakeArray_Array_4) == 0x000260, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, CallFunc_Format_ReturnValue_4) == 0x000270, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::CallFunc_Format_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, K2Node_MakeStruct_FormatArgumentData_2) == 0x000288, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, K2Node_MakeArray_Array_5) == 0x0002D8, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::K2Node_MakeArray_Array_5' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, CallFunc_Format_ReturnValue_5) == 0x0002E8, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::CallFunc_Format_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, CallFunc_PlayEvent2D_ReturnValue) == 0x000300, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::CallFunc_PlayEvent2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, K2Node_MakeArray_Array_6) == 0x000308, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::K2Node_MakeArray_Array_6' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, CallFunc_Format_ReturnValue_6) == 0x000318, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::CallFunc_Format_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, K2Node_CreateDelegate_OutputDelegate_1) == 0x000330, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, K2Node_MakeStruct_FormatArgumentData_3) == 0x000340, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000390, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, K2Node_MakeArray_Array_7) == 0x000398, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::K2Node_MakeArray_Array_7' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, CallFunc_Format_ReturnValue_7) == 0x0003A8, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::CallFunc_Format_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, CallFunc_PlayEvent2D_ReturnValue_1) == 0x0003C0, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::CallFunc_PlayEvent2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, CallFunc_Conv_TextToString_ReturnValue) == 0x0003C8, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, CallFunc_Concat_StrStr_ReturnValue) == 0x0003D8, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, K2Node_CreateDelegate_OutputDelegate_2) == 0x0003E8, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x0003F8, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, K2Node_CustomEvent_Text) == 0x000400, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::K2Node_CustomEvent_Text' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000418, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, CallFunc_GetPlayerController_ReturnValue_1) == 0x000420, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000428, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, K2Node_DynamicCast_AsSurv_PC) == 0x000430, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::K2Node_DynamicCast_AsSurv_PC' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, K2Node_DynamicCast_bSuccess_3) == 0x000438, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, K2Node_CustomEvent_OnCar) == 0x000439, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::K2Node_CustomEvent_OnCar' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, K2Node_CustomEvent_WithoutShade) == 0x00043A, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::K2Node_CustomEvent_WithoutShade' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, CallFunc_GetPlayerController_ReturnValue_2) == 0x000440, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, K2Node_CreateDelegate_OutputDelegate_3) == 0x000448, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, K2Node_DynamicCast_AsSurv_PC_1) == 0x000458, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::K2Node_DynamicCast_AsSurv_PC_1' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, K2Node_DynamicCast_bSuccess_4) == 0x000460, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1) == 0x000461, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, CallFunc_Conv_DoubleToText_ReturnValue_1) == 0x000468, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::CallFunc_Conv_DoubleToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, K2Node_MakeStruct_FormatArgumentData_4) == 0x000480, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, K2Node_MakeArray_Array_8) == 0x0004D0, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::K2Node_MakeArray_Array_8' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, CallFunc_Format_ReturnValue_8) == 0x0004E0, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::CallFunc_Format_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, CallFunc_GetPlayerController_ReturnValue_3) == 0x0004F8, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, CallFunc_K2_GetPawn_ReturnValue) == 0x000500, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, K2Node_DynamicCast_AsAVS_Vehicle_Master) == 0x000508, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::K2Node_DynamicCast_AsAVS_Vehicle_Master' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, K2Node_DynamicCast_bSuccess_5) == 0x000510, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, K2Node_DynamicCast_AsSurvival_Player) == 0x000518, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, K2Node_DynamicCast_bSuccess_6) == 0x000520, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, CallFunc_GetComponentByClass_ReturnValue) == 0x000528, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, CallFunc_Array_Get_Item) == 0x000530, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, K2Node_CreateDelegate_OutputDelegate_4) == 0x000538, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000548, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, CallFunc_GetPlayerController_ReturnValue_4) == 0x000550, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::CallFunc_GetPlayerController_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, CallFunc_K2_GetPawn_ReturnValue_1) == 0x000558, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::CallFunc_K2_GetPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, CallFunc_GetPlayerController_ReturnValue_5) == 0x000560, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::CallFunc_GetPlayerController_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, K2Node_DynamicCast_AsSurvival_Player_1) == 0x000568, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::K2Node_DynamicCast_AsSurvival_Player_1' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, K2Node_DynamicCast_bSuccess_7) == 0x000570, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, CallFunc_K2_GetPawn_ReturnValue_2) == 0x000578, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::CallFunc_K2_GetPawn_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, CallFunc_GetTransform_ReturnValue) == 0x000580, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, K2Node_DynamicCast_AsSurvival_Player_2) == 0x0005E0, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::K2Node_DynamicCast_AsSurvival_Player_2' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, K2Node_DynamicCast_bSuccess_8) == 0x0005E8, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, CallFunc_BreakTransform_Location) == 0x0005F0, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, CallFunc_BreakTransform_Rotation) == 0x000608, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, CallFunc_BreakTransform_Scale) == 0x000620, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, CallFunc_GetComponentByClass_ReturnValue_2) == 0x000638, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::CallFunc_GetComponentByClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, CallFunc_GetComponentByClass_ReturnValue_3) == 0x000640, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::CallFunc_GetComponentByClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen, K2Node_CreateDelegate_OutputDelegate_5) == 0x000648, "Member 'W_BlackScreen_C_ExecuteUbergraph_W_BlackScreen::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");

// Function W_BlackScreen.W_BlackScreen_C.Open
// 0x0001 (0x0001 - 0x0000)
struct W_BlackScreen_C_Open final
{
public:
	bool                                          WithoutShade;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_BlackScreen_C_Open) == 0x000001, "Wrong alignment on W_BlackScreen_C_Open");
static_assert(sizeof(W_BlackScreen_C_Open) == 0x000001, "Wrong size on W_BlackScreen_C_Open");
static_assert(offsetof(W_BlackScreen_C_Open, WithoutShade) == 0x000000, "Member 'W_BlackScreen_C_Open::WithoutShade' has a wrong offset!");

// Function W_BlackScreen.W_BlackScreen_C.OpenWithText
// 0x0018 (0x0018 - 0x0000)
struct W_BlackScreen_C_OpenWithText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(W_BlackScreen_C_OpenWithText) == 0x000008, "Wrong alignment on W_BlackScreen_C_OpenWithText");
static_assert(sizeof(W_BlackScreen_C_OpenWithText) == 0x000018, "Wrong size on W_BlackScreen_C_OpenWithText");
static_assert(offsetof(W_BlackScreen_C_OpenWithText, Text) == 0x000000, "Member 'W_BlackScreen_C_OpenWithText::Text' has a wrong offset!");

// Function W_BlackScreen.W_BlackScreen_C.SetTextAndHint
// 0x0038 (0x0038 - 0x0000)
struct W_BlackScreen_C_SetTextAndHint final
{
public:
	class FText                                   MapName;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   HintText;                                          // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UTexture2D*                             Texture;                                           // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_BlackScreen_C_SetTextAndHint) == 0x000008, "Wrong alignment on W_BlackScreen_C_SetTextAndHint");
static_assert(sizeof(W_BlackScreen_C_SetTextAndHint) == 0x000038, "Wrong size on W_BlackScreen_C_SetTextAndHint");
static_assert(offsetof(W_BlackScreen_C_SetTextAndHint, MapName) == 0x000000, "Member 'W_BlackScreen_C_SetTextAndHint::MapName' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_SetTextAndHint, HintText) == 0x000018, "Member 'W_BlackScreen_C_SetTextAndHint::HintText' has a wrong offset!");
static_assert(offsetof(W_BlackScreen_C_SetTextAndHint, Texture) == 0x000030, "Member 'W_BlackScreen_C_SetTextAndHint::Texture' has a wrong offset!");

}

