#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_BodyTypeCell

#include "Basic.hpp"

#include "WS_BodyFeatures_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "WE_BodyTypes_structs.hpp"
#include "InputCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FMODStudio_structs.hpp"


namespace SDK::Params
{

// Function W_BodyTypeCell.W_BodyTypeCell_C.Change Material Param Color
// 0x0088 (0x0088 - 0x0000)
struct W_BodyTypeCell_C_Change_Material_Param_Color final
{
public:
	TArray<class USkeletalMeshComponent*>         Array;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class FName                                   ParameterName;                                     // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Value;                                             // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue;                 // 0x0050(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_Array_Get_Item_1;                         // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_BodyTypeCell_C_Change_Material_Param_Color) == 0x000008, "Wrong alignment on W_BodyTypeCell_C_Change_Material_Param_Color");
static_assert(sizeof(W_BodyTypeCell_C_Change_Material_Param_Color) == 0x000088, "Wrong size on W_BodyTypeCell_C_Change_Material_Param_Color");
static_assert(offsetof(W_BodyTypeCell_C_Change_Material_Param_Color, Array) == 0x000000, "Member 'W_BodyTypeCell_C_Change_Material_Param_Color::Array' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_Change_Material_Param_Color, ParameterName) == 0x000010, "Member 'W_BodyTypeCell_C_Change_Material_Param_Color::ParameterName' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_Change_Material_Param_Color, Value) == 0x000018, "Member 'W_BodyTypeCell_C_Change_Material_Param_Color::Value' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_Change_Material_Param_Color, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'W_BodyTypeCell_C_Change_Material_Param_Color::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_Change_Material_Param_Color, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'W_BodyTypeCell_C_Change_Material_Param_Color::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_Change_Material_Param_Color, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'W_BodyTypeCell_C_Change_Material_Param_Color::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_Change_Material_Param_Color, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'W_BodyTypeCell_C_Change_Material_Param_Color::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_Change_Material_Param_Color, Temp_int_Array_Index_Variable) == 0x000038, "Member 'W_BodyTypeCell_C_Change_Material_Param_Color::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_Change_Material_Param_Color, Temp_int_Loop_Counter_Variable_1) == 0x00003C, "Member 'W_BodyTypeCell_C_Change_Material_Param_Color::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_Change_Material_Param_Color, CallFunc_Array_Get_Item) == 0x000040, "Member 'W_BodyTypeCell_C_Change_Material_Param_Color::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_Change_Material_Param_Color, CallFunc_Add_IntInt_ReturnValue_1) == 0x000048, "Member 'W_BodyTypeCell_C_Change_Material_Param_Color::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_Change_Material_Param_Color, CallFunc_GetMaterials_ReturnValue) == 0x000050, "Member 'W_BodyTypeCell_C_Change_Material_Param_Color::CallFunc_GetMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_Change_Material_Param_Color, CallFunc_Array_Length_ReturnValue_1) == 0x000060, "Member 'W_BodyTypeCell_C_Change_Material_Param_Color::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_Change_Material_Param_Color, CallFunc_Less_IntInt_ReturnValue_1) == 0x000064, "Member 'W_BodyTypeCell_C_Change_Material_Param_Color::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_Change_Material_Param_Color, Temp_int_Array_Index_Variable_1) == 0x000068, "Member 'W_BodyTypeCell_C_Change_Material_Param_Color::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_Change_Material_Param_Color, CallFunc_Array_Get_Item_1) == 0x000070, "Member 'W_BodyTypeCell_C_Change_Material_Param_Color::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_Change_Material_Param_Color, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000078, "Member 'W_BodyTypeCell_C_Change_Material_Param_Color::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_Change_Material_Param_Color, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'W_BodyTypeCell_C_Change_Material_Param_Color::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function W_BodyTypeCell.W_BodyTypeCell_C.ChangeMaterialScalar
// 0x0078 (0x0078 - 0x0000)
struct W_BodyTypeCell_C_ChangeMaterialScalar final
{
public:
	TArray<class USkeletalMeshComponent*>         Array;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class FName                                   ParameterName;                                     // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Value;                                             // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue;                 // 0x0040(0x0010)(ReferenceParm)
	class UMaterialInterface*                     CallFunc_Array_Get_Item_1;                         // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_BodyTypeCell_C_ChangeMaterialScalar) == 0x000008, "Wrong alignment on W_BodyTypeCell_C_ChangeMaterialScalar");
static_assert(sizeof(W_BodyTypeCell_C_ChangeMaterialScalar) == 0x000078, "Wrong size on W_BodyTypeCell_C_ChangeMaterialScalar");
static_assert(offsetof(W_BodyTypeCell_C_ChangeMaterialScalar, Array) == 0x000000, "Member 'W_BodyTypeCell_C_ChangeMaterialScalar::Array' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_ChangeMaterialScalar, ParameterName) == 0x000010, "Member 'W_BodyTypeCell_C_ChangeMaterialScalar::ParameterName' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_ChangeMaterialScalar, Value) == 0x000018, "Member 'W_BodyTypeCell_C_ChangeMaterialScalar::Value' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_ChangeMaterialScalar, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'W_BodyTypeCell_C_ChangeMaterialScalar::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_ChangeMaterialScalar, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'W_BodyTypeCell_C_ChangeMaterialScalar::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_ChangeMaterialScalar, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'W_BodyTypeCell_C_ChangeMaterialScalar::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_ChangeMaterialScalar, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'W_BodyTypeCell_C_ChangeMaterialScalar::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_ChangeMaterialScalar, Temp_int_Array_Index_Variable) == 0x000030, "Member 'W_BodyTypeCell_C_ChangeMaterialScalar::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_ChangeMaterialScalar, Temp_int_Array_Index_Variable_1) == 0x000034, "Member 'W_BodyTypeCell_C_ChangeMaterialScalar::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_ChangeMaterialScalar, CallFunc_Array_Get_Item) == 0x000038, "Member 'W_BodyTypeCell_C_ChangeMaterialScalar::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_ChangeMaterialScalar, CallFunc_GetMaterials_ReturnValue) == 0x000040, "Member 'W_BodyTypeCell_C_ChangeMaterialScalar::CallFunc_GetMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_ChangeMaterialScalar, CallFunc_Array_Get_Item_1) == 0x000050, "Member 'W_BodyTypeCell_C_ChangeMaterialScalar::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_ChangeMaterialScalar, CallFunc_Array_Length_ReturnValue_1) == 0x000058, "Member 'W_BodyTypeCell_C_ChangeMaterialScalar::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_ChangeMaterialScalar, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000060, "Member 'W_BodyTypeCell_C_ChangeMaterialScalar::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_ChangeMaterialScalar, Temp_int_Loop_Counter_Variable_1) == 0x000068, "Member 'W_BodyTypeCell_C_ChangeMaterialScalar::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_ChangeMaterialScalar, CallFunc_Less_IntInt_ReturnValue_1) == 0x00006C, "Member 'W_BodyTypeCell_C_ChangeMaterialScalar::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_ChangeMaterialScalar, CallFunc_Add_IntInt_ReturnValue_1) == 0x000070, "Member 'W_BodyTypeCell_C_ChangeMaterialScalar::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_ChangeMaterialScalar, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000074, "Member 'W_BodyTypeCell_C_ChangeMaterialScalar::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function W_BodyTypeCell.W_BodyTypeCell_C.CheckBeard
// 0x0018 (0x0018 - 0x0000)
struct W_BodyTypeCell_C_CheckBeard final
{
public:
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_BodyTypeCell_C_CheckBeard) == 0x000008, "Wrong alignment on W_BodyTypeCell_C_CheckBeard");
static_assert(sizeof(W_BodyTypeCell_C_CheckBeard) == 0x000018, "Wrong size on W_BodyTypeCell_C_CheckBeard");
static_assert(offsetof(W_BodyTypeCell_C_CheckBeard, CallFunc_GetGameInstance_ReturnValue) == 0x000000, "Member 'W_BodyTypeCell_C_CheckBeard::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_CheckBeard, K2Node_DynamicCast_AsGI_Survival) == 0x000008, "Member 'W_BodyTypeCell_C_CheckBeard::K2Node_DynamicCast_AsGI_Survival' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_CheckBeard, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'W_BodyTypeCell_C_CheckBeard::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_CheckBeard, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000011, "Member 'W_BodyTypeCell_C_CheckBeard::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function W_BodyTypeCell.W_BodyTypeCell_C.CheckEmptySlot
// 0x0002 (0x0002 - 0x0000)
struct W_BodyTypeCell_C_CheckEmptySlot final
{
public:
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_BodyTypeCell_C_CheckEmptySlot) == 0x000001, "Wrong alignment on W_BodyTypeCell_C_CheckEmptySlot");
static_assert(sizeof(W_BodyTypeCell_C_CheckEmptySlot) == 0x000002, "Wrong size on W_BodyTypeCell_C_CheckEmptySlot");
static_assert(offsetof(W_BodyTypeCell_C_CheckEmptySlot, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000000, "Member 'W_BodyTypeCell_C_CheckEmptySlot::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_CheckEmptySlot, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000001, "Member 'W_BodyTypeCell_C_CheckEmptySlot::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");

// Function W_BodyTypeCell.W_BodyTypeCell_C.CheckHairAndBeard
// 0x0038 (0x0038 - 0x0000)
struct W_BodyTypeCell_C_CheckHairAndBeard final
{
public:
	bool                                          IsBeard;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsHead;                                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue_1;       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CreateCharacter_C*                  CallFunc_GetActorOfClass_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_CreateCharacter_C*                  CallFunc_GetActorOfClass_ReturnValue_1;            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CreateCharacter_C*                  CallFunc_GetActorOfClass_ReturnValue_2;            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_BodyTypeCell_C_CheckHairAndBeard) == 0x000008, "Wrong alignment on W_BodyTypeCell_C_CheckHairAndBeard");
static_assert(sizeof(W_BodyTypeCell_C_CheckHairAndBeard) == 0x000038, "Wrong size on W_BodyTypeCell_C_CheckHairAndBeard");
static_assert(offsetof(W_BodyTypeCell_C_CheckHairAndBeard, IsBeard) == 0x000000, "Member 'W_BodyTypeCell_C_CheckHairAndBeard::IsBeard' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_CheckHairAndBeard, IsHead) == 0x000001, "Member 'W_BodyTypeCell_C_CheckHairAndBeard::IsHead' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_CheckHairAndBeard, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000004, "Member 'W_BodyTypeCell_C_CheckHairAndBeard::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_CheckHairAndBeard, CallFunc_RandomIntegerInRange_ReturnValue_1) == 0x000008, "Member 'W_BodyTypeCell_C_CheckHairAndBeard::CallFunc_RandomIntegerInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_CheckHairAndBeard, CallFunc_GetActorOfClass_ReturnValue) == 0x000010, "Member 'W_BodyTypeCell_C_CheckHairAndBeard::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_CheckHairAndBeard, CallFunc_GetActorOfClass_ReturnValue_1) == 0x000018, "Member 'W_BodyTypeCell_C_CheckHairAndBeard::CallFunc_GetActorOfClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_CheckHairAndBeard, CallFunc_BooleanOR_ReturnValue) == 0x000020, "Member 'W_BodyTypeCell_C_CheckHairAndBeard::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_CheckHairAndBeard, CallFunc_GetActorOfClass_ReturnValue_2) == 0x000028, "Member 'W_BodyTypeCell_C_CheckHairAndBeard::CallFunc_GetActorOfClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_CheckHairAndBeard, CallFunc_BooleanOR_ReturnValue_1) == 0x000030, "Member 'W_BodyTypeCell_C_CheckHairAndBeard::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");

// Function W_BodyTypeCell.W_BodyTypeCell_C.CheckSkin
// 0x0003 (0x0003 - 0x0000)
struct W_BodyTypeCell_C_CheckSkin final
{
public:
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_BodyTypeCell_C_CheckSkin) == 0x000001, "Wrong alignment on W_BodyTypeCell_C_CheckSkin");
static_assert(sizeof(W_BodyTypeCell_C_CheckSkin) == 0x000003, "Wrong size on W_BodyTypeCell_C_CheckSkin");
static_assert(offsetof(W_BodyTypeCell_C_CheckSkin, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000000, "Member 'W_BodyTypeCell_C_CheckSkin::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_CheckSkin, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000001, "Member 'W_BodyTypeCell_C_CheckSkin::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_CheckSkin, CallFunc_EqualEqual_ObjectObject_ReturnValue_2) == 0x000002, "Member 'W_BodyTypeCell_C_CheckSkin::CallFunc_EqualEqual_ObjectObject_ReturnValue_2' has a wrong offset!");

// Function W_BodyTypeCell.W_BodyTypeCell_C.CheckSkinTone
// 0x0188 (0x0188 - 0x0000)
struct W_BodyTypeCell_C_CheckSkinTone final
{
public:
	bool                                          Woman_;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Black;                                             // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0004(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x000C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x0014(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_3;                              // 0x001C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_4;                              // 0x0024(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_5;                              // 0x002C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_6;                              // 0x0034(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_7;                              // 0x003C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival;                  // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetMaterialSlotNames_ReturnValue;         // 0x0060(0x0010)(ReferenceParm)
	TArray<class FName>                           CallFunc_GetMaterialSlotNames_ReturnValue_1;       // 0x0070(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue_1;                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival_1;                // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetMaterialSlotNames_ReturnValue_2;       // 0x00B0(0x0010)(ReferenceParm)
	TArray<class FName>                           CallFunc_GetMaterialSlotNames_ReturnValue_3;       // 0x00C0(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Find_ReturnValue_2;                 // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue_3;                 // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_2; // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_3; // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_2;            // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival_2;                // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetMaterialSlotNames_ReturnValue_4;       // 0x0100(0x0010)(ReferenceParm)
	TArray<class FName>                           CallFunc_GetMaterialSlotNames_ReturnValue_5;       // 0x0110(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Find_ReturnValue_4;                 // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue_5;                 // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_4; // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_5; // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_3;            // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival_3;                // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetMaterialSlotNames_ReturnValue_6;       // 0x0150(0x0010)(ReferenceParm)
	TArray<class FName>                           CallFunc_GetMaterialSlotNames_ReturnValue_7;       // 0x0160(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Find_ReturnValue_6;                 // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue_7;                 // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_6; // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_7; // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_BodyTypeCell_C_CheckSkinTone) == 0x000008, "Wrong alignment on W_BodyTypeCell_C_CheckSkinTone");
static_assert(sizeof(W_BodyTypeCell_C_CheckSkinTone) == 0x000188, "Wrong size on W_BodyTypeCell_C_CheckSkinTone");
static_assert(offsetof(W_BodyTypeCell_C_CheckSkinTone, Woman_) == 0x000000, "Member 'W_BodyTypeCell_C_CheckSkinTone::Woman_' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_CheckSkinTone, Black) == 0x000001, "Member 'W_BodyTypeCell_C_CheckSkinTone::Black' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_CheckSkinTone, Temp_name_Variable) == 0x000004, "Member 'W_BodyTypeCell_C_CheckSkinTone::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_CheckSkinTone, Temp_name_Variable_1) == 0x00000C, "Member 'W_BodyTypeCell_C_CheckSkinTone::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_CheckSkinTone, Temp_name_Variable_2) == 0x000014, "Member 'W_BodyTypeCell_C_CheckSkinTone::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_CheckSkinTone, Temp_name_Variable_3) == 0x00001C, "Member 'W_BodyTypeCell_C_CheckSkinTone::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_CheckSkinTone, Temp_name_Variable_4) == 0x000024, "Member 'W_BodyTypeCell_C_CheckSkinTone::Temp_name_Variable_4' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_CheckSkinTone, Temp_name_Variable_5) == 0x00002C, "Member 'W_BodyTypeCell_C_CheckSkinTone::Temp_name_Variable_5' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_CheckSkinTone, Temp_name_Variable_6) == 0x000034, "Member 'W_BodyTypeCell_C_CheckSkinTone::Temp_name_Variable_6' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_CheckSkinTone, Temp_name_Variable_7) == 0x00003C, "Member 'W_BodyTypeCell_C_CheckSkinTone::Temp_name_Variable_7' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_CheckSkinTone, CallFunc_GetGameInstance_ReturnValue) == 0x000048, "Member 'W_BodyTypeCell_C_CheckSkinTone::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_CheckSkinTone, K2Node_DynamicCast_AsGI_Survival) == 0x000050, "Member 'W_BodyTypeCell_C_CheckSkinTone::K2Node_DynamicCast_AsGI_Survival' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_CheckSkinTone, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'W_BodyTypeCell_C_CheckSkinTone::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_CheckSkinTone, CallFunc_GetMaterialSlotNames_ReturnValue) == 0x000060, "Member 'W_BodyTypeCell_C_CheckSkinTone::CallFunc_GetMaterialSlotNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_CheckSkinTone, CallFunc_GetMaterialSlotNames_ReturnValue_1) == 0x000070, "Member 'W_BodyTypeCell_C_CheckSkinTone::CallFunc_GetMaterialSlotNames_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_CheckSkinTone, CallFunc_Array_Find_ReturnValue) == 0x000080, "Member 'W_BodyTypeCell_C_CheckSkinTone::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_CheckSkinTone, CallFunc_Array_Find_ReturnValue_1) == 0x000084, "Member 'W_BodyTypeCell_C_CheckSkinTone::CallFunc_Array_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_CheckSkinTone, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000088, "Member 'W_BodyTypeCell_C_CheckSkinTone::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_CheckSkinTone, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000090, "Member 'W_BodyTypeCell_C_CheckSkinTone::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_CheckSkinTone, CallFunc_GetGameInstance_ReturnValue_1) == 0x000098, "Member 'W_BodyTypeCell_C_CheckSkinTone::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_CheckSkinTone, K2Node_DynamicCast_AsGI_Survival_1) == 0x0000A0, "Member 'W_BodyTypeCell_C_CheckSkinTone::K2Node_DynamicCast_AsGI_Survival_1' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_CheckSkinTone, K2Node_DynamicCast_bSuccess_1) == 0x0000A8, "Member 'W_BodyTypeCell_C_CheckSkinTone::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_CheckSkinTone, CallFunc_GetMaterialSlotNames_ReturnValue_2) == 0x0000B0, "Member 'W_BodyTypeCell_C_CheckSkinTone::CallFunc_GetMaterialSlotNames_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_CheckSkinTone, CallFunc_GetMaterialSlotNames_ReturnValue_3) == 0x0000C0, "Member 'W_BodyTypeCell_C_CheckSkinTone::CallFunc_GetMaterialSlotNames_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_CheckSkinTone, CallFunc_Array_Find_ReturnValue_2) == 0x0000D0, "Member 'W_BodyTypeCell_C_CheckSkinTone::CallFunc_Array_Find_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_CheckSkinTone, CallFunc_Array_Find_ReturnValue_3) == 0x0000D4, "Member 'W_BodyTypeCell_C_CheckSkinTone::CallFunc_Array_Find_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_CheckSkinTone, CallFunc_CreateDynamicMaterialInstance_ReturnValue_2) == 0x0000D8, "Member 'W_BodyTypeCell_C_CheckSkinTone::CallFunc_CreateDynamicMaterialInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_CheckSkinTone, CallFunc_CreateDynamicMaterialInstance_ReturnValue_3) == 0x0000E0, "Member 'W_BodyTypeCell_C_CheckSkinTone::CallFunc_CreateDynamicMaterialInstance_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_CheckSkinTone, CallFunc_GetGameInstance_ReturnValue_2) == 0x0000E8, "Member 'W_BodyTypeCell_C_CheckSkinTone::CallFunc_GetGameInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_CheckSkinTone, K2Node_DynamicCast_AsGI_Survival_2) == 0x0000F0, "Member 'W_BodyTypeCell_C_CheckSkinTone::K2Node_DynamicCast_AsGI_Survival_2' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_CheckSkinTone, K2Node_DynamicCast_bSuccess_2) == 0x0000F8, "Member 'W_BodyTypeCell_C_CheckSkinTone::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_CheckSkinTone, CallFunc_GetMaterialSlotNames_ReturnValue_4) == 0x000100, "Member 'W_BodyTypeCell_C_CheckSkinTone::CallFunc_GetMaterialSlotNames_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_CheckSkinTone, CallFunc_GetMaterialSlotNames_ReturnValue_5) == 0x000110, "Member 'W_BodyTypeCell_C_CheckSkinTone::CallFunc_GetMaterialSlotNames_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_CheckSkinTone, CallFunc_Array_Find_ReturnValue_4) == 0x000120, "Member 'W_BodyTypeCell_C_CheckSkinTone::CallFunc_Array_Find_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_CheckSkinTone, CallFunc_Array_Find_ReturnValue_5) == 0x000124, "Member 'W_BodyTypeCell_C_CheckSkinTone::CallFunc_Array_Find_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_CheckSkinTone, CallFunc_CreateDynamicMaterialInstance_ReturnValue_4) == 0x000128, "Member 'W_BodyTypeCell_C_CheckSkinTone::CallFunc_CreateDynamicMaterialInstance_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_CheckSkinTone, CallFunc_CreateDynamicMaterialInstance_ReturnValue_5) == 0x000130, "Member 'W_BodyTypeCell_C_CheckSkinTone::CallFunc_CreateDynamicMaterialInstance_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_CheckSkinTone, CallFunc_GetGameInstance_ReturnValue_3) == 0x000138, "Member 'W_BodyTypeCell_C_CheckSkinTone::CallFunc_GetGameInstance_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_CheckSkinTone, K2Node_DynamicCast_AsGI_Survival_3) == 0x000140, "Member 'W_BodyTypeCell_C_CheckSkinTone::K2Node_DynamicCast_AsGI_Survival_3' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_CheckSkinTone, K2Node_DynamicCast_bSuccess_3) == 0x000148, "Member 'W_BodyTypeCell_C_CheckSkinTone::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_CheckSkinTone, CallFunc_GetMaterialSlotNames_ReturnValue_6) == 0x000150, "Member 'W_BodyTypeCell_C_CheckSkinTone::CallFunc_GetMaterialSlotNames_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_CheckSkinTone, CallFunc_GetMaterialSlotNames_ReturnValue_7) == 0x000160, "Member 'W_BodyTypeCell_C_CheckSkinTone::CallFunc_GetMaterialSlotNames_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_CheckSkinTone, CallFunc_Array_Find_ReturnValue_6) == 0x000170, "Member 'W_BodyTypeCell_C_CheckSkinTone::CallFunc_Array_Find_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_CheckSkinTone, CallFunc_Array_Find_ReturnValue_7) == 0x000174, "Member 'W_BodyTypeCell_C_CheckSkinTone::CallFunc_Array_Find_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_CheckSkinTone, CallFunc_CreateDynamicMaterialInstance_ReturnValue_6) == 0x000178, "Member 'W_BodyTypeCell_C_CheckSkinTone::CallFunc_CreateDynamicMaterialInstance_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(W_BodyTypeCell_C_CheckSkinTone, CallFunc_CreateDynamicMaterialInstance_ReturnValue_7) == 0x000180, "Member 'W_BodyTypeCell_C_CheckSkinTone::CallFunc_CreateDynamicMaterialInstance_ReturnValue_7' has a wrong offset!");

// Function W_BodyTypeCell.W_BodyTypeCell_C.ExecuteUbergraph_W_BodyTypeCell
// 0x0540 (0x0540 - 0x0000)
struct W_BodyTypeCell_C_ExecuteUbergraph_W_BodyTypeCell final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival;                  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USkeletalMeshComponent*>         K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          CallFunc_GetSkeletalMeshAsset_ReturnValue;         // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetPostProcessInstance_ReturnValue;       // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_ABPHead_C>        K2Node_DynamicCast_AsBPI_ABPHead;                  // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival_1;                // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B[0x5];                                       // 0x007B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         K2Node_MakeArray_Array_1;                          // 0x0080(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0096(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_3;    // 0x0097(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_4;    // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x009B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          K2Node_DynamicCast_AsSkeletal_Mesh;                // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          CallFunc_GetSkeletalMeshAsset_ReturnValue_1;       // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetPostProcessInstance_ReturnValue_1;     // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_ABPHead_C>        K2Node_DynamicCast_AsBPI_ABPHead_1;                // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_2;            // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival_2;                // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         K2Node_MakeArray_Array_2;                          // 0x00F8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UObject*                                Temp_object_Variable_1;                            // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPaperSprite*                           K2Node_DynamicCast_AsPaper_Sprite;                 // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetMaterialSlotNames_ReturnValue;         // 0x0120(0x0010)(ReferenceParm)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_142[0x6];                                      // 0x0142(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_4;                       // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_3;            // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival_3;                // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_162[0x2];                                      // 0x0162(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0164(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_MakeBrushFromSprite_ReturnValue;          // 0x0170(0x00D0)()
	class FName                                   Temp_name_Variable_1;                              // 0x0240(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0248(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CreateCharacter_C*                  CallFunc_GetActorOfClass_ReturnValue;              // 0x0288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_294[0x4];                                      // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          CallFunc_GetSkeletalMeshAsset_ReturnValue_2;       // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetMaterialSlotNames_ReturnValue_1;       // 0x02B0(0x0010)(ReferenceParm)
	class UAnimInstance*                          CallFunc_GetPostProcessInstance_ReturnValue_2;     // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue_1;                 // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_ABPHead_C>        K2Node_DynamicCast_AsBPI_ABPHead_2;                // 0x02D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
