#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_BottomHint

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_BottomHint.W_BottomHint_C.ExecuteUbergraph_W_BottomHint
// 0x0020 (0x0020 - 0x0000)
struct W_BottomHint_C_ExecuteUbergraph_W_BottomHint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_InText;                         // 0x0008(0x0018)()
};
static_assert(alignof(W_BottomHint_C_ExecuteUbergraph_W_BottomHint) == 0x000008, "Wrong alignment on W_BottomHint_C_ExecuteUbergraph_W_BottomHint");
static_assert(sizeof(W_BottomHint_C_ExecuteUbergraph_W_BottomHint) == 0x000020, "Wrong size on W_BottomHint_C_ExecuteUbergraph_W_BottomHint");
static_assert(offsetof(W_BottomHint_C_ExecuteUbergraph_W_BottomHint, EntryPoint) == 0x000000, "Member 'W_BottomHint_C_ExecuteUbergraph_W_BottomHint::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_BottomHint_C_ExecuteUbergraph_W_BottomHint, K2Node_CustomEvent_InText) == 0x000008, "Member 'W_BottomHint_C_ExecuteUbergraph_W_BottomHint::K2Node_CustomEvent_InText' has a wrong offset!");

// Function W_BottomHint.W_BottomHint_C.SetHint
// 0x0018 (0x0018 - 0x0000)
struct W_BottomHint_C_SetHint final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(W_BottomHint_C_SetHint) == 0x000008, "Wrong alignment on W_BottomHint_C_SetHint");
static_assert(sizeof(W_BottomHint_C_SetHint) == 0x000018, "Wrong size on W_BottomHint_C_SetHint");
static_assert(offsetof(W_BottomHint_C_SetHint, InText) == 0x000000, "Member 'W_BottomHint_C_SetHint::InText' has a wrong offset!");

}

