#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_BodyType_Actual_Cell

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_BodyType_Actual_Cell.W_BodyType_Actual_Cell_C
// 0x0068 (0x02E8 - 0x0280)
class UW_BodyType_Actual_Cell_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Selected;                                          // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hovered;                                           // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_BodyType;                                   // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BodyType;                                    // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BodyType_Selected;                           // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_State;                              // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPaperSprite*                           Icon_BodyType;                                     // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         Desired_Image_Size;                                // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             PressedButton_Teloslozhenie_ED;                    // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         Desired_Image_Size_Height;                         // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__W_BodyType_Actual_Cell_Button_BodyType_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__W_BodyType_Actual_Cell_Button_BodyType_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void Ceil_Deactivated();
	void Cell_Activated();
	void ExecuteUbergraph_W_BodyType_Actual_Cell(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void PressedButton_Teloslozhenie_ED__DelegateSignature(class UW_BodyType_Actual_Cell_C* GivenCell);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_BodyType_Actual_Cell_C">();
	}
	static class UW_BodyType_Actual_Cell_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_BodyType_Actual_Cell_C>();
	}
};
static_assert(alignof(UW_BodyType_Actual_Cell_C) == 0x000008, "Wrong alignment on UW_BodyType_Actual_Cell_C");
static_assert(sizeof(UW_BodyType_Actual_Cell_C) == 0x0002E8, "Wrong size on UW_BodyType_Actual_Cell_C");
static_assert(offsetof(UW_BodyType_Actual_Cell_C, UberGraphFrame) == 0x000280, "Member 'UW_BodyType_Actual_Cell_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_BodyType_Actual_Cell_C, Selected) == 0x000288, "Member 'UW_BodyType_Actual_Cell_C::Selected' has a wrong offset!");
static_assert(offsetof(UW_BodyType_Actual_Cell_C, Hovered) == 0x000290, "Member 'UW_BodyType_Actual_Cell_C::Hovered' has a wrong offset!");
static_assert(offsetof(UW_BodyType_Actual_Cell_C, Default) == 0x000298, "Member 'UW_BodyType_Actual_Cell_C::Default' has a wrong offset!");
static_assert(offsetof(UW_BodyType_Actual_Cell_C, Button_BodyType) == 0x0002A0, "Member 'UW_BodyType_Actual_Cell_C::Button_BodyType' has a wrong offset!");
static_assert(offsetof(UW_BodyType_Actual_Cell_C, Image_BodyType) == 0x0002A8, "Member 'UW_BodyType_Actual_Cell_C::Image_BodyType' has a wrong offset!");
static_assert(offsetof(UW_BodyType_Actual_Cell_C, Image_BodyType_Selected) == 0x0002B0, "Member 'UW_BodyType_Actual_Cell_C::Image_BodyType_Selected' has a wrong offset!");
static_assert(offsetof(UW_BodyType_Actual_Cell_C, WidgetSwitcher_State) == 0x0002B8, "Member 'UW_BodyType_Actual_Cell_C::WidgetSwitcher_State' has a wrong offset!");
static_assert(offsetof(UW_BodyType_Actual_Cell_C, Icon_BodyType) == 0x0002C0, "Member 'UW_BodyType_Actual_Cell_C::Icon_BodyType' has a wrong offset!");
static_assert(offsetof(UW_BodyType_Actual_Cell_C, Desired_Image_Size) == 0x0002C8, "Member 'UW_BodyType_Actual_Cell_C::Desired_Image_Size' has a wrong offset!");
static_assert(offsetof(UW_BodyType_Actual_Cell_C, PressedButton_Teloslozhenie_ED) == 0x0002D0, "Member 'UW_BodyType_Actual_Cell_C::PressedButton_Teloslozhenie_ED' has a wrong offset!");
static_assert(offsetof(UW_BodyType_Actual_Cell_C, Desired_Image_Size_Height) == 0x0002E0, "Member 'UW_BodyType_Actual_Cell_C::Desired_Image_Size_Height' has a wrong offset!");

}

