#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_BodyTypeCell

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "WS_BodyFeatures_structs.hpp"
#include "WE_BodyTypes_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_BodyTypeCell.W_BodyTypeCell_C
// 0x0178 (0x03F8 - 0x0280)
class UW_BodyTypeCell_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Select_Anim;                                       // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_BodyType;                                   // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Hovered;                                     // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Icon;                                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_NoneBG;                                      // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Selected;                                    // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FWS_BodyFeatures                       GivenInfo;                                         // 0x02C0(0x0088)(Edit, BlueprintVisible, ContainsInstancedReference, ExposeOnSpawn, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             PressedButton_BodyType_ED;                         // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         DesiredImageSize;                                  // 0x0358(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DesiredButtonSize;                                 // 0x035C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_CreateCharacter_C*                  CharRef;                                           // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCharacterCreateSave_C*                 SaveCharacterInfo;                                 // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      Pants_Slot;                                        // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonIndex;                                       // 0x0378(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37C[0x4];                                      // 0x037C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               DW_Fem;                                            // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DM_Mal;                                            // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 NewVar_0;                                          // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          HeadBuffer;                                        // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DWFemBody;                                         // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DWFemLegs;                                         // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DMManBody;                                         // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DMManLegs;                                         // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnSelectRandom;                                    // 0x03C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnBlockMetallicGloss;                              // 0x03D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnBlockDepthColorTattoo;                           // 0x03E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          Selected;                                          // 0x03F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__W_BodyTypeCell_Button_BodyType_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__W_BodyTypeCell_Button_BodyType_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__W_BodyTypeCell_Button_BodyType_K2Node_ComponentBoundEvent_2_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__W_BodyTypeCell_Button_BodyType_K2Node_ComponentBoundEvent_3_OnButtonReleasedEvent__DelegateSignature();
	void CellActivated();
	void CellDeactivated();
	void Change_Material_Param_Color(TArray<class USkeletalMeshComponent*>& Array, class FName ParameterName, const struct FLinearColor& Value);
	void ChangeMaterialScalar(TArray<class USkeletalMeshComponent*>& Array, class FName ParameterName, double Value);
	void CheckBeard();
	void CheckEmptySlot();
	void CheckHairAndBeard(bool IsBeard, bool IsHead);
	void CheckSkin();
	void CheckSkinTone(bool Woman_, bool Black);
	void Construct();
	void ExecuteUbergraph_W_BodyTypeCell(int32 EntryPoint);
	void LoadScar(class UMaterialInstanceDynamic* MIDHead);
	void MakeupGirl(int32 Param_Index, class ABP_CreateCharacter_C* DMGirl);
	void MakeupMan(class ABP_CreateCharacter_C* DMMan, int32 Param_Index);
	void MasterPoseFunc();
	void OnBlockDepthColorTattoo__DelegateSignature(int32 Param_Index);
	void OnBlockMetallicGloss__DelegateSignature(int32 Param_Index);
	void OnInitialized();
	void OnLoaded_93030D1B4C6E0F68DB91F19C03F9C64A(class UObject* Loaded);
	void OnLoaded_93030D1B4C6E0F68DB91F19C804858F4(class UObject* Loaded);
	void OnLoaded_93030D1B4C6E0F68DB91F19CB63B9535(class UObject* Loaded);
	void OnLoaded_CFF65C0C47457C1DC48DE28F8273D9EB(class UObject* Loaded);
	void OnLoaded_FA2232034EC70C50486BA4BF8C4DC8CA(class UObject* Loaded);
	struct FEventReply OnPreviewKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void OnSelectRandom__DelegateSignature(class UW_BodyTypeCell_C* BodyTypeCell);
	void PreConstruct(bool IsDesignTime);
	void PressedButton_BodyType_ED__DelegateSignature(class UW_BodyTypeCell_C* CurrentCell);
	void ReMinusInit(const struct FWS_BodyFeatures& NewFeatures, EWE_BodyTypes BodyType);
	void ResetMaterials(class USkeletalMeshComponent* Mesh);
	void RestoreDefaultMaterials();
	void ScarsGirl(int32 Param_Index, class ABP_CreateCharacter_C* DM_Girl);
	void ScarsMan(int32 Param_Index, class ABP_CreateCharacter_C* DMMan);
	void Select();
	void SetHeadScarParameter(bool IsWoman, int32 Selection, class ABP_CreateCharacter_C* CreateChar);
	void SetHovered(bool Hovered);
	void SetMakeup(class ABP_CreateCharacter_C* Ref);
	void SetNewClothes(class USkeletalMesh* Body, bool Black, const class FString& RowName);
	void SetScar(class ABP_CreateCharacter_C* Ref);
	void SetSelected(bool Param_Selected);
	void SetTattoo(class ABP_CreateCharacter_C* Ref);
	void TattooGirl(int32 Param_Index, class ABP_CreateCharacter_C* DMGirl);
	void TattooMan(class ABP_CreateCharacter_C* DMMan, int32 Param_Index);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_BodyTypeCell_C">();
	}
	static class UW_BodyTypeCell_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_BodyTypeCell_C>();
	}
};
static_assert(alignof(UW_BodyTypeCell_C) == 0x000008, "Wrong alignment on UW_BodyTypeCell_C");
static_assert(sizeof(UW_BodyTypeCell_C) == 0x0003F8, "Wrong size on UW_BodyTypeCell_C");
static_assert(offsetof(UW_BodyTypeCell_C, UberGraphFrame) == 0x000280, "Member 'UW_BodyTypeCell_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_BodyTypeCell_C, Select_Anim) == 0x000288, "Member 'UW_BodyTypeCell_C::Select_Anim' has a wrong offset!");
static_assert(offsetof(UW_BodyTypeCell_C, Hover) == 0x000290, "Member 'UW_BodyTypeCell_C::Hover' has a wrong offset!");
static_assert(offsetof(UW_BodyTypeCell_C, Button_BodyType) == 0x000298, "Member 'UW_BodyTypeCell_C::Button_BodyType' has a wrong offset!");
static_assert(offsetof(UW_BodyTypeCell_C, Image_Hovered) == 0x0002A0, "Member 'UW_BodyTypeCell_C::Image_Hovered' has a wrong offset!");
static_assert(offsetof(UW_BodyTypeCell_C, Image_Icon) == 0x0002A8, "Member 'UW_BodyTypeCell_C::Image_Icon' has a wrong offset!");
static_assert(offsetof(UW_BodyTypeCell_C, Image_NoneBG) == 0x0002B0, "Member 'UW_BodyTypeCell_C::Image_NoneBG' has a wrong offset!");
static_assert(offsetof(UW_BodyTypeCell_C, Image_Selected) == 0x0002B8, "Member 'UW_BodyTypeCell_C::Image_Selected' has a wrong offset!");
static_assert(offsetof(UW_BodyTypeCell_C, GivenInfo) == 0x0002C0, "Member 'UW_BodyTypeCell_C::GivenInfo' has a wrong offset!");
static_assert(offsetof(UW_BodyTypeCell_C, PressedButton_BodyType_ED) == 0x000348, "Member 'UW_BodyTypeCell_C::PressedButton_BodyType_ED' has a wrong offset!");
static_assert(offsetof(UW_BodyTypeCell_C, DesiredImageSize) == 0x000358, "Member 'UW_BodyTypeCell_C::DesiredImageSize' has a wrong offset!");
static_assert(offsetof(UW_BodyTypeCell_C, DesiredButtonSize) == 0x00035C, "Member 'UW_BodyTypeCell_C::DesiredButtonSize' has a wrong offset!");
static_assert(offsetof(UW_BodyTypeCell_C, CharRef) == 0x000360, "Member 'UW_BodyTypeCell_C::CharRef' has a wrong offset!");
static_assert(offsetof(UW_BodyTypeCell_C, SaveCharacterInfo) == 0x000368, "Member 'UW_BodyTypeCell_C::SaveCharacterInfo' has a wrong offset!");
static_assert(offsetof(UW_BodyTypeCell_C, Pants_Slot) == 0x000370, "Member 'UW_BodyTypeCell_C::Pants_Slot' has a wrong offset!");
static_assert(offsetof(UW_BodyTypeCell_C, ButtonIndex) == 0x000378, "Member 'UW_BodyTypeCell_C::ButtonIndex' has a wrong offset!");
static_assert(offsetof(UW_BodyTypeCell_C, DW_Fem) == 0x000380, "Member 'UW_BodyTypeCell_C::DW_Fem' has a wrong offset!");
static_assert(offsetof(UW_BodyTypeCell_C, DM_Mal) == 0x000388, "Member 'UW_BodyTypeCell_C::DM_Mal' has a wrong offset!");
static_assert(offsetof(UW_BodyTypeCell_C, NewVar_0) == 0x000390, "Member 'UW_BodyTypeCell_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(UW_BodyTypeCell_C, HeadBuffer) == 0x000398, "Member 'UW_BodyTypeCell_C::HeadBuffer' has a wrong offset!");
static_assert(offsetof(UW_BodyTypeCell_C, DWFemBody) == 0x0003A0, "Member 'UW_BodyTypeCell_C::DWFemBody' has a wrong offset!");
static_assert(offsetof(UW_BodyTypeCell_C, DWFemLegs) == 0x0003A8, "Member 'UW_BodyTypeCell_C::DWFemLegs' has a wrong offset!");
static_assert(offsetof(UW_BodyTypeCell_C, DMManBody) == 0x0003B0, "Member 'UW_BodyTypeCell_C::DMManBody' has a wrong offset!");
static_assert(offsetof(UW_BodyTypeCell_C, DMManLegs) == 0x0003B8, "Member 'UW_BodyTypeCell_C::DMManLegs' has a wrong offset!");
static_assert(offsetof(UW_BodyTypeCell_C, OnSelectRandom) == 0x0003C0, "Member 'UW_BodyTypeCell_C::OnSelectRandom' has a wrong offset!");
static_assert(offsetof(UW_BodyTypeCell_C, OnBlockMetallicGloss) == 0x0003D0, "Member 'UW_BodyTypeCell_C::OnBlockMetallicGloss' has a wrong offset!");
static_assert(offsetof(UW_BodyTypeCell_C, OnBlockDepthColorTattoo) == 0x0003E0, "Member 'UW_BodyTypeCell_C::OnBlockDepthColorTattoo' has a wrong offset!");
static_assert(offsetof(UW_BodyTypeCell_C, Selected) == 0x0003F0, "Member 'UW_BodyTypeCell_C::Selected' has a wrong offset!");

}

