#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_BodyType_Actual_Cell

#include "Basic.hpp"

#include "FMODStudio_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_BodyType_Actual_Cell.W_BodyType_Actual_Cell_C.ExecuteUbergraph_W_BodyType_Actual_Cell
// 0x00F0 (0x00F0 - 0x0000)
struct W_BodyType_Actual_Cell_C_ExecuteUbergraph_W_BodyType_Actual_Cell final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_1;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_MakeBrushFromSprite_ReturnValue;          // 0x0020(0x00D0)()
};
static_assert(alignof(W_BodyType_Actual_Cell_C_ExecuteUbergraph_W_BodyType_Actual_Cell) == 0x000010, "Wrong alignment on W_BodyType_Actual_Cell_C_ExecuteUbergraph_W_BodyType_Actual_Cell");
static_assert(sizeof(W_BodyType_Actual_Cell_C_ExecuteUbergraph_W_BodyType_Actual_Cell) == 0x0000F0, "Wrong size on W_BodyType_Actual_Cell_C_ExecuteUbergraph_W_BodyType_Actual_Cell");
static_assert(offsetof(W_BodyType_Actual_Cell_C_ExecuteUbergraph_W_BodyType_Actual_Cell, EntryPoint) == 0x000000, "Member 'W_BodyType_Actual_Cell_C_ExecuteUbergraph_W_BodyType_Actual_Cell::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_BodyType_Actual_Cell_C_ExecuteUbergraph_W_BodyType_Actual_Cell, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'W_BodyType_Actual_Cell_C_ExecuteUbergraph_W_BodyType_Actual_Cell::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BodyType_Actual_Cell_C_ExecuteUbergraph_W_BodyType_Actual_Cell, K2Node_Event_IsDesignTime) == 0x000005, "Member 'W_BodyType_Actual_Cell_C_ExecuteUbergraph_W_BodyType_Actual_Cell::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_BodyType_Actual_Cell_C_ExecuteUbergraph_W_BodyType_Actual_Cell, CallFunc_PlayEvent2D_ReturnValue) == 0x000008, "Member 'W_BodyType_Actual_Cell_C_ExecuteUbergraph_W_BodyType_Actual_Cell::CallFunc_PlayEvent2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BodyType_Actual_Cell_C_ExecuteUbergraph_W_BodyType_Actual_Cell, CallFunc_PlayEvent2D_ReturnValue_1) == 0x000010, "Member 'W_BodyType_Actual_Cell_C_ExecuteUbergraph_W_BodyType_Actual_Cell::CallFunc_PlayEvent2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BodyType_Actual_Cell_C_ExecuteUbergraph_W_BodyType_Actual_Cell, CallFunc_MakeBrushFromSprite_ReturnValue) == 0x000020, "Member 'W_BodyType_Actual_Cell_C_ExecuteUbergraph_W_BodyType_Actual_Cell::CallFunc_MakeBrushFromSprite_ReturnValue' has a wrong offset!");

// Function W_BodyType_Actual_Cell.W_BodyType_Actual_Cell_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_BodyType_Actual_Cell_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_BodyType_Actual_Cell_C_PreConstruct) == 0x000001, "Wrong alignment on W_BodyType_Actual_Cell_C_PreConstruct");
static_assert(sizeof(W_BodyType_Actual_Cell_C_PreConstruct) == 0x000001, "Wrong size on W_BodyType_Actual_Cell_C_PreConstruct");
static_assert(offsetof(W_BodyType_Actual_Cell_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_BodyType_Actual_Cell_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_BodyType_Actual_Cell.W_BodyType_Actual_Cell_C.PressedButton_Teloslozhenie_ED__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_BodyType_Actual_Cell_C_PressedButton_Teloslozhenie_ED__DelegateSignature final
{
public:
	class UW_BodyType_Actual_Cell_C*              GivenCell;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_BodyType_Actual_Cell_C_PressedButton_Teloslozhenie_ED__DelegateSignature) == 0x000008, "Wrong alignment on W_BodyType_Actual_Cell_C_PressedButton_Teloslozhenie_ED__DelegateSignature");
static_assert(sizeof(W_BodyType_Actual_Cell_C_PressedButton_Teloslozhenie_ED__DelegateSignature) == 0x000008, "Wrong size on W_BodyType_Actual_Cell_C_PressedButton_Teloslozhenie_ED__DelegateSignature");
static_assert(offsetof(W_BodyType_Actual_Cell_C_PressedButton_Teloslozhenie_ED__DelegateSignature, GivenCell) == 0x000000, "Member 'W_BodyType_Actual_Cell_C_PressedButton_Teloslozhenie_ED__DelegateSignature::GivenCell' has a wrong offset!");

}

