#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Button_E

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Button_E.W_Button_E_C
// 0x0058 (0x02D8 - 0x0280)
class UW_Button_E_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button;                                            // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text;                                              // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CircleMaterial;                                    // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCanvasRenderTarget2D*                  CanvasRenderTarget2D;                              // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnClicked;                                         // 0x02B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   ButtonText;                                        // 0x02C0(0x0018)(Edit, BlueprintVisible)

public:
	void BndEvt__Button_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_W_Button_E(int32 EntryPoint);
	void OnCanvasRenderTargetUpdate(class UCanvas* Canvas, int32 Width, int32 Height);
	void OnClicked__DelegateSignature();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Button_E_C">();
	}
	static class UW_Button_E_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Button_E_C>();
	}
};
static_assert(alignof(UW_Button_E_C) == 0x000008, "Wrong alignment on UW_Button_E_C");
static_assert(sizeof(UW_Button_E_C) == 0x0002D8, "Wrong size on UW_Button_E_C");
static_assert(offsetof(UW_Button_E_C, UberGraphFrame) == 0x000280, "Member 'UW_Button_E_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Button_E_C, Button) == 0x000288, "Member 'UW_Button_E_C::Button' has a wrong offset!");
static_assert(offsetof(UW_Button_E_C, Image) == 0x000290, "Member 'UW_Button_E_C::Image' has a wrong offset!");
static_assert(offsetof(UW_Button_E_C, Text) == 0x000298, "Member 'UW_Button_E_C::Text' has a wrong offset!");
static_assert(offsetof(UW_Button_E_C, CircleMaterial) == 0x0002A0, "Member 'UW_Button_E_C::CircleMaterial' has a wrong offset!");
static_assert(offsetof(UW_Button_E_C, CanvasRenderTarget2D) == 0x0002A8, "Member 'UW_Button_E_C::CanvasRenderTarget2D' has a wrong offset!");
static_assert(offsetof(UW_Button_E_C, OnClicked) == 0x0002B0, "Member 'UW_Button_E_C::OnClicked' has a wrong offset!");
static_assert(offsetof(UW_Button_E_C, ButtonText) == 0x0002C0, "Member 'UW_Button_E_C::ButtonText' has a wrong offset!");

}

