#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Button

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_Button.W_Button_C.ExecuteUbergraph_W_Button
// 0x0220 (0x0220 - 0x0000)
struct W_Button_C_ExecuteUbergraph_W_Button final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_PlayTime;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_NewEnabled;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B[0x5];                                       // 0x006B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       K2Node_DynamicCast_AsCanvas_Panel_Slot;            // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       K2Node_DynamicCast_AsCanvas_Panel_Slot_1;          // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x008C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x009C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     K2Node_DynamicCast_AsHorizontal_Box_Slot;          // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default_1;                           // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0xF];                                       // 0x00E1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_MakeBrushFromTexture_ReturnValue;         // 0x00F0(0x00D0)()
	class UCanvasPanelSlot*                       K2Node_DynamicCast_AsCanvas_Panel_Slot_2;          // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x3];                                      // 0x01C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin_2;                        // 0x01CC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_RetriggerableDelay_Duration_ImplicitCast; // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast; // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Left_ImplicitCast;               // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Top_ImplicitCast;                // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Right_ImplicitCast;              // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Bottom_ImplicitCast;             // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Left_ImplicitCast_1;             // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Top_ImplicitCast_1;              // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Right_ImplicitCast_1;            // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Bottom_ImplicitCast_1;           // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Top_ImplicitCast_2;              // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Bottom_ImplicitCast_2;           // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Left_ImplicitCast_2;             // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Right_ImplicitCast_2;            // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Button_C_ExecuteUbergraph_W_Button) == 0x000010, "Wrong alignment on W_Button_C_ExecuteUbergraph_W_Button");
static_assert(sizeof(W_Button_C_ExecuteUbergraph_W_Button) == 0x000220, "Wrong size on W_Button_C_ExecuteUbergraph_W_Button");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, EntryPoint) == 0x000000, "Member 'W_Button_C_ExecuteUbergraph_W_Button::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, Temp_bool_Variable) == 0x000004, "Member 'W_Button_C_ExecuteUbergraph_W_Button::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, Temp_bool_Variable_1) == 0x000005, "Member 'W_Button_C_ExecuteUbergraph_W_Button::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, Temp_bool_Variable_2) == 0x000006, "Member 'W_Button_C_ExecuteUbergraph_W_Button::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, Temp_real_Variable) == 0x000008, "Member 'W_Button_C_ExecuteUbergraph_W_Button::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, Temp_real_Variable_1) == 0x000010, "Member 'W_Button_C_ExecuteUbergraph_W_Button::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, K2Node_Event_IsDesignTime) == 0x000018, "Member 'W_Button_C_ExecuteUbergraph_W_Button::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, K2Node_CustomEvent_PlayTime) == 0x000020, "Member 'W_Button_C_ExecuteUbergraph_W_Button::K2Node_CustomEvent_PlayTime' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000028, "Member 'W_Button_C_ExecuteUbergraph_W_Button::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000030, "Member 'W_Button_C_ExecuteUbergraph_W_Button::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000038, "Member 'W_Button_C_ExecuteUbergraph_W_Button::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'W_Button_C_ExecuteUbergraph_W_Button::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, CallFunc_PlayAnimation_ReturnValue) == 0x000048, "Member 'W_Button_C_ExecuteUbergraph_W_Button::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, CallFunc_PlayAnimation_ReturnValue_1) == 0x000050, "Member 'W_Button_C_ExecuteUbergraph_W_Button::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, K2Node_CustomEvent_NewEnabled) == 0x000058, "Member 'W_Button_C_ExecuteUbergraph_W_Button::K2Node_CustomEvent_NewEnabled' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, CallFunc_PlayAnimation_ReturnValue_2) == 0x000060, "Member 'W_Button_C_ExecuteUbergraph_W_Button::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, CallFunc_BooleanAND_ReturnValue) == 0x000068, "Member 'W_Button_C_ExecuteUbergraph_W_Button::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, CallFunc_BooleanAND_ReturnValue_1) == 0x000069, "Member 'W_Button_C_ExecuteUbergraph_W_Button::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, Temp_byte_Variable) == 0x00006A, "Member 'W_Button_C_ExecuteUbergraph_W_Button::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, K2Node_DynamicCast_AsCanvas_Panel_Slot) == 0x000070, "Member 'W_Button_C_ExecuteUbergraph_W_Button::K2Node_DynamicCast_AsCanvas_Panel_Slot' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'W_Button_C_ExecuteUbergraph_W_Button::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, K2Node_DynamicCast_AsCanvas_Panel_Slot_1) == 0x000080, "Member 'W_Button_C_ExecuteUbergraph_W_Button::K2Node_DynamicCast_AsCanvas_Panel_Slot_1' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, K2Node_DynamicCast_bSuccess_1) == 0x000088, "Member 'W_Button_C_ExecuteUbergraph_W_Button::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, K2Node_MakeStruct_Margin) == 0x00008C, "Member 'W_Button_C_ExecuteUbergraph_W_Button::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, K2Node_MakeStruct_Margin_1) == 0x00009C, "Member 'W_Button_C_ExecuteUbergraph_W_Button::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, K2Node_Select_Default) == 0x0000B0, "Member 'W_Button_C_ExecuteUbergraph_W_Button::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, K2Node_DynamicCast_AsHorizontal_Box_Slot) == 0x0000B8, "Member 'W_Button_C_ExecuteUbergraph_W_Button::K2Node_DynamicCast_AsHorizontal_Box_Slot' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, K2Node_DynamicCast_bSuccess_2) == 0x0000C0, "Member 'W_Button_C_ExecuteUbergraph_W_Button::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x0000C8, "Member 'W_Button_C_ExecuteUbergraph_W_Button::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, Temp_byte_Variable_1) == 0x0000D0, "Member 'W_Button_C_ExecuteUbergraph_W_Button::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, K2Node_Select_Default_1) == 0x0000D8, "Member 'W_Button_C_ExecuteUbergraph_W_Button::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, K2Node_Select_Default_2) == 0x0000E0, "Member 'W_Button_C_ExecuteUbergraph_W_Button::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, CallFunc_MakeBrushFromTexture_ReturnValue) == 0x0000F0, "Member 'W_Button_C_ExecuteUbergraph_W_Button::CallFunc_MakeBrushFromTexture_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, K2Node_DynamicCast_AsCanvas_Panel_Slot_2) == 0x0001C0, "Member 'W_Button_C_ExecuteUbergraph_W_Button::K2Node_DynamicCast_AsCanvas_Panel_Slot_2' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, K2Node_DynamicCast_bSuccess_3) == 0x0001C8, "Member 'W_Button_C_ExecuteUbergraph_W_Button::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, K2Node_MakeStruct_Margin_2) == 0x0001CC, "Member 'W_Button_C_ExecuteUbergraph_W_Button::K2Node_MakeStruct_Margin_2' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, CallFunc_RetriggerableDelay_Duration_ImplicitCast) == 0x0001DC, "Member 'W_Button_C_ExecuteUbergraph_W_Button::CallFunc_RetriggerableDelay_Duration_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast) == 0x0001E0, "Member 'W_Button_C_ExecuteUbergraph_W_Button::CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, K2Node_MakeStruct_Left_ImplicitCast) == 0x0001E4, "Member 'W_Button_C_ExecuteUbergraph_W_Button::K2Node_MakeStruct_Left_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, K2Node_MakeStruct_Top_ImplicitCast) == 0x0001E8, "Member 'W_Button_C_ExecuteUbergraph_W_Button::K2Node_MakeStruct_Top_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, K2Node_MakeStruct_Right_ImplicitCast) == 0x0001EC, "Member 'W_Button_C_ExecuteUbergraph_W_Button::K2Node_MakeStruct_Right_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, K2Node_MakeStruct_Bottom_ImplicitCast) == 0x0001F0, "Member 'W_Button_C_ExecuteUbergraph_W_Button::K2Node_MakeStruct_Bottom_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, K2Node_MakeStruct_Left_ImplicitCast_1) == 0x0001F4, "Member 'W_Button_C_ExecuteUbergraph_W_Button::K2Node_MakeStruct_Left_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, K2Node_MakeStruct_Top_ImplicitCast_1) == 0x0001F8, "Member 'W_Button_C_ExecuteUbergraph_W_Button::K2Node_MakeStruct_Top_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, K2Node_MakeStruct_Right_ImplicitCast_1) == 0x0001FC, "Member 'W_Button_C_ExecuteUbergraph_W_Button::K2Node_MakeStruct_Right_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, K2Node_MakeStruct_Bottom_ImplicitCast_1) == 0x000200, "Member 'W_Button_C_ExecuteUbergraph_W_Button::K2Node_MakeStruct_Bottom_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast) == 0x000204, "Member 'W_Button_C_ExecuteUbergraph_W_Button::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000208, "Member 'W_Button_C_ExecuteUbergraph_W_Button::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, K2Node_MakeStruct_Top_ImplicitCast_2) == 0x00020C, "Member 'W_Button_C_ExecuteUbergraph_W_Button::K2Node_MakeStruct_Top_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, K2Node_MakeStruct_Bottom_ImplicitCast_2) == 0x000210, "Member 'W_Button_C_ExecuteUbergraph_W_Button::K2Node_MakeStruct_Bottom_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, K2Node_MakeStruct_Left_ImplicitCast_2) == 0x000214, "Member 'W_Button_C_ExecuteUbergraph_W_Button::K2Node_MakeStruct_Left_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, K2Node_MakeStruct_Right_ImplicitCast_2) == 0x000218, "Member 'W_Button_C_ExecuteUbergraph_W_Button::K2Node_MakeStruct_Right_ImplicitCast_2' has a wrong offset!");

// Function W_Button.W_Button_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_Button_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Button_C_PreConstruct) == 0x000001, "Wrong alignment on W_Button_C_PreConstruct");
static_assert(sizeof(W_Button_C_PreConstruct) == 0x000001, "Wrong size on W_Button_C_PreConstruct");
static_assert(offsetof(W_Button_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_Button_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_Button.W_Button_C.RingAnimationStart
// 0x0008 (0x0008 - 0x0000)
struct W_Button_C_RingAnimationStart final
{
public:
	double                                        PlayTime;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Button_C_RingAnimationStart) == 0x000008, "Wrong alignment on W_Button_C_RingAnimationStart");
static_assert(sizeof(W_Button_C_RingAnimationStart) == 0x000008, "Wrong size on W_Button_C_RingAnimationStart");
static_assert(offsetof(W_Button_C_RingAnimationStart, PlayTime) == 0x000000, "Member 'W_Button_C_RingAnimationStart::PlayTime' has a wrong offset!");

// Function W_Button.W_Button_C.SetEnabled
// 0x0001 (0x0001 - 0x0000)
struct W_Button_C_SetEnabled final
{
public:
	bool                                          NewEnabled;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Button_C_SetEnabled) == 0x000001, "Wrong alignment on W_Button_C_SetEnabled");
static_assert(sizeof(W_Button_C_SetEnabled) == 0x000001, "Wrong size on W_Button_C_SetEnabled");
static_assert(offsetof(W_Button_C_SetEnabled, NewEnabled) == 0x000000, "Member 'W_Button_C_SetEnabled::NewEnabled' has a wrong offset!");

}

