#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_BuildingCell

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BuildingInfo_Struct_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_BuildingCell.W_BuildingCell_C
// 0x0158 (0x03D8 - 0x0280)
class UW_BuildingCell_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoverAnim;                                         // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowBorder;                                        // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button;                                            // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Money_2ndScreen;                     // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Border;                                      // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Default;                                     // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Hovered;                                     // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Object;                                      // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Selected;                                    // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Money;                                   // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Name;                                    // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FBuildingInfo_Struct                   BuildingInfo;                                      // 0x02E0(0x00D8)(Edit, BlueprintVisible, ContainsInstancedReference, ExposeOnSpawn, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnClick;                                           // 0x03B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnSelect;                                          // 0x03C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__W_BuildingCell_Button_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__W_BuildingCell_Button_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__W_BuildingCell_Button_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_W_BuildingCell(int32 EntryPoint);
	void OnClick__DelegateSignature(const struct FBuildingInfo_Struct& Info);
	void OnLoaded_04BC4976421E8AE1814C82AFFAF21695(class UObject* Loaded);
	void OnSelect__DelegateSignature();
	void SetSelectedCell();
	void SetUnselectedCell();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_BuildingCell_C">();
	}
	static class UW_BuildingCell_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_BuildingCell_C>();
	}
};
static_assert(alignof(UW_BuildingCell_C) == 0x000008, "Wrong alignment on UW_BuildingCell_C");
static_assert(sizeof(UW_BuildingCell_C) == 0x0003D8, "Wrong size on UW_BuildingCell_C");
static_assert(offsetof(UW_BuildingCell_C, UberGraphFrame) == 0x000280, "Member 'UW_BuildingCell_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_BuildingCell_C, HoverAnim) == 0x000288, "Member 'UW_BuildingCell_C::HoverAnim' has a wrong offset!");
static_assert(offsetof(UW_BuildingCell_C, ShowBorder) == 0x000290, "Member 'UW_BuildingCell_C::ShowBorder' has a wrong offset!");
static_assert(offsetof(UW_BuildingCell_C, Button) == 0x000298, "Member 'UW_BuildingCell_C::Button' has a wrong offset!");
static_assert(offsetof(UW_BuildingCell_C, HorizontalBox_Money_2ndScreen) == 0x0002A0, "Member 'UW_BuildingCell_C::HorizontalBox_Money_2ndScreen' has a wrong offset!");
static_assert(offsetof(UW_BuildingCell_C, Image_Border) == 0x0002A8, "Member 'UW_BuildingCell_C::Image_Border' has a wrong offset!");
static_assert(offsetof(UW_BuildingCell_C, Image_Default) == 0x0002B0, "Member 'UW_BuildingCell_C::Image_Default' has a wrong offset!");
static_assert(offsetof(UW_BuildingCell_C, Image_Hovered) == 0x0002B8, "Member 'UW_BuildingCell_C::Image_Hovered' has a wrong offset!");
static_assert(offsetof(UW_BuildingCell_C, Image_Object) == 0x0002C0, "Member 'UW_BuildingCell_C::Image_Object' has a wrong offset!");
static_assert(offsetof(UW_BuildingCell_C, Image_Selected) == 0x0002C8, "Member 'UW_BuildingCell_C::Image_Selected' has a wrong offset!");
static_assert(offsetof(UW_BuildingCell_C, TextBlock_Money) == 0x0002D0, "Member 'UW_BuildingCell_C::TextBlock_Money' has a wrong offset!");
static_assert(offsetof(UW_BuildingCell_C, TextBlock_Name) == 0x0002D8, "Member 'UW_BuildingCell_C::TextBlock_Name' has a wrong offset!");
static_assert(offsetof(UW_BuildingCell_C, BuildingInfo) == 0x0002E0, "Member 'UW_BuildingCell_C::BuildingInfo' has a wrong offset!");
static_assert(offsetof(UW_BuildingCell_C, OnClick) == 0x0003B8, "Member 'UW_BuildingCell_C::OnClick' has a wrong offset!");
static_assert(offsetof(UW_BuildingCell_C, OnSelect) == 0x0003C8, "Member 'UW_BuildingCell_C::OnSelect' has a wrong offset!");

}

