#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ButtonWaitingLabel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_ButtonWaitingLabel.W_ButtonWaitingLabel_C
// 0x0020 (0x02A0 - 0x0280)
class UW_ButtonWaitingLabel_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       AppearingAnim;                                     // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       LabelHidingAnim;                                   // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       LabelSigningAnim;                                  // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_ButtonWaitingLabel(int32 EntryPoint);
	void HideAway();
	void PlayWaitingAnim();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_ButtonWaitingLabel_C">();
	}
	static class UW_ButtonWaitingLabel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_ButtonWaitingLabel_C>();
	}
};
static_assert(alignof(UW_ButtonWaitingLabel_C) == 0x000008, "Wrong alignment on UW_ButtonWaitingLabel_C");
static_assert(sizeof(UW_ButtonWaitingLabel_C) == 0x0002A0, "Wrong size on UW_ButtonWaitingLabel_C");
static_assert(offsetof(UW_ButtonWaitingLabel_C, UberGraphFrame) == 0x000280, "Member 'UW_ButtonWaitingLabel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_ButtonWaitingLabel_C, AppearingAnim) == 0x000288, "Member 'UW_ButtonWaitingLabel_C::AppearingAnim' has a wrong offset!");
static_assert(offsetof(UW_ButtonWaitingLabel_C, LabelHidingAnim) == 0x000290, "Member 'UW_ButtonWaitingLabel_C::LabelHidingAnim' has a wrong offset!");
static_assert(offsetof(UW_ButtonWaitingLabel_C, LabelSigningAnim) == 0x000298, "Member 'UW_ButtonWaitingLabel_C::LabelSigningAnim' has a wrong offset!");

}

