#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CarSnowCamera

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function W_CarSnowCamera.W_CarSnowCamera_C.ExecuteUbergraph_W_CarSnowCamera
// 0x00A8 (0x00A8 - 0x0000)
struct W_CarSnowCamera_C_ExecuteUbergraph_W_CarSnowCamera final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_InOpacity;                      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0030(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_ReturnValue;                    // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_1; // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CarSnowCamera_C_ExecuteUbergraph_W_CarSnowCamera) == 0x000008, "Wrong alignment on W_CarSnowCamera_C_ExecuteUbergraph_W_CarSnowCamera");
static_assert(sizeof(W_CarSnowCamera_C_ExecuteUbergraph_W_CarSnowCamera) == 0x0000A8, "Wrong size on W_CarSnowCamera_C_ExecuteUbergraph_W_CarSnowCamera");
static_assert(offsetof(W_CarSnowCamera_C_ExecuteUbergraph_W_CarSnowCamera, EntryPoint) == 0x000000, "Member 'W_CarSnowCamera_C_ExecuteUbergraph_W_CarSnowCamera::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_CarSnowCamera_C_ExecuteUbergraph_W_CarSnowCamera, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000008, "Member 'W_CarSnowCamera_C_ExecuteUbergraph_W_CarSnowCamera::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CarSnowCamera_C_ExecuteUbergraph_W_CarSnowCamera, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'W_CarSnowCamera_C_ExecuteUbergraph_W_CarSnowCamera::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CarSnowCamera_C_ExecuteUbergraph_W_CarSnowCamera, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'W_CarSnowCamera_C_ExecuteUbergraph_W_CarSnowCamera::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CarSnowCamera_C_ExecuteUbergraph_W_CarSnowCamera, CallFunc_PlayAnimation_ReturnValue_1) == 0x000020, "Member 'W_CarSnowCamera_C_ExecuteUbergraph_W_CarSnowCamera::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_CarSnowCamera_C_ExecuteUbergraph_W_CarSnowCamera, K2Node_CustomEvent_InOpacity) == 0x000028, "Member 'W_CarSnowCamera_C_ExecuteUbergraph_W_CarSnowCamera::K2Node_CustomEvent_InOpacity' has a wrong offset!");
static_assert(offsetof(W_CarSnowCamera_C_ExecuteUbergraph_W_CarSnowCamera, K2Node_Event_MyGeometry) == 0x000030, "Member 'W_CarSnowCamera_C_ExecuteUbergraph_W_CarSnowCamera::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_CarSnowCamera_C_ExecuteUbergraph_W_CarSnowCamera, K2Node_Event_InDeltaTime) == 0x000068, "Member 'W_CarSnowCamera_C_ExecuteUbergraph_W_CarSnowCamera::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(W_CarSnowCamera_C_ExecuteUbergraph_W_CarSnowCamera, CallFunc_GetVelocity_ReturnValue) == 0x000070, "Member 'W_CarSnowCamera_C_ExecuteUbergraph_W_CarSnowCamera::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CarSnowCamera_C_ExecuteUbergraph_W_CarSnowCamera, CallFunc_VSize_ReturnValue) == 0x000088, "Member 'W_CarSnowCamera_C_ExecuteUbergraph_W_CarSnowCamera::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CarSnowCamera_C_ExecuteUbergraph_W_CarSnowCamera, CallFunc_MapRangeClamped_ReturnValue) == 0x000090, "Member 'W_CarSnowCamera_C_ExecuteUbergraph_W_CarSnowCamera::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CarSnowCamera_C_ExecuteUbergraph_W_CarSnowCamera, CallFunc_FInterpTo_ReturnValue) == 0x000098, "Member 'W_CarSnowCamera_C_ExecuteUbergraph_W_CarSnowCamera::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CarSnowCamera_C_ExecuteUbergraph_W_CarSnowCamera, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast) == 0x0000A0, "Member 'W_CarSnowCamera_C_ExecuteUbergraph_W_CarSnowCamera::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_CarSnowCamera_C_ExecuteUbergraph_W_CarSnowCamera, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_1) == 0x0000A4, "Member 'W_CarSnowCamera_C_ExecuteUbergraph_W_CarSnowCamera::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_1' has a wrong offset!");

// Function W_CarSnowCamera.W_CarSnowCamera_C.SetOpacity
// 0x0008 (0x0008 - 0x0000)
struct W_CarSnowCamera_C_SetOpacity final
{
public:
	double                                        InOpacity;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CarSnowCamera_C_SetOpacity) == 0x000008, "Wrong alignment on W_CarSnowCamera_C_SetOpacity");
static_assert(sizeof(W_CarSnowCamera_C_SetOpacity) == 0x000008, "Wrong size on W_CarSnowCamera_C_SetOpacity");
static_assert(offsetof(W_CarSnowCamera_C_SetOpacity, InOpacity) == 0x000000, "Member 'W_CarSnowCamera_C_SetOpacity::InOpacity' has a wrong offset!");

// Function W_CarSnowCamera.W_CarSnowCamera_C.Tick
// 0x003C (0x003C - 0x0000)
struct W_CarSnowCamera_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CarSnowCamera_C_Tick) == 0x000004, "Wrong alignment on W_CarSnowCamera_C_Tick");
static_assert(sizeof(W_CarSnowCamera_C_Tick) == 0x00003C, "Wrong size on W_CarSnowCamera_C_Tick");
static_assert(offsetof(W_CarSnowCamera_C_Tick, MyGeometry) == 0x000000, "Member 'W_CarSnowCamera_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_CarSnowCamera_C_Tick, InDeltaTime) == 0x000038, "Member 'W_CarSnowCamera_C_Tick::InDeltaTime' has a wrong offset!");

}

