#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CampTent

#include "Basic.hpp"

#include "E_CampAction_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_CampTent.W_CampTent_C.ExecuteUbergraph_W_CampTent
// 0x0080 (0x0080 - 0x0000)
struct W_CampTent_C_ExecuteUbergraph_W_CampTent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasInputKeyJustPressed_ReturnValue;       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_CampClient_C*                       CallFunc_GetComponentByClass_ReturnValue;          // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	E_CampAction                                  K2Node_CustomEvent_Action;                         // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CampTent_C_ExecuteUbergraph_W_CampTent) == 0x000008, "Wrong alignment on W_CampTent_C_ExecuteUbergraph_W_CampTent");
static_assert(sizeof(W_CampTent_C_ExecuteUbergraph_W_CampTent) == 0x000080, "Wrong size on W_CampTent_C_ExecuteUbergraph_W_CampTent");
static_assert(offsetof(W_CampTent_C_ExecuteUbergraph_W_CampTent, EntryPoint) == 0x000000, "Member 'W_CampTent_C_ExecuteUbergraph_W_CampTent::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_CampTent_C_ExecuteUbergraph_W_CampTent, K2Node_Event_MyGeometry) == 0x000004, "Member 'W_CampTent_C_ExecuteUbergraph_W_CampTent::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_CampTent_C_ExecuteUbergraph_W_CampTent, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'W_CampTent_C_ExecuteUbergraph_W_CampTent::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(W_CampTent_C_ExecuteUbergraph_W_CampTent, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000040, "Member 'W_CampTent_C_ExecuteUbergraph_W_CampTent::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CampTent_C_ExecuteUbergraph_W_CampTent, CallFunc_GetPlayerController_ReturnValue) == 0x000048, "Member 'W_CampTent_C_ExecuteUbergraph_W_CampTent::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CampTent_C_ExecuteUbergraph_W_CampTent, CallFunc_WasInputKeyJustPressed_ReturnValue) == 0x000050, "Member 'W_CampTent_C_ExecuteUbergraph_W_CampTent::CallFunc_WasInputKeyJustPressed_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CampTent_C_ExecuteUbergraph_W_CampTent, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000058, "Member 'W_CampTent_C_ExecuteUbergraph_W_CampTent::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CampTent_C_ExecuteUbergraph_W_CampTent, K2Node_DynamicCast_AsSurvival_Player) == 0x000060, "Member 'W_CampTent_C_ExecuteUbergraph_W_CampTent::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(W_CampTent_C_ExecuteUbergraph_W_CampTent, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'W_CampTent_C_ExecuteUbergraph_W_CampTent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_CampTent_C_ExecuteUbergraph_W_CampTent, CallFunc_GetComponentByClass_ReturnValue) == 0x000070, "Member 'W_CampTent_C_ExecuteUbergraph_W_CampTent::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CampTent_C_ExecuteUbergraph_W_CampTent, K2Node_CustomEvent_Action) == 0x000078, "Member 'W_CampTent_C_ExecuteUbergraph_W_CampTent::K2Node_CustomEvent_Action' has a wrong offset!");

// Function W_CampTent.W_CampTent_C.Show
// 0x0001 (0x0001 - 0x0000)
struct W_CampTent_C_Show final
{
public:
	E_CampAction                                  Action;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CampTent_C_Show) == 0x000001, "Wrong alignment on W_CampTent_C_Show");
static_assert(sizeof(W_CampTent_C_Show) == 0x000001, "Wrong size on W_CampTent_C_Show");
static_assert(offsetof(W_CampTent_C_Show, Action) == 0x000000, "Member 'W_CampTent_C_Show::Action' has a wrong offset!");

// Function W_CampTent.W_CampTent_C.Tick
// 0x003C (0x003C - 0x0000)
struct W_CampTent_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CampTent_C_Tick) == 0x000004, "Wrong alignment on W_CampTent_C_Tick");
static_assert(sizeof(W_CampTent_C_Tick) == 0x00003C, "Wrong size on W_CampTent_C_Tick");
static_assert(offsetof(W_CampTent_C_Tick, MyGeometry) == 0x000000, "Member 'W_CampTent_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_CampTent_C_Tick, InDeltaTime) == 0x000038, "Member 'W_CampTent_C_Tick::InDeltaTime' has a wrong offset!");

}

