#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CategoryButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Survival_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_CategoryButton.W_CategoryButton_C
// 0x0068 (0x02E8 - 0x0280)
class UW_CategoryButton_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoverAnim;                                         // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SelectionAnim;                                     // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_Category;                                   // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Icon;                                        // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Selection;                                   // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPaperSprite*                           Icon;                                              // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Scale;                                             // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        IconPositionX;                                     // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSelected;                                        // 0x02C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnClicked;                                         // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	EItemType                                     CategoryType;                                      // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__Button_24_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Button_24_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__Button_24_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void ExecuteUbergraph_W_CategoryButton(int32 EntryPoint);
	void OnClick();
	void OnClicked__DelegateSignature(class UW_CategoryButton_C* ClickedWidget);
	void PreConstruct(bool IsDesignTime);
	void SetItemType(EItemType Type);
	void Unclick();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_CategoryButton_C">();
	}
	static class UW_CategoryButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_CategoryButton_C>();
	}
};
static_assert(alignof(UW_CategoryButton_C) == 0x000008, "Wrong alignment on UW_CategoryButton_C");
static_assert(sizeof(UW_CategoryButton_C) == 0x0002E8, "Wrong size on UW_CategoryButton_C");
static_assert(offsetof(UW_CategoryButton_C, UberGraphFrame) == 0x000280, "Member 'UW_CategoryButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_CategoryButton_C, HoverAnim) == 0x000288, "Member 'UW_CategoryButton_C::HoverAnim' has a wrong offset!");
static_assert(offsetof(UW_CategoryButton_C, SelectionAnim) == 0x000290, "Member 'UW_CategoryButton_C::SelectionAnim' has a wrong offset!");
static_assert(offsetof(UW_CategoryButton_C, Button_Category) == 0x000298, "Member 'UW_CategoryButton_C::Button_Category' has a wrong offset!");
static_assert(offsetof(UW_CategoryButton_C, Image_Icon) == 0x0002A0, "Member 'UW_CategoryButton_C::Image_Icon' has a wrong offset!");
static_assert(offsetof(UW_CategoryButton_C, Image_Selection) == 0x0002A8, "Member 'UW_CategoryButton_C::Image_Selection' has a wrong offset!");
static_assert(offsetof(UW_CategoryButton_C, Icon) == 0x0002B0, "Member 'UW_CategoryButton_C::Icon' has a wrong offset!");
static_assert(offsetof(UW_CategoryButton_C, Scale) == 0x0002B8, "Member 'UW_CategoryButton_C::Scale' has a wrong offset!");
static_assert(offsetof(UW_CategoryButton_C, IconPositionX) == 0x0002C0, "Member 'UW_CategoryButton_C::IconPositionX' has a wrong offset!");
static_assert(offsetof(UW_CategoryButton_C, IsSelected) == 0x0002C8, "Member 'UW_CategoryButton_C::IsSelected' has a wrong offset!");
static_assert(offsetof(UW_CategoryButton_C, OnClicked) == 0x0002D0, "Member 'UW_CategoryButton_C::OnClicked' has a wrong offset!");
static_assert(offsetof(UW_CategoryButton_C, CategoryType) == 0x0002E0, "Member 'UW_CategoryButton_C::CategoryType' has a wrong offset!");

}

