#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CarBoost

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_CarBoost.W_CarBoost_C.ExecuteUbergraph_W_CarBoost
// 0x0040 (0x0040 - 0x0000)
struct W_CarBoost_C_ExecuteUbergraph_W_CarBoost final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_time_1;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_time;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast; // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast_1; // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CarBoost_C_ExecuteUbergraph_W_CarBoost) == 0x000008, "Wrong alignment on W_CarBoost_C_ExecuteUbergraph_W_CarBoost");
static_assert(sizeof(W_CarBoost_C_ExecuteUbergraph_W_CarBoost) == 0x000040, "Wrong size on W_CarBoost_C_ExecuteUbergraph_W_CarBoost");
static_assert(offsetof(W_CarBoost_C_ExecuteUbergraph_W_CarBoost, EntryPoint) == 0x000000, "Member 'W_CarBoost_C_ExecuteUbergraph_W_CarBoost::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_CarBoost_C_ExecuteUbergraph_W_CarBoost, K2Node_CustomEvent_time_1) == 0x000008, "Member 'W_CarBoost_C_ExecuteUbergraph_W_CarBoost::K2Node_CustomEvent_time_1' has a wrong offset!");
static_assert(offsetof(W_CarBoost_C_ExecuteUbergraph_W_CarBoost, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000010, "Member 'W_CarBoost_C_ExecuteUbergraph_W_CarBoost::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CarBoost_C_ExecuteUbergraph_W_CarBoost, K2Node_CustomEvent_time) == 0x000018, "Member 'W_CarBoost_C_ExecuteUbergraph_W_CarBoost::K2Node_CustomEvent_time' has a wrong offset!");
static_assert(offsetof(W_CarBoost_C_ExecuteUbergraph_W_CarBoost, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'W_CarBoost_C_ExecuteUbergraph_W_CarBoost::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CarBoost_C_ExecuteUbergraph_W_CarBoost, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000028, "Member 'W_CarBoost_C_ExecuteUbergraph_W_CarBoost::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_CarBoost_C_ExecuteUbergraph_W_CarBoost, CallFunc_PlayAnimation_ReturnValue_1) == 0x000030, "Member 'W_CarBoost_C_ExecuteUbergraph_W_CarBoost::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_CarBoost_C_ExecuteUbergraph_W_CarBoost, CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast) == 0x000038, "Member 'W_CarBoost_C_ExecuteUbergraph_W_CarBoost::CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_CarBoost_C_ExecuteUbergraph_W_CarBoost, CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast_1) == 0x00003C, "Member 'W_CarBoost_C_ExecuteUbergraph_W_CarBoost::CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast_1' has a wrong offset!");

// Function W_CarBoost.W_CarBoost_C.PlayBoosting
// 0x0008 (0x0008 - 0x0000)
struct W_CarBoost_C_PlayBoosting final
{
public:
	double                                        Time;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CarBoost_C_PlayBoosting) == 0x000008, "Wrong alignment on W_CarBoost_C_PlayBoosting");
static_assert(sizeof(W_CarBoost_C_PlayBoosting) == 0x000008, "Wrong size on W_CarBoost_C_PlayBoosting");
static_assert(offsetof(W_CarBoost_C_PlayBoosting, Time) == 0x000000, "Member 'W_CarBoost_C_PlayBoosting::Time' has a wrong offset!");

// Function W_CarBoost.W_CarBoost_C.PlayCooldown
// 0x0008 (0x0008 - 0x0000)
struct W_CarBoost_C_PlayCooldown final
{
public:
	double                                        Time;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CarBoost_C_PlayCooldown) == 0x000008, "Wrong alignment on W_CarBoost_C_PlayCooldown");
static_assert(sizeof(W_CarBoost_C_PlayCooldown) == 0x000008, "Wrong size on W_CarBoost_C_PlayCooldown");
static_assert(offsetof(W_CarBoost_C_PlayCooldown, Time) == 0x000000, "Member 'W_CarBoost_C_PlayCooldown::Time' has a wrong offset!");

}

