#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CampTimer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_CampTimer.W_CampTimer_C
// 0x0038 (0x02B8 - 0x0280)
class UW_CampTimer_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UW_Interact_C*                          W_Interact;                                        // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        Duration;                                          // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Text;                                              // 0x0298(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	double                                        SpentTime;                                         // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Active;                                            // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_CampTimer(int32 EntryPoint);
	void Hide();
	void Show();
	void ShowTimer(double Param_Duration, const class FString& Param_Text);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_CampTimer_C">();
	}
	static class UW_CampTimer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_CampTimer_C>();
	}
};
static_assert(alignof(UW_CampTimer_C) == 0x000008, "Wrong alignment on UW_CampTimer_C");
static_assert(sizeof(UW_CampTimer_C) == 0x0002B8, "Wrong size on UW_CampTimer_C");
static_assert(offsetof(UW_CampTimer_C, UberGraphFrame) == 0x000280, "Member 'UW_CampTimer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_CampTimer_C, W_Interact) == 0x000288, "Member 'UW_CampTimer_C::W_Interact' has a wrong offset!");
static_assert(offsetof(UW_CampTimer_C, Duration) == 0x000290, "Member 'UW_CampTimer_C::Duration' has a wrong offset!");
static_assert(offsetof(UW_CampTimer_C, Text) == 0x000298, "Member 'UW_CampTimer_C::Text' has a wrong offset!");
static_assert(offsetof(UW_CampTimer_C, SpentTime) == 0x0002A8, "Member 'UW_CampTimer_C::SpentTime' has a wrong offset!");
static_assert(offsetof(UW_CampTimer_C, Active) == 0x0002B0, "Member 'UW_CampTimer_C::Active' has a wrong offset!");

}

