#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CategoryButton

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Survival_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_CategoryButton.W_CategoryButton_C.ExecuteUbergraph_W_CategoryButton
// 0x0180 (0x0180 - 0x0000)
struct W_CategoryButton_C_ExecuteUbergraph_W_CategoryButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0xF];                                       // 0x0011(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_MakeBrushFromSprite_ReturnValue;          // 0x0020(0x00D0)()
	class UCanvasPanelSlot*                       K2Node_DynamicCast_AsCanvas_Panel_Slot;            // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue;       // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0110(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0120(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       K2Node_DynamicCast_AsCanvas_Panel_Slot_1;          // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_2;       // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_A_ImplicitCast;    // 0x0168(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CategoryButton_C_ExecuteUbergraph_W_CategoryButton) == 0x000010, "Wrong alignment on W_CategoryButton_C_ExecuteUbergraph_W_CategoryButton");
static_assert(sizeof(W_CategoryButton_C_ExecuteUbergraph_W_CategoryButton) == 0x000180, "Wrong size on W_CategoryButton_C_ExecuteUbergraph_W_CategoryButton");
static_assert(offsetof(W_CategoryButton_C_ExecuteUbergraph_W_CategoryButton, EntryPoint) == 0x000000, "Member 'W_CategoryButton_C_ExecuteUbergraph_W_CategoryButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_CategoryButton_C_ExecuteUbergraph_W_CategoryButton, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000008, "Member 'W_CategoryButton_C_ExecuteUbergraph_W_CategoryButton::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CategoryButton_C_ExecuteUbergraph_W_CategoryButton, K2Node_Event_IsDesignTime) == 0x000010, "Member 'W_CategoryButton_C_ExecuteUbergraph_W_CategoryButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_CategoryButton_C_ExecuteUbergraph_W_CategoryButton, CallFunc_MakeBrushFromSprite_ReturnValue) == 0x000020, "Member 'W_CategoryButton_C_ExecuteUbergraph_W_CategoryButton::CallFunc_MakeBrushFromSprite_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CategoryButton_C_ExecuteUbergraph_W_CategoryButton, K2Node_DynamicCast_AsCanvas_Panel_Slot) == 0x0000F0, "Member 'W_CategoryButton_C_ExecuteUbergraph_W_CategoryButton::K2Node_DynamicCast_AsCanvas_Panel_Slot' has a wrong offset!");
static_assert(offsetof(W_CategoryButton_C_ExecuteUbergraph_W_CategoryButton, K2Node_DynamicCast_bSuccess) == 0x0000F8, "Member 'W_CategoryButton_C_ExecuteUbergraph_W_CategoryButton::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_CategoryButton_C_ExecuteUbergraph_W_CategoryButton, CallFunc_Multiply_Vector2DFloat_ReturnValue) == 0x000100, "Member 'W_CategoryButton_C_ExecuteUbergraph_W_CategoryButton::CallFunc_Multiply_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CategoryButton_C_ExecuteUbergraph_W_CategoryButton, CallFunc_MakeVector2D_ReturnValue) == 0x000110, "Member 'W_CategoryButton_C_ExecuteUbergraph_W_CategoryButton::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CategoryButton_C_ExecuteUbergraph_W_CategoryButton, CallFunc_MakeVector2D_ReturnValue_1) == 0x000120, "Member 'W_CategoryButton_C_ExecuteUbergraph_W_CategoryButton::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_CategoryButton_C_ExecuteUbergraph_W_CategoryButton, K2Node_DynamicCast_AsCanvas_Panel_Slot_1) == 0x000130, "Member 'W_CategoryButton_C_ExecuteUbergraph_W_CategoryButton::K2Node_DynamicCast_AsCanvas_Panel_Slot_1' has a wrong offset!");
static_assert(offsetof(W_CategoryButton_C_ExecuteUbergraph_W_CategoryButton, K2Node_DynamicCast_bSuccess_1) == 0x000138, "Member 'W_CategoryButton_C_ExecuteUbergraph_W_CategoryButton::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_CategoryButton_C_ExecuteUbergraph_W_CategoryButton, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x000140, "Member 'W_CategoryButton_C_ExecuteUbergraph_W_CategoryButton::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_CategoryButton_C_ExecuteUbergraph_W_CategoryButton, CallFunc_Not_PreBool_ReturnValue) == 0x000148, "Member 'W_CategoryButton_C_ExecuteUbergraph_W_CategoryButton::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CategoryButton_C_ExecuteUbergraph_W_CategoryButton, CallFunc_PlayAnimationReverse_ReturnValue_2) == 0x000150, "Member 'W_CategoryButton_C_ExecuteUbergraph_W_CategoryButton::CallFunc_PlayAnimationReverse_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_CategoryButton_C_ExecuteUbergraph_W_CategoryButton, CallFunc_PlayAnimationForward_ReturnValue) == 0x000158, "Member 'W_CategoryButton_C_ExecuteUbergraph_W_CategoryButton::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CategoryButton_C_ExecuteUbergraph_W_CategoryButton, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000160, "Member 'W_CategoryButton_C_ExecuteUbergraph_W_CategoryButton::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_CategoryButton_C_ExecuteUbergraph_W_CategoryButton, CallFunc_Multiply_Vector2DFloat_A_ImplicitCast) == 0x000168, "Member 'W_CategoryButton_C_ExecuteUbergraph_W_CategoryButton::CallFunc_Multiply_Vector2DFloat_A_ImplicitCast' has a wrong offset!");

// Function W_CategoryButton.W_CategoryButton_C.OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_CategoryButton_C_OnClicked__DelegateSignature final
{
public:
	class UW_CategoryButton_C*                    ClickedWidget;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CategoryButton_C_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on W_CategoryButton_C_OnClicked__DelegateSignature");
static_assert(sizeof(W_CategoryButton_C_OnClicked__DelegateSignature) == 0x000008, "Wrong size on W_CategoryButton_C_OnClicked__DelegateSignature");
static_assert(offsetof(W_CategoryButton_C_OnClicked__DelegateSignature, ClickedWidget) == 0x000000, "Member 'W_CategoryButton_C_OnClicked__DelegateSignature::ClickedWidget' has a wrong offset!");

// Function W_CategoryButton.W_CategoryButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_CategoryButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CategoryButton_C_PreConstruct) == 0x000001, "Wrong alignment on W_CategoryButton_C_PreConstruct");
static_assert(sizeof(W_CategoryButton_C_PreConstruct) == 0x000001, "Wrong size on W_CategoryButton_C_PreConstruct");
static_assert(offsetof(W_CategoryButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_CategoryButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_CategoryButton.W_CategoryButton_C.SetItemType
// 0x0001 (0x0001 - 0x0000)
struct W_CategoryButton_C_SetItemType final
{
public:
	EItemType                                     Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CategoryButton_C_SetItemType) == 0x000001, "Wrong alignment on W_CategoryButton_C_SetItemType");
static_assert(sizeof(W_CategoryButton_C_SetItemType) == 0x000001, "Wrong size on W_CategoryButton_C_SetItemType");
static_assert(offsetof(W_CategoryButton_C_SetItemType, Type) == 0x000000, "Member 'W_CategoryButton_C_SetItemType::Type' has a wrong offset!");

}

