#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CarUpgradeMenu

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function W_CarUpgradeMenu.W_CarUpgradeMenu_C.ExecuteUbergraph_W_CarUpgradeMenu
// 0x0148 (0x0148 - 0x0000)
struct W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UW_CarUpgradeElement_C* ClickedWidget)> K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_NewState;                             // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasInputKeyJustReleased_ReturnValue;      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasInputKeyJustPressed_ReturnValue;       // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasInputKeyJustPressed_ReturnValue_1;     // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B[0x1];                                       // 0x004B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x004C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_Vehicle_C>          K2Node_DynamicCast_AsI_Vehicle;                    // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_CarUpgradeElement_C*                 K2Node_CustomEvent_ClickedWidget;                  // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetDriver_Driver;                         // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_V2_C*                   CallFunc_GetDriver_NewParam;                       // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetItemCountByName_ReturnedCount;         // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00C8(0x0018)()
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_CarUpgradeElement_C*                 CallFunc_Array_Get_Item;                           // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_CarUpgradeElement_C*                 CallFunc_Array_Get_Item_1;                         // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10A[0x6];                                      // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UW_CarUpgradeElement_C*>         K2Node_MakeArray_Array;                            // 0x0110(0x0010)(ReferenceParm, ContainsInstancedReference)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0120(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0130(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UW_CarUpgradeElement_C*                 CallFunc_Array_Get_Item_2;                         // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu) == 0x000008, "Wrong alignment on W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu");
static_assert(sizeof(W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu) == 0x000148, "Wrong size on W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu");
static_assert(offsetof(W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu, EntryPoint) == 0x000000, "Member 'W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu, Temp_bool_IsClosed_Variable) == 0x000004, "Member 'W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu, Temp_bool_Has_Been_Initd_Variable) == 0x000005, "Member 'W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu, Temp_int_Loop_Counter_Variable_1) == 0x000020, "Member 'W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu, CallFunc_Less_IntInt_ReturnValue) == 0x000024, "Member 'W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu, CallFunc_Add_IntInt_ReturnValue_1) == 0x00002C, "Member 'W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu, Temp_int_Loop_Counter_Variable_2) == 0x000030, "Member 'W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu, CallFunc_Add_IntInt_ReturnValue_2) == 0x000034, "Member 'W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu, Temp_int_Array_Index_Variable) == 0x000038, "Member 'W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu, K2Node_Event_NewState) == 0x00003C, "Member 'W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu::K2Node_Event_NewState' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu, CallFunc_GetPlayerController_ReturnValue) == 0x000040, "Member 'W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu, CallFunc_WasInputKeyJustReleased_ReturnValue) == 0x000048, "Member 'W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu::CallFunc_WasInputKeyJustReleased_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu, CallFunc_WasInputKeyJustPressed_ReturnValue) == 0x000049, "Member 'W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu::CallFunc_WasInputKeyJustPressed_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu, CallFunc_WasInputKeyJustPressed_ReturnValue_1) == 0x00004A, "Member 'W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu::CallFunc_WasInputKeyJustPressed_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu, K2Node_Event_MyGeometry) == 0x00004C, "Member 'W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu, K2Node_Event_InDeltaTime) == 0x000084, "Member 'W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu, K2Node_DynamicCast_AsI_Vehicle) == 0x000088, "Member 'W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu::K2Node_DynamicCast_AsI_Vehicle' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu, K2Node_CustomEvent_ClickedWidget) == 0x0000A0, "Member 'W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu::K2Node_CustomEvent_ClickedWidget' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu, CallFunc_GetDriver_Driver) == 0x0000A8, "Member 'W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu::CallFunc_GetDriver_Driver' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu, CallFunc_GetDriver_NewParam) == 0x0000B0, "Member 'W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu::CallFunc_GetDriver_NewParam' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu, K2Node_DynamicCast_AsSurvival_Player) == 0x0000B8, "Member 'W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu, K2Node_DynamicCast_bSuccess_1) == 0x0000C0, "Member 'W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu, CallFunc_GetItemCountByName_ReturnedCount) == 0x0000C4, "Member 'W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu::CallFunc_GetItemCountByName_ReturnedCount' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu, CallFunc_Conv_IntToText_ReturnValue) == 0x0000C8, "Member 'W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu, Temp_int_Array_Index_Variable_1) == 0x0000E0, "Member 'W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu, CallFunc_Array_Get_Item) == 0x0000E8, "Member 'W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu, CallFunc_Array_Length_ReturnValue_1) == 0x0000F0, "Member 'W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000F4, "Member 'W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu, Temp_int_Array_Index_Variable_2) == 0x0000F8, "Member 'W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu, CallFunc_Array_Get_Item_1) == 0x000100, "Member 'W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu, CallFunc_IsValid_ReturnValue) == 0x000108, "Member 'W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu, CallFunc_IsValid_ReturnValue_1) == 0x000109, "Member 'W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu, K2Node_MakeArray_Array) == 0x000110, "Member 'W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu, K2Node_CreateDelegate_OutputDelegate_1) == 0x000120, "Member 'W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000130, "Member 'W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu, CallFunc_Array_Get_Item_2) == 0x000138, "Member 'W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu, CallFunc_Array_Length_ReturnValue_2) == 0x000140, "Member 'W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu, CallFunc_Less_IntInt_ReturnValue_2) == 0x000144, "Member 'W_CarUpgradeMenu_C_ExecuteUbergraph_W_CarUpgradeMenu::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");

// Function W_CarUpgradeMenu.W_CarUpgradeMenu_C.GetFocused
// 0x0001 (0x0001 - 0x0000)
struct W_CarUpgradeMenu_C_GetFocused final
{
public:
	bool                                          Param_Focused;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CarUpgradeMenu_C_GetFocused) == 0x000001, "Wrong alignment on W_CarUpgradeMenu_C_GetFocused");
static_assert(sizeof(W_CarUpgradeMenu_C_GetFocused) == 0x000001, "Wrong size on W_CarUpgradeMenu_C_GetFocused");
static_assert(offsetof(W_CarUpgradeMenu_C_GetFocused, Param_Focused) == 0x000000, "Member 'W_CarUpgradeMenu_C_GetFocused::Param_Focused' has a wrong offset!");

// Function W_CarUpgradeMenu.W_CarUpgradeMenu_C.OnToggleSplitDialog
// 0x0001 (0x0001 - 0x0000)
struct W_CarUpgradeMenu_C_OnToggleSplitDialog final
{
public:
	bool                                          NewState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CarUpgradeMenu_C_OnToggleSplitDialog) == 0x000001, "Wrong alignment on W_CarUpgradeMenu_C_OnToggleSplitDialog");
static_assert(sizeof(W_CarUpgradeMenu_C_OnToggleSplitDialog) == 0x000001, "Wrong size on W_CarUpgradeMenu_C_OnToggleSplitDialog");
static_assert(offsetof(W_CarUpgradeMenu_C_OnToggleSplitDialog, NewState) == 0x000000, "Member 'W_CarUpgradeMenu_C_OnToggleSplitDialog::NewState' has a wrong offset!");

// Function W_CarUpgradeMenu.W_CarUpgradeMenu_C.SetFocused
// 0x0002 (0x0002 - 0x0000)
struct W_CarUpgradeMenu_C_SetFocused final
{
public:
	bool                                          NewFocus;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CarUpgradeMenu_C_SetFocused) == 0x000001, "Wrong alignment on W_CarUpgradeMenu_C_SetFocused");
static_assert(sizeof(W_CarUpgradeMenu_C_SetFocused) == 0x000002, "Wrong size on W_CarUpgradeMenu_C_SetFocused");
static_assert(offsetof(W_CarUpgradeMenu_C_SetFocused, NewFocus) == 0x000000, "Member 'W_CarUpgradeMenu_C_SetFocused::NewFocus' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_SetFocused, Success) == 0x000001, "Member 'W_CarUpgradeMenu_C_SetFocused::Success' has a wrong offset!");

// Function W_CarUpgradeMenu.W_CarUpgradeMenu_C.Tick
// 0x003C (0x003C - 0x0000)
struct W_CarUpgradeMenu_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CarUpgradeMenu_C_Tick) == 0x000004, "Wrong alignment on W_CarUpgradeMenu_C_Tick");
static_assert(sizeof(W_CarUpgradeMenu_C_Tick) == 0x00003C, "Wrong size on W_CarUpgradeMenu_C_Tick");
static_assert(offsetof(W_CarUpgradeMenu_C_Tick, MyGeometry) == 0x000000, "Member 'W_CarUpgradeMenu_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_Tick, InDeltaTime) == 0x000038, "Member 'W_CarUpgradeMenu_C_Tick::InDeltaTime' has a wrong offset!");

// Function W_CarUpgradeMenu.W_CarUpgradeMenu_C.UpdateUpgradeWidget
// 0x0060 (0x0060 - 0x0000)
struct W_CarUpgradeMenu_C_UpdateUpgradeWidget final
{
public:
	class UW_CarUpgradeElement_C*                 UpgradeWidget;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBPDA_BaseUpgrade_C*                    UpgradeAsset;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentLevel;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFullyUpgraded;                                   // 0x0014(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_Vehicle_C>          K2Node_DynamicCast_AsI_Vehicle;                    // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetDriver_Driver;                         // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_V2_C*                   CallFunc_GetDriver_NewParam;                       // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetItemCountByName_ReturnedCount;         // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CarUpgradeMenu_C_UpdateUpgradeWidget) == 0x000008, "Wrong alignment on W_CarUpgradeMenu_C_UpdateUpgradeWidget");
static_assert(sizeof(W_CarUpgradeMenu_C_UpdateUpgradeWidget) == 0x000060, "Wrong size on W_CarUpgradeMenu_C_UpdateUpgradeWidget");
static_assert(offsetof(W_CarUpgradeMenu_C_UpdateUpgradeWidget, UpgradeWidget) == 0x000000, "Member 'W_CarUpgradeMenu_C_UpdateUpgradeWidget::UpgradeWidget' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_UpdateUpgradeWidget, UpgradeAsset) == 0x000008, "Member 'W_CarUpgradeMenu_C_UpdateUpgradeWidget::UpgradeAsset' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_UpdateUpgradeWidget, CurrentLevel) == 0x000010, "Member 'W_CarUpgradeMenu_C_UpdateUpgradeWidget::CurrentLevel' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_UpdateUpgradeWidget, IsFullyUpgraded) == 0x000014, "Member 'W_CarUpgradeMenu_C_UpdateUpgradeWidget::IsFullyUpgraded' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_UpdateUpgradeWidget, CallFunc_Subtract_IntInt_ReturnValue) == 0x000018, "Member 'W_CarUpgradeMenu_C_UpdateUpgradeWidget::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_UpdateUpgradeWidget, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x00001C, "Member 'W_CarUpgradeMenu_C_UpdateUpgradeWidget::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_UpdateUpgradeWidget, K2Node_DynamicCast_AsI_Vehicle) == 0x000020, "Member 'W_CarUpgradeMenu_C_UpdateUpgradeWidget::K2Node_DynamicCast_AsI_Vehicle' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_UpdateUpgradeWidget, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'W_CarUpgradeMenu_C_UpdateUpgradeWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_UpdateUpgradeWidget, CallFunc_GetDriver_Driver) == 0x000038, "Member 'W_CarUpgradeMenu_C_UpdateUpgradeWidget::CallFunc_GetDriver_Driver' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_UpdateUpgradeWidget, CallFunc_GetDriver_NewParam) == 0x000040, "Member 'W_CarUpgradeMenu_C_UpdateUpgradeWidget::CallFunc_GetDriver_NewParam' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_UpdateUpgradeWidget, K2Node_DynamicCast_AsSurvival_Player) == 0x000048, "Member 'W_CarUpgradeMenu_C_UpdateUpgradeWidget::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_UpdateUpgradeWidget, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'W_CarUpgradeMenu_C_UpdateUpgradeWidget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_UpdateUpgradeWidget, CallFunc_GetItemCountByName_ReturnedCount) == 0x000054, "Member 'W_CarUpgradeMenu_C_UpdateUpgradeWidget::CallFunc_GetItemCountByName_ReturnedCount' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_UpdateUpgradeWidget, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'W_CarUpgradeMenu_C_UpdateUpgradeWidget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function W_CarUpgradeMenu.W_CarUpgradeMenu_C.UpdateWindow
// 0x0080 (0x0080 - 0x0000)
struct W_CarUpgradeMenu_C_UpdateWindow final
{
public:
	class UBPDA_FuelMax_C*                        CallFunc_GetFuelMaxInfo_Info;                      // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetFuelMaxInfo_Level;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFuelMaxInfo_IsFullyUpgraded;           // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPDA_FuelDecreaseSpeed_C*              CallFunc_GetFuelDecreaseSpeedInfo_Output;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetFuelDecreaseSpeedInfo_Level;           // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFuelDecreaseSpeedInfo_IsFullyUpgraded; // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPDA_Boost_C*                          CallFunc_GetBoostInfo_Info;                        // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetBoostInfo_Level;                       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBoostInfo_IsFullyUpgraded;             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPDA_Acceleration_C*                   CallFunc_GetAccelerationInfo_Info;                 // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAccelerationInfo_Level;                // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAccelerationInfo_IsFullyUpgraded;      // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPDA_Isolation_C*                      CallFunc_GetIsolationInfo_Info;                    // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetIsolationInfo_Level;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsolationInfo_IsFullyUpgraded;         // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPDA_Inventory_C*                      CallFunc_GetInventoryInfo_Info;                    // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetInventoryInfo_Level;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetInventoryInfo_IsFullyUpgraded;         // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPDA_AdditionalLight_C*                CallFunc_GetAdditionalLightInfo_Info;              // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAdditionalLightInfo_Level;             // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAdditionalLightInfo_IsFullyUpgraded;   // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPDA_Armor_C*                          CallFunc_GetArmorInfo_Info;                        // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetArmorInfo_Level;                       // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetArmorInfo_IsFullyUpgraded;             // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CarUpgradeMenu_C_UpdateWindow) == 0x000008, "Wrong alignment on W_CarUpgradeMenu_C_UpdateWindow");
static_assert(sizeof(W_CarUpgradeMenu_C_UpdateWindow) == 0x000080, "Wrong size on W_CarUpgradeMenu_C_UpdateWindow");
static_assert(offsetof(W_CarUpgradeMenu_C_UpdateWindow, CallFunc_GetFuelMaxInfo_Info) == 0x000000, "Member 'W_CarUpgradeMenu_C_UpdateWindow::CallFunc_GetFuelMaxInfo_Info' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_UpdateWindow, CallFunc_GetFuelMaxInfo_Level) == 0x000008, "Member 'W_CarUpgradeMenu_C_UpdateWindow::CallFunc_GetFuelMaxInfo_Level' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_UpdateWindow, CallFunc_GetFuelMaxInfo_IsFullyUpgraded) == 0x00000C, "Member 'W_CarUpgradeMenu_C_UpdateWindow::CallFunc_GetFuelMaxInfo_IsFullyUpgraded' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_UpdateWindow, CallFunc_GetFuelDecreaseSpeedInfo_Output) == 0x000010, "Member 'W_CarUpgradeMenu_C_UpdateWindow::CallFunc_GetFuelDecreaseSpeedInfo_Output' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_UpdateWindow, CallFunc_GetFuelDecreaseSpeedInfo_Level) == 0x000018, "Member 'W_CarUpgradeMenu_C_UpdateWindow::CallFunc_GetFuelDecreaseSpeedInfo_Level' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_UpdateWindow, CallFunc_GetFuelDecreaseSpeedInfo_IsFullyUpgraded) == 0x00001C, "Member 'W_CarUpgradeMenu_C_UpdateWindow::CallFunc_GetFuelDecreaseSpeedInfo_IsFullyUpgraded' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_UpdateWindow, CallFunc_GetBoostInfo_Info) == 0x000020, "Member 'W_CarUpgradeMenu_C_UpdateWindow::CallFunc_GetBoostInfo_Info' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_UpdateWindow, CallFunc_GetBoostInfo_Level) == 0x000028, "Member 'W_CarUpgradeMenu_C_UpdateWindow::CallFunc_GetBoostInfo_Level' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_UpdateWindow, CallFunc_GetBoostInfo_IsFullyUpgraded) == 0x00002C, "Member 'W_CarUpgradeMenu_C_UpdateWindow::CallFunc_GetBoostInfo_IsFullyUpgraded' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_UpdateWindow, CallFunc_GetAccelerationInfo_Info) == 0x000030, "Member 'W_CarUpgradeMenu_C_UpdateWindow::CallFunc_GetAccelerationInfo_Info' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_UpdateWindow, CallFunc_GetAccelerationInfo_Level) == 0x000038, "Member 'W_CarUpgradeMenu_C_UpdateWindow::CallFunc_GetAccelerationInfo_Level' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_UpdateWindow, CallFunc_GetAccelerationInfo_IsFullyUpgraded) == 0x00003C, "Member 'W_CarUpgradeMenu_C_UpdateWindow::CallFunc_GetAccelerationInfo_IsFullyUpgraded' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_UpdateWindow, CallFunc_GetIsolationInfo_Info) == 0x000040, "Member 'W_CarUpgradeMenu_C_UpdateWindow::CallFunc_GetIsolationInfo_Info' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_UpdateWindow, CallFunc_GetIsolationInfo_Level) == 0x000048, "Member 'W_CarUpgradeMenu_C_UpdateWindow::CallFunc_GetIsolationInfo_Level' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_UpdateWindow, CallFunc_GetIsolationInfo_IsFullyUpgraded) == 0x00004C, "Member 'W_CarUpgradeMenu_C_UpdateWindow::CallFunc_GetIsolationInfo_IsFullyUpgraded' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_UpdateWindow, CallFunc_GetInventoryInfo_Info) == 0x000050, "Member 'W_CarUpgradeMenu_C_UpdateWindow::CallFunc_GetInventoryInfo_Info' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_UpdateWindow, CallFunc_GetInventoryInfo_Level) == 0x000058, "Member 'W_CarUpgradeMenu_C_UpdateWindow::CallFunc_GetInventoryInfo_Level' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_UpdateWindow, CallFunc_GetInventoryInfo_IsFullyUpgraded) == 0x00005C, "Member 'W_CarUpgradeMenu_C_UpdateWindow::CallFunc_GetInventoryInfo_IsFullyUpgraded' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_UpdateWindow, CallFunc_GetAdditionalLightInfo_Info) == 0x000060, "Member 'W_CarUpgradeMenu_C_UpdateWindow::CallFunc_GetAdditionalLightInfo_Info' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_UpdateWindow, CallFunc_GetAdditionalLightInfo_Level) == 0x000068, "Member 'W_CarUpgradeMenu_C_UpdateWindow::CallFunc_GetAdditionalLightInfo_Level' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_UpdateWindow, CallFunc_GetAdditionalLightInfo_IsFullyUpgraded) == 0x00006C, "Member 'W_CarUpgradeMenu_C_UpdateWindow::CallFunc_GetAdditionalLightInfo_IsFullyUpgraded' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_UpdateWindow, CallFunc_GetArmorInfo_Info) == 0x000070, "Member 'W_CarUpgradeMenu_C_UpdateWindow::CallFunc_GetArmorInfo_Info' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_UpdateWindow, CallFunc_GetArmorInfo_Level) == 0x000078, "Member 'W_CarUpgradeMenu_C_UpdateWindow::CallFunc_GetArmorInfo_Level' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_UpdateWindow, CallFunc_GetArmorInfo_IsFullyUpgraded) == 0x00007C, "Member 'W_CarUpgradeMenu_C_UpdateWindow::CallFunc_GetArmorInfo_IsFullyUpgraded' has a wrong offset!");

// Function W_CarUpgradeMenu.W_CarUpgradeMenu_C.Upgrade
// 0x0080 (0x0080 - 0x0000)
struct W_CarUpgradeMenu_C_Upgrade final
{
public:
	class UBPDA_AdditionalLight_C*                K2Node_DynamicCast_AsBPDA_Additional_Light;        // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPDA_Boost_C*                          K2Node_DynamicCast_AsBPDA_Boost;                   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPDA_FuelMax_C*                        K2Node_DynamicCast_AsBPDA_Fuel_Max;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPDA_Armor_C*                          K2Node_DynamicCast_AsBPDA_Armor;                   // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPDA_FuelDecreaseSpeed_C*              K2Node_DynamicCast_AsBPDA_Fuel_Decrease_Speed;     // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPDA_Inventory_C*                      K2Node_DynamicCast_AsBPDA_Inventory;               // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPDA_Acceleration_C*                   K2Node_DynamicCast_AsBPDA_Acceleration;            // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPDA_Isolation_C*                      K2Node_DynamicCast_AsBPDA_Isolation;               // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CarUpgradeMenu_C_Upgrade) == 0x000008, "Wrong alignment on W_CarUpgradeMenu_C_Upgrade");
static_assert(sizeof(W_CarUpgradeMenu_C_Upgrade) == 0x000080, "Wrong size on W_CarUpgradeMenu_C_Upgrade");
static_assert(offsetof(W_CarUpgradeMenu_C_Upgrade, K2Node_DynamicCast_AsBPDA_Additional_Light) == 0x000000, "Member 'W_CarUpgradeMenu_C_Upgrade::K2Node_DynamicCast_AsBPDA_Additional_Light' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_Upgrade, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'W_CarUpgradeMenu_C_Upgrade::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_Upgrade, K2Node_DynamicCast_AsBPDA_Boost) == 0x000010, "Member 'W_CarUpgradeMenu_C_Upgrade::K2Node_DynamicCast_AsBPDA_Boost' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_Upgrade, K2Node_DynamicCast_bSuccess_1) == 0x000018, "Member 'W_CarUpgradeMenu_C_Upgrade::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_Upgrade, K2Node_DynamicCast_AsBPDA_Fuel_Max) == 0x000020, "Member 'W_CarUpgradeMenu_C_Upgrade::K2Node_DynamicCast_AsBPDA_Fuel_Max' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_Upgrade, K2Node_DynamicCast_bSuccess_2) == 0x000028, "Member 'W_CarUpgradeMenu_C_Upgrade::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_Upgrade, K2Node_DynamicCast_AsBPDA_Armor) == 0x000030, "Member 'W_CarUpgradeMenu_C_Upgrade::K2Node_DynamicCast_AsBPDA_Armor' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_Upgrade, K2Node_DynamicCast_bSuccess_3) == 0x000038, "Member 'W_CarUpgradeMenu_C_Upgrade::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_Upgrade, K2Node_DynamicCast_AsBPDA_Fuel_Decrease_Speed) == 0x000040, "Member 'W_CarUpgradeMenu_C_Upgrade::K2Node_DynamicCast_AsBPDA_Fuel_Decrease_Speed' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_Upgrade, K2Node_DynamicCast_bSuccess_4) == 0x000048, "Member 'W_CarUpgradeMenu_C_Upgrade::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_Upgrade, K2Node_DynamicCast_AsBPDA_Inventory) == 0x000050, "Member 'W_CarUpgradeMenu_C_Upgrade::K2Node_DynamicCast_AsBPDA_Inventory' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_Upgrade, K2Node_DynamicCast_bSuccess_5) == 0x000058, "Member 'W_CarUpgradeMenu_C_Upgrade::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_Upgrade, K2Node_DynamicCast_AsBPDA_Acceleration) == 0x000060, "Member 'W_CarUpgradeMenu_C_Upgrade::K2Node_DynamicCast_AsBPDA_Acceleration' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_Upgrade, K2Node_DynamicCast_bSuccess_6) == 0x000068, "Member 'W_CarUpgradeMenu_C_Upgrade::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_Upgrade, K2Node_DynamicCast_AsBPDA_Isolation) == 0x000070, "Member 'W_CarUpgradeMenu_C_Upgrade::K2Node_DynamicCast_AsBPDA_Isolation' has a wrong offset!");
static_assert(offsetof(W_CarUpgradeMenu_C_Upgrade, K2Node_DynamicCast_bSuccess_7) == 0x000078, "Member 'W_CarUpgradeMenu_C_Upgrade::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");

// Function W_CarUpgradeMenu.W_CarUpgradeMenu_C.WidgetClicked
// 0x0008 (0x0008 - 0x0000)
struct W_CarUpgradeMenu_C_WidgetClicked final
{
public:
	class UW_CarUpgradeElement_C*                 ClickedWidget;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CarUpgradeMenu_C_WidgetClicked) == 0x000008, "Wrong alignment on W_CarUpgradeMenu_C_WidgetClicked");
static_assert(sizeof(W_CarUpgradeMenu_C_WidgetClicked) == 0x000008, "Wrong size on W_CarUpgradeMenu_C_WidgetClicked");
static_assert(offsetof(W_CarUpgradeMenu_C_WidgetClicked, ClickedWidget) == 0x000000, "Member 'W_CarUpgradeMenu_C_WidgetClicked::ClickedWidget' has a wrong offset!");

}

