#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CategoryBar

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_CategoryBar.W_CategoryBar_C.ExecuteUbergraph_W_CategoryBar
// 0x0080 (0x0080 - 0x0000)
struct W_CategoryBar_C_ExecuteUbergraph_W_CategoryBar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_CategoryButton_C*                    CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_CategoryButton_C*                    CallFunc_Array_Get_Item_1;                         // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UW_CategoryButton_C*>            K2Node_MakeArray_Array;                            // 0x0038(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UW_CategoryButton_C* ClickedWidget)> K2Node_CreateDelegate_OutputDelegate;              // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UW_CategoryButton_C*                    K2Node_CustomEvent_ClickedWidget;                  // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UW_CategoryButton_C* ClickedWidget)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x006C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CategoryBar_C_ExecuteUbergraph_W_CategoryBar) == 0x000008, "Wrong alignment on W_CategoryBar_C_ExecuteUbergraph_W_CategoryBar");
static_assert(sizeof(W_CategoryBar_C_ExecuteUbergraph_W_CategoryBar) == 0x000080, "Wrong size on W_CategoryBar_C_ExecuteUbergraph_W_CategoryBar");
static_assert(offsetof(W_CategoryBar_C_ExecuteUbergraph_W_CategoryBar, EntryPoint) == 0x000000, "Member 'W_CategoryBar_C_ExecuteUbergraph_W_CategoryBar::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_CategoryBar_C_ExecuteUbergraph_W_CategoryBar, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'W_CategoryBar_C_ExecuteUbergraph_W_CategoryBar::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CategoryBar_C_ExecuteUbergraph_W_CategoryBar, CallFunc_Array_Length_ReturnValue_1) == 0x000008, "Member 'W_CategoryBar_C_ExecuteUbergraph_W_CategoryBar::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_CategoryBar_C_ExecuteUbergraph_W_CategoryBar, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'W_CategoryBar_C_ExecuteUbergraph_W_CategoryBar::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_CategoryBar_C_ExecuteUbergraph_W_CategoryBar, CallFunc_Less_IntInt_ReturnValue) == 0x000010, "Member 'W_CategoryBar_C_ExecuteUbergraph_W_CategoryBar::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CategoryBar_C_ExecuteUbergraph_W_CategoryBar, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'W_CategoryBar_C_ExecuteUbergraph_W_CategoryBar::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CategoryBar_C_ExecuteUbergraph_W_CategoryBar, Temp_int_Array_Index_Variable) == 0x000018, "Member 'W_CategoryBar_C_ExecuteUbergraph_W_CategoryBar::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_CategoryBar_C_ExecuteUbergraph_W_CategoryBar, Temp_int_Array_Index_Variable_1) == 0x00001C, "Member 'W_CategoryBar_C_ExecuteUbergraph_W_CategoryBar::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(W_CategoryBar_C_ExecuteUbergraph_W_CategoryBar, CallFunc_Array_Get_Item) == 0x000020, "Member 'W_CategoryBar_C_ExecuteUbergraph_W_CategoryBar::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_CategoryBar_C_ExecuteUbergraph_W_CategoryBar, CallFunc_Array_Get_Item_1) == 0x000028, "Member 'W_CategoryBar_C_ExecuteUbergraph_W_CategoryBar::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(W_CategoryBar_C_ExecuteUbergraph_W_CategoryBar, Temp_int_Loop_Counter_Variable_1) == 0x000030, "Member 'W_CategoryBar_C_ExecuteUbergraph_W_CategoryBar::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(W_CategoryBar_C_ExecuteUbergraph_W_CategoryBar, K2Node_MakeArray_Array) == 0x000038, "Member 'W_CategoryBar_C_ExecuteUbergraph_W_CategoryBar::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_CategoryBar_C_ExecuteUbergraph_W_CategoryBar, CallFunc_Less_IntInt_ReturnValue_1) == 0x000048, "Member 'W_CategoryBar_C_ExecuteUbergraph_W_CategoryBar::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_CategoryBar_C_ExecuteUbergraph_W_CategoryBar, CallFunc_Add_IntInt_ReturnValue_1) == 0x00004C, "Member 'W_CategoryBar_C_ExecuteUbergraph_W_CategoryBar::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_CategoryBar_C_ExecuteUbergraph_W_CategoryBar, K2Node_CreateDelegate_OutputDelegate) == 0x000050, "Member 'W_CategoryBar_C_ExecuteUbergraph_W_CategoryBar::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_CategoryBar_C_ExecuteUbergraph_W_CategoryBar, K2Node_CustomEvent_ClickedWidget) == 0x000060, "Member 'W_CategoryBar_C_ExecuteUbergraph_W_CategoryBar::K2Node_CustomEvent_ClickedWidget' has a wrong offset!");
static_assert(offsetof(W_CategoryBar_C_ExecuteUbergraph_W_CategoryBar, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'W_CategoryBar_C_ExecuteUbergraph_W_CategoryBar::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CategoryBar_C_ExecuteUbergraph_W_CategoryBar, K2Node_CreateDelegate_OutputDelegate_1) == 0x00006C, "Member 'W_CategoryBar_C_ExecuteUbergraph_W_CategoryBar::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function W_CategoryBar.W_CategoryBar_C.OnCategoryClicked
// 0x0008 (0x0008 - 0x0000)
struct W_CategoryBar_C_OnCategoryClicked final
{
public:
	class UW_CategoryButton_C*                    ClickedWidget;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CategoryBar_C_OnCategoryClicked) == 0x000008, "Wrong alignment on W_CategoryBar_C_OnCategoryClicked");
static_assert(sizeof(W_CategoryBar_C_OnCategoryClicked) == 0x000008, "Wrong size on W_CategoryBar_C_OnCategoryClicked");
static_assert(offsetof(W_CategoryBar_C_OnCategoryClicked, ClickedWidget) == 0x000000, "Member 'W_CategoryBar_C_OnCategoryClicked::ClickedWidget' has a wrong offset!");

// Function W_CategoryBar.W_CategoryBar_C.OnClickedCategoryButton__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_CategoryBar_C_OnClickedCategoryButton__DelegateSignature final
{
public:
	class UW_CategoryButton_C*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CategoryBar_C_OnClickedCategoryButton__DelegateSignature) == 0x000008, "Wrong alignment on W_CategoryBar_C_OnClickedCategoryButton__DelegateSignature");
static_assert(sizeof(W_CategoryBar_C_OnClickedCategoryButton__DelegateSignature) == 0x000008, "Wrong size on W_CategoryBar_C_OnClickedCategoryButton__DelegateSignature");
static_assert(offsetof(W_CategoryBar_C_OnClickedCategoryButton__DelegateSignature, Button) == 0x000000, "Member 'W_CategoryBar_C_OnClickedCategoryButton__DelegateSignature::Button' has a wrong offset!");

}

