#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CampTent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_CampAction_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_CampTent.W_CampTent_C
// 0x0018 (0x0298 - 0x0280)
class UW_CampTent_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_239;                                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	E_CampAction                                  CampAction;                                        // 0x0290(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsBlocked;                                         // 0x0291(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_CampTent(int32 EntryPoint);
	void Hide();
	void Show(E_CampAction Action);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_CampTent_C">();
	}
	static class UW_CampTent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_CampTent_C>();
	}
};
static_assert(alignof(UW_CampTent_C) == 0x000008, "Wrong alignment on UW_CampTent_C");
static_assert(sizeof(UW_CampTent_C) == 0x000298, "Wrong size on UW_CampTent_C");
static_assert(offsetof(UW_CampTent_C, UberGraphFrame) == 0x000280, "Member 'UW_CampTent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_CampTent_C, Image_239) == 0x000288, "Member 'UW_CampTent_C::Image_239' has a wrong offset!");
static_assert(offsetof(UW_CampTent_C, CampAction) == 0x000290, "Member 'UW_CampTent_C::CampAction' has a wrong offset!");
static_assert(offsetof(UW_CampTent_C, IsBlocked) == 0x000291, "Member 'UW_CampTent_C::IsBlocked' has a wrong offset!");

}

