#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CategorySelector

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_CategorySelector.W_CategorySelector_C
// 0x0230 (0x04B0 - 0x0280)
class UW_CategorySelector_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         HorizontalBox_Marks;                               // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Root;                                      // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_CategoryName;                            // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_HintButtonNew_C*                     W_ButtonNext;                                      // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_HintButtonNew_C*                     W_ButtonPrev;                                      // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                 MarkWidgetClass;                                   // 0x02B0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            SelectedMarkBrush;                                 // 0x02C0(0x00D0)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	struct FSlateBrush                            UnselectedMarkBrush;                               // 0x0390(0x00D0)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	TArray<class UImage*>                         MarksArray;                                        // 0x0460(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class FText>                           CategoryArray;                                     // 0x0470(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	int32                                         CurrentCategoryIndex;                              // 0x0480(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_484[0x4];                                      // 0x0484(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnCategoryChanged;                                 // 0x0488(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnPressedCategoryChangeButtons;                    // 0x0498(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__W_CategorySelector_W_ButtonNext_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature();
	void BndEvt__W_CategorySelector_W_ButtonPrev_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();
	void Construct();
	void CreateMark();
	void ExecuteUbergraph_W_CategorySelector(int32 EntryPoint);
	int32 GetNumCategories();
	void Init();
	void Nav_NextCategory();
	void Nav_PrevCategory();
	void NextCategory();
	void OnCategoryChanged__DelegateSignature(int32 CategoryIndex);
	void OnPressedCategoryChangeButtons__DelegateSignature();
	void PrevCategory();
	void SelectCategory(int32 Param_Index);
	void SetCategoryArray(TArray<class FText>& CategoriesArray);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_CategorySelector_C">();
	}
	static class UW_CategorySelector_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_CategorySelector_C>();
	}
};
static_assert(alignof(UW_CategorySelector_C) == 0x000010, "Wrong alignment on UW_CategorySelector_C");
static_assert(sizeof(UW_CategorySelector_C) == 0x0004B0, "Wrong size on UW_CategorySelector_C");
static_assert(offsetof(UW_CategorySelector_C, UberGraphFrame) == 0x000280, "Member 'UW_CategorySelector_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_CategorySelector_C, HorizontalBox_Marks) == 0x000288, "Member 'UW_CategorySelector_C::HorizontalBox_Marks' has a wrong offset!");
static_assert(offsetof(UW_CategorySelector_C, SizeBox_Root) == 0x000290, "Member 'UW_CategorySelector_C::SizeBox_Root' has a wrong offset!");
static_assert(offsetof(UW_CategorySelector_C, TextBlock_CategoryName) == 0x000298, "Member 'UW_CategorySelector_C::TextBlock_CategoryName' has a wrong offset!");
static_assert(offsetof(UW_CategorySelector_C, W_ButtonNext) == 0x0002A0, "Member 'UW_CategorySelector_C::W_ButtonNext' has a wrong offset!");
static_assert(offsetof(UW_CategorySelector_C, W_ButtonPrev) == 0x0002A8, "Member 'UW_CategorySelector_C::W_ButtonPrev' has a wrong offset!");
static_assert(offsetof(UW_CategorySelector_C, MarkWidgetClass) == 0x0002B0, "Member 'UW_CategorySelector_C::MarkWidgetClass' has a wrong offset!");
static_assert(offsetof(UW_CategorySelector_C, SelectedMarkBrush) == 0x0002C0, "Member 'UW_CategorySelector_C::SelectedMarkBrush' has a wrong offset!");
static_assert(offsetof(UW_CategorySelector_C, UnselectedMarkBrush) == 0x000390, "Member 'UW_CategorySelector_C::UnselectedMarkBrush' has a wrong offset!");
static_assert(offsetof(UW_CategorySelector_C, MarksArray) == 0x000460, "Member 'UW_CategorySelector_C::MarksArray' has a wrong offset!");
static_assert(offsetof(UW_CategorySelector_C, CategoryArray) == 0x000470, "Member 'UW_CategorySelector_C::CategoryArray' has a wrong offset!");
static_assert(offsetof(UW_CategorySelector_C, CurrentCategoryIndex) == 0x000480, "Member 'UW_CategorySelector_C::CurrentCategoryIndex' has a wrong offset!");
static_assert(offsetof(UW_CategorySelector_C, OnCategoryChanged) == 0x000488, "Member 'UW_CategorySelector_C::OnCategoryChanged' has a wrong offset!");
static_assert(offsetof(UW_CategorySelector_C, OnPressedCategoryChangeButtons) == 0x000498, "Member 'UW_CategorySelector_C::OnPressedCategoryChangeButtons' has a wrong offset!");

}

