#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CharacterCreate_Switcher

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"
#include "FMODStudio_structs.hpp"


namespace SDK::Params
{

// Function W_CharacterCreate_Switcher.W_CharacterCreate_Switcher_C.ExecuteUbergraph_W_CharacterCreate_Switcher
// 0x01F8 (0x01F8 - 0x0000)
struct W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_CurrentIndex;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextTransformPolicy                          Temp_byte_Variable;                                // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_1;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0024(0x0038)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0060(0x0078)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00D8(0x0078)(ConstParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0152(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0153(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Settings_C>       K2Node_DynamicCast_AsBPI_Settings;                 // 0x0158(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Settings_C>       K2Node_DynamicCast_AsBPI_Settings_1;               // 0x0170(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Settings_C>       K2Node_DynamicCast_AsBPI_Settings_2;               // 0x0188(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Settings_C>       K2Node_DynamicCast_AsBPI_Settings_3;               // 0x01A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_Event_SettingsWidgetRef;                    // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ETextTransformPolicy                          Temp_byte_Variable_1;                              // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C2[0x6];                                      // 0x01C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_2;                // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_3;                // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_4;                // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_5;                // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x01ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x01EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01EF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextTransformPolicy                          K2Node_Select_Default;                             // 0x01F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher) == 0x000008, "Wrong alignment on W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher");
static_assert(sizeof(W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher) == 0x0001F8, "Wrong size on W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher");
static_assert(offsetof(W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher, EntryPoint) == 0x000000, "Member 'W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher, K2Node_CustomEvent_CurrentIndex) == 0x000004, "Member 'W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher::K2Node_CustomEvent_CurrentIndex' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00000C, "Member 'W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher, Temp_byte_Variable) == 0x00000D, "Member 'W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher, CallFunc_PlayEvent2D_ReturnValue) == 0x000010, "Member 'W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher::CallFunc_PlayEvent2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher, CallFunc_PlayEvent2D_ReturnValue_1) == 0x000018, "Member 'W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher::CallFunc_PlayEvent2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher, CallFunc_Not_PreBool_ReturnValue) == 0x000020, "Member 'W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher, CallFunc_Not_PreBool_ReturnValue_1) == 0x000021, "Member 'W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher, CallFunc_Not_PreBool_ReturnValue_2) == 0x000022, "Member 'W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher, CallFunc_Not_PreBool_ReturnValue_3) == 0x000023, "Member 'W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher, K2Node_Event_MyGeometry) == 0x000024, "Member 'W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher, K2Node_Event_MouseEvent_1) == 0x000060, "Member 'W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher, K2Node_Event_MouseEvent) == 0x0000D8, "Member 'W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher, CallFunc_IsValid_ReturnValue) == 0x000150, "Member 'W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher, CallFunc_IsValid_ReturnValue_1) == 0x000151, "Member 'W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher, CallFunc_IsValid_ReturnValue_2) == 0x000152, "Member 'W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher, CallFunc_IsValid_ReturnValue_3) == 0x000153, "Member 'W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher, K2Node_DynamicCast_AsBPI_Settings) == 0x000158, "Member 'W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher::K2Node_DynamicCast_AsBPI_Settings' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher, K2Node_DynamicCast_bSuccess) == 0x000168, "Member 'W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher, K2Node_DynamicCast_AsBPI_Settings_1) == 0x000170, "Member 'W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher::K2Node_DynamicCast_AsBPI_Settings_1' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher, K2Node_DynamicCast_bSuccess_1) == 0x000180, "Member 'W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher, K2Node_DynamicCast_AsBPI_Settings_2) == 0x000188, "Member 'W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher::K2Node_DynamicCast_AsBPI_Settings_2' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher, K2Node_DynamicCast_bSuccess_2) == 0x000198, "Member 'W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher, K2Node_DynamicCast_AsBPI_Settings_3) == 0x0001A0, "Member 'W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher::K2Node_DynamicCast_AsBPI_Settings_3' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher, K2Node_DynamicCast_bSuccess_3) == 0x0001B0, "Member 'W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher, K2Node_Event_SettingsWidgetRef) == 0x0001B8, "Member 'W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher::K2Node_Event_SettingsWidgetRef' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher, Temp_byte_Variable_1) == 0x0001C0, "Member 'W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher, Temp_bool_Variable) == 0x0001C1, "Member 'W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher, CallFunc_PlayEvent2D_ReturnValue_2) == 0x0001C8, "Member 'W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher::CallFunc_PlayEvent2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher, CallFunc_PlayEvent2D_ReturnValue_3) == 0x0001D0, "Member 'W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher::CallFunc_PlayEvent2D_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher, CallFunc_PlayEvent2D_ReturnValue_4) == 0x0001D8, "Member 'W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher::CallFunc_PlayEvent2D_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher, CallFunc_PlayEvent2D_ReturnValue_5) == 0x0001E0, "Member 'W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher::CallFunc_PlayEvent2D_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher, CallFunc_Subtract_IntInt_ReturnValue) == 0x0001E8, "Member 'W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher, K2Node_Event_IsDesignTime) == 0x0001EC, "Member 'W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0001ED, "Member 'W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher, CallFunc_Not_PreBool_ReturnValue_4) == 0x0001EE, "Member 'W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher, CallFunc_BooleanAND_ReturnValue) == 0x0001EF, "Member 'W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher, CallFunc_Not_PreBool_ReturnValue_5) == 0x0001F0, "Member 'W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher::CallFunc_Not_PreBool_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher, CallFunc_BooleanAND_ReturnValue_1) == 0x0001F1, "Member 'W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher, K2Node_Select_Default) == 0x0001F2, "Member 'W_CharacterCreate_Switcher_C_ExecuteUbergraph_W_CharacterCreate_Switcher::K2Node_Select_Default' has a wrong offset!");

// Function W_CharacterCreate_Switcher.W_CharacterCreate_Switcher_C.GetIsDefaultValue
// 0x0002 (0x0002 - 0x0000)
struct W_CharacterCreate_Switcher_C_GetIsDefaultValue final
{
public:
	bool                                          Default;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CharacterCreate_Switcher_C_GetIsDefaultValue) == 0x000001, "Wrong alignment on W_CharacterCreate_Switcher_C_GetIsDefaultValue");
static_assert(sizeof(W_CharacterCreate_Switcher_C_GetIsDefaultValue) == 0x000002, "Wrong size on W_CharacterCreate_Switcher_C_GetIsDefaultValue");
static_assert(offsetof(W_CharacterCreate_Switcher_C_GetIsDefaultValue, Default) == 0x000000, "Member 'W_CharacterCreate_Switcher_C_GetIsDefaultValue::Default' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_GetIsDefaultValue, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000001, "Member 'W_CharacterCreate_Switcher_C_GetIsDefaultValue::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function W_CharacterCreate_Switcher.W_CharacterCreate_Switcher_C.GetSettingName
// 0x0008 (0x0008 - 0x0000)
struct W_CharacterCreate_Switcher_C_GetSettingName final
{
public:
	class FName                                   SettingName;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CharacterCreate_Switcher_C_GetSettingName) == 0x000004, "Wrong alignment on W_CharacterCreate_Switcher_C_GetSettingName");
static_assert(sizeof(W_CharacterCreate_Switcher_C_GetSettingName) == 0x000008, "Wrong size on W_CharacterCreate_Switcher_C_GetSettingName");
static_assert(offsetof(W_CharacterCreate_Switcher_C_GetSettingName, SettingName) == 0x000000, "Member 'W_CharacterCreate_Switcher_C_GetSettingName::SettingName' has a wrong offset!");

// Function W_CharacterCreate_Switcher.W_CharacterCreate_Switcher_C.IndexHasBeenChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_CharacterCreate_Switcher_C_IndexHasBeenChanged__DelegateSignature final
{
public:
	int32                                         NewIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CharacterCreate_Switcher_C_IndexHasBeenChanged__DelegateSignature) == 0x000004, "Wrong alignment on W_CharacterCreate_Switcher_C_IndexHasBeenChanged__DelegateSignature");
static_assert(sizeof(W_CharacterCreate_Switcher_C_IndexHasBeenChanged__DelegateSignature) == 0x000004, "Wrong size on W_CharacterCreate_Switcher_C_IndexHasBeenChanged__DelegateSignature");
static_assert(offsetof(W_CharacterCreate_Switcher_C_IndexHasBeenChanged__DelegateSignature, NewIndex) == 0x000000, "Member 'W_CharacterCreate_Switcher_C_IndexHasBeenChanged__DelegateSignature::NewIndex' has a wrong offset!");

// Function W_CharacterCreate_Switcher.W_CharacterCreate_Switcher_C.Init
// 0x0004 (0x0004 - 0x0000)
struct W_CharacterCreate_Switcher_C_Init final
{
public:
	int32                                         Param_CurrentIndex;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CharacterCreate_Switcher_C_Init) == 0x000004, "Wrong alignment on W_CharacterCreate_Switcher_C_Init");
static_assert(sizeof(W_CharacterCreate_Switcher_C_Init) == 0x000004, "Wrong size on W_CharacterCreate_Switcher_C_Init");
static_assert(offsetof(W_CharacterCreate_Switcher_C_Init, Param_CurrentIndex) == 0x000000, "Member 'W_CharacterCreate_Switcher_C_Init::Param_CurrentIndex' has a wrong offset!");

// Function W_CharacterCreate_Switcher.W_CharacterCreate_Switcher_C.IsRowHovered
// 0x0001 (0x0001 - 0x0000)
struct W_CharacterCreate_Switcher_C_IsRowHovered final
{
public:
	bool                                          Param_IsHovered;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CharacterCreate_Switcher_C_IsRowHovered) == 0x000001, "Wrong alignment on W_CharacterCreate_Switcher_C_IsRowHovered");
static_assert(sizeof(W_CharacterCreate_Switcher_C_IsRowHovered) == 0x000001, "Wrong size on W_CharacterCreate_Switcher_C_IsRowHovered");
static_assert(offsetof(W_CharacterCreate_Switcher_C_IsRowHovered, Param_IsHovered) == 0x000000, "Member 'W_CharacterCreate_Switcher_C_IsRowHovered::Param_IsHovered' has a wrong offset!");

// Function W_CharacterCreate_Switcher.W_CharacterCreate_Switcher_C.IsRowSelected
// 0x0001 (0x0001 - 0x0000)
struct W_CharacterCreate_Switcher_C_IsRowSelected final
{
public:
	bool                                          IsSelected;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CharacterCreate_Switcher_C_IsRowSelected) == 0x000001, "Wrong alignment on W_CharacterCreate_Switcher_C_IsRowSelected");
static_assert(sizeof(W_CharacterCreate_Switcher_C_IsRowSelected) == 0x000001, "Wrong size on W_CharacterCreate_Switcher_C_IsRowSelected");
static_assert(offsetof(W_CharacterCreate_Switcher_C_IsRowSelected, IsSelected) == 0x000000, "Member 'W_CharacterCreate_Switcher_C_IsRowSelected::IsSelected' has a wrong offset!");

// Function W_CharacterCreate_Switcher.W_CharacterCreate_Switcher_C.OnMouseEnter
// 0x00B0 (0x00B0 - 0x0000)
struct W_CharacterCreate_Switcher_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(W_CharacterCreate_Switcher_C_OnMouseEnter) == 0x000008, "Wrong alignment on W_CharacterCreate_Switcher_C_OnMouseEnter");
static_assert(sizeof(W_CharacterCreate_Switcher_C_OnMouseEnter) == 0x0000B0, "Wrong size on W_CharacterCreate_Switcher_C_OnMouseEnter");
static_assert(offsetof(W_CharacterCreate_Switcher_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'W_CharacterCreate_Switcher_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'W_CharacterCreate_Switcher_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function W_CharacterCreate_Switcher.W_CharacterCreate_Switcher_C.OnMouseLeave
// 0x0078 (0x0078 - 0x0000)
struct W_CharacterCreate_Switcher_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(W_CharacterCreate_Switcher_C_OnMouseLeave) == 0x000008, "Wrong alignment on W_CharacterCreate_Switcher_C_OnMouseLeave");
static_assert(sizeof(W_CharacterCreate_Switcher_C_OnMouseLeave) == 0x000078, "Wrong size on W_CharacterCreate_Switcher_C_OnMouseLeave");
static_assert(offsetof(W_CharacterCreate_Switcher_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'W_CharacterCreate_Switcher_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function W_CharacterCreate_Switcher.W_CharacterCreate_Switcher_C.OnPreviewKeyDown
// 0x02E8 (0x02E8 - 0x0000)
struct W_CharacterCreate_Switcher_C_OnPreviewKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0078(0x00B8)(Parm, OutParm, ReturnParm)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x0138(0x0018)(HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MainMenu_C>       K2Node_DynamicCast_AsBPI_Main_Menu;                // 0x0160(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0178(0x00B8)()
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0230(0x00B8)()
};
static_assert(alignof(W_CharacterCreate_Switcher_C_OnPreviewKeyDown) == 0x000008, "Wrong alignment on W_CharacterCreate_Switcher_C_OnPreviewKeyDown");
static_assert(sizeof(W_CharacterCreate_Switcher_C_OnPreviewKeyDown) == 0x0002E8, "Wrong size on W_CharacterCreate_Switcher_C_OnPreviewKeyDown");
static_assert(offsetof(W_CharacterCreate_Switcher_C_OnPreviewKeyDown, MyGeometry) == 0x000000, "Member 'W_CharacterCreate_Switcher_C_OnPreviewKeyDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_OnPreviewKeyDown, InKeyEvent) == 0x000038, "Member 'W_CharacterCreate_Switcher_C_OnPreviewKeyDown::InKeyEvent' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_OnPreviewKeyDown, ReturnValue) == 0x000078, "Member 'W_CharacterCreate_Switcher_C_OnPreviewKeyDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_OnPreviewKeyDown, CallFunc_GetPlayerController_ReturnValue) == 0x000130, "Member 'W_CharacterCreate_Switcher_C_OnPreviewKeyDown::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_OnPreviewKeyDown, CallFunc_GetKey_ReturnValue) == 0x000138, "Member 'W_CharacterCreate_Switcher_C_OnPreviewKeyDown::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_OnPreviewKeyDown, CallFunc_GetHUD_ReturnValue) == 0x000150, "Member 'W_CharacterCreate_Switcher_C_OnPreviewKeyDown::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_OnPreviewKeyDown, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000158, "Member 'W_CharacterCreate_Switcher_C_OnPreviewKeyDown::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_OnPreviewKeyDown, K2Node_DynamicCast_AsBPI_Main_Menu) == 0x000160, "Member 'W_CharacterCreate_Switcher_C_OnPreviewKeyDown::K2Node_DynamicCast_AsBPI_Main_Menu' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_OnPreviewKeyDown, K2Node_DynamicCast_bSuccess) == 0x000170, "Member 'W_CharacterCreate_Switcher_C_OnPreviewKeyDown::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_OnPreviewKeyDown, CallFunc_Handled_ReturnValue) == 0x000178, "Member 'W_CharacterCreate_Switcher_C_OnPreviewKeyDown::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_OnPreviewKeyDown, CallFunc_Unhandled_ReturnValue) == 0x000230, "Member 'W_CharacterCreate_Switcher_C_OnPreviewKeyDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");

// Function W_CharacterCreate_Switcher.W_CharacterCreate_Switcher_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_CharacterCreate_Switcher_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CharacterCreate_Switcher_C_PreConstruct) == 0x000001, "Wrong alignment on W_CharacterCreate_Switcher_C_PreConstruct");
static_assert(sizeof(W_CharacterCreate_Switcher_C_PreConstruct) == 0x000001, "Wrong size on W_CharacterCreate_Switcher_C_PreConstruct");
static_assert(offsetof(W_CharacterCreate_Switcher_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_CharacterCreate_Switcher_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_CharacterCreate_Switcher.W_CharacterCreate_Switcher_C.SetArrowsOpacity
// 0x0028 (0x0028 - 0x0000)
struct W_CharacterCreate_Switcher_C_SetArrowsOpacity final
{
public:
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_1; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CharacterCreate_Switcher_C_SetArrowsOpacity) == 0x000008, "Wrong alignment on W_CharacterCreate_Switcher_C_SetArrowsOpacity");
static_assert(sizeof(W_CharacterCreate_Switcher_C_SetArrowsOpacity) == 0x000028, "Wrong size on W_CharacterCreate_Switcher_C_SetArrowsOpacity");
static_assert(offsetof(W_CharacterCreate_Switcher_C_SetArrowsOpacity, CallFunc_Subtract_IntInt_ReturnValue) == 0x000000, "Member 'W_CharacterCreate_Switcher_C_SetArrowsOpacity::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_SetArrowsOpacity, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000004, "Member 'W_CharacterCreate_Switcher_C_SetArrowsOpacity::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_SetArrowsOpacity, CallFunc_SelectFloat_ReturnValue) == 0x000008, "Member 'W_CharacterCreate_Switcher_C_SetArrowsOpacity::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_SetArrowsOpacity, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'W_CharacterCreate_Switcher_C_SetArrowsOpacity::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_SetArrowsOpacity, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000014, "Member 'W_CharacterCreate_Switcher_C_SetArrowsOpacity::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_SetArrowsOpacity, CallFunc_SelectFloat_ReturnValue_1) == 0x000018, "Member 'W_CharacterCreate_Switcher_C_SetArrowsOpacity::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_SetArrowsOpacity, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast) == 0x000020, "Member 'W_CharacterCreate_Switcher_C_SetArrowsOpacity::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_SetArrowsOpacity, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_1) == 0x000024, "Member 'W_CharacterCreate_Switcher_C_SetArrowsOpacity::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_1' has a wrong offset!");

// Function W_CharacterCreate_Switcher.W_CharacterCreate_Switcher_C.SetButtonsState
// 0x0002 (0x0002 - 0x0000)
struct W_CharacterCreate_Switcher_C_SetButtonsState final
{
public:
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CharacterCreate_Switcher_C_SetButtonsState) == 0x000001, "Wrong alignment on W_CharacterCreate_Switcher_C_SetButtonsState");
static_assert(sizeof(W_CharacterCreate_Switcher_C_SetButtonsState) == 0x000002, "Wrong size on W_CharacterCreate_Switcher_C_SetButtonsState");
static_assert(offsetof(W_CharacterCreate_Switcher_C_SetButtonsState, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000000, "Member 'W_CharacterCreate_Switcher_C_SetButtonsState::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_SetButtonsState, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x000001, "Member 'W_CharacterCreate_Switcher_C_SetButtonsState::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");

// Function W_CharacterCreate_Switcher.W_CharacterCreate_Switcher_C.SetDefault
// 0x0020 (0x0020 - 0x0000)
struct W_CharacterCreate_Switcher_C_SetDefault final
{
public:
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0000(0x0014)()
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CharacterCreate_Switcher_C_SetDefault) == 0x000008, "Wrong alignment on W_CharacterCreate_Switcher_C_SetDefault");
static_assert(sizeof(W_CharacterCreate_Switcher_C_SetDefault) == 0x000020, "Wrong size on W_CharacterCreate_Switcher_C_SetDefault");
static_assert(offsetof(W_CharacterCreate_Switcher_C_SetDefault, K2Node_MakeStruct_SlateColor) == 0x000000, "Member 'W_CharacterCreate_Switcher_C_SetDefault::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_SetDefault, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'W_CharacterCreate_Switcher_C_SetDefault::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function W_CharacterCreate_Switcher.W_CharacterCreate_Switcher_C.SetHovered
// 0x0008 (0x0008 - 0x0000)
struct W_CharacterCreate_Switcher_C_SetHovered final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CharacterCreate_Switcher_C_SetHovered) == 0x000008, "Wrong alignment on W_CharacterCreate_Switcher_C_SetHovered");
static_assert(sizeof(W_CharacterCreate_Switcher_C_SetHovered) == 0x000008, "Wrong size on W_CharacterCreate_Switcher_C_SetHovered");
static_assert(offsetof(W_CharacterCreate_Switcher_C_SetHovered, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'W_CharacterCreate_Switcher_C_SetHovered::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function W_CharacterCreate_Switcher.W_CharacterCreate_Switcher_C.SetParentSettingsWidget
// 0x0008 (0x0008 - 0x0000)
struct W_CharacterCreate_Switcher_C_SetParentSettingsWidget final
{
public:
	class UUserWidget*                            SettingsWidgetRef;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CharacterCreate_Switcher_C_SetParentSettingsWidget) == 0x000008, "Wrong alignment on W_CharacterCreate_Switcher_C_SetParentSettingsWidget");
static_assert(sizeof(W_CharacterCreate_Switcher_C_SetParentSettingsWidget) == 0x000008, "Wrong size on W_CharacterCreate_Switcher_C_SetParentSettingsWidget");
static_assert(offsetof(W_CharacterCreate_Switcher_C_SetParentSettingsWidget, SettingsWidgetRef) == 0x000000, "Member 'W_CharacterCreate_Switcher_C_SetParentSettingsWidget::SettingsWidgetRef' has a wrong offset!");

// Function W_CharacterCreate_Switcher.W_CharacterCreate_Switcher_C.SetSelected
// 0x0020 (0x0020 - 0x0000)
struct W_CharacterCreate_Switcher_C_SetSelected final
{
public:
	bool                                          Selected;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CharacterCreate_Switcher_C_SetSelected) == 0x000008, "Wrong alignment on W_CharacterCreate_Switcher_C_SetSelected");
static_assert(sizeof(W_CharacterCreate_Switcher_C_SetSelected) == 0x000020, "Wrong size on W_CharacterCreate_Switcher_C_SetSelected");
static_assert(offsetof(W_CharacterCreate_Switcher_C_SetSelected, Selected) == 0x000000, "Member 'W_CharacterCreate_Switcher_C_SetSelected::Selected' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_SetSelected, Temp_bool_Variable) == 0x000001, "Member 'W_CharacterCreate_Switcher_C_SetSelected::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_SetSelected, K2Node_Select_Default) == 0x000008, "Member 'W_CharacterCreate_Switcher_C_SetSelected::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_SetSelected, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x000010, "Member 'W_CharacterCreate_Switcher_C_SetSelected::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_SetSelected, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'W_CharacterCreate_Switcher_C_SetSelected::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function W_CharacterCreate_Switcher.W_CharacterCreate_Switcher_C.SetTextByIndex
// 0x0004 (0x0004 - 0x0000)
struct W_CharacterCreate_Switcher_C_SetTextByIndex final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CharacterCreate_Switcher_C_SetTextByIndex) == 0x000004, "Wrong alignment on W_CharacterCreate_Switcher_C_SetTextByIndex");
static_assert(sizeof(W_CharacterCreate_Switcher_C_SetTextByIndex) == 0x000004, "Wrong size on W_CharacterCreate_Switcher_C_SetTextByIndex");
static_assert(offsetof(W_CharacterCreate_Switcher_C_SetTextByIndex, Param_Index) == 0x000000, "Member 'W_CharacterCreate_Switcher_C_SetTextByIndex::Param_Index' has a wrong offset!");

// Function W_CharacterCreate_Switcher.W_CharacterCreate_Switcher_C.SetValues
// 0x0018 (0x0018 - 0x0000)
struct W_CharacterCreate_Switcher_C_SetValues final
{
public:
	TArray<class FText>                           Param_Content;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CharacterCreate_Switcher_C_SetValues) == 0x000008, "Wrong alignment on W_CharacterCreate_Switcher_C_SetValues");
static_assert(sizeof(W_CharacterCreate_Switcher_C_SetValues) == 0x000018, "Wrong size on W_CharacterCreate_Switcher_C_SetValues");
static_assert(offsetof(W_CharacterCreate_Switcher_C_SetValues, Param_Content) == 0x000000, "Member 'W_CharacterCreate_Switcher_C_SetValues::Param_Content' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_SetValues, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'W_CharacterCreate_Switcher_C_SetValues::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterCreate_Switcher_C_SetValues, CallFunc_Subtract_IntInt_ReturnValue) == 0x000014, "Member 'W_CharacterCreate_Switcher_C_SetValues::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");

}

