#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ChooseRegion

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FMODStudio_structs.hpp"


namespace SDK::Params
{

// Function W_ChooseRegion.W_ChooseRegion_C.ExecuteUbergraph_W_ChooseRegion
// 0x0230 (0x0230 - 0x0000)
struct W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_2;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_Region_1;                       // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0050(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_1;                 // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_3;        // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_1;                       // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_2;               // 0x00F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_4;        // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_5;        // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_2;       // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_2;           // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_3;       // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_6;        // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_7;        // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASurvPC_C*                              K2Node_DynamicCast_AsSurv_PC;                      // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_2;      // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_RegionEntry_C*                       K2Node_CustomEvent_Region;                         // 0x0170(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0178(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0180(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_2;           // 0x0188(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_3;           // 0x0190(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_4;           // 0x0198(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_5;           // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_8;        // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Ease_ReturnValue;                         // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_3;               // 0x01B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_1;                // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_2;                // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_1; // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_2; // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast_1;        // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast_2;        // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_3; // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_4; // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_5; // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_6; // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_7; // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_8; // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_9; // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_10; // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_11; // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion) == 0x000008, "Wrong alignment on W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion");
static_assert(sizeof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion) == 0x000230, "Wrong size on W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, EntryPoint) == 0x000000, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000010, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, K2Node_SwitchInteger_CmpSuccess) == 0x000018, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000020, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, CallFunc_Divide_DoubleDouble_ReturnValue_2) == 0x000028, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::CallFunc_Divide_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000030, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, K2Node_CustomEvent_Region_1) == 0x000034, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::K2Node_CustomEvent_Region_1' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, CallFunc_Conv_NameToString_ReturnValue) == 0x000040, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, K2Node_Event_MyGeometry) == 0x000050, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, K2Node_Event_InDeltaTime) == 0x000088, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000090, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, K2Node_SwitchInteger_CmpSuccess_1) == 0x000098, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::K2Node_SwitchInteger_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x0000A0, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000A8, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, CallFunc_Divide_DoubleDouble_ReturnValue_3) == 0x0000B0, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::CallFunc_Divide_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x0000B8, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0000C0, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, CallFunc_Lerp_ReturnValue) == 0x0000C8, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, CallFunc_Lerp_ReturnValue_1) == 0x0000D0, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, CallFunc_MakeVector2D_ReturnValue) == 0x0000D8, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, CallFunc_MakeVector2D_ReturnValue_1) == 0x0000E8, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, CallFunc_MakeVector2D_ReturnValue_2) == 0x0000F8, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::CallFunc_MakeVector2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, CallFunc_Divide_DoubleDouble_ReturnValue_4) == 0x000108, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::CallFunc_Divide_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000110, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, CallFunc_Divide_DoubleDouble_ReturnValue_5) == 0x000118, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::CallFunc_Divide_DoubleDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, CallFunc_Greater_DoubleDouble_ReturnValue_2) == 0x000120, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::CallFunc_Greater_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, CallFunc_Add_DoubleDouble_ReturnValue_2) == 0x000128, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::CallFunc_Add_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, CallFunc_GetPlayerController_ReturnValue_1) == 0x000130, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, CallFunc_Greater_DoubleDouble_ReturnValue_3) == 0x000138, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::CallFunc_Greater_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, CallFunc_Divide_DoubleDouble_ReturnValue_6) == 0x000140, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::CallFunc_Divide_DoubleDouble_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, CallFunc_GetPlayerController_ReturnValue_2) == 0x000148, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, CallFunc_Divide_DoubleDouble_ReturnValue_7) == 0x000150, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::CallFunc_Divide_DoubleDouble_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, K2Node_DynamicCast_AsSurv_PC) == 0x000158, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::K2Node_DynamicCast_AsSurv_PC' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, K2Node_DynamicCast_bSuccess) == 0x000160, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, CallFunc_Subtract_DoubleDouble_ReturnValue_2) == 0x000168, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::CallFunc_Subtract_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, K2Node_CustomEvent_Region) == 0x000170, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::K2Node_CustomEvent_Region' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000178, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x000180, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, CallFunc_SlotAsCanvasSlot_ReturnValue_2) == 0x000188, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::CallFunc_SlotAsCanvasSlot_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, CallFunc_SlotAsCanvasSlot_ReturnValue_3) == 0x000190, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::CallFunc_SlotAsCanvasSlot_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, CallFunc_SlotAsCanvasSlot_ReturnValue_4) == 0x000198, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::CallFunc_SlotAsCanvasSlot_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, CallFunc_SlotAsCanvasSlot_ReturnValue_5) == 0x0001A0, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::CallFunc_SlotAsCanvasSlot_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, CallFunc_Divide_DoubleDouble_ReturnValue_8) == 0x0001A8, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::CallFunc_Divide_DoubleDouble_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, CallFunc_Ease_ReturnValue) == 0x0001B0, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::CallFunc_Ease_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, CallFunc_MakeVector2D_ReturnValue_3) == 0x0001B8, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::CallFunc_MakeVector2D_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, CallFunc_PlayEvent2D_ReturnValue) == 0x0001C8, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::CallFunc_PlayEvent2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, CallFunc_PlayEvent2D_ReturnValue_1) == 0x0001D0, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::CallFunc_PlayEvent2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, CallFunc_PlayEvent2D_ReturnValue_2) == 0x0001D8, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::CallFunc_PlayEvent2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast) == 0x0001E0, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_1) == 0x0001E4, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_2) == 0x0001E8, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x0001F0, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, CallFunc_Add_DoubleDouble_A_ImplicitCast_1) == 0x0001F8, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::CallFunc_Add_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, CallFunc_Add_DoubleDouble_A_ImplicitCast_2) == 0x000200, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::CallFunc_Add_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_3) == 0x000208, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_4) == 0x00020C, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_5) == 0x000210, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_5' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_6) == 0x000214, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_6' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_7) == 0x000218, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_7' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_8) == 0x00021C, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_8' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_9) == 0x000220, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_9' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_10) == 0x000224, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_10' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_11) == 0x000228, "Member 'W_ChooseRegion_C_ExecuteUbergraph_W_ChooseRegion::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_11' has a wrong offset!");

// Function W_ChooseRegion.W_ChooseRegion_C.GetRegionEntryByID
// 0x0020 (0x0020 - 0x0000)
struct W_ChooseRegion_C_GetRegionEntryByID final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_RegionEntry_C*                       Entry;                                             // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_RegionEntry_C*                       Res;                                               // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ChooseRegion_C_GetRegionEntryByID) == 0x000008, "Wrong alignment on W_ChooseRegion_C_GetRegionEntryByID");
static_assert(sizeof(W_ChooseRegion_C_GetRegionEntryByID) == 0x000020, "Wrong size on W_ChooseRegion_C_GetRegionEntryByID");
static_assert(offsetof(W_ChooseRegion_C_GetRegionEntryByID, ID) == 0x000000, "Member 'W_ChooseRegion_C_GetRegionEntryByID::ID' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_GetRegionEntryByID, Entry) == 0x000008, "Member 'W_ChooseRegion_C_GetRegionEntryByID::Entry' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_GetRegionEntryByID, Res) == 0x000010, "Member 'W_ChooseRegion_C_GetRegionEntryByID::Res' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_GetRegionEntryByID, K2Node_SwitchInteger_CmpSuccess) == 0x000018, "Member 'W_ChooseRegion_C_GetRegionEntryByID::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function W_ChooseRegion.W_ChooseRegion_C.OnChooseRegion
// 0x0008 (0x0008 - 0x0000)
struct W_ChooseRegion_C_OnChooseRegion final
{
public:
	class FName                                   Region;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ChooseRegion_C_OnChooseRegion) == 0x000004, "Wrong alignment on W_ChooseRegion_C_OnChooseRegion");
static_assert(sizeof(W_ChooseRegion_C_OnChooseRegion) == 0x000008, "Wrong size on W_ChooseRegion_C_OnChooseRegion");
static_assert(offsetof(W_ChooseRegion_C_OnChooseRegion, Region) == 0x000000, "Member 'W_ChooseRegion_C_OnChooseRegion::Region' has a wrong offset!");

// Function W_ChooseRegion.W_ChooseRegion_C.OnKeyDown
// 0x03A0 (0x03A0 - 0x0000)
struct W_ChooseRegion_C_OnKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0078(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x0130(0x0018)(HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0148(0x00B8)()
	class FText                                   CallFunc_Key_GetDisplayName_ReturnValue;           // 0x0200(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0218(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Handled_ReturnValue_1;                    // 0x0228(0x00B8)()
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x02E8(0x00B8)()
};
static_assert(alignof(W_ChooseRegion_C_OnKeyDown) == 0x000008, "Wrong alignment on W_ChooseRegion_C_OnKeyDown");
static_assert(sizeof(W_ChooseRegion_C_OnKeyDown) == 0x0003A0, "Wrong size on W_ChooseRegion_C_OnKeyDown");
static_assert(offsetof(W_ChooseRegion_C_OnKeyDown, MyGeometry) == 0x000000, "Member 'W_ChooseRegion_C_OnKeyDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_OnKeyDown, InKeyEvent) == 0x000038, "Member 'W_ChooseRegion_C_OnKeyDown::InKeyEvent' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_OnKeyDown, ReturnValue) == 0x000078, "Member 'W_ChooseRegion_C_OnKeyDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_OnKeyDown, CallFunc_GetKey_ReturnValue) == 0x000130, "Member 'W_ChooseRegion_C_OnKeyDown::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_OnKeyDown, CallFunc_Handled_ReturnValue) == 0x000148, "Member 'W_ChooseRegion_C_OnKeyDown::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_OnKeyDown, CallFunc_Key_GetDisplayName_ReturnValue) == 0x000200, "Member 'W_ChooseRegion_C_OnKeyDown::CallFunc_Key_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_OnKeyDown, CallFunc_Conv_TextToString_ReturnValue) == 0x000218, "Member 'W_ChooseRegion_C_OnKeyDown::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_OnKeyDown, CallFunc_Handled_ReturnValue_1) == 0x000228, "Member 'W_ChooseRegion_C_OnKeyDown::CallFunc_Handled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_OnKeyDown, K2Node_SwitchString_CmpSuccess) == 0x0002E0, "Member 'W_ChooseRegion_C_OnKeyDown::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_OnKeyDown, CallFunc_Unhandled_ReturnValue) == 0x0002E8, "Member 'W_ChooseRegion_C_OnKeyDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");

// Function W_ChooseRegion.W_ChooseRegion_C.OnRegionChange2
// 0x0008 (0x0008 - 0x0000)
struct W_ChooseRegion_C_OnRegionChange2 final
{
public:
	class UW_RegionEntry_C*                       Region;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ChooseRegion_C_OnRegionChange2) == 0x000008, "Wrong alignment on W_ChooseRegion_C_OnRegionChange2");
static_assert(sizeof(W_ChooseRegion_C_OnRegionChange2) == 0x000008, "Wrong size on W_ChooseRegion_C_OnRegionChange2");
static_assert(offsetof(W_ChooseRegion_C_OnRegionChange2, Region) == 0x000000, "Member 'W_ChooseRegion_C_OnRegionChange2::Region' has a wrong offset!");

// Function W_ChooseRegion.W_ChooseRegion_C.SetRegion
// 0x0010 (0x0010 - 0x0000)
struct W_ChooseRegion_C_SetRegion final
{
public:
	class UW_RegionEntry_C*                       Entry;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_IntInt_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ChooseRegion_C_SetRegion) == 0x000008, "Wrong alignment on W_ChooseRegion_C_SetRegion");
static_assert(sizeof(W_ChooseRegion_C_SetRegion) == 0x000010, "Wrong size on W_ChooseRegion_C_SetRegion");
static_assert(offsetof(W_ChooseRegion_C_SetRegion, Entry) == 0x000000, "Member 'W_ChooseRegion_C_SetRegion::Entry' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_SetRegion, CallFunc_InRange_IntInt_ReturnValue) == 0x000008, "Member 'W_ChooseRegion_C_SetRegion::CallFunc_InRange_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_SetRegion, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000009, "Member 'W_ChooseRegion_C_SetRegion::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");

// Function W_ChooseRegion.W_ChooseRegion_C.SetText
// 0x0028 (0x0028 - 0x0000)
struct W_ChooseRegion_C_SetText final
{
public:
	class FString                                 Param_RegionName;                                  // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0010(0x0018)()
};
static_assert(alignof(W_ChooseRegion_C_SetText) == 0x000008, "Wrong alignment on W_ChooseRegion_C_SetText");
static_assert(sizeof(W_ChooseRegion_C_SetText) == 0x000028, "Wrong size on W_ChooseRegion_C_SetText");
static_assert(offsetof(W_ChooseRegion_C_SetText, Param_RegionName) == 0x000000, "Member 'W_ChooseRegion_C_SetText::Param_RegionName' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_SetText, CallFunc_Conv_StringToText_ReturnValue) == 0x000010, "Member 'W_ChooseRegion_C_SetText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function W_ChooseRegion.W_ChooseRegion_C.Tick
// 0x003C (0x003C - 0x0000)
struct W_ChooseRegion_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ChooseRegion_C_Tick) == 0x000004, "Wrong alignment on W_ChooseRegion_C_Tick");
static_assert(sizeof(W_ChooseRegion_C_Tick) == 0x00003C, "Wrong size on W_ChooseRegion_C_Tick");
static_assert(offsetof(W_ChooseRegion_C_Tick, MyGeometry) == 0x000000, "Member 'W_ChooseRegion_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_ChooseRegion_C_Tick, InDeltaTime) == 0x000038, "Member 'W_ChooseRegion_C_Tick::InDeltaTime' has a wrong offset!");

}

