#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ChatLog

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "ChatType_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function W_ChatLog.W_ChatLog_C.ExecuteUbergraph_W_ChatLog
// 0x0148 (0x0148 - 0x0000)
struct W_ChatLog_C_ExecuteUbergraph_W_ChatLog final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0008(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0020(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0080(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0098(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_GenerateFullText_OutputPin;               // 0x00E8(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0100(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0110(0x0018)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GenerateFullText_OutputPin_1;             // 0x0130(0x0018)()
};
static_assert(alignof(W_ChatLog_C_ExecuteUbergraph_W_ChatLog) == 0x000008, "Wrong alignment on W_ChatLog_C_ExecuteUbergraph_W_ChatLog");
static_assert(sizeof(W_ChatLog_C_ExecuteUbergraph_W_ChatLog) == 0x000148, "Wrong size on W_ChatLog_C_ExecuteUbergraph_W_ChatLog");
static_assert(offsetof(W_ChatLog_C_ExecuteUbergraph_W_ChatLog, EntryPoint) == 0x000000, "Member 'W_ChatLog_C_ExecuteUbergraph_W_ChatLog::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_ChatLog_C_ExecuteUbergraph_W_ChatLog, K2Node_Event_IsDesignTime) == 0x000004, "Member 'W_ChatLog_C_ExecuteUbergraph_W_ChatLog::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_ChatLog_C_ExecuteUbergraph_W_ChatLog, CallFunc_TextToUpper_ReturnValue) == 0x000008, "Member 'W_ChatLog_C_ExecuteUbergraph_W_ChatLog::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ChatLog_C_ExecuteUbergraph_W_ChatLog, K2Node_MakeStruct_FormatArgumentData) == 0x000020, "Member 'W_ChatLog_C_ExecuteUbergraph_W_ChatLog::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_ChatLog_C_ExecuteUbergraph_W_ChatLog, K2Node_MakeArray_Array) == 0x000070, "Member 'W_ChatLog_C_ExecuteUbergraph_W_ChatLog::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_ChatLog_C_ExecuteUbergraph_W_ChatLog, CallFunc_Format_ReturnValue) == 0x000080, "Member 'W_ChatLog_C_ExecuteUbergraph_W_ChatLog::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ChatLog_C_ExecuteUbergraph_W_ChatLog, K2Node_MakeStruct_FormatArgumentData_1) == 0x000098, "Member 'W_ChatLog_C_ExecuteUbergraph_W_ChatLog::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(W_ChatLog_C_ExecuteUbergraph_W_ChatLog, CallFunc_GenerateFullText_OutputPin) == 0x0000E8, "Member 'W_ChatLog_C_ExecuteUbergraph_W_ChatLog::CallFunc_GenerateFullText_OutputPin' has a wrong offset!");
static_assert(offsetof(W_ChatLog_C_ExecuteUbergraph_W_ChatLog, K2Node_MakeArray_Array_1) == 0x000100, "Member 'W_ChatLog_C_ExecuteUbergraph_W_ChatLog::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(W_ChatLog_C_ExecuteUbergraph_W_ChatLog, CallFunc_Format_ReturnValue_1) == 0x000110, "Member 'W_ChatLog_C_ExecuteUbergraph_W_ChatLog::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ChatLog_C_ExecuteUbergraph_W_ChatLog, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000128, "Member 'W_ChatLog_C_ExecuteUbergraph_W_ChatLog::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ChatLog_C_ExecuteUbergraph_W_ChatLog, CallFunc_TextIsEmpty_ReturnValue) == 0x000129, "Member 'W_ChatLog_C_ExecuteUbergraph_W_ChatLog::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ChatLog_C_ExecuteUbergraph_W_ChatLog, CallFunc_GenerateFullText_OutputPin_1) == 0x000130, "Member 'W_ChatLog_C_ExecuteUbergraph_W_ChatLog::CallFunc_GenerateFullText_OutputPin_1' has a wrong offset!");

// Function W_ChatLog.W_ChatLog_C.GenerateFullText
// 0x0260 (0x0260 - 0x0000)
struct W_ChatLog_C_GenerateFullText final
{
public:
	class FText                                   MessageText;                                       // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Status;                                            // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   PlayerName;                                        // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          BEZTOCHEK;                                         // 0x0048(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   OutputPin;                                         // 0x0050(0x0018)(Parm, OutParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0068(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00B8(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0108(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0120(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0170(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x01C0(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0210(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0220(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0230(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0248(0x0018)()
};
static_assert(alignof(W_ChatLog_C_GenerateFullText) == 0x000008, "Wrong alignment on W_ChatLog_C_GenerateFullText");
static_assert(sizeof(W_ChatLog_C_GenerateFullText) == 0x000260, "Wrong size on W_ChatLog_C_GenerateFullText");
static_assert(offsetof(W_ChatLog_C_GenerateFullText, MessageText) == 0x000000, "Member 'W_ChatLog_C_GenerateFullText::MessageText' has a wrong offset!");
static_assert(offsetof(W_ChatLog_C_GenerateFullText, Status) == 0x000018, "Member 'W_ChatLog_C_GenerateFullText::Status' has a wrong offset!");
static_assert(offsetof(W_ChatLog_C_GenerateFullText, PlayerName) == 0x000030, "Member 'W_ChatLog_C_GenerateFullText::PlayerName' has a wrong offset!");
static_assert(offsetof(W_ChatLog_C_GenerateFullText, BEZTOCHEK) == 0x000048, "Member 'W_ChatLog_C_GenerateFullText::BEZTOCHEK' has a wrong offset!");
static_assert(offsetof(W_ChatLog_C_GenerateFullText, OutputPin) == 0x000050, "Member 'W_ChatLog_C_GenerateFullText::OutputPin' has a wrong offset!");
static_assert(offsetof(W_ChatLog_C_GenerateFullText, K2Node_MakeStruct_FormatArgumentData) == 0x000068, "Member 'W_ChatLog_C_GenerateFullText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_ChatLog_C_GenerateFullText, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000B8, "Member 'W_ChatLog_C_GenerateFullText::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(W_ChatLog_C_GenerateFullText, CallFunc_TextToUpper_ReturnValue) == 0x000108, "Member 'W_ChatLog_C_GenerateFullText::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ChatLog_C_GenerateFullText, K2Node_MakeStruct_FormatArgumentData_2) == 0x000120, "Member 'W_ChatLog_C_GenerateFullText::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(W_ChatLog_C_GenerateFullText, K2Node_MakeStruct_FormatArgumentData_3) == 0x000170, "Member 'W_ChatLog_C_GenerateFullText::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(W_ChatLog_C_GenerateFullText, K2Node_MakeStruct_FormatArgumentData_4) == 0x0001C0, "Member 'W_ChatLog_C_GenerateFullText::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(W_ChatLog_C_GenerateFullText, K2Node_MakeArray_Array) == 0x000210, "Member 'W_ChatLog_C_GenerateFullText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_ChatLog_C_GenerateFullText, K2Node_MakeArray_Array_1) == 0x000220, "Member 'W_ChatLog_C_GenerateFullText::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(W_ChatLog_C_GenerateFullText, CallFunc_Format_ReturnValue) == 0x000230, "Member 'W_ChatLog_C_GenerateFullText::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ChatLog_C_GenerateFullText, CallFunc_Format_ReturnValue_1) == 0x000248, "Member 'W_ChatLog_C_GenerateFullText::CallFunc_Format_ReturnValue_1' has a wrong offset!");

// Function W_ChatLog.W_ChatLog_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_ChatLog_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ChatLog_C_PreConstruct) == 0x000001, "Wrong alignment on W_ChatLog_C_PreConstruct");
static_assert(sizeof(W_ChatLog_C_PreConstruct) == 0x000001, "Wrong size on W_ChatLog_C_PreConstruct");
static_assert(offsetof(W_ChatLog_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_ChatLog_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_ChatLog.W_ChatLog_C.SetNicknameColor
// 0x0058 (0x0058 - 0x0000)
struct W_ChatLog_C_SetNicknameColor final
{
public:
	EChatType                                     Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0044(0x0014)()
};
static_assert(alignof(W_ChatLog_C_SetNicknameColor) == 0x000004, "Wrong alignment on W_ChatLog_C_SetNicknameColor");
static_assert(sizeof(W_ChatLog_C_SetNicknameColor) == 0x000058, "Wrong size on W_ChatLog_C_SetNicknameColor");
static_assert(offsetof(W_ChatLog_C_SetNicknameColor, Temp_byte_Variable) == 0x000000, "Member 'W_ChatLog_C_SetNicknameColor::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_ChatLog_C_SetNicknameColor, Temp_struct_Variable) == 0x000004, "Member 'W_ChatLog_C_SetNicknameColor::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(W_ChatLog_C_SetNicknameColor, Temp_struct_Variable_1) == 0x000014, "Member 'W_ChatLog_C_SetNicknameColor::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(W_ChatLog_C_SetNicknameColor, Temp_struct_Variable_2) == 0x000024, "Member 'W_ChatLog_C_SetNicknameColor::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(W_ChatLog_C_SetNicknameColor, K2Node_Select_Default) == 0x000034, "Member 'W_ChatLog_C_SetNicknameColor::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_ChatLog_C_SetNicknameColor, K2Node_MakeStruct_SlateColor) == 0x000044, "Member 'W_ChatLog_C_SetNicknameColor::K2Node_MakeStruct_SlateColor' has a wrong offset!");

}

