#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CoinStart

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function W_CoinStart.W_CoinStart_C.ExecuteUbergraph_W_CoinStart
// 0x0148 (0x0148 - 0x0000)
struct W_CoinStart_C_ExecuteUbergraph_W_CoinStart final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key;                          // 0x0008(0x0018)(HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Key_IsKeyboardKey_ReturnValue;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue_1;                     // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD_MainMenu_C*                        K2Node_DynamicCast_AsHUD_Main_Menu;                // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUD_MainMenu_C*                        K2Node_DynamicCast_AsHUD_Main_Menu_1;              // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival;                  // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue_2;                     // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD_MainMenu_C*                        K2Node_DynamicCast_AsHUD_Main_Menu_2;              // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue_3;                     // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue_4;                     // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD_MainMenu_C*                        K2Node_DynamicCast_AsHUD_Main_Menu_3;              // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUD_MainMenu_C*                        K2Node_DynamicCast_AsHUD_Main_Menu_4;              // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue_1;                       // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_122[0x2];                                      // 0x0122(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0124(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0138(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CoinStart_C_ExecuteUbergraph_W_CoinStart) == 0x000008, "Wrong alignment on W_CoinStart_C_ExecuteUbergraph_W_CoinStart");
static_assert(sizeof(W_CoinStart_C_ExecuteUbergraph_W_CoinStart) == 0x000148, "Wrong size on W_CoinStart_C_ExecuteUbergraph_W_CoinStart");
static_assert(offsetof(W_CoinStart_C_ExecuteUbergraph_W_CoinStart, EntryPoint) == 0x000000, "Member 'W_CoinStart_C_ExecuteUbergraph_W_CoinStart::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_CoinStart_C_ExecuteUbergraph_W_CoinStart, K2Node_InputKeyEvent_Key) == 0x000008, "Member 'W_CoinStart_C_ExecuteUbergraph_W_CoinStart::K2Node_InputKeyEvent_Key' has a wrong offset!");
static_assert(offsetof(W_CoinStart_C_ExecuteUbergraph_W_CoinStart, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'W_CoinStart_C_ExecuteUbergraph_W_CoinStart::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_CoinStart_C_ExecuteUbergraph_W_CoinStart, CallFunc_Key_IsKeyboardKey_ReturnValue) == 0x000030, "Member 'W_CoinStart_C_ExecuteUbergraph_W_CoinStart::CallFunc_Key_IsKeyboardKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CoinStart_C_ExecuteUbergraph_W_CoinStart, K2Node_CreateDelegate_OutputDelegate_1) == 0x000034, "Member 'W_CoinStart_C_ExecuteUbergraph_W_CoinStart::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(W_CoinStart_C_ExecuteUbergraph_W_CoinStart, Temp_bool_Has_Been_Initd_Variable) == 0x000044, "Member 'W_CoinStart_C_ExecuteUbergraph_W_CoinStart::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(W_CoinStart_C_ExecuteUbergraph_W_CoinStart, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000048, "Member 'W_CoinStart_C_ExecuteUbergraph_W_CoinStart::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CoinStart_C_ExecuteUbergraph_W_CoinStart, Temp_bool_IsClosed_Variable) == 0x000050, "Member 'W_CoinStart_C_ExecuteUbergraph_W_CoinStart::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(W_CoinStart_C_ExecuteUbergraph_W_CoinStart, CallFunc_PlayAnimationForward_ReturnValue) == 0x000058, "Member 'W_CoinStart_C_ExecuteUbergraph_W_CoinStart::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CoinStart_C_ExecuteUbergraph_W_CoinStart, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000060, "Member 'W_CoinStart_C_ExecuteUbergraph_W_CoinStart::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_CoinStart_C_ExecuteUbergraph_W_CoinStart, CallFunc_GetPlayerController_ReturnValue) == 0x000068, "Member 'W_CoinStart_C_ExecuteUbergraph_W_CoinStart::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CoinStart_C_ExecuteUbergraph_W_CoinStart, CallFunc_GetPlayerController_ReturnValue_1) == 0x000070, "Member 'W_CoinStart_C_ExecuteUbergraph_W_CoinStart::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_CoinStart_C_ExecuteUbergraph_W_CoinStart, CallFunc_GetHUD_ReturnValue) == 0x000078, "Member 'W_CoinStart_C_ExecuteUbergraph_W_CoinStart::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CoinStart_C_ExecuteUbergraph_W_CoinStart, CallFunc_GetHUD_ReturnValue_1) == 0x000080, "Member 'W_CoinStart_C_ExecuteUbergraph_W_CoinStart::CallFunc_GetHUD_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_CoinStart_C_ExecuteUbergraph_W_CoinStart, K2Node_DynamicCast_AsHUD_Main_Menu) == 0x000088, "Member 'W_CoinStart_C_ExecuteUbergraph_W_CoinStart::K2Node_DynamicCast_AsHUD_Main_Menu' has a wrong offset!");
static_assert(offsetof(W_CoinStart_C_ExecuteUbergraph_W_CoinStart, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'W_CoinStart_C_ExecuteUbergraph_W_CoinStart::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_CoinStart_C_ExecuteUbergraph_W_CoinStart, K2Node_DynamicCast_AsHUD_Main_Menu_1) == 0x000098, "Member 'W_CoinStart_C_ExecuteUbergraph_W_CoinStart::K2Node_DynamicCast_AsHUD_Main_Menu_1' has a wrong offset!");
static_assert(offsetof(W_CoinStart_C_ExecuteUbergraph_W_CoinStart, K2Node_DynamicCast_bSuccess_1) == 0x0000A0, "Member 'W_CoinStart_C_ExecuteUbergraph_W_CoinStart::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_CoinStart_C_ExecuteUbergraph_W_CoinStart, CallFunc_Play_ReturnValue) == 0x0000A1, "Member 'W_CoinStart_C_ExecuteUbergraph_W_CoinStart::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CoinStart_C_ExecuteUbergraph_W_CoinStart, CallFunc_GetGameInstance_ReturnValue) == 0x0000A8, "Member 'W_CoinStart_C_ExecuteUbergraph_W_CoinStart::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CoinStart_C_ExecuteUbergraph_W_CoinStart, K2Node_DynamicCast_AsGI_Survival) == 0x0000B0, "Member 'W_CoinStart_C_ExecuteUbergraph_W_CoinStart::K2Node_DynamicCast_AsGI_Survival' has a wrong offset!");
static_assert(offsetof(W_CoinStart_C_ExecuteUbergraph_W_CoinStart, K2Node_DynamicCast_bSuccess_2) == 0x0000B8, "Member 'W_CoinStart_C_ExecuteUbergraph_W_CoinStart::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(W_CoinStart_C_ExecuteUbergraph_W_CoinStart, CallFunc_GetPlayerController_ReturnValue_2) == 0x0000C0, "Member 'W_CoinStart_C_ExecuteUbergraph_W_CoinStart::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_CoinStart_C_ExecuteUbergraph_W_CoinStart, CallFunc_GetHUD_ReturnValue_2) == 0x0000C8, "Member 'W_CoinStart_C_ExecuteUbergraph_W_CoinStart::CallFunc_GetHUD_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_CoinStart_C_ExecuteUbergraph_W_CoinStart, K2Node_DynamicCast_AsHUD_Main_Menu_2) == 0x0000D0, "Member 'W_CoinStart_C_ExecuteUbergraph_W_CoinStart::K2Node_DynamicCast_AsHUD_Main_Menu_2' has a wrong offset!");
static_assert(offsetof(W_CoinStart_C_ExecuteUbergraph_W_CoinStart, K2Node_DynamicCast_bSuccess_3) == 0x0000D8, "Member 'W_CoinStart_C_ExecuteUbergraph_W_CoinStart::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(W_CoinStart_C_ExecuteUbergraph_W_CoinStart, CallFunc_PlayAnimationForward_ReturnValue_2) == 0x0000E0, "Member 'W_CoinStart_C_ExecuteUbergraph_W_CoinStart::CallFunc_PlayAnimationForward_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_CoinStart_C_ExecuteUbergraph_W_CoinStart, CallFunc_GetPlayerController_ReturnValue_3) == 0x0000E8, "Member 'W_CoinStart_C_ExecuteUbergraph_W_CoinStart::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_CoinStart_C_ExecuteUbergraph_W_CoinStart, CallFunc_GetPlayerController_ReturnValue_4) == 0x0000F0, "Member 'W_CoinStart_C_ExecuteUbergraph_W_CoinStart::CallFunc_GetPlayerController_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_CoinStart_C_ExecuteUbergraph_W_CoinStart, CallFunc_GetHUD_ReturnValue_3) == 0x0000F8, "Member 'W_CoinStart_C_ExecuteUbergraph_W_CoinStart::CallFunc_GetHUD_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_CoinStart_C_ExecuteUbergraph_W_CoinStart, CallFunc_GetHUD_ReturnValue_4) == 0x000100, "Member 'W_CoinStart_C_ExecuteUbergraph_W_CoinStart::CallFunc_GetHUD_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_CoinStart_C_ExecuteUbergraph_W_CoinStart, K2Node_DynamicCast_AsHUD_Main_Menu_3) == 0x000108, "Member 'W_CoinStart_C_ExecuteUbergraph_W_CoinStart::K2Node_DynamicCast_AsHUD_Main_Menu_3' has a wrong offset!");
static_assert(offsetof(W_CoinStart_C_ExecuteUbergraph_W_CoinStart, K2Node_DynamicCast_bSuccess_4) == 0x000110, "Member 'W_CoinStart_C_ExecuteUbergraph_W_CoinStart::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(W_CoinStart_C_ExecuteUbergraph_W_CoinStart, K2Node_DynamicCast_AsHUD_Main_Menu_4) == 0x000118, "Member 'W_CoinStart_C_ExecuteUbergraph_W_CoinStart::K2Node_DynamicCast_AsHUD_Main_Menu_4' has a wrong offset!");
static_assert(offsetof(W_CoinStart_C_ExecuteUbergraph_W_CoinStart, K2Node_DynamicCast_bSuccess_5) == 0x000120, "Member 'W_CoinStart_C_ExecuteUbergraph_W_CoinStart::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(W_CoinStart_C_ExecuteUbergraph_W_CoinStart, CallFunc_Play_ReturnValue_1) == 0x000121, "Member 'W_CoinStart_C_ExecuteUbergraph_W_CoinStart::CallFunc_Play_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_CoinStart_C_ExecuteUbergraph_W_CoinStart, K2Node_CreateDelegate_OutputDelegate_2) == 0x000124, "Member 'W_CoinStart_C_ExecuteUbergraph_W_CoinStart::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(W_CoinStart_C_ExecuteUbergraph_W_CoinStart, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000138, "Member 'W_CoinStart_C_ExecuteUbergraph_W_CoinStart::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_CoinStart_C_ExecuteUbergraph_W_CoinStart, CallFunc_Not_PreBool_ReturnValue) == 0x000140, "Member 'W_CoinStart_C_ExecuteUbergraph_W_CoinStart::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CoinStart_C_ExecuteUbergraph_W_CoinStart, CallFunc_Not_PreBool_ReturnValue_1) == 0x000141, "Member 'W_CoinStart_C_ExecuteUbergraph_W_CoinStart::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");

// Function W_CoinStart.W_CoinStart_C.InpActEvt_AnyKey_K2Node_InputKeyEvent_0
// 0x0018 (0x0018 - 0x0000)
struct W_CoinStart_C_InpActEvt_AnyKey_K2Node_InputKeyEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(W_CoinStart_C_InpActEvt_AnyKey_K2Node_InputKeyEvent_0) == 0x000008, "Wrong alignment on W_CoinStart_C_InpActEvt_AnyKey_K2Node_InputKeyEvent_0");
static_assert(sizeof(W_CoinStart_C_InpActEvt_AnyKey_K2Node_InputKeyEvent_0) == 0x000018, "Wrong size on W_CoinStart_C_InpActEvt_AnyKey_K2Node_InputKeyEvent_0");
static_assert(offsetof(W_CoinStart_C_InpActEvt_AnyKey_K2Node_InputKeyEvent_0, Key) == 0x000000, "Member 'W_CoinStart_C_InpActEvt_AnyKey_K2Node_InputKeyEvent_0::Key' has a wrong offset!");

}

