#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ColorCell

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "WS_BodyFeatures_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_ColorCell.W_ColorCell_C
// 0x00F0 (0x0370 - 0x0280)
class UW_ColorCell_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       BorderAppear;                                      // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_ActualColor;                                // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Border;                                      // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FWS_BodyFeatures                       GivenInfo;                                         // 0x02A0(0x0088)(Edit, BlueprintVisible, ContainsInstancedReference, ExposeOnSpawn, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             PressedButton_ColorCell_ED;                        // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class ABP_CreateCharacter_C*                  CharRef;                                           // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           SkinColor;                                         // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           EyeColor;                                          // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           HairColor;                                         // 0x0360(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__W_ColorCell_Button_ActualColor_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void CellActivated();
	void CellDeactivated();
	void Change_Material_Param_Color(TArray<class USkeletalMeshComponent*>& Array, class FName ParameterName, const struct FLinearColor& Value);
	void CheckBlackSkinMp(bool IsBlack_);
	void Construct();
	void ExecuteUbergraph_W_ColorCell(int32 EntryPoint);
	void EyeColorFunc(int32 Param_Index, struct FLinearColor* Param_EyeColor);
	void PressedButton_ColorCell_ED__DelegateSignature(class UW_ColorCell_C* Param_CellActivated);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_ColorCell_C">();
	}
	static class UW_ColorCell_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_ColorCell_C>();
	}
};
static_assert(alignof(UW_ColorCell_C) == 0x000008, "Wrong alignment on UW_ColorCell_C");
static_assert(sizeof(UW_ColorCell_C) == 0x000370, "Wrong size on UW_ColorCell_C");
static_assert(offsetof(UW_ColorCell_C, UberGraphFrame) == 0x000280, "Member 'UW_ColorCell_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_ColorCell_C, BorderAppear) == 0x000288, "Member 'UW_ColorCell_C::BorderAppear' has a wrong offset!");
static_assert(offsetof(UW_ColorCell_C, Button_ActualColor) == 0x000290, "Member 'UW_ColorCell_C::Button_ActualColor' has a wrong offset!");
static_assert(offsetof(UW_ColorCell_C, Image_Border) == 0x000298, "Member 'UW_ColorCell_C::Image_Border' has a wrong offset!");
static_assert(offsetof(UW_ColorCell_C, GivenInfo) == 0x0002A0, "Member 'UW_ColorCell_C::GivenInfo' has a wrong offset!");
static_assert(offsetof(UW_ColorCell_C, PressedButton_ColorCell_ED) == 0x000328, "Member 'UW_ColorCell_C::PressedButton_ColorCell_ED' has a wrong offset!");
static_assert(offsetof(UW_ColorCell_C, CharRef) == 0x000338, "Member 'UW_ColorCell_C::CharRef' has a wrong offset!");
static_assert(offsetof(UW_ColorCell_C, SkinColor) == 0x000340, "Member 'UW_ColorCell_C::SkinColor' has a wrong offset!");
static_assert(offsetof(UW_ColorCell_C, EyeColor) == 0x000350, "Member 'UW_ColorCell_C::EyeColor' has a wrong offset!");
static_assert(offsetof(UW_ColorCell_C, HairColor) == 0x000360, "Member 'UW_ColorCell_C::HairColor' has a wrong offset!");

}

