#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CraftCategorySelector

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_CraftCategorySelector.W_CraftCategorySelector_C.ExecuteUbergraph_W_CraftCategorySelector
// 0x0010 (0x0010 - 0x0000)
struct W_CraftCategorySelector_C_ExecuteUbergraph_W_CraftCategorySelector final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_CraftCategoryButton_C*               CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CraftCategorySelector_C_ExecuteUbergraph_W_CraftCategorySelector) == 0x000008, "Wrong alignment on W_CraftCategorySelector_C_ExecuteUbergraph_W_CraftCategorySelector");
static_assert(sizeof(W_CraftCategorySelector_C_ExecuteUbergraph_W_CraftCategorySelector) == 0x000010, "Wrong size on W_CraftCategorySelector_C_ExecuteUbergraph_W_CraftCategorySelector");
static_assert(offsetof(W_CraftCategorySelector_C_ExecuteUbergraph_W_CraftCategorySelector, EntryPoint) == 0x000000, "Member 'W_CraftCategorySelector_C_ExecuteUbergraph_W_CraftCategorySelector::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_CraftCategorySelector_C_ExecuteUbergraph_W_CraftCategorySelector, K2Node_Event_IsDesignTime) == 0x000004, "Member 'W_CraftCategorySelector_C_ExecuteUbergraph_W_CraftCategorySelector::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_CraftCategorySelector_C_ExecuteUbergraph_W_CraftCategorySelector, CallFunc_Create_ReturnValue) == 0x000008, "Member 'W_CraftCategorySelector_C_ExecuteUbergraph_W_CraftCategorySelector::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function W_CraftCategorySelector.W_CraftCategorySelector_C.SetCategoriesArray
// 0x0020 (0x0020 - 0x0000)
struct W_CraftCategorySelector_C_SetCategoriesArray final
{
public:
	TArray<class FName>                           Param_CategoriesArray;                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm)
};
static_assert(alignof(W_CraftCategorySelector_C_SetCategoriesArray) == 0x000008, "Wrong alignment on W_CraftCategorySelector_C_SetCategoriesArray");
static_assert(sizeof(W_CraftCategorySelector_C_SetCategoriesArray) == 0x000020, "Wrong size on W_CraftCategorySelector_C_SetCategoriesArray");
static_assert(offsetof(W_CraftCategorySelector_C_SetCategoriesArray, Param_CategoriesArray) == 0x000000, "Member 'W_CraftCategorySelector_C_SetCategoriesArray::Param_CategoriesArray' has a wrong offset!");
static_assert(offsetof(W_CraftCategorySelector_C_SetCategoriesArray, K2Node_MakeArray_Array) == 0x000010, "Member 'W_CraftCategorySelector_C_SetCategoriesArray::K2Node_MakeArray_Array' has a wrong offset!");

// Function W_CraftCategorySelector.W_CraftCategorySelector_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_CraftCategorySelector_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CraftCategorySelector_C_PreConstruct) == 0x000001, "Wrong alignment on W_CraftCategorySelector_C_PreConstruct");
static_assert(sizeof(W_CraftCategorySelector_C_PreConstruct) == 0x000001, "Wrong size on W_CraftCategorySelector_C_PreConstruct");
static_assert(offsetof(W_CraftCategorySelector_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_CraftCategorySelector_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_CraftCategorySelector.W_CraftCategorySelector_C.SetCategories
// 0x0050 (0x0050 - 0x0000)
struct W_CraftCategorySelector_C_SetCategories final
{
public:
	TArray<class FName>                           CategoryTypes;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UW_CraftCategoryButton_C*               CurrentButton;                                     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_CraftCategoryButton_C*               CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CraftCategorySelector_C_SetCategories) == 0x000008, "Wrong alignment on W_CraftCategorySelector_C_SetCategories");
static_assert(sizeof(W_CraftCategorySelector_C_SetCategories) == 0x000050, "Wrong size on W_CraftCategorySelector_C_SetCategories");
static_assert(offsetof(W_CraftCategorySelector_C_SetCategories, CategoryTypes) == 0x000000, "Member 'W_CraftCategorySelector_C_SetCategories::CategoryTypes' has a wrong offset!");
static_assert(offsetof(W_CraftCategorySelector_C_SetCategories, CurrentButton) == 0x000010, "Member 'W_CraftCategorySelector_C_SetCategories::CurrentButton' has a wrong offset!");
static_assert(offsetof(W_CraftCategorySelector_C_SetCategories, CallFunc_Create_ReturnValue) == 0x000018, "Member 'W_CraftCategorySelector_C_SetCategories::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CraftCategorySelector_C_SetCategories, Temp_int_Array_Index_Variable) == 0x000020, "Member 'W_CraftCategorySelector_C_SetCategories::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_CraftCategorySelector_C_SetCategories, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'W_CraftCategorySelector_C_SetCategories::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_CraftCategorySelector_C_SetCategories, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'W_CraftCategorySelector_C_SetCategories::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CraftCategorySelector_C_SetCategories, CallFunc_AddChild_ReturnValue) == 0x000030, "Member 'W_CraftCategorySelector_C_SetCategories::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CraftCategorySelector_C_SetCategories, CallFunc_Array_Add_ReturnValue) == 0x000038, "Member 'W_CraftCategorySelector_C_SetCategories::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CraftCategorySelector_C_SetCategories, CallFunc_Array_Get_Item) == 0x00003C, "Member 'W_CraftCategorySelector_C_SetCategories::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_CraftCategorySelector_C_SetCategories, CallFunc_Array_Length_ReturnValue) == 0x000044, "Member 'W_CraftCategorySelector_C_SetCategories::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CraftCategorySelector_C_SetCategories, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'W_CraftCategorySelector_C_SetCategories::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

