#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CraftIngredient

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function W_CraftIngredient.W_CraftIngredient_C.ExecuteUbergraph_W_CraftIngredient
// 0x01C0 (0x01C0 - 0x0000)
struct W_CraftIngredient_C_ExecuteUbergraph_W_CraftIngredient final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x001C(0x0014)()
	struct FSlateColor                            K2Node_Select_Default;                             // 0x0030(0x0014)()
	int32                                         K2Node_CustomEvent_CurrentCount;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NeededCount_1;                  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0060(0x0018)()
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_MakeBrushFromSprite_ReturnValue;          // 0x0080(0x00D0)()
	double                                        K2Node_CustomEvent_PlaybackSpeed;                  // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0158(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NeededCount;                    // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0180(0x0018)()
	int32                                         K2Node_CustomEvent_Count;                          // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x01A0(0x0018)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x3];                                      // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_PlayAnimationForward_PlaybackSpeed_ImplicitCast; // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CraftIngredient_C_ExecuteUbergraph_W_CraftIngredient) == 0x000010, "Wrong alignment on W_CraftIngredient_C_ExecuteUbergraph_W_CraftIngredient");
static_assert(sizeof(W_CraftIngredient_C_ExecuteUbergraph_W_CraftIngredient) == 0x0001C0, "Wrong size on W_CraftIngredient_C_ExecuteUbergraph_W_CraftIngredient");
static_assert(offsetof(W_CraftIngredient_C_ExecuteUbergraph_W_CraftIngredient, EntryPoint) == 0x000000, "Member 'W_CraftIngredient_C_ExecuteUbergraph_W_CraftIngredient::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_CraftIngredient_C_ExecuteUbergraph_W_CraftIngredient, Temp_bool_Variable) == 0x000004, "Member 'W_CraftIngredient_C_ExecuteUbergraph_W_CraftIngredient::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_CraftIngredient_C_ExecuteUbergraph_W_CraftIngredient, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'W_CraftIngredient_C_ExecuteUbergraph_W_CraftIngredient::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_CraftIngredient_C_ExecuteUbergraph_W_CraftIngredient, K2Node_MakeStruct_SlateColor_1) == 0x00001C, "Member 'W_CraftIngredient_C_ExecuteUbergraph_W_CraftIngredient::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_CraftIngredient_C_ExecuteUbergraph_W_CraftIngredient, K2Node_Select_Default) == 0x000030, "Member 'W_CraftIngredient_C_ExecuteUbergraph_W_CraftIngredient::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_CraftIngredient_C_ExecuteUbergraph_W_CraftIngredient, K2Node_CustomEvent_CurrentCount) == 0x000044, "Member 'W_CraftIngredient_C_ExecuteUbergraph_W_CraftIngredient::K2Node_CustomEvent_CurrentCount' has a wrong offset!");
static_assert(offsetof(W_CraftIngredient_C_ExecuteUbergraph_W_CraftIngredient, K2Node_CustomEvent_NeededCount_1) == 0x000048, "Member 'W_CraftIngredient_C_ExecuteUbergraph_W_CraftIngredient::K2Node_CustomEvent_NeededCount_1' has a wrong offset!");
static_assert(offsetof(W_CraftIngredient_C_ExecuteUbergraph_W_CraftIngredient, CallFunc_Conv_IntToString_ReturnValue) == 0x000050, "Member 'W_CraftIngredient_C_ExecuteUbergraph_W_CraftIngredient::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CraftIngredient_C_ExecuteUbergraph_W_CraftIngredient, CallFunc_Conv_StringToText_ReturnValue) == 0x000060, "Member 'W_CraftIngredient_C_ExecuteUbergraph_W_CraftIngredient::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CraftIngredient_C_ExecuteUbergraph_W_CraftIngredient, CallFunc_MakeBrushFromSprite_ReturnValue) == 0x000080, "Member 'W_CraftIngredient_C_ExecuteUbergraph_W_CraftIngredient::CallFunc_MakeBrushFromSprite_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CraftIngredient_C_ExecuteUbergraph_W_CraftIngredient, K2Node_CustomEvent_PlaybackSpeed) == 0x000150, "Member 'W_CraftIngredient_C_ExecuteUbergraph_W_CraftIngredient::K2Node_CustomEvent_PlaybackSpeed' has a wrong offset!");
static_assert(offsetof(W_CraftIngredient_C_ExecuteUbergraph_W_CraftIngredient, CallFunc_MakeVector2D_ReturnValue) == 0x000158, "Member 'W_CraftIngredient_C_ExecuteUbergraph_W_CraftIngredient::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CraftIngredient_C_ExecuteUbergraph_W_CraftIngredient, CallFunc_PlayAnimationForward_ReturnValue) == 0x000168, "Member 'W_CraftIngredient_C_ExecuteUbergraph_W_CraftIngredient::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CraftIngredient_C_ExecuteUbergraph_W_CraftIngredient, K2Node_CustomEvent_NeededCount) == 0x000170, "Member 'W_CraftIngredient_C_ExecuteUbergraph_W_CraftIngredient::K2Node_CustomEvent_NeededCount' has a wrong offset!");
static_assert(offsetof(W_CraftIngredient_C_ExecuteUbergraph_W_CraftIngredient, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000178, "Member 'W_CraftIngredient_C_ExecuteUbergraph_W_CraftIngredient::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_CraftIngredient_C_ExecuteUbergraph_W_CraftIngredient, CallFunc_Conv_IntToText_ReturnValue) == 0x000180, "Member 'W_CraftIngredient_C_ExecuteUbergraph_W_CraftIngredient::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CraftIngredient_C_ExecuteUbergraph_W_CraftIngredient, K2Node_CustomEvent_Count) == 0x000198, "Member 'W_CraftIngredient_C_ExecuteUbergraph_W_CraftIngredient::K2Node_CustomEvent_Count' has a wrong offset!");
static_assert(offsetof(W_CraftIngredient_C_ExecuteUbergraph_W_CraftIngredient, CallFunc_Conv_IntToText_ReturnValue_1) == 0x0001A0, "Member 'W_CraftIngredient_C_ExecuteUbergraph_W_CraftIngredient::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_CraftIngredient_C_ExecuteUbergraph_W_CraftIngredient, K2Node_Event_IsDesignTime) == 0x0001B8, "Member 'W_CraftIngredient_C_ExecuteUbergraph_W_CraftIngredient::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_CraftIngredient_C_ExecuteUbergraph_W_CraftIngredient, CallFunc_PlayAnimationForward_PlaybackSpeed_ImplicitCast) == 0x0001BC, "Member 'W_CraftIngredient_C_ExecuteUbergraph_W_CraftIngredient::CallFunc_PlayAnimationForward_PlaybackSpeed_ImplicitCast' has a wrong offset!");

// Function W_CraftIngredient.W_CraftIngredient_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_CraftIngredient_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CraftIngredient_C_PreConstruct) == 0x000001, "Wrong alignment on W_CraftIngredient_C_PreConstruct");
static_assert(sizeof(W_CraftIngredient_C_PreConstruct) == 0x000001, "Wrong size on W_CraftIngredient_C_PreConstruct");
static_assert(offsetof(W_CraftIngredient_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_CraftIngredient_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_CraftIngredient.W_CraftIngredient_C.SetCount
// 0x0008 (0x0008 - 0x0000)
struct W_CraftIngredient_C_SetCount final
{
public:
	int32                                         CurrentCount;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NeededCount;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CraftIngredient_C_SetCount) == 0x000004, "Wrong alignment on W_CraftIngredient_C_SetCount");
static_assert(sizeof(W_CraftIngredient_C_SetCount) == 0x000008, "Wrong size on W_CraftIngredient_C_SetCount");
static_assert(offsetof(W_CraftIngredient_C_SetCount, CurrentCount) == 0x000000, "Member 'W_CraftIngredient_C_SetCount::CurrentCount' has a wrong offset!");
static_assert(offsetof(W_CraftIngredient_C_SetCount, NeededCount) == 0x000004, "Member 'W_CraftIngredient_C_SetCount::NeededCount' has a wrong offset!");

// Function W_CraftIngredient.W_CraftIngredient_C.SetCountOnly
// 0x0004 (0x0004 - 0x0000)
struct W_CraftIngredient_C_SetCountOnly final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CraftIngredient_C_SetCountOnly) == 0x000004, "Wrong alignment on W_CraftIngredient_C_SetCountOnly");
static_assert(sizeof(W_CraftIngredient_C_SetCountOnly) == 0x000004, "Wrong size on W_CraftIngredient_C_SetCountOnly");
static_assert(offsetof(W_CraftIngredient_C_SetCountOnly, Count) == 0x000000, "Member 'W_CraftIngredient_C_SetCountOnly::Count' has a wrong offset!");

// Function W_CraftIngredient.W_CraftIngredient_C.SetNeededCountOnly
// 0x0004 (0x0004 - 0x0000)
struct W_CraftIngredient_C_SetNeededCountOnly final
{
public:
	int32                                         NeededCount;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CraftIngredient_C_SetNeededCountOnly) == 0x000004, "Wrong alignment on W_CraftIngredient_C_SetNeededCountOnly");
static_assert(sizeof(W_CraftIngredient_C_SetNeededCountOnly) == 0x000004, "Wrong size on W_CraftIngredient_C_SetNeededCountOnly");
static_assert(offsetof(W_CraftIngredient_C_SetNeededCountOnly, NeededCount) == 0x000000, "Member 'W_CraftIngredient_C_SetNeededCountOnly::NeededCount' has a wrong offset!");

// Function W_CraftIngredient.W_CraftIngredient_C.StartFilling
// 0x0008 (0x0008 - 0x0000)
struct W_CraftIngredient_C_StartFilling final
{
public:
	double                                        PlaybackSpeed;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CraftIngredient_C_StartFilling) == 0x000008, "Wrong alignment on W_CraftIngredient_C_StartFilling");
static_assert(sizeof(W_CraftIngredient_C_StartFilling) == 0x000008, "Wrong size on W_CraftIngredient_C_StartFilling");
static_assert(offsetof(W_CraftIngredient_C_StartFilling, PlaybackSpeed) == 0x000000, "Member 'W_CraftIngredient_C_StartFilling::PlaybackSpeed' has a wrong offset!");

}

