#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CraftItem

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "S_ItemsToCraft_structs.hpp"


namespace SDK::Params
{

// Function W_CraftItem.W_CraftItem_C.ExecuteUbergraph_W_CraftItem
// 0x0640 (0x0640 - 0x0000)
struct W_CraftItem_C_ExecuteUbergraph_W_CraftItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x001C(0x0014)()
	struct FSlateBrush                            CallFunc_MakeBrushFromSprite_ReturnValue;          // 0x0030(0x00D0)()
	struct FSlateBrush                            CallFunc_MakeBrushFromTexture_ReturnValue;         // 0x0100(0x00D0)()
	struct FSlateBrush                            CallFunc_MakeBrushFromTexture_ReturnValue_1;       // 0x01D0(0x00D0)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       K2Node_DynamicCast_AsCanvas_Panel_Slot;            // 0x02A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x3];                                      // 0x02B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Count;                          // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_ItemsToCraft                        CallFunc_GetDataTableRowFromName_OutRow;           // 0x02C0(0x0150)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0411(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_412[0x2];                                      // 0x0412(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_Select_Default;                             // 0x0414(0x0014)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0428(0x0018)()
	double                                        K2Node_CustomEvent_PlaybackSpeed;                  // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0448(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            CallFunc_MakeBrushFromSprite_ReturnValue_1;        // 0x0450(0x00D0)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0520(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x0528(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0530(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_3;       // 0x0538(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_4;       // 0x0540(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_5;       // 0x0548(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_CustomEvent_PlayMode;                       // 0x0550(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_551[0xF];                                      // 0x0551(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_MakeBrushFromSprite_ReturnValue_2;        // 0x0560(0x00D0)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0630(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimationForward_PlaybackSpeed_ImplicitCast; // 0x0638(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CraftItem_C_ExecuteUbergraph_W_CraftItem) == 0x000010, "Wrong alignment on W_CraftItem_C_ExecuteUbergraph_W_CraftItem");
static_assert(sizeof(W_CraftItem_C_ExecuteUbergraph_W_CraftItem) == 0x000640, "Wrong size on W_CraftItem_C_ExecuteUbergraph_W_CraftItem");
static_assert(offsetof(W_CraftItem_C_ExecuteUbergraph_W_CraftItem, EntryPoint) == 0x000000, "Member 'W_CraftItem_C_ExecuteUbergraph_W_CraftItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_CraftItem_C_ExecuteUbergraph_W_CraftItem, Temp_bool_Variable) == 0x000004, "Member 'W_CraftItem_C_ExecuteUbergraph_W_CraftItem::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_CraftItem_C_ExecuteUbergraph_W_CraftItem, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'W_CraftItem_C_ExecuteUbergraph_W_CraftItem::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_CraftItem_C_ExecuteUbergraph_W_CraftItem, K2Node_MakeStruct_SlateColor_1) == 0x00001C, "Member 'W_CraftItem_C_ExecuteUbergraph_W_CraftItem::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_CraftItem_C_ExecuteUbergraph_W_CraftItem, CallFunc_MakeBrushFromSprite_ReturnValue) == 0x000030, "Member 'W_CraftItem_C_ExecuteUbergraph_W_CraftItem::CallFunc_MakeBrushFromSprite_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CraftItem_C_ExecuteUbergraph_W_CraftItem, CallFunc_MakeBrushFromTexture_ReturnValue) == 0x000100, "Member 'W_CraftItem_C_ExecuteUbergraph_W_CraftItem::CallFunc_MakeBrushFromTexture_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CraftItem_C_ExecuteUbergraph_W_CraftItem, CallFunc_MakeBrushFromTexture_ReturnValue_1) == 0x0001D0, "Member 'W_CraftItem_C_ExecuteUbergraph_W_CraftItem::CallFunc_MakeBrushFromTexture_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_CraftItem_C_ExecuteUbergraph_W_CraftItem, K2Node_Event_IsDesignTime) == 0x0002A0, "Member 'W_CraftItem_C_ExecuteUbergraph_W_CraftItem::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_CraftItem_C_ExecuteUbergraph_W_CraftItem, K2Node_DynamicCast_AsCanvas_Panel_Slot) == 0x0002A8, "Member 'W_CraftItem_C_ExecuteUbergraph_W_CraftItem::K2Node_DynamicCast_AsCanvas_Panel_Slot' has a wrong offset!");
static_assert(offsetof(W_CraftItem_C_ExecuteUbergraph_W_CraftItem, K2Node_DynamicCast_bSuccess) == 0x0002B0, "Member 'W_CraftItem_C_ExecuteUbergraph_W_CraftItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_CraftItem_C_ExecuteUbergraph_W_CraftItem, K2Node_CustomEvent_Count) == 0x0002B4, "Member 'W_CraftItem_C_ExecuteUbergraph_W_CraftItem::K2Node_CustomEvent_Count' has a wrong offset!");
static_assert(offsetof(W_CraftItem_C_ExecuteUbergraph_W_CraftItem, CallFunc_GetDataTableRowFromName_OutRow) == 0x0002C0, "Member 'W_CraftItem_C_ExecuteUbergraph_W_CraftItem::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(W_CraftItem_C_ExecuteUbergraph_W_CraftItem, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000410, "Member 'W_CraftItem_C_ExecuteUbergraph_W_CraftItem::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CraftItem_C_ExecuteUbergraph_W_CraftItem, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000411, "Member 'W_CraftItem_C_ExecuteUbergraph_W_CraftItem::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CraftItem_C_ExecuteUbergraph_W_CraftItem, K2Node_Select_Default) == 0x000414, "Member 'W_CraftItem_C_ExecuteUbergraph_W_CraftItem::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_CraftItem_C_ExecuteUbergraph_W_CraftItem, CallFunc_Conv_IntToText_ReturnValue) == 0x000428, "Member 'W_CraftItem_C_ExecuteUbergraph_W_CraftItem::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CraftItem_C_ExecuteUbergraph_W_CraftItem, K2Node_CustomEvent_PlaybackSpeed) == 0x000440, "Member 'W_CraftItem_C_ExecuteUbergraph_W_CraftItem::K2Node_CustomEvent_PlaybackSpeed' has a wrong offset!");
static_assert(offsetof(W_CraftItem_C_ExecuteUbergraph_W_CraftItem, CallFunc_PlayAnimationForward_ReturnValue) == 0x000448, "Member 'W_CraftItem_C_ExecuteUbergraph_W_CraftItem::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CraftItem_C_ExecuteUbergraph_W_CraftItem, CallFunc_MakeBrushFromSprite_ReturnValue_1) == 0x000450, "Member 'W_CraftItem_C_ExecuteUbergraph_W_CraftItem::CallFunc_MakeBrushFromSprite_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_CraftItem_C_ExecuteUbergraph_W_CraftItem, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000520, "Member 'W_CraftItem_C_ExecuteUbergraph_W_CraftItem::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_CraftItem_C_ExecuteUbergraph_W_CraftItem, CallFunc_PlayAnimationForward_ReturnValue_2) == 0x000528, "Member 'W_CraftItem_C_ExecuteUbergraph_W_CraftItem::CallFunc_PlayAnimationForward_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_CraftItem_C_ExecuteUbergraph_W_CraftItem, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000530, "Member 'W_CraftItem_C_ExecuteUbergraph_W_CraftItem::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CraftItem_C_ExecuteUbergraph_W_CraftItem, CallFunc_PlayAnimationForward_ReturnValue_3) == 0x000538, "Member 'W_CraftItem_C_ExecuteUbergraph_W_CraftItem::CallFunc_PlayAnimationForward_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_CraftItem_C_ExecuteUbergraph_W_CraftItem, CallFunc_PlayAnimationForward_ReturnValue_4) == 0x000540, "Member 'W_CraftItem_C_ExecuteUbergraph_W_CraftItem::CallFunc_PlayAnimationForward_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_CraftItem_C_ExecuteUbergraph_W_CraftItem, CallFunc_PlayAnimationForward_ReturnValue_5) == 0x000548, "Member 'W_CraftItem_C_ExecuteUbergraph_W_CraftItem::CallFunc_PlayAnimationForward_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_CraftItem_C_ExecuteUbergraph_W_CraftItem, K2Node_CustomEvent_PlayMode) == 0x000550, "Member 'W_CraftItem_C_ExecuteUbergraph_W_CraftItem::K2Node_CustomEvent_PlayMode' has a wrong offset!");
static_assert(offsetof(W_CraftItem_C_ExecuteUbergraph_W_CraftItem, CallFunc_MakeBrushFromSprite_ReturnValue_2) == 0x000560, "Member 'W_CraftItem_C_ExecuteUbergraph_W_CraftItem::CallFunc_MakeBrushFromSprite_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_CraftItem_C_ExecuteUbergraph_W_CraftItem, CallFunc_PlayAnimation_ReturnValue) == 0x000630, "Member 'W_CraftItem_C_ExecuteUbergraph_W_CraftItem::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CraftItem_C_ExecuteUbergraph_W_CraftItem, CallFunc_PlayAnimationForward_PlaybackSpeed_ImplicitCast) == 0x000638, "Member 'W_CraftItem_C_ExecuteUbergraph_W_CraftItem::CallFunc_PlayAnimationForward_PlaybackSpeed_ImplicitCast' has a wrong offset!");

// Function W_CraftItem.W_CraftItem_C.OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_CraftItem_C_OnClicked__DelegateSignature final
{
public:
	class UW_CraftItem_C*                         Clicked;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CraftItem_C_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on W_CraftItem_C_OnClicked__DelegateSignature");
static_assert(sizeof(W_CraftItem_C_OnClicked__DelegateSignature) == 0x000008, "Wrong size on W_CraftItem_C_OnClicked__DelegateSignature");
static_assert(offsetof(W_CraftItem_C_OnClicked__DelegateSignature, Clicked) == 0x000000, "Member 'W_CraftItem_C_OnClicked__DelegateSignature::Clicked' has a wrong offset!");

// Function W_CraftItem.W_CraftItem_C.PlaySuccessfulAnimation
// 0x0001 (0x0001 - 0x0000)
struct W_CraftItem_C_PlaySuccessfulAnimation final
{
public:
	EUMGSequencePlayMode                          PlayMode;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CraftItem_C_PlaySuccessfulAnimation) == 0x000001, "Wrong alignment on W_CraftItem_C_PlaySuccessfulAnimation");
static_assert(sizeof(W_CraftItem_C_PlaySuccessfulAnimation) == 0x000001, "Wrong size on W_CraftItem_C_PlaySuccessfulAnimation");
static_assert(offsetof(W_CraftItem_C_PlaySuccessfulAnimation, PlayMode) == 0x000000, "Member 'W_CraftItem_C_PlaySuccessfulAnimation::PlayMode' has a wrong offset!");

// Function W_CraftItem.W_CraftItem_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_CraftItem_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CraftItem_C_PreConstruct) == 0x000001, "Wrong alignment on W_CraftItem_C_PreConstruct");
static_assert(sizeof(W_CraftItem_C_PreConstruct) == 0x000001, "Wrong size on W_CraftItem_C_PreConstruct");
static_assert(offsetof(W_CraftItem_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_CraftItem_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_CraftItem.W_CraftItem_C.SetItemsCount
// 0x0004 (0x0004 - 0x0000)
struct W_CraftItem_C_SetItemsCount final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CraftItem_C_SetItemsCount) == 0x000004, "Wrong alignment on W_CraftItem_C_SetItemsCount");
static_assert(sizeof(W_CraftItem_C_SetItemsCount) == 0x000004, "Wrong size on W_CraftItem_C_SetItemsCount");
static_assert(offsetof(W_CraftItem_C_SetItemsCount, Count) == 0x000000, "Member 'W_CraftItem_C_SetItemsCount::Count' has a wrong offset!");

// Function W_CraftItem.W_CraftItem_C.StartFilling
// 0x0008 (0x0008 - 0x0000)
struct W_CraftItem_C_StartFilling final
{
public:
	double                                        PlaybackSpeed;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CraftItem_C_StartFilling) == 0x000008, "Wrong alignment on W_CraftItem_C_StartFilling");
static_assert(sizeof(W_CraftItem_C_StartFilling) == 0x000008, "Wrong size on W_CraftItem_C_StartFilling");
static_assert(offsetof(W_CraftItem_C_StartFilling, PlaybackSpeed) == 0x000000, "Member 'W_CraftItem_C_StartFilling::PlaybackSpeed' has a wrong offset!");

}

