#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_disclaimer

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_disclaimer.W_disclaimer_C.ExecuteUbergraph_W_disclaimer
// 0x0098 (0x0098 - 0x0000)
struct W_disclaimer_C_ExecuteUbergraph_W_disclaimer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USizeBox*                               K2Node_CustomEvent_SizeBox_0_1;                    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USizeBox*                               K2Node_CustomEvent_SizeBox_0;                      // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0018(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTDB_LevelInspectorSubsystem*           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCurrentLevelLoadedFull_ReturnValue;    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73[0x5];                                       // 0x0073(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD_MainMenu_C*                        K2Node_DynamicCast_AsHUD_Main_Menu;                // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_disclaimer_C_ExecuteUbergraph_W_disclaimer) == 0x000008, "Wrong alignment on W_disclaimer_C_ExecuteUbergraph_W_disclaimer");
static_assert(sizeof(W_disclaimer_C_ExecuteUbergraph_W_disclaimer) == 0x000098, "Wrong size on W_disclaimer_C_ExecuteUbergraph_W_disclaimer");
static_assert(offsetof(W_disclaimer_C_ExecuteUbergraph_W_disclaimer, EntryPoint) == 0x000000, "Member 'W_disclaimer_C_ExecuteUbergraph_W_disclaimer::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_disclaimer_C_ExecuteUbergraph_W_disclaimer, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'W_disclaimer_C_ExecuteUbergraph_W_disclaimer::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_disclaimer_C_ExecuteUbergraph_W_disclaimer, K2Node_CustomEvent_SizeBox_0_1) == 0x000008, "Member 'W_disclaimer_C_ExecuteUbergraph_W_disclaimer::K2Node_CustomEvent_SizeBox_0_1' has a wrong offset!");
static_assert(offsetof(W_disclaimer_C_ExecuteUbergraph_W_disclaimer, K2Node_CustomEvent_SizeBox_0) == 0x000010, "Member 'W_disclaimer_C_ExecuteUbergraph_W_disclaimer::K2Node_CustomEvent_SizeBox_0' has a wrong offset!");
static_assert(offsetof(W_disclaimer_C_ExecuteUbergraph_W_disclaimer, K2Node_Event_MyGeometry) == 0x000018, "Member 'W_disclaimer_C_ExecuteUbergraph_W_disclaimer::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_disclaimer_C_ExecuteUbergraph_W_disclaimer, K2Node_Event_InDeltaTime) == 0x000050, "Member 'W_disclaimer_C_ExecuteUbergraph_W_disclaimer::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(W_disclaimer_C_ExecuteUbergraph_W_disclaimer, CallFunc_PlayAnimationForward_ReturnValue) == 0x000058, "Member 'W_disclaimer_C_ExecuteUbergraph_W_disclaimer::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_disclaimer_C_ExecuteUbergraph_W_disclaimer, CallFunc_BooleanAND_ReturnValue) == 0x000060, "Member 'W_disclaimer_C_ExecuteUbergraph_W_disclaimer::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_disclaimer_C_ExecuteUbergraph_W_disclaimer, CallFunc_Not_PreBool_ReturnValue_1) == 0x000061, "Member 'W_disclaimer_C_ExecuteUbergraph_W_disclaimer::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_disclaimer_C_ExecuteUbergraph_W_disclaimer, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000068, "Member 'W_disclaimer_C_ExecuteUbergraph_W_disclaimer::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_disclaimer_C_ExecuteUbergraph_W_disclaimer, CallFunc_GetCurrentLevelLoadedFull_ReturnValue) == 0x000070, "Member 'W_disclaimer_C_ExecuteUbergraph_W_disclaimer::CallFunc_GetCurrentLevelLoadedFull_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_disclaimer_C_ExecuteUbergraph_W_disclaimer, CallFunc_BooleanAND_ReturnValue_1) == 0x000071, "Member 'W_disclaimer_C_ExecuteUbergraph_W_disclaimer::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_disclaimer_C_ExecuteUbergraph_W_disclaimer, CallFunc_BooleanAND_ReturnValue_2) == 0x000072, "Member 'W_disclaimer_C_ExecuteUbergraph_W_disclaimer::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_disclaimer_C_ExecuteUbergraph_W_disclaimer, CallFunc_GetPlayerController_ReturnValue) == 0x000078, "Member 'W_disclaimer_C_ExecuteUbergraph_W_disclaimer::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_disclaimer_C_ExecuteUbergraph_W_disclaimer, CallFunc_GetHUD_ReturnValue) == 0x000080, "Member 'W_disclaimer_C_ExecuteUbergraph_W_disclaimer::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_disclaimer_C_ExecuteUbergraph_W_disclaimer, K2Node_DynamicCast_AsHUD_Main_Menu) == 0x000088, "Member 'W_disclaimer_C_ExecuteUbergraph_W_disclaimer::K2Node_DynamicCast_AsHUD_Main_Menu' has a wrong offset!");
static_assert(offsetof(W_disclaimer_C_ExecuteUbergraph_W_disclaimer, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'W_disclaimer_C_ExecuteUbergraph_W_disclaimer::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function W_disclaimer.W_disclaimer_C.SequenceEvent__ENTRYPOINTW_disclaimer
// 0x0008 (0x0008 - 0x0000)
struct W_disclaimer_C_SequenceEvent__ENTRYPOINTW_disclaimer final
{
public:
	class USizeBox*                               SizeBox_0;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_disclaimer_C_SequenceEvent__ENTRYPOINTW_disclaimer) == 0x000008, "Wrong alignment on W_disclaimer_C_SequenceEvent__ENTRYPOINTW_disclaimer");
static_assert(sizeof(W_disclaimer_C_SequenceEvent__ENTRYPOINTW_disclaimer) == 0x000008, "Wrong size on W_disclaimer_C_SequenceEvent__ENTRYPOINTW_disclaimer");
static_assert(offsetof(W_disclaimer_C_SequenceEvent__ENTRYPOINTW_disclaimer, SizeBox_0) == 0x000000, "Member 'W_disclaimer_C_SequenceEvent__ENTRYPOINTW_disclaimer::SizeBox_0' has a wrong offset!");

// Function W_disclaimer.W_disclaimer_C.StartMusic
// 0x0008 (0x0008 - 0x0000)
struct W_disclaimer_C_StartMusic final
{
public:
	class USizeBox*                               SizeBox_0;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_disclaimer_C_StartMusic) == 0x000008, "Wrong alignment on W_disclaimer_C_StartMusic");
static_assert(sizeof(W_disclaimer_C_StartMusic) == 0x000008, "Wrong size on W_disclaimer_C_StartMusic");
static_assert(offsetof(W_disclaimer_C_StartMusic, SizeBox_0) == 0x000000, "Member 'W_disclaimer_C_StartMusic::SizeBox_0' has a wrong offset!");

// Function W_disclaimer.W_disclaimer_C.StartSoundSnapshot
// 0x0008 (0x0008 - 0x0000)
struct W_disclaimer_C_StartSoundSnapshot final
{
public:
	class USizeBox*                               SizeBox_0;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_disclaimer_C_StartSoundSnapshot) == 0x000008, "Wrong alignment on W_disclaimer_C_StartSoundSnapshot");
static_assert(sizeof(W_disclaimer_C_StartSoundSnapshot) == 0x000008, "Wrong size on W_disclaimer_C_StartSoundSnapshot");
static_assert(offsetof(W_disclaimer_C_StartSoundSnapshot, SizeBox_0) == 0x000000, "Member 'W_disclaimer_C_StartSoundSnapshot::SizeBox_0' has a wrong offset!");

// Function W_disclaimer.W_disclaimer_C.Tick
// 0x003C (0x003C - 0x0000)
struct W_disclaimer_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_disclaimer_C_Tick) == 0x000004, "Wrong alignment on W_disclaimer_C_Tick");
static_assert(sizeof(W_disclaimer_C_Tick) == 0x00003C, "Wrong size on W_disclaimer_C_Tick");
static_assert(offsetof(W_disclaimer_C_Tick, MyGeometry) == 0x000000, "Member 'W_disclaimer_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_disclaimer_C_Tick, InDeltaTime) == 0x000038, "Member 'W_disclaimer_C_Tick::InDeltaTime' has a wrong offset!");

}

