#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_DialoguePerks

#include "Basic.hpp"

#include "FMODStudio_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function W_DialoguePerks.W_DialoguePerks_C.BndEvt__W_DialoguePerks_Slider_Craft_K2Node_ComponentBoundEvent_25_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_DialoguePerks_C_BndEvt__W_DialoguePerks_Slider_Craft_K2Node_ComponentBoundEvent_25_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Param_Value;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_DialoguePerks_C_BndEvt__W_DialoguePerks_Slider_Craft_K2Node_ComponentBoundEvent_25_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on W_DialoguePerks_C_BndEvt__W_DialoguePerks_Slider_Craft_K2Node_ComponentBoundEvent_25_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(W_DialoguePerks_C_BndEvt__W_DialoguePerks_Slider_Craft_K2Node_ComponentBoundEvent_25_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on W_DialoguePerks_C_BndEvt__W_DialoguePerks_Slider_Craft_K2Node_ComponentBoundEvent_25_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(W_DialoguePerks_C_BndEvt__W_DialoguePerks_Slider_Craft_K2Node_ComponentBoundEvent_25_OnFloatValueChangedEvent__DelegateSignature, Param_Value) == 0x000000, "Member 'W_DialoguePerks_C_BndEvt__W_DialoguePerks_Slider_Craft_K2Node_ComponentBoundEvent_25_OnFloatValueChangedEvent__DelegateSignature::Param_Value' has a wrong offset!");

// Function W_DialoguePerks.W_DialoguePerks_C.Check Character Create
// 0x0018 (0x0018 - 0x0000)
struct W_DialoguePerks_C_Check_Character_Create final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_DialoguePerks_C_Check_Character_Create) == 0x000008, "Wrong alignment on W_DialoguePerks_C_Check_Character_Create");
static_assert(sizeof(W_DialoguePerks_C_Check_Character_Create) == 0x000018, "Wrong size on W_DialoguePerks_C_Check_Character_Create");
static_assert(offsetof(W_DialoguePerks_C_Check_Character_Create, ReturnValue) == 0x000000, "Member 'W_DialoguePerks_C_Check_Character_Create::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_Check_Character_Create, CallFunc_GetActiveWidget_ReturnValue) == 0x000008, "Member 'W_DialoguePerks_C_Check_Character_Create::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_Check_Character_Create, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000010, "Member 'W_DialoguePerks_C_Check_Character_Create::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function W_DialoguePerks.W_DialoguePerks_C.ConfirmAction
// 0x0008 (0x0008 - 0x0000)
struct W_DialoguePerks_C_ConfirmAction final
{
public:
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_DialoguePerks_C_ConfirmAction) == 0x000004, "Wrong alignment on W_DialoguePerks_C_ConfirmAction");
static_assert(sizeof(W_DialoguePerks_C_ConfirmAction) == 0x000008, "Wrong size on W_DialoguePerks_C_ConfirmAction");
static_assert(offsetof(W_DialoguePerks_C_ConfirmAction, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000000, "Member 'W_DialoguePerks_C_ConfirmAction::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ConfirmAction, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'W_DialoguePerks_C_ConfirmAction::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function W_DialoguePerks.W_DialoguePerks_C.ConnectionFailedWidget
// 0x0030 (0x0030 - 0x0000)
struct W_DialoguePerks_C_ConnectionFailedWidget final
{
public:
	class FText                                   Description;                                       // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Header;                                            // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(W_DialoguePerks_C_ConnectionFailedWidget) == 0x000008, "Wrong alignment on W_DialoguePerks_C_ConnectionFailedWidget");
static_assert(sizeof(W_DialoguePerks_C_ConnectionFailedWidget) == 0x000030, "Wrong size on W_DialoguePerks_C_ConnectionFailedWidget");
static_assert(offsetof(W_DialoguePerks_C_ConnectionFailedWidget, Description) == 0x000000, "Member 'W_DialoguePerks_C_ConnectionFailedWidget::Description' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ConnectionFailedWidget, Header) == 0x000018, "Member 'W_DialoguePerks_C_ConnectionFailedWidget::Header' has a wrong offset!");

// Function W_DialoguePerks.W_DialoguePerks_C.ExecuteUbergraph_W_DialoguePerks
// 0x03B0 (0x03B0 - 0x0000)
struct W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_1;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_2;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_3;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_4;                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_5;                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_6;                // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_7;                // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_1;     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_ComponentBoundEvent_Value;                  // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_2;     // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00C0(0x0018)()
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue_1;                      // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x00F0(0x0018)()
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue_2;                      // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x0120(0x0018)()
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_8;                // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_9;                // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival;                  // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Show;                           // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15A[0x6];                                      // 0x015A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0160(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0178(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01C8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01D8(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_3;             // 0x01F0(0x0018)()
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_222[0x6];                                      // 0x0222(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_1;  // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1; // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_4;             // 0x0240(0x0018)()
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_10;               // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_11;               // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_12;               // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_13;               // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_14;               // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Check_Character_Create_ReturnValue;       // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Check_Character_Create_ReturnValue_1;     // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0282(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_283[0x5];                                      // 0x0283(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_Description;                    // 0x0288(0x0018)()
	class FText                                   K2Node_CustomEvent_Header;                         // 0x02A0(0x0018)()
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_15;               // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_NeedForward;                    // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x02D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_16;               // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_17;               // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsItSettings;                   // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x02F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         K2Node_MakeArray_Array_1;                          // 0x02F8(0x0010)(ReferenceParm)
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival_1;                // 0x0308(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_18;               // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_324[0x4];                                      // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_ModalWindowButton_C*                 CallFunc_Array_Get_Item;                           // 0x0328(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UW_ModalWindowButton_C*>         K2Node_MakeArray_Array_2;                          // 0x0338(0x0010)(ReferenceParm, ContainsInstancedReference)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_5;             // 0x0348(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_6;             // 0x0360(0x0018)()
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_HandlerValue_ImplicitCast;      // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38C[0x4];                                      // 0x038C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1;   // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_HandlerValue_ImplicitCast_1;    // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A4[0x4];                                      // 0x03A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2;   // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks) == 0x000008, "Wrong alignment on W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks");
static_assert(sizeof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks) == 0x0003B0, "Wrong size on W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, EntryPoint) == 0x000000, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_PlayEvent2D_ReturnValue) == 0x000008, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_PlayEvent2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_PlayEvent2D_ReturnValue_1) == 0x000010, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_PlayEvent2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_PlayEvent2D_ReturnValue_2) == 0x000018, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_PlayEvent2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_PlayEvent2D_ReturnValue_3) == 0x000020, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_PlayEvent2D_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000030, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_Subtract_IntInt_ReturnValue) == 0x000038, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x00003C, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00003D, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, K2Node_CreateDelegate_OutputDelegate) == 0x000040, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_PlayEvent2D_ReturnValue_4) == 0x000050, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_PlayEvent2D_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_PlayEvent2D_ReturnValue_5) == 0x000058, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_PlayEvent2D_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_PlayEvent2D_ReturnValue_6) == 0x000060, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_PlayEvent2D_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_PlayEvent2D_ReturnValue_7) == 0x000068, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_PlayEvent2D_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_Add_IntInt_ReturnValue_1) == 0x000070, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000078, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_LessEqual_DoubleDouble_ReturnValue_1) == 0x000080, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_LessEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000084, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, K2Node_CreateDelegate_OutputDelegate_1) == 0x000088, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x000098, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, K2Node_ComponentBoundEvent_Value) == 0x00009C, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0000A0, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000A8, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0000B0, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_Round_ReturnValue) == 0x0000B8, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_LessEqual_DoubleDouble_ReturnValue_2) == 0x0000BC, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_LessEqual_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_Conv_IntToText_ReturnValue) == 0x0000C0, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0000D8, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_Round_ReturnValue_1) == 0x0000E0, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_Round_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0000E8, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_Conv_IntToText_ReturnValue_1) == 0x0000F0, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000108, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000110, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_Round_ReturnValue_2) == 0x000118, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_Round_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_Conv_IntToText_ReturnValue_2) == 0x000120, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_Conv_IntToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_PlayEvent2D_ReturnValue_8) == 0x000138, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_PlayEvent2D_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_PlayEvent2D_ReturnValue_9) == 0x000140, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_PlayEvent2D_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_GetGameInstance_ReturnValue) == 0x000148, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, K2Node_DynamicCast_AsGI_Survival) == 0x000150, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::K2Node_DynamicCast_AsGI_Survival' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, K2Node_DynamicCast_bSuccess) == 0x000158, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, K2Node_CustomEvent_Show) == 0x000159, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::K2Node_CustomEvent_Show' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_Conv_StringToText_ReturnValue) == 0x000160, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, K2Node_MakeStruct_FormatArgumentData) == 0x000178, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, K2Node_MakeArray_Array) == 0x0001C8, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_Format_ReturnValue) == 0x0001D8, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_Conv_IntToText_ReturnValue_3) == 0x0001F0, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_Conv_IntToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000208, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000210, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000218, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, K2Node_Event_IsDesignTime) == 0x000220, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_IsValid_ReturnValue) == 0x000221, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_CreatePlayAnimationProxyObject_Result_1) == 0x000228, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_CreatePlayAnimationProxyObject_Result_1' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1) == 0x000230, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_IsValid_ReturnValue_1) == 0x000238, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_Conv_IntToText_ReturnValue_4) == 0x000240, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_Conv_IntToText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_PlayEvent2D_ReturnValue_10) == 0x000258, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_PlayEvent2D_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_PlayEvent2D_ReturnValue_11) == 0x000260, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_PlayEvent2D_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_PlayEvent2D_ReturnValue_12) == 0x000268, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_PlayEvent2D_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_PlayEvent2D_ReturnValue_13) == 0x000270, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_PlayEvent2D_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_PlayEvent2D_ReturnValue_14) == 0x000278, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_PlayEvent2D_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_Check_Character_Create_ReturnValue) == 0x000280, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_Check_Character_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_Check_Character_Create_ReturnValue_1) == 0x000281, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_Check_Character_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_Not_PreBool_ReturnValue) == 0x000282, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, K2Node_CustomEvent_Description) == 0x000288, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::K2Node_CustomEvent_Description' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, K2Node_CustomEvent_Header) == 0x0002A0, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::K2Node_CustomEvent_Header' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_PlayEvent2D_ReturnValue_15) == 0x0002B8, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_PlayEvent2D_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, K2Node_CustomEvent_NeedForward) == 0x0002C0, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::K2Node_CustomEvent_NeedForward' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_PlayAnimationReverse_ReturnValue) == 0x0002C8, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_PlayAnimationForward_ReturnValue) == 0x0002D0, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_PlayEvent2D_ReturnValue_16) == 0x0002D8, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_PlayEvent2D_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_PlayEvent2D_ReturnValue_17) == 0x0002E0, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_PlayEvent2D_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, K2Node_CustomEvent_IsItSettings) == 0x0002E8, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::K2Node_CustomEvent_IsItSettings' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_GetGameInstance_ReturnValue_1) == 0x0002F0, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, K2Node_MakeArray_Array_1) == 0x0002F8, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, K2Node_DynamicCast_AsGI_Survival_1) == 0x000308, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::K2Node_DynamicCast_AsGI_Survival_1' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, K2Node_DynamicCast_bSuccess_1) == 0x000310, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_PlayEvent2D_ReturnValue_18) == 0x000318, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_PlayEvent2D_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000320, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_Array_Get_Item) == 0x000328, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_IsValid_ReturnValue_2) == 0x000330, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, K2Node_MakeArray_Array_2) == 0x000338, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_Conv_IntToText_ReturnValue_5) == 0x000348, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_Conv_IntToText_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_Conv_IntToText_ReturnValue_6) == 0x000360, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_Conv_IntToText_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000378, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000380, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, K2Node_VariableSet_HandlerValue_ImplicitCast) == 0x000388, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::K2Node_VariableSet_HandlerValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1) == 0x000390, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000398, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, K2Node_VariableSet_HandlerValue_ImplicitCast_1) == 0x0003A0, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::K2Node_VariableSet_HandlerValue_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2) == 0x0003A8, "Member 'W_DialoguePerks_C_ExecuteUbergraph_W_DialoguePerks::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");

// Function W_DialoguePerks.W_DialoguePerks_C.Get_Slider_Craft_Value_0
// 0x0004 (0x0004 - 0x0000)
struct W_DialoguePerks_C_Get_Slider_Craft_Value_0 final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_DialoguePerks_C_Get_Slider_Craft_Value_0) == 0x000004, "Wrong alignment on W_DialoguePerks_C_Get_Slider_Craft_Value_0");
static_assert(sizeof(W_DialoguePerks_C_Get_Slider_Craft_Value_0) == 0x000004, "Wrong size on W_DialoguePerks_C_Get_Slider_Craft_Value_0");
static_assert(offsetof(W_DialoguePerks_C_Get_Slider_Craft_Value_0, ReturnValue) == 0x000000, "Member 'W_DialoguePerks_C_Get_Slider_Craft_Value_0::ReturnValue' has a wrong offset!");

// Function W_DialoguePerks.W_DialoguePerks_C.GetExitWindow
// 0x0008 (0x0008 - 0x0000)
struct W_DialoguePerks_C_GetExitWindow final
{
public:
	class UWBP_ModalWindow_C*                     Param_WBP_ModalWindow_Exit;                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_DialoguePerks_C_GetExitWindow) == 0x000008, "Wrong alignment on W_DialoguePerks_C_GetExitWindow");
static_assert(sizeof(W_DialoguePerks_C_GetExitWindow) == 0x000008, "Wrong size on W_DialoguePerks_C_GetExitWindow");
static_assert(offsetof(W_DialoguePerks_C_GetExitWindow, Param_WBP_ModalWindow_Exit) == 0x000000, "Member 'W_DialoguePerks_C_GetExitWindow::Param_WBP_ModalWindow_Exit' has a wrong offset!");

// Function W_DialoguePerks.W_DialoguePerks_C.GetShowed
// 0x0001 (0x0001 - 0x0000)
struct W_DialoguePerks_C_GetShowed final
{
public:
	bool                                          Param_Showed;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_DialoguePerks_C_GetShowed) == 0x000001, "Wrong alignment on W_DialoguePerks_C_GetShowed");
static_assert(sizeof(W_DialoguePerks_C_GetShowed) == 0x000001, "Wrong size on W_DialoguePerks_C_GetShowed");
static_assert(offsetof(W_DialoguePerks_C_GetShowed, Param_Showed) == 0x000000, "Member 'W_DialoguePerks_C_GetShowed::Param_Showed' has a wrong offset!");

// Function W_DialoguePerks.W_DialoguePerks_C.OnSetExitTimerActive
// 0x0001 (0x0001 - 0x0000)
struct W_DialoguePerks_C_OnSetExitTimerActive final
{
public:
	bool                                          IsItSettings;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_DialoguePerks_C_OnSetExitTimerActive) == 0x000001, "Wrong alignment on W_DialoguePerks_C_OnSetExitTimerActive");
static_assert(sizeof(W_DialoguePerks_C_OnSetExitTimerActive) == 0x000001, "Wrong size on W_DialoguePerks_C_OnSetExitTimerActive");
static_assert(offsetof(W_DialoguePerks_C_OnSetExitTimerActive, IsItSettings) == 0x000000, "Member 'W_DialoguePerks_C_OnSetExitTimerActive::IsItSettings' has a wrong offset!");

// Function W_DialoguePerks.W_DialoguePerks_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_DialoguePerks_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_DialoguePerks_C_PreConstruct) == 0x000001, "Wrong alignment on W_DialoguePerks_C_PreConstruct");
static_assert(sizeof(W_DialoguePerks_C_PreConstruct) == 0x000001, "Wrong size on W_DialoguePerks_C_PreConstruct");
static_assert(offsetof(W_DialoguePerks_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_DialoguePerks_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_DialoguePerks.W_DialoguePerks_C.PrepareWindow
// 0x0001 (0x0001 - 0x0000)
struct W_DialoguePerks_C_PrepareWindow final
{
public:
	bool                                          bIsItSettings;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_DialoguePerks_C_PrepareWindow) == 0x000001, "Wrong alignment on W_DialoguePerks_C_PrepareWindow");
static_assert(sizeof(W_DialoguePerks_C_PrepareWindow) == 0x000001, "Wrong size on W_DialoguePerks_C_PrepareWindow");
static_assert(offsetof(W_DialoguePerks_C_PrepareWindow, bIsItSettings) == 0x000000, "Member 'W_DialoguePerks_C_PrepareWindow::bIsItSettings' has a wrong offset!");

// Function W_DialoguePerks.W_DialoguePerks_C.Show
// 0x0001 (0x0001 - 0x0000)
struct W_DialoguePerks_C_Show final
{
public:
	bool                                          Param_Show;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_DialoguePerks_C_Show) == 0x000001, "Wrong alignment on W_DialoguePerks_C_Show");
static_assert(sizeof(W_DialoguePerks_C_Show) == 0x000001, "Wrong size on W_DialoguePerks_C_Show");
static_assert(offsetof(W_DialoguePerks_C_Show, Param_Show) == 0x000000, "Member 'W_DialoguePerks_C_Show::Param_Show' has a wrong offset!");

// Function W_DialoguePerks.W_DialoguePerks_C.ShowAnimExitWindow
// 0x0001 (0x0001 - 0x0000)
struct W_DialoguePerks_C_ShowAnimExitWindow final
{
public:
	bool                                          NeedForward;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_DialoguePerks_C_ShowAnimExitWindow) == 0x000001, "Wrong alignment on W_DialoguePerks_C_ShowAnimExitWindow");
static_assert(sizeof(W_DialoguePerks_C_ShowAnimExitWindow) == 0x000001, "Wrong size on W_DialoguePerks_C_ShowAnimExitWindow");
static_assert(offsetof(W_DialoguePerks_C_ShowAnimExitWindow, NeedForward) == 0x000000, "Member 'W_DialoguePerks_C_ShowAnimExitWindow::NeedForward' has a wrong offset!");

}

