#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_DialogueButtons

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_DialogueButtons.W_DialogueButtons_C
// 0x00B8 (0x0338 - 0x0280)
class UW_DialogueButtons_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Select_Anim;                                       // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover_Anim;                                        // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       UniqueHide_Anim;                                   // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hide_Anim;                                         // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_Answer;                                     // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BG;                                          // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PhraseIcon;                                  // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PhraseIcon_Shadow;                           // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Answer;                                  // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsSelected;                                        // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D1[0x3];                                      // 0x02D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Index_W_DialogueButtons_C;                         // 0x02D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FText                                   AnswerText;                                        // 0x02D8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UW_Dialogue_C*                          ParentRef;                                         // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TSoftObjectPtr<class UPaperSprite>            PhraseIcon;                                        // 0x02F8(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bIsHovered;                                        // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsClicked;                                        // 0x0329(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowNumber;                                       // 0x032A(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Picked_;                                           // 0x032B(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         Picked_Answer;                                     // 0x032C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsButtonBack;                                      // 0x0330(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          AnimationPlayed;                                   // 0x0331(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__W_DialogueButtons_Button_Answer_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__W_DialogueButtons_Button_Answer_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__W_DialogueButtons_Button_Answer_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_W_DialogueButtons(int32 EntryPoint);
	void GetIsButtonBack(bool* Param_IsButtonBack);
	void GetPickedAnswer(int32* PickedAnswer);
	void HideButton();
	void HideHighlightEffect();
	void OnSelectPhraseChanged_Event(int32 PhraseIndex);
	void ParseNickname();
	void PreConstruct(bool IsDesignTime);
	void SetPickedAnswers(bool Param_Picked_);
	void ShowHighlightEffect();
	void UniqueHideButton();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_DialogueButtons_C">();
	}
	static class UW_DialogueButtons_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_DialogueButtons_C>();
	}
};
static_assert(alignof(UW_DialogueButtons_C) == 0x000008, "Wrong alignment on UW_DialogueButtons_C");
static_assert(sizeof(UW_DialogueButtons_C) == 0x000338, "Wrong size on UW_DialogueButtons_C");
static_assert(offsetof(UW_DialogueButtons_C, UberGraphFrame) == 0x000280, "Member 'UW_DialogueButtons_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_DialogueButtons_C, Select_Anim) == 0x000288, "Member 'UW_DialogueButtons_C::Select_Anim' has a wrong offset!");
static_assert(offsetof(UW_DialogueButtons_C, Hover_Anim) == 0x000290, "Member 'UW_DialogueButtons_C::Hover_Anim' has a wrong offset!");
static_assert(offsetof(UW_DialogueButtons_C, UniqueHide_Anim) == 0x000298, "Member 'UW_DialogueButtons_C::UniqueHide_Anim' has a wrong offset!");
static_assert(offsetof(UW_DialogueButtons_C, Hide_Anim) == 0x0002A0, "Member 'UW_DialogueButtons_C::Hide_Anim' has a wrong offset!");
static_assert(offsetof(UW_DialogueButtons_C, Button_Answer) == 0x0002A8, "Member 'UW_DialogueButtons_C::Button_Answer' has a wrong offset!");
static_assert(offsetof(UW_DialogueButtons_C, Image_BG) == 0x0002B0, "Member 'UW_DialogueButtons_C::Image_BG' has a wrong offset!");
static_assert(offsetof(UW_DialogueButtons_C, Image_PhraseIcon) == 0x0002B8, "Member 'UW_DialogueButtons_C::Image_PhraseIcon' has a wrong offset!");
static_assert(offsetof(UW_DialogueButtons_C, Image_PhraseIcon_Shadow) == 0x0002C0, "Member 'UW_DialogueButtons_C::Image_PhraseIcon_Shadow' has a wrong offset!");
static_assert(offsetof(UW_DialogueButtons_C, TextBlock_Answer) == 0x0002C8, "Member 'UW_DialogueButtons_C::TextBlock_Answer' has a wrong offset!");
static_assert(offsetof(UW_DialogueButtons_C, IsSelected) == 0x0002D0, "Member 'UW_DialogueButtons_C::IsSelected' has a wrong offset!");
static_assert(offsetof(UW_DialogueButtons_C, Index_W_DialogueButtons_C) == 0x0002D4, "Member 'UW_DialogueButtons_C::Index_W_DialogueButtons_C' has a wrong offset!");
static_assert(offsetof(UW_DialogueButtons_C, AnswerText) == 0x0002D8, "Member 'UW_DialogueButtons_C::AnswerText' has a wrong offset!");
static_assert(offsetof(UW_DialogueButtons_C, ParentRef) == 0x0002F0, "Member 'UW_DialogueButtons_C::ParentRef' has a wrong offset!");
static_assert(offsetof(UW_DialogueButtons_C, PhraseIcon) == 0x0002F8, "Member 'UW_DialogueButtons_C::PhraseIcon' has a wrong offset!");
static_assert(offsetof(UW_DialogueButtons_C, bIsHovered) == 0x000328, "Member 'UW_DialogueButtons_C::bIsHovered' has a wrong offset!");
static_assert(offsetof(UW_DialogueButtons_C, bIsClicked) == 0x000329, "Member 'UW_DialogueButtons_C::bIsClicked' has a wrong offset!");
static_assert(offsetof(UW_DialogueButtons_C, bShowNumber) == 0x00032A, "Member 'UW_DialogueButtons_C::bShowNumber' has a wrong offset!");
static_assert(offsetof(UW_DialogueButtons_C, Picked_) == 0x00032B, "Member 'UW_DialogueButtons_C::Picked_' has a wrong offset!");
static_assert(offsetof(UW_DialogueButtons_C, Picked_Answer) == 0x00032C, "Member 'UW_DialogueButtons_C::Picked_Answer' has a wrong offset!");
static_assert(offsetof(UW_DialogueButtons_C, IsButtonBack) == 0x000330, "Member 'UW_DialogueButtons_C::IsButtonBack' has a wrong offset!");
static_assert(offsetof(UW_DialogueButtons_C, AnimationPlayed) == 0x000331, "Member 'UW_DialogueButtons_C::AnimationPlayed' has a wrong offset!");

}

