#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Dialogue

#include "Basic.hpp"

#include "F_DialogueNodeInfo_structs.hpp"
#include "QuestFramework_structs.hpp"
#include "NPC_Structure_structs.hpp"
#include "FMODStudio_structs.hpp"
#include "F_DialoguePhrasesNodeInfo_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_Dialogue.W_Dialogue_C.CheckSlidesWidgets
// 0x0008 (0x0008 - 0x0000)
struct W_Dialogue_C_CheckSlidesWidgets final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInViewport_ReturnValue_1;               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Dialogue_C_CheckSlidesWidgets) == 0x000001, "Wrong alignment on W_Dialogue_C_CheckSlidesWidgets");
static_assert(sizeof(W_Dialogue_C_CheckSlidesWidgets) == 0x000008, "Wrong size on W_Dialogue_C_CheckSlidesWidgets");
static_assert(offsetof(W_Dialogue_C_CheckSlidesWidgets, ReturnValue) == 0x000000, "Member 'W_Dialogue_C_CheckSlidesWidgets::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_CheckSlidesWidgets, CallFunc_IsVisible_ReturnValue) == 0x000001, "Member 'W_Dialogue_C_CheckSlidesWidgets::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_CheckSlidesWidgets, CallFunc_IsInViewport_ReturnValue) == 0x000002, "Member 'W_Dialogue_C_CheckSlidesWidgets::CallFunc_IsInViewport_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_CheckSlidesWidgets, CallFunc_IsInViewport_ReturnValue_1) == 0x000003, "Member 'W_Dialogue_C_CheckSlidesWidgets::CallFunc_IsInViewport_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_CheckSlidesWidgets, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'W_Dialogue_C_CheckSlidesWidgets::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_CheckSlidesWidgets, CallFunc_Not_PreBool_ReturnValue_1) == 0x000005, "Member 'W_Dialogue_C_CheckSlidesWidgets::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_CheckSlidesWidgets, CallFunc_BooleanAND_ReturnValue) == 0x000006, "Member 'W_Dialogue_C_CheckSlidesWidgets::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_CheckSlidesWidgets, CallFunc_BooleanAND_ReturnValue_1) == 0x000007, "Member 'W_Dialogue_C_CheckSlidesWidgets::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function W_Dialogue.W_Dialogue_C.Create Player Answers
// 0x0208 (0x0208 - 0x0000)
struct W_Dialogue_C_Create_Player_Answers final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival;                  // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UW_DialogueButtons_C*                   CallFunc_Create_ReturnValue;                       // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UADSDialogueResponseNode*>       CallFunc_GetAllValidAnswers_ReturnValue;           // 0x0060(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UADSDialogueResponseNode*               CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetDialogueText_ReturnValue;              // 0x0088(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetDialogueText_ReturnValue_1;            // 0x00B0(0x0018)()
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPickedAnswers_Find_;                   // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FF_DialogueNodeInfo                    CallFunc_GetDataTableRowFromName_OutRow;           // 0x00F0(0x0108)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x3];                                      // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Dialogue_C_Create_Player_Answers) == 0x000008, "Wrong alignment on W_Dialogue_C_Create_Player_Answers");
static_assert(sizeof(W_Dialogue_C_Create_Player_Answers) == 0x000208, "Wrong size on W_Dialogue_C_Create_Player_Answers");
static_assert(offsetof(W_Dialogue_C_Create_Player_Answers, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'W_Dialogue_C_Create_Player_Answers::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_Create_Player_Answers, Temp_int_Array_Index_Variable) == 0x000004, "Member 'W_Dialogue_C_Create_Player_Answers::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_Create_Player_Answers, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'W_Dialogue_C_Create_Player_Answers::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_Create_Player_Answers, Temp_bool_Variable) == 0x00000C, "Member 'W_Dialogue_C_Create_Player_Answers::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_Create_Player_Answers, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'W_Dialogue_C_Create_Player_Answers::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_Create_Player_Answers, Temp_bool_Variable_1) == 0x000014, "Member 'W_Dialogue_C_Create_Player_Answers::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_Create_Player_Answers, CallFunc_GetGameInstance_ReturnValue) == 0x000018, "Member 'W_Dialogue_C_Create_Player_Answers::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_Create_Player_Answers, K2Node_MakeStruct_Margin) == 0x000020, "Member 'W_Dialogue_C_Create_Player_Answers::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_Create_Player_Answers, K2Node_DynamicCast_AsGI_Survival) == 0x000030, "Member 'W_Dialogue_C_Create_Player_Answers::K2Node_DynamicCast_AsGI_Survival' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_Create_Player_Answers, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'W_Dialogue_C_Create_Player_Answers::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_Create_Player_Answers, CallFunc_GetOwningPlayer_ReturnValue) == 0x000040, "Member 'W_Dialogue_C_Create_Player_Answers::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_Create_Player_Answers, CallFunc_Create_ReturnValue) == 0x000048, "Member 'W_Dialogue_C_Create_Player_Answers::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_Create_Player_Answers, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000050, "Member 'W_Dialogue_C_Create_Player_Answers::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_Create_Player_Answers, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000058, "Member 'W_Dialogue_C_Create_Player_Answers::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_Create_Player_Answers, CallFunc_GetAllValidAnswers_ReturnValue) == 0x000060, "Member 'W_Dialogue_C_Create_Player_Answers::CallFunc_GetAllValidAnswers_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_Create_Player_Answers, CallFunc_Array_Length_ReturnValue) == 0x000070, "Member 'W_Dialogue_C_Create_Player_Answers::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_Create_Player_Answers, CallFunc_Array_Get_Item) == 0x000078, "Member 'W_Dialogue_C_Create_Player_Answers::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_Create_Player_Answers, CallFunc_Greater_IntInt_ReturnValue) == 0x000080, "Member 'W_Dialogue_C_Create_Player_Answers::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_Create_Player_Answers, CallFunc_GetDialogueText_ReturnValue) == 0x000088, "Member 'W_Dialogue_C_Create_Player_Answers::CallFunc_GetDialogueText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_Create_Player_Answers, CallFunc_Conv_TextToString_ReturnValue) == 0x0000A0, "Member 'W_Dialogue_C_Create_Player_Answers::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_Create_Player_Answers, CallFunc_GetDialogueText_ReturnValue_1) == 0x0000B0, "Member 'W_Dialogue_C_Create_Player_Answers::CallFunc_GetDialogueText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_Create_Player_Answers, CallFunc_Conv_StringToInt_ReturnValue) == 0x0000C8, "Member 'W_Dialogue_C_Create_Player_Answers::CallFunc_Conv_StringToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_Create_Player_Answers, CallFunc_Conv_TextToString_ReturnValue_1) == 0x0000D0, "Member 'W_Dialogue_C_Create_Player_Answers::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_Create_Player_Answers, CallFunc_Conv_StringToName_ReturnValue) == 0x0000E0, "Member 'W_Dialogue_C_Create_Player_Answers::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_Create_Player_Answers, CallFunc_GetPickedAnswers_Find_) == 0x0000E8, "Member 'W_Dialogue_C_Create_Player_Answers::CallFunc_GetPickedAnswers_Find_' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_Create_Player_Answers, CallFunc_GetDataTableRowFromName_OutRow) == 0x0000F0, "Member 'W_Dialogue_C_Create_Player_Answers::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_Create_Player_Answers, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0001F8, "Member 'W_Dialogue_C_Create_Player_Answers::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_Create_Player_Answers, CallFunc_Array_Length_ReturnValue_1) == 0x0001FC, "Member 'W_Dialogue_C_Create_Player_Answers::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_Create_Player_Answers, CallFunc_Less_IntInt_ReturnValue) == 0x000200, "Member 'W_Dialogue_C_Create_Player_Answers::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_Create_Player_Answers, K2Node_Select_Default) == 0x000201, "Member 'W_Dialogue_C_Create_Player_Answers::K2Node_Select_Default' has a wrong offset!");

// Function W_Dialogue.W_Dialogue_C.Discount Upd Fade Notification
// 0x0020 (0x0020 - 0x0000)
struct W_Dialogue_C_Discount_Upd_Fade_Notification final
{
public:
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_GameHUD_C*                          K2Node_DynamicCast_AsBP_Game_HUD;                  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Dialogue_C_Discount_Upd_Fade_Notification) == 0x000008, "Wrong alignment on W_Dialogue_C_Discount_Upd_Fade_Notification");
static_assert(sizeof(W_Dialogue_C_Discount_Upd_Fade_Notification) == 0x000020, "Wrong size on W_Dialogue_C_Discount_Upd_Fade_Notification");
static_assert(offsetof(W_Dialogue_C_Discount_Upd_Fade_Notification, CallFunc_GetPlayerController_ReturnValue) == 0x000000, "Member 'W_Dialogue_C_Discount_Upd_Fade_Notification::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_Discount_Upd_Fade_Notification, CallFunc_GetHUD_ReturnValue) == 0x000008, "Member 'W_Dialogue_C_Discount_Upd_Fade_Notification::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_Discount_Upd_Fade_Notification, K2Node_DynamicCast_AsBP_Game_HUD) == 0x000010, "Member 'W_Dialogue_C_Discount_Upd_Fade_Notification::K2Node_DynamicCast_AsBP_Game_HUD' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_Discount_Upd_Fade_Notification, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'W_Dialogue_C_Discount_Upd_Fade_Notification::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function W_Dialogue.W_Dialogue_C.EndingPhraseContinue
// 0x0010 (0x0010 - 0x0000)
struct W_Dialogue_C_EndingPhraseContinue final
{
public:
	class FName                                   RowName;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Delay;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Dialogue_C_EndingPhraseContinue) == 0x000008, "Wrong alignment on W_Dialogue_C_EndingPhraseContinue");
static_assert(sizeof(W_Dialogue_C_EndingPhraseContinue) == 0x000010, "Wrong size on W_Dialogue_C_EndingPhraseContinue");
static_assert(offsetof(W_Dialogue_C_EndingPhraseContinue, RowName) == 0x000000, "Member 'W_Dialogue_C_EndingPhraseContinue::RowName' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_EndingPhraseContinue, Delay) == 0x000008, "Member 'W_Dialogue_C_EndingPhraseContinue::Delay' has a wrong offset!");

// Function W_Dialogue.W_Dialogue_C.ExecuteUbergraph_W_Dialogue
// 0x0538 (0x0538 - 0x0000)
struct W_Dialogue_C_ExecuteUbergraph_W_Dialogue final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvPC_C*                              K2Node_DynamicCast_AsSurv_PC;                      // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShowNPC_Phrase_Success;                   // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_ShowNPC_Phrase_soundLength;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_PhraseIndex_3;                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PhraseIndex_2;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PhraseIndex_1;                  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PhraseIndex;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UADSDialoguePartecipantComponent*> K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UADSDialoguePartecipantComponent*> K2Node_MakeArray_Array_1;                          // 0x0068(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	TArray<class FString>                         K2Node_MakeArray_Array_2;                          // 0x0078(0x0010)(ConstParm, ReferenceParm)
	class FString                                 CallFunc_Array_Random_OutItem;                     // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00C8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00D0(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasInputKeyJustPressed_ReturnValue;       // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasInputKeyJustPressed_ReturnValue_1;     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_122[0x2];                                      // 0x0122(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 PhraseIndex)>            K2Node_CreateDelegate_OutputDelegate_2;            // 0x0124(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0134(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0148(0x0008)(NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAGSGraphNode*                          CallFunc_StartDialogue_ReturnValue;                // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue;       // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue_1;     // 0x0182(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCurrentPhraseDeadEnd_IsDeadEnd;         // 0x0183(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCurrentPhraseDeadEnd_IsDeadEnd_1;       // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCurrentLastPhrases_Last;                // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A5[0x3];                                      // 0x01A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UADSDialogueNode*                       CallFunc_MoveToNextNode_ReturnValue;               // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAGSGraphNode*                          CallFunc_StartDialogue_ReturnValue_1;              // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCurrentPhraseDeadEnd_IsDeadEnd_2;       // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BA[0x6];                                      // 0x01BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x01C8(0x0018)()
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameHUD_C>        K2Node_DynamicCast_AsBPI_Game_HUD;                 // 0x01E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCurrentLastPhrases_Last_1;              // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FA[0x2];                                      // 0x01FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x01FC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_2;        // 0x0210(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0218(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UQuest*                                 K2Node_CustomEvent_Object;                         // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_5;        // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_6;        // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x027A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27B[0x5];                                      // 0x027B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UADSGraphNode*                          CallFunc_GetCurrentNode_ReturnValue;               // 0x0280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28C[0x4];                                      // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UADSDialogueNode*                       K2Node_DynamicCast_AsADSDialogue_Node;             // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckSlidesWidgets_ReturnValue;           // 0x029A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckSlidesWidgets_ReturnValue_1;         // 0x029B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x029C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x029D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckSlidesWidgets_ReturnValue_2;         // 0x029E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29F[0x1];                                      // 0x029F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_7;        // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UADSDialogueResponseNode*>       CallFunc_GetAllButtonAnswersForCurrentNode_ReturnValue; // 0x02B0(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x3];                                      // 0x02C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x02CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x02CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UADSDialogueResponseNode*>       CallFunc_GetAllButtonAnswersForCurrentNode_ReturnValue_1; // 0x02D0(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_LastIndex_ReturnValue_1;            // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x02E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_6;                // 0x02E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E6[0x2];                                      // 0x02E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UQuest* Quest)>          K2Node_CreateDelegate_OutputDelegate_6;            // 0x02E8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x02F8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Stash_C*                            K2Node_DynamicCast_AsBP_Stash;                     // 0x0308(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAfterRaid_bAfterRaid;                  // 0x0311(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_312[0x6];                                      // 0x0312(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Stash_C*                            K2Node_DynamicCast_AsBP_Stash_1;                   // 0x0318(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Shops_C*                            K2Node_DynamicCast_AsBP_Shops;                     // 0x0328(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_331[0x3];                                      // 0x0331(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x0334(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x0344(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_354[0x4];                                      // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Stash_C*                            K2Node_DynamicCast_AsBP_Stash_2;                   // 0x0358(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Shops_C*                            K2Node_DynamicCast_AsBP_Shops_1;                   // 0x0368(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UQuestCustomData*                 CallFunc_GetCustomData_ReturnValue;                // 0x0378(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UQuestData_C*                     K2Node_DynamicCast_AsQuest_Data;                   // 0x0380(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0389(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_7;                // 0x038A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38B[0x5];                                      // 0x038B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Stash_C*                            K2Node_DynamicCast_AsBP_Stash_3;                   // 0x0390(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0399(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39A[0x6];                                      // 0x039A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Shops_C*                            K2Node_DynamicCast_AsBP_Shops_2;                   // 0x03A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x03A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x03AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AB[0x5];                                      // 0x03AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNPC_Structure                         CallFunc_GetDataTableRowFromName_OutRow;           // 0x03B0(0x0110)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C1[0x7];                                      // 0x04C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Stash_C*                            K2Node_DynamicCast_AsBP_Stash_4;                   // 0x04C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D1[0x7];                                      // 0x04D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetDialogueText_ReturnValue;              // 0x04D8(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x04F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ABP_Shops_C*                            K2Node_DynamicCast_AsBP_Shops_3;                   // 0x0500(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_13;                    // 0x0508(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_509[0x3];                                      // 0x0509(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x050C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0514(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0515(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_516[0x2];                                      // 0x0516(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_RowName;                        // 0x0518(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Delay;                          // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0528(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_529[0x3];                                      // 0x0529(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x052C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0530(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x0534(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Dialogue_C_ExecuteUbergraph_W_Dialogue) == 0x000008, "Wrong alignment on W_Dialogue_C_ExecuteUbergraph_W_Dialogue");
static_assert(sizeof(W_Dialogue_C_ExecuteUbergraph_W_Dialogue) == 0x000538, "Wrong size on W_Dialogue_C_ExecuteUbergraph_W_Dialogue");
static_assert(offsetof(W_Dialogue_C_ExecuteUbergraph_W_Dialogue, EntryPoint) == 0x000000, "Member 'W_Dialogue_C_ExecuteUbergraph_W_Dialogue::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_ExecuteUbergraph_W_Dialogue, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'W_Dialogue_C_ExecuteUbergraph_W_Dialogue::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_ExecuteUbergraph_W_Dialogue, CallFunc_GetOwningPlayer_ReturnValue) == 0x000018, "Member 'W_Dialogue_C_ExecuteUbergraph_W_Dialogue::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_ExecuteUbergraph_W_Dialogue, K2Node_DynamicCast_AsSurv_PC) == 0x000020, "Member 'W_Dialogue_C_ExecuteUbergraph_W_Dialogue::K2Node_DynamicCast_AsSurv_PC' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_ExecuteUbergraph_W_Dialogue, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'W_Dialogue_C_ExecuteUbergraph_W_Dialogue::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_ExecuteUbergraph_W_Dialogue, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'W_Dialogue_C_ExecuteUbergraph_W_Dialogue::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_ExecuteUbergraph_W_Dialogue, CallFunc_ShowNPC_Phrase_Success) == 0x00002A, "Member 'W_Dialogue_C_ExecuteUbergraph_W_Dialogue::CallFunc_ShowNPC_Phrase_Success' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_ExecuteUbergraph_W_Dialogue, CallFunc_ShowNPC_Phrase_soundLength) == 0x000030, "Member 'W_Dialogue_C_ExecuteUbergraph_W_Dialogue::CallFunc_ShowNPC_Phrase_soundLength' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_ExecuteUbergraph_W_Dialogue, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000038, "Member 'W_Dialogue_C_ExecuteUbergraph_W_Dialogue::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_ExecuteUbergraph_W_Dialogue, CallFunc_Not_PreBool_ReturnValue) == 0x000039, "Member 'W_Dialogue_C_ExecuteUbergraph_W_Dialogue::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_ExecuteUbergraph_W_Dialogue, K2Node_CustomEvent_PhraseIndex_3) == 0x00003C, "Member 'W_Dialogue_C_ExecuteUbergraph_W_Dialogue::K2Node_CustomEvent_PhraseIndex_3' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_ExecuteUbergraph_W_Dialogue, K2Node_CustomEvent_PhraseIndex_2) == 0x000040, "Member 'W_Dialogue_C_ExecuteUbergraph_W_Dialogue::K2Node_CustomEvent_PhraseIndex_2' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_ExecuteUbergraph_W_Dialogue, K2Node_CustomEvent_PhraseIndex_1) == 0x000044, "Member 'W_Dialogue_C_ExecuteUbergraph_W_Dialogue::K2Node_CustomEvent_PhraseIndex_1' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_ExecuteUbergraph_W_Dialogue, K2Node_CustomEvent_PhraseIndex) == 0x000048, "Member 'W_Dialogue_C_ExecuteUbergraph_W_Dialogue::K2Node_CustomEvent_PhraseIndex' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_ExecuteUbergraph_W_Dialogue, Temp_int_Variable) == 0x00004C, "Member 'W_Dialogue_C_ExecuteUbergraph_W_Dialogue::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_ExecuteUbergraph_W_Dialogue, K2Node_MakeArray_Array) == 0x000050, "Member 'W_Dialogue_C_ExecuteUbergraph_W_Dialogue::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_ExecuteUbergraph_W_Dialogue, CallFunc_PlayAnimationForward_ReturnValue) == 0x000060, "Member 'W_Dialogue_C_ExecuteUbergraph_W_Dialogue::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_ExecuteUbergraph_W_Dialogue, K2Node_MakeArray_Array_1) == 0x000068, "Member 'W_Dialogue_C_ExecuteUbergraph_W_Dialogue::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_ExecuteUbergraph_W_Dialogue, K2Node_MakeArray_Array_2) == 0x000078, "Member 'W_Dialogue_C_ExecuteUbergraph_W_Dialogue::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_ExecuteUbergraph_W_Dialogue, CallFunc_Array_Random_OutItem) == 0x000088, "Member 'W_Dialogue_C_ExecuteUbergraph_W_Dialogue::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_ExecuteUbergraph_W_Dialogue, CallFunc_Array_Random_OutIndex) == 0x000098, "Member 'W_Dialogue_C_ExecuteUbergraph_W_Dialogue::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_ExecuteUbergraph_W_Dialogue, CallFunc_Concat_StrStr_ReturnValue) == 0x0000A0, "Member 'W_Dialogue_C_ExecuteUbergraph_W_Dialogue::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_ExecuteUbergraph_W_Dialogue, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000B0, "Member 'W_Dialogue_C_ExecuteUbergraph_W_Dialogue::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_ExecuteUbergraph_W_Dialogue, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x0000C0, "Member 'W_Dialogue_C_ExecuteUbergraph_W_Dialogue::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_ExecuteUbergraph_W_Dialogue, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000C8, "Member 'W_Dialogue_C_ExecuteUbergraph_W_Dialogue::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_ExecuteUbergraph_W_Dialogue, K2Node_Event_MyGeometry) == 0x0000D0, "Member 'W_Dialogue_C_ExecuteUbergraph_W_Dialogue::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_ExecuteUbergraph_W_Dialogue, K2Node_Event_InDeltaTime) == 0x000108, "Member 'W_Dialogue_C_ExecuteUbergraph_W_Dialogue::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_ExecuteUbergraph_W_Dialogue, CallFunc_GetPlayerController_ReturnValue) == 0x000110, "Member 'W_Dialogue_C_ExecuteUbergraph_W_Dialogue::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_ExecuteUbergraph_W_Dialogue, CallFunc_WasInputKeyJustPressed_ReturnValue) == 0x000118, "Member 'W_Dialogue_C_ExecuteUbergraph_W_Dialogue::CallFunc_WasInputKeyJustPressed_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_ExecuteUbergraph_W_Dialogue, CallFunc_Add_IntInt_ReturnValue) == 0x00011C, "Member 'W_Dialogue_C_ExecuteUbergraph_W_Dialogue::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_ExecuteUbergraph_W_Dialogue, CallFunc_WasInputKeyJustPressed_ReturnValue_1) == 0x000120, "Member 'W_Dialogue_C_ExecuteUbergraph_W_Dialogue::CallFunc_WasInputKeyJustPressed_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_ExecuteUbergraph_W_Dialogue, CallFunc_BooleanOR_ReturnValue) == 0x000121, "Member 'W_Dialogue_C_ExecuteUbergraph_W_Dialogue::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_ExecuteUbergraph_W_Dialogue, K2Node_CreateDelegate_OutputDelegate_2) == 0x000124, "Member 'W_Dialogue_C_ExecuteUbergraph_W_Dialogue::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
