#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_disclaimer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_disclaimer.W_disclaimer_C
// 0x0030 (0x02B0 - 0x0280)
class UW_disclaimer_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowText;                                          // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HideText;                                          // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_BG;                                          // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          ShowTimerIsEnd;                                    // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LevelLoaded;                                       // 0x02A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Closed;                                            // 0x02AA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_W_disclaimer(int32 EntryPoint);
	void SequenceEvent__ENTRYPOINTW_disclaimer(class USizeBox* SizeBox_0);
	void StartMusic(class USizeBox* SizeBox_0);
	void StartSoundSnapshot(class USizeBox* SizeBox_0);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_disclaimer_C">();
	}
	static class UW_disclaimer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_disclaimer_C>();
	}
};
static_assert(alignof(UW_disclaimer_C) == 0x000008, "Wrong alignment on UW_disclaimer_C");
static_assert(sizeof(UW_disclaimer_C) == 0x0002B0, "Wrong size on UW_disclaimer_C");
static_assert(offsetof(UW_disclaimer_C, UberGraphFrame) == 0x000280, "Member 'UW_disclaimer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_disclaimer_C, ShowText) == 0x000288, "Member 'UW_disclaimer_C::ShowText' has a wrong offset!");
static_assert(offsetof(UW_disclaimer_C, HideText) == 0x000290, "Member 'UW_disclaimer_C::HideText' has a wrong offset!");
static_assert(offsetof(UW_disclaimer_C, Image_BG) == 0x000298, "Member 'UW_disclaimer_C::Image_BG' has a wrong offset!");
static_assert(offsetof(UW_disclaimer_C, InvalidationBox_0) == 0x0002A0, "Member 'UW_disclaimer_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UW_disclaimer_C, ShowTimerIsEnd) == 0x0002A8, "Member 'UW_disclaimer_C::ShowTimerIsEnd' has a wrong offset!");
static_assert(offsetof(UW_disclaimer_C, LevelLoaded) == 0x0002A9, "Member 'UW_disclaimer_C::LevelLoaded' has a wrong offset!");
static_assert(offsetof(UW_disclaimer_C, Closed) == 0x0002AA, "Member 'UW_disclaimer_C::Closed' has a wrong offset!");

}

