#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_DialogueButtons

#include "Basic.hpp"

#include "FMODStudio_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function W_DialogueButtons.W_DialogueButtons_C.ExecuteUbergraph_W_DialogueButtons
// 0x0190 (0x0190 - 0x0000)
struct W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_PhraseIndex;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 PhraseIndex)>            K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 PhraseIndex)>            K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_1;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0050(0x0050)(HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_3;       // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x00D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D6[0x2];                                       // 0x00D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_4;       // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00F8(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0148(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0158(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0170(0x0018)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons) == 0x000008, "Wrong alignment on W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons");
static_assert(sizeof(W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons) == 0x000190, "Wrong size on W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons");
static_assert(offsetof(W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons, EntryPoint) == 0x000000, "Member 'W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons, CallFunc_IsValid_ReturnValue_1) == 0x000005, "Member 'W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons, Temp_bool_Variable) == 0x000006, "Member 'W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons, CallFunc_IsValid_ReturnValue_2) == 0x000007, "Member 'W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons, CallFunc_IsValid_ReturnValue_3) == 0x000008, "Member 'W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons, K2Node_CustomEvent_PhraseIndex) == 0x00000C, "Member 'W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons::K2Node_CustomEvent_PhraseIndex' has a wrong offset!");
static_assert(offsetof(W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000030, "Member 'W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons, CallFunc_PlayEvent2D_ReturnValue) == 0x000038, "Member 'W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons::CallFunc_PlayEvent2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons, CallFunc_PlayEvent2D_ReturnValue_1) == 0x000040, "Member 'W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons::CallFunc_PlayEvent2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons, CallFunc_TextIsEmpty_ReturnValue) == 0x000048, "Member 'W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons, CallFunc_Not_PreBool_ReturnValue) == 0x000049, "Member 'W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons, K2Node_MakeStruct_FormatArgumentData) == 0x000050, "Member 'W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons, CallFunc_PlayAnimationForward_ReturnValue) == 0x0000A0, "Member 'W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x0000A8, "Member 'W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons, CallFunc_PlayAnimationForward_ReturnValue_2) == 0x0000B0, "Member 'W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons::CallFunc_PlayAnimationForward_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons, CallFunc_PlayAnimationReverse_ReturnValue) == 0x0000B8, "Member 'W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000C0, "Member 'W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons, CallFunc_PlayAnimationForward_ReturnValue_3) == 0x0000C8, "Member 'W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons::CallFunc_PlayAnimationForward_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons, CallFunc_Not_PreBool_ReturnValue_2) == 0x0000D0, "Member 'W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons, CallFunc_BooleanAND_ReturnValue) == 0x0000D1, "Member 'W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons, CallFunc_Not_PreBool_ReturnValue_3) == 0x0000D2, "Member 'W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons, CallFunc_BooleanAND_ReturnValue_1) == 0x0000D3, "Member 'W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons, CallFunc_Not_PreBool_ReturnValue_4) == 0x0000D4, "Member 'W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons, CallFunc_BooleanAND_ReturnValue_2) == 0x0000D5, "Member 'W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons, CallFunc_PlayAnimationForward_ReturnValue_4) == 0x0000D8, "Member 'W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons::CallFunc_PlayAnimationForward_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x0000E0, "Member 'W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons, CallFunc_Add_IntInt_ReturnValue) == 0x0000E8, "Member 'W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons, CallFunc_IsValid_ReturnValue_4) == 0x0000EC, "Member 'W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons, CallFunc_Conv_IntToInt64_ReturnValue) == 0x0000F0, "Member 'W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000F8, "Member 'W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons, K2Node_MakeArray_Array) == 0x000148, "Member 'W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons, CallFunc_Format_ReturnValue) == 0x000158, "Member 'W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons, K2Node_Select_Default) == 0x000170, "Member 'W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons, K2Node_Event_IsDesignTime) == 0x000188, "Member 'W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons, CallFunc_Not_PreBool_ReturnValue_5) == 0x000189, "Member 'W_DialogueButtons_C_ExecuteUbergraph_W_DialogueButtons::CallFunc_Not_PreBool_ReturnValue_5' has a wrong offset!");

// Function W_DialogueButtons.W_DialogueButtons_C.GetIsButtonBack
// 0x0001 (0x0001 - 0x0000)
struct W_DialogueButtons_C_GetIsButtonBack final
{
public:
	bool                                          Param_IsButtonBack;                                // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_DialogueButtons_C_GetIsButtonBack) == 0x000001, "Wrong alignment on W_DialogueButtons_C_GetIsButtonBack");
static_assert(sizeof(W_DialogueButtons_C_GetIsButtonBack) == 0x000001, "Wrong size on W_DialogueButtons_C_GetIsButtonBack");
static_assert(offsetof(W_DialogueButtons_C_GetIsButtonBack, Param_IsButtonBack) == 0x000000, "Member 'W_DialogueButtons_C_GetIsButtonBack::Param_IsButtonBack' has a wrong offset!");

// Function W_DialogueButtons.W_DialogueButtons_C.GetPickedAnswer
// 0x0004 (0x0004 - 0x0000)
struct W_DialogueButtons_C_GetPickedAnswer final
{
public:
	int32                                         PickedAnswer;                                      // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_DialogueButtons_C_GetPickedAnswer) == 0x000004, "Wrong alignment on W_DialogueButtons_C_GetPickedAnswer");
static_assert(sizeof(W_DialogueButtons_C_GetPickedAnswer) == 0x000004, "Wrong size on W_DialogueButtons_C_GetPickedAnswer");
static_assert(offsetof(W_DialogueButtons_C_GetPickedAnswer, PickedAnswer) == 0x000000, "Member 'W_DialogueButtons_C_GetPickedAnswer::PickedAnswer' has a wrong offset!");

// Function W_DialogueButtons.W_DialogueButtons_C.OnSelectPhraseChanged_Event
// 0x0004 (0x0004 - 0x0000)
struct W_DialogueButtons_C_OnSelectPhraseChanged_Event final
{
public:
	int32                                         PhraseIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_DialogueButtons_C_OnSelectPhraseChanged_Event) == 0x000004, "Wrong alignment on W_DialogueButtons_C_OnSelectPhraseChanged_Event");
static_assert(sizeof(W_DialogueButtons_C_OnSelectPhraseChanged_Event) == 0x000004, "Wrong size on W_DialogueButtons_C_OnSelectPhraseChanged_Event");
static_assert(offsetof(W_DialogueButtons_C_OnSelectPhraseChanged_Event, PhraseIndex) == 0x000000, "Member 'W_DialogueButtons_C_OnSelectPhraseChanged_Event::PhraseIndex' has a wrong offset!");

// Function W_DialogueButtons.W_DialogueButtons_C.ParseNickname
// 0x0060 (0x0060 - 0x0000)
struct W_DialogueButtons_C_ParseNickname final
{
public:
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APS_TDB_C*                              K2Node_DynamicCast_AsPS_TDB;                       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetUserName_ReturnValue;                  // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue;                      // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0048(0x0018)()
};
static_assert(alignof(W_DialogueButtons_C_ParseNickname) == 0x000008, "Wrong alignment on W_DialogueButtons_C_ParseNickname");
static_assert(sizeof(W_DialogueButtons_C_ParseNickname) == 0x000060, "Wrong size on W_DialogueButtons_C_ParseNickname");
static_assert(offsetof(W_DialogueButtons_C_ParseNickname, CallFunc_GetPlayerController_ReturnValue) == 0x000000, "Member 'W_DialogueButtons_C_ParseNickname::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DialogueButtons_C_ParseNickname, K2Node_DynamicCast_AsPS_TDB) == 0x000008, "Member 'W_DialogueButtons_C_ParseNickname::K2Node_DynamicCast_AsPS_TDB' has a wrong offset!");
static_assert(offsetof(W_DialogueButtons_C_ParseNickname, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'W_DialogueButtons_C_ParseNickname::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_DialogueButtons_C_ParseNickname, CallFunc_GetUserName_ReturnValue) == 0x000018, "Member 'W_DialogueButtons_C_ParseNickname::CallFunc_GetUserName_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DialogueButtons_C_ParseNickname, CallFunc_Conv_TextToString_ReturnValue) == 0x000028, "Member 'W_DialogueButtons_C_ParseNickname::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DialogueButtons_C_ParseNickname, CallFunc_Replace_ReturnValue) == 0x000038, "Member 'W_DialogueButtons_C_ParseNickname::CallFunc_Replace_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DialogueButtons_C_ParseNickname, CallFunc_Conv_StringToText_ReturnValue) == 0x000048, "Member 'W_DialogueButtons_C_ParseNickname::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function W_DialogueButtons.W_DialogueButtons_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_DialogueButtons_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_DialogueButtons_C_PreConstruct) == 0x000001, "Wrong alignment on W_DialogueButtons_C_PreConstruct");
static_assert(sizeof(W_DialogueButtons_C_PreConstruct) == 0x000001, "Wrong size on W_DialogueButtons_C_PreConstruct");
static_assert(offsetof(W_DialogueButtons_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_DialogueButtons_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_DialogueButtons.W_DialogueButtons_C.SetPickedAnswers
// 0x0018 (0x0018 - 0x0000)
struct W_DialogueButtons_C_SetPickedAnswers final
{
public:
	bool                                          Param_Picked_;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetOpacity_InOpacity_ImplicitCast;        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_DialogueButtons_C_SetPickedAnswers) == 0x000008, "Wrong alignment on W_DialogueButtons_C_SetPickedAnswers");
static_assert(sizeof(W_DialogueButtons_C_SetPickedAnswers) == 0x000018, "Wrong size on W_DialogueButtons_C_SetPickedAnswers");
static_assert(offsetof(W_DialogueButtons_C_SetPickedAnswers, Param_Picked_) == 0x000000, "Member 'W_DialogueButtons_C_SetPickedAnswers::Param_Picked_' has a wrong offset!");
static_assert(offsetof(W_DialogueButtons_C_SetPickedAnswers, CallFunc_SelectFloat_ReturnValue) == 0x000008, "Member 'W_DialogueButtons_C_SetPickedAnswers::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DialogueButtons_C_SetPickedAnswers, CallFunc_SetOpacity_InOpacity_ImplicitCast) == 0x000010, "Member 'W_DialogueButtons_C_SetPickedAnswers::CallFunc_SetOpacity_InOpacity_ImplicitCast' has a wrong offset!");

}

