#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_EffectsPanelElement

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_EffectsPanelElement.W_EffectsPanelElement_C.ExecuteUbergraph_W_EffectsPanelElement
// 0x0178 (0x0178 - 0x0000)
struct W_EffectsPanelElement_C_ExecuteUbergraph_W_EffectsPanelElement final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UEffectMain_C*                          K2Node_CustomEvent_Target;                         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetEffectStatus_Name;                     // 0x0028(0x0018)()
	double                                        CallFunc_GetEffectStatus_Duration;                 // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0090(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00A8(0x0018)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00C4(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetEffectStatus_Name_1;                   // 0x0100(0x0018)()
	double                                        CallFunc_GetEffectStatus_Duration_1;               // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Select_Default;                             // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0160(0x0018)()
};
static_assert(alignof(W_EffectsPanelElement_C_ExecuteUbergraph_W_EffectsPanelElement) == 0x000008, "Wrong alignment on W_EffectsPanelElement_C_ExecuteUbergraph_W_EffectsPanelElement");
static_assert(sizeof(W_EffectsPanelElement_C_ExecuteUbergraph_W_EffectsPanelElement) == 0x000178, "Wrong size on W_EffectsPanelElement_C_ExecuteUbergraph_W_EffectsPanelElement");
static_assert(offsetof(W_EffectsPanelElement_C_ExecuteUbergraph_W_EffectsPanelElement, EntryPoint) == 0x000000, "Member 'W_EffectsPanelElement_C_ExecuteUbergraph_W_EffectsPanelElement::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_EffectsPanelElement_C_ExecuteUbergraph_W_EffectsPanelElement, K2Node_CustomEvent_Target) == 0x000008, "Member 'W_EffectsPanelElement_C_ExecuteUbergraph_W_EffectsPanelElement::K2Node_CustomEvent_Target' has a wrong offset!");
static_assert(offsetof(W_EffectsPanelElement_C_ExecuteUbergraph_W_EffectsPanelElement, Temp_bool_Variable) == 0x000010, "Member 'W_EffectsPanelElement_C_ExecuteUbergraph_W_EffectsPanelElement::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_EffectsPanelElement_C_ExecuteUbergraph_W_EffectsPanelElement, Temp_string_Variable) == 0x000018, "Member 'W_EffectsPanelElement_C_ExecuteUbergraph_W_EffectsPanelElement::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(W_EffectsPanelElement_C_ExecuteUbergraph_W_EffectsPanelElement, CallFunc_GetEffectStatus_Name) == 0x000028, "Member 'W_EffectsPanelElement_C_ExecuteUbergraph_W_EffectsPanelElement::CallFunc_GetEffectStatus_Name' has a wrong offset!");
static_assert(offsetof(W_EffectsPanelElement_C_ExecuteUbergraph_W_EffectsPanelElement, CallFunc_GetEffectStatus_Duration) == 0x000040, "Member 'W_EffectsPanelElement_C_ExecuteUbergraph_W_EffectsPanelElement::CallFunc_GetEffectStatus_Duration' has a wrong offset!");
static_assert(offsetof(W_EffectsPanelElement_C_ExecuteUbergraph_W_EffectsPanelElement, CallFunc_FTrunc_ReturnValue) == 0x000048, "Member 'W_EffectsPanelElement_C_ExecuteUbergraph_W_EffectsPanelElement::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EffectsPanelElement_C_ExecuteUbergraph_W_EffectsPanelElement, CallFunc_Conv_TextToString_ReturnValue) == 0x000050, "Member 'W_EffectsPanelElement_C_ExecuteUbergraph_W_EffectsPanelElement::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EffectsPanelElement_C_ExecuteUbergraph_W_EffectsPanelElement, CallFunc_Conv_IntToString_ReturnValue) == 0x000060, "Member 'W_EffectsPanelElement_C_ExecuteUbergraph_W_EffectsPanelElement::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EffectsPanelElement_C_ExecuteUbergraph_W_EffectsPanelElement, CallFunc_Concat_StrStr_ReturnValue) == 0x000070, "Member 'W_EffectsPanelElement_C_ExecuteUbergraph_W_EffectsPanelElement::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EffectsPanelElement_C_ExecuteUbergraph_W_EffectsPanelElement, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000080, "Member 'W_EffectsPanelElement_C_ExecuteUbergraph_W_EffectsPanelElement::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_EffectsPanelElement_C_ExecuteUbergraph_W_EffectsPanelElement, CallFunc_Conv_StringToText_ReturnValue) == 0x000090, "Member 'W_EffectsPanelElement_C_ExecuteUbergraph_W_EffectsPanelElement::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EffectsPanelElement_C_ExecuteUbergraph_W_EffectsPanelElement, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0000A8, "Member 'W_EffectsPanelElement_C_ExecuteUbergraph_W_EffectsPanelElement::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_EffectsPanelElement_C_ExecuteUbergraph_W_EffectsPanelElement, K2Node_Event_IsDesignTime) == 0x0000C0, "Member 'W_EffectsPanelElement_C_ExecuteUbergraph_W_EffectsPanelElement::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_EffectsPanelElement_C_ExecuteUbergraph_W_EffectsPanelElement, K2Node_Event_MyGeometry) == 0x0000C4, "Member 'W_EffectsPanelElement_C_ExecuteUbergraph_W_EffectsPanelElement::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_EffectsPanelElement_C_ExecuteUbergraph_W_EffectsPanelElement, K2Node_Event_InDeltaTime) == 0x0000FC, "Member 'W_EffectsPanelElement_C_ExecuteUbergraph_W_EffectsPanelElement::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(W_EffectsPanelElement_C_ExecuteUbergraph_W_EffectsPanelElement, CallFunc_GetEffectStatus_Name_1) == 0x000100, "Member 'W_EffectsPanelElement_C_ExecuteUbergraph_W_EffectsPanelElement::CallFunc_GetEffectStatus_Name_1' has a wrong offset!");
static_assert(offsetof(W_EffectsPanelElement_C_ExecuteUbergraph_W_EffectsPanelElement, CallFunc_GetEffectStatus_Duration_1) == 0x000118, "Member 'W_EffectsPanelElement_C_ExecuteUbergraph_W_EffectsPanelElement::CallFunc_GetEffectStatus_Duration_1' has a wrong offset!");
static_assert(offsetof(W_EffectsPanelElement_C_ExecuteUbergraph_W_EffectsPanelElement, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000120, "Member 'W_EffectsPanelElement_C_ExecuteUbergraph_W_EffectsPanelElement::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EffectsPanelElement_C_ExecuteUbergraph_W_EffectsPanelElement, CallFunc_FTrunc_ReturnValue_1) == 0x000124, "Member 'W_EffectsPanelElement_C_ExecuteUbergraph_W_EffectsPanelElement::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_EffectsPanelElement_C_ExecuteUbergraph_W_EffectsPanelElement, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000128, "Member 'W_EffectsPanelElement_C_ExecuteUbergraph_W_EffectsPanelElement::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_EffectsPanelElement_C_ExecuteUbergraph_W_EffectsPanelElement, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000138, "Member 'W_EffectsPanelElement_C_ExecuteUbergraph_W_EffectsPanelElement::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_EffectsPanelElement_C_ExecuteUbergraph_W_EffectsPanelElement, K2Node_Select_Default) == 0x000148, "Member 'W_EffectsPanelElement_C_ExecuteUbergraph_W_EffectsPanelElement::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_EffectsPanelElement_C_ExecuteUbergraph_W_EffectsPanelElement, CallFunc_Array_Contains_ReturnValue) == 0x000158, "Member 'W_EffectsPanelElement_C_ExecuteUbergraph_W_EffectsPanelElement::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EffectsPanelElement_C_ExecuteUbergraph_W_EffectsPanelElement, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000160, "Member 'W_EffectsPanelElement_C_ExecuteUbergraph_W_EffectsPanelElement::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");

// Function W_EffectsPanelElement.W_EffectsPanelElement_C.Init
// 0x0008 (0x0008 - 0x0000)
struct W_EffectsPanelElement_C_Init final
{
public:
	class UEffectMain_C*                          Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_EffectsPanelElement_C_Init) == 0x000008, "Wrong alignment on W_EffectsPanelElement_C_Init");
static_assert(sizeof(W_EffectsPanelElement_C_Init) == 0x000008, "Wrong size on W_EffectsPanelElement_C_Init");
static_assert(offsetof(W_EffectsPanelElement_C_Init, Target) == 0x000000, "Member 'W_EffectsPanelElement_C_Init::Target' has a wrong offset!");

// Function W_EffectsPanelElement.W_EffectsPanelElement_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_EffectsPanelElement_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_EffectsPanelElement_C_PreConstruct) == 0x000001, "Wrong alignment on W_EffectsPanelElement_C_PreConstruct");
static_assert(sizeof(W_EffectsPanelElement_C_PreConstruct) == 0x000001, "Wrong size on W_EffectsPanelElement_C_PreConstruct");
static_assert(offsetof(W_EffectsPanelElement_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_EffectsPanelElement_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_EffectsPanelElement.W_EffectsPanelElement_C.Tick
// 0x003C (0x003C - 0x0000)
struct W_EffectsPanelElement_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_EffectsPanelElement_C_Tick) == 0x000004, "Wrong alignment on W_EffectsPanelElement_C_Tick");
static_assert(sizeof(W_EffectsPanelElement_C_Tick) == 0x00003C, "Wrong size on W_EffectsPanelElement_C_Tick");
static_assert(offsetof(W_EffectsPanelElement_C_Tick, MyGeometry) == 0x000000, "Member 'W_EffectsPanelElement_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_EffectsPanelElement_C_Tick, InDeltaTime) == 0x000038, "Member 'W_EffectsPanelElement_C_Tick::InDeltaTime' has a wrong offset!");

}

