#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_EffectRowForItemInfo

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function W_EffectRowForItemInfo.W_EffectRowForItemInfo_C.ExecuteUbergraph_W_EffectRowForItemInfo
// 0x01B0 (0x01B0 - 0x0000)
struct W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0010(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0028(0x0018)()
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNegativeEffectValue_ReturnValue;        // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47[0x1];                                       // 0x0047(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0048(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x005C(0x0014)()
	bool                                          CallFunc_IsNegativeEffectValue_ReturnValue_1;      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_Select_Default_2;                           // 0x0074(0x0014)()
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x00A0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00B8(0x0050)(HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default_3;                           // 0x0108(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0120(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0170(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0180(0x0018)()
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast_1;      // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast_2;      // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast_3;      // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast_4;      // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo) == 0x000008, "Wrong alignment on W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo");
static_assert(sizeof(W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo) == 0x0001B0, "Wrong size on W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo");
static_assert(offsetof(W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo, EntryPoint) == 0x000000, "Member 'W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo, Temp_byte_Variable) == 0x000004, "Member 'W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo, Temp_byte_Variable_1) == 0x000005, "Member 'W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo, Temp_bool_Variable) == 0x000006, "Member 'W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo, Temp_byte_Variable_2) == 0x000007, "Member 'W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo, Temp_byte_Variable_3) == 0x000008, "Member 'W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo, Temp_bool_Variable_1) == 0x000009, "Member 'W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo, Temp_bool_Variable_2) == 0x00000A, "Member 'W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo, Temp_text_Variable) == 0x000010, "Member 'W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo, Temp_text_Variable_1) == 0x000028, "Member 'W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000040, "Member 'W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo, K2Node_Select_Default) == 0x000041, "Member 'W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo, Temp_bool_Variable_3) == 0x000042, "Member 'W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo, K2Node_Select_Default_1) == 0x000043, "Member 'W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000044, "Member 'W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo, K2Node_Event_IsDesignTime) == 0x000045, "Member 'W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo, CallFunc_IsNegativeEffectValue_ReturnValue) == 0x000046, "Member 'W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo::CallFunc_IsNegativeEffectValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo, K2Node_MakeStruct_SlateColor) == 0x000048, "Member 'W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo, K2Node_MakeStruct_SlateColor_1) == 0x00005C, "Member 'W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo, CallFunc_IsNegativeEffectValue_ReturnValue_1) == 0x000070, "Member 'W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo::CallFunc_IsNegativeEffectValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo, K2Node_Select_Default_2) == 0x000074, "Member 'W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo, CallFunc_SelectInt_ReturnValue) == 0x000088, "Member 'W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo, CallFunc_Abs_ReturnValue) == 0x000090, "Member 'W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000098, "Member 'W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo, CallFunc_Conv_DoubleToText_ReturnValue) == 0x0000A0, "Member 'W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo, K2Node_MakeStruct_FormatArgumentData) == 0x0000B8, "Member 'W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo, K2Node_Select_Default_3) == 0x000108, "Member 'W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo, K2Node_MakeStruct_FormatArgumentData_1) == 0x000120, "Member 'W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo, K2Node_MakeArray_Array) == 0x000170, "Member 'W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo, CallFunc_Format_ReturnValue) == 0x000180, "Member 'W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x000198, "Member 'W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo, CallFunc_SetPercent_InPercent_ImplicitCast_1) == 0x00019C, "Member 'W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo::CallFunc_SetPercent_InPercent_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo, CallFunc_SetPercent_InPercent_ImplicitCast_2) == 0x0001A0, "Member 'W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo::CallFunc_SetPercent_InPercent_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo, CallFunc_SetPercent_InPercent_ImplicitCast_3) == 0x0001A4, "Member 'W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo::CallFunc_SetPercent_InPercent_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo, CallFunc_SetPercent_InPercent_ImplicitCast_4) == 0x0001A8, "Member 'W_EffectRowForItemInfo_C_ExecuteUbergraph_W_EffectRowForItemInfo::CallFunc_SetPercent_InPercent_ImplicitCast_4' has a wrong offset!");

// Function W_EffectRowForItemInfo.W_EffectRowForItemInfo_C.IsNegativeEffectValue
// 0x0003 (0x0003 - 0x0000)
struct W_EffectRowForItemInfo_C_IsNegativeEffectValue final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_EffectRowForItemInfo_C_IsNegativeEffectValue) == 0x000001, "Wrong alignment on W_EffectRowForItemInfo_C_IsNegativeEffectValue");
static_assert(sizeof(W_EffectRowForItemInfo_C_IsNegativeEffectValue) == 0x000003, "Wrong size on W_EffectRowForItemInfo_C_IsNegativeEffectValue");
static_assert(offsetof(W_EffectRowForItemInfo_C_IsNegativeEffectValue, ReturnValue) == 0x000000, "Member 'W_EffectRowForItemInfo_C_IsNegativeEffectValue::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EffectRowForItemInfo_C_IsNegativeEffectValue, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000001, "Member 'W_EffectRowForItemInfo_C_IsNegativeEffectValue::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EffectRowForItemInfo_C_IsNegativeEffectValue, CallFunc_BooleanAND_ReturnValue) == 0x000002, "Member 'W_EffectRowForItemInfo_C_IsNegativeEffectValue::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function W_EffectRowForItemInfo.W_EffectRowForItemInfo_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_EffectRowForItemInfo_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_EffectRowForItemInfo_C_PreConstruct) == 0x000001, "Wrong alignment on W_EffectRowForItemInfo_C_PreConstruct");
static_assert(sizeof(W_EffectRowForItemInfo_C_PreConstruct) == 0x000001, "Wrong size on W_EffectRowForItemInfo_C_PreConstruct");
static_assert(offsetof(W_EffectRowForItemInfo_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_EffectRowForItemInfo_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

