#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_EffectsPanelElement

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_EffectsPanelElement.W_EffectsPanelElement_C
// 0x0028 (0x02A8 - 0x0280)
class UW_EffectsPanelElement_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             TextBlock_EffectName;                              // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_EffectTime;                              // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEffectMain_C*                          Effect;                                            // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      Player;                                            // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_W_EffectsPanelElement(int32 EntryPoint);
	void Init(class UEffectMain_C* Target);
	void PreConstruct(bool IsDesignTime);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_EffectsPanelElement_C">();
	}
	static class UW_EffectsPanelElement_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_EffectsPanelElement_C>();
	}
};
static_assert(alignof(UW_EffectsPanelElement_C) == 0x000008, "Wrong alignment on UW_EffectsPanelElement_C");
static_assert(sizeof(UW_EffectsPanelElement_C) == 0x0002A8, "Wrong size on UW_EffectsPanelElement_C");
static_assert(offsetof(UW_EffectsPanelElement_C, UberGraphFrame) == 0x000280, "Member 'UW_EffectsPanelElement_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_EffectsPanelElement_C, TextBlock_EffectName) == 0x000288, "Member 'UW_EffectsPanelElement_C::TextBlock_EffectName' has a wrong offset!");
static_assert(offsetof(UW_EffectsPanelElement_C, TextBlock_EffectTime) == 0x000290, "Member 'UW_EffectsPanelElement_C::TextBlock_EffectTime' has a wrong offset!");
static_assert(offsetof(UW_EffectsPanelElement_C, Effect) == 0x000298, "Member 'UW_EffectsPanelElement_C::Effect' has a wrong offset!");
static_assert(offsetof(UW_EffectsPanelElement_C, Player) == 0x0002A0, "Member 'UW_EffectsPanelElement_C::Player' has a wrong offset!");

}

