#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_FinishingMenu

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_FinishingMenu.W_FinishingMenu_C.ExecuteUbergraph_W_FinishingMenu
// 0x0110 (0x0110 - 0x0000)
struct W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckBandages_HaveBandage;                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue;                         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1;  // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue_1;                       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0068(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInputKeyDown_ReturnValue;               // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInputKeyDown_ReturnValue_1;             // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BB[0x5];                                       // 0x00BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      K2Node_CustomEvent_Player;                         // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABandit_Mannequin_C*                    K2Node_CustomEvent_IsBanditMannequin;              // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsSelfTarget;                   // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x00D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_1;                 // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player_1;            // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player_2;            // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_DeltaTime_ImplicitCast;         // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu) == 0x000008, "Wrong alignment on W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu");
static_assert(sizeof(W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu) == 0x000110, "Wrong size on W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu");
static_assert(offsetof(W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu, EntryPoint) == 0x000000, "Member 'W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu, CallFunc_K2_GetPawn_ReturnValue) == 0x000010, "Member 'W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu, K2Node_DynamicCast_AsSurvival_Player) == 0x000018, "Member 'W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu, CallFunc_CheckBandages_HaveBandage) == 0x000021, "Member 'W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu::CallFunc_CheckBandages_HaveBandage' has a wrong offset!");
static_assert(offsetof(W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu, CallFunc_Not_PreBool_ReturnValue) == 0x000022, "Member 'W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu, CallFunc_BooleanAND_ReturnValue) == 0x000023, "Member 'W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000028, "Member 'W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu, CallFunc_FMin_ReturnValue) == 0x000030, "Member 'W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000038, "Member 'W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000040, "Member 'W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu, CallFunc_Not_PreBool_ReturnValue_1) == 0x000048, "Member 'W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu, CallFunc_BooleanAND_ReturnValue_1) == 0x000049, "Member 'W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1) == 0x00004A, "Member 'W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu, Temp_bool_Has_Been_Initd_Variable) == 0x00004B, "Member 'W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000050, "Member 'W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000058, "Member 'W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu, CallFunc_FMin_ReturnValue_1) == 0x000060, "Member 'W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu::CallFunc_FMin_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu, K2Node_Event_MyGeometry) == 0x000068, "Member 'W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu, K2Node_Event_InDeltaTime) == 0x0000A0, "Member 'W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu, CallFunc_GetPlayerController_ReturnValue_1) == 0x0000A8, "Member 'W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu, CallFunc_GetPlayerController_ReturnValue_2) == 0x0000B0, "Member 'W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu, CallFunc_IsInputKeyDown_ReturnValue) == 0x0000B8, "Member 'W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu::CallFunc_IsInputKeyDown_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu, CallFunc_IsInputKeyDown_ReturnValue_1) == 0x0000B9, "Member 'W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu::CallFunc_IsInputKeyDown_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu, CallFunc_BooleanAND_ReturnValue_2) == 0x0000BA, "Member 'W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu, K2Node_CustomEvent_Player) == 0x0000C0, "Member 'W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu::K2Node_CustomEvent_Player' has a wrong offset!");
static_assert(offsetof(W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu, K2Node_CustomEvent_IsBanditMannequin) == 0x0000C8, "Member 'W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu::K2Node_CustomEvent_IsBanditMannequin' has a wrong offset!");
static_assert(offsetof(W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu, K2Node_CustomEvent_IsSelfTarget) == 0x0000D0, "Member 'W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu::K2Node_CustomEvent_IsSelfTarget' has a wrong offset!");
static_assert(offsetof(W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu, Temp_bool_Has_Been_Initd_Variable_1) == 0x0000D1, "Member 'W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu, Temp_bool_IsClosed_Variable) == 0x0000D2, "Member 'W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu, Temp_bool_IsClosed_Variable_1) == 0x0000D3, "Member 'W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu, CallFunc_IsValid_ReturnValue) == 0x0000D4, "Member 'W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu, CallFunc_GetPlayerController_ReturnValue_3) == 0x0000D8, "Member 'W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu, CallFunc_K2_GetPawn_ReturnValue_1) == 0x0000E0, "Member 'W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu::CallFunc_K2_GetPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu, K2Node_DynamicCast_AsSurvival_Player_1) == 0x0000E8, "Member 'W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu::K2Node_DynamicCast_AsSurvival_Player_1' has a wrong offset!");
static_assert(offsetof(W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu, K2Node_DynamicCast_bSuccess_1) == 0x0000F0, "Member 'W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu, K2Node_DynamicCast_AsSurvival_Player_2) == 0x0000F8, "Member 'W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu::K2Node_DynamicCast_AsSurvival_Player_2' has a wrong offset!");
static_assert(offsetof(W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu, K2Node_DynamicCast_bSuccess_2) == 0x000100, "Member 'W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu, K2Node_VariableSet_DeltaTime_ImplicitCast) == 0x000108, "Member 'W_FinishingMenu_C_ExecuteUbergraph_W_FinishingMenu::K2Node_VariableSet_DeltaTime_ImplicitCast' has a wrong offset!");

// Function W_FinishingMenu.W_FinishingMenu_C.Show
// 0x0018 (0x0018 - 0x0000)
struct W_FinishingMenu_C_Show final
{
public:
	class ASurvivalPlayer_C*                      Param_Player;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABandit_Mannequin_C*                    IsBanditMannequin;                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Param_IsSelfTarget;                                // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_FinishingMenu_C_Show) == 0x000008, "Wrong alignment on W_FinishingMenu_C_Show");
static_assert(sizeof(W_FinishingMenu_C_Show) == 0x000018, "Wrong size on W_FinishingMenu_C_Show");
static_assert(offsetof(W_FinishingMenu_C_Show, Param_Player) == 0x000000, "Member 'W_FinishingMenu_C_Show::Param_Player' has a wrong offset!");
static_assert(offsetof(W_FinishingMenu_C_Show, IsBanditMannequin) == 0x000008, "Member 'W_FinishingMenu_C_Show::IsBanditMannequin' has a wrong offset!");
static_assert(offsetof(W_FinishingMenu_C_Show, Param_IsSelfTarget) == 0x000010, "Member 'W_FinishingMenu_C_Show::Param_IsSelfTarget' has a wrong offset!");

// Function W_FinishingMenu.W_FinishingMenu_C.Tick
// 0x003C (0x003C - 0x0000)
struct W_FinishingMenu_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_FinishingMenu_C_Tick) == 0x000004, "Wrong alignment on W_FinishingMenu_C_Tick");
static_assert(sizeof(W_FinishingMenu_C_Tick) == 0x00003C, "Wrong size on W_FinishingMenu_C_Tick");
static_assert(offsetof(W_FinishingMenu_C_Tick, MyGeometry) == 0x000000, "Member 'W_FinishingMenu_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_FinishingMenu_C_Tick, InDeltaTime) == 0x000038, "Member 'W_FinishingMenu_C_Tick::InDeltaTime' has a wrong offset!");

}

