#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_FoodIngredientItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_FoodIngredientItem.W_FoodIngredientItem_C
// 0x0028 (0x02A8 - 0x0280)
class UW_FoodIngredientItem_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             Count;                                             // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_62;                                          // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Name_W_FoodIngredientItem_C;                       // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             YouHave;                                           // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void ExecuteUbergraph_W_FoodIngredientItem(int32 EntryPoint);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void OnLoaded_B2F26B37490E67C0DDD667A20FC5B751(class UObject* Loaded);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_FoodIngredientItem_C">();
	}
	static class UW_FoodIngredientItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_FoodIngredientItem_C>();
	}
};
static_assert(alignof(UW_FoodIngredientItem_C) == 0x000008, "Wrong alignment on UW_FoodIngredientItem_C");
static_assert(sizeof(UW_FoodIngredientItem_C) == 0x0002A8, "Wrong size on UW_FoodIngredientItem_C");
static_assert(offsetof(UW_FoodIngredientItem_C, UberGraphFrame) == 0x000280, "Member 'UW_FoodIngredientItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_FoodIngredientItem_C, Count) == 0x000288, "Member 'UW_FoodIngredientItem_C::Count' has a wrong offset!");
static_assert(offsetof(UW_FoodIngredientItem_C, Image_62) == 0x000290, "Member 'UW_FoodIngredientItem_C::Image_62' has a wrong offset!");
static_assert(offsetof(UW_FoodIngredientItem_C, Name_W_FoodIngredientItem_C) == 0x000298, "Member 'UW_FoodIngredientItem_C::Name_W_FoodIngredientItem_C' has a wrong offset!");
static_assert(offsetof(UW_FoodIngredientItem_C, YouHave) == 0x0002A0, "Member 'UW_FoodIngredientItem_C::YouHave' has a wrong offset!");

}

