#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_GameLogo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_GameLogo.W_GameLogo_C
// 0x0020 (0x02A0 - 0x0280)
class UW_GameLogo_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       GameLogoAnim;                                      // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_BG;                                          // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_GameLogo;                                    // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_GameLogo(int32 EntryPoint);
	void PlayAnim();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_GameLogo_C">();
	}
	static class UW_GameLogo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_GameLogo_C>();
	}
};
static_assert(alignof(UW_GameLogo_C) == 0x000008, "Wrong alignment on UW_GameLogo_C");
static_assert(sizeof(UW_GameLogo_C) == 0x0002A0, "Wrong size on UW_GameLogo_C");
static_assert(offsetof(UW_GameLogo_C, UberGraphFrame) == 0x000280, "Member 'UW_GameLogo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_GameLogo_C, GameLogoAnim) == 0x000288, "Member 'UW_GameLogo_C::GameLogoAnim' has a wrong offset!");
static_assert(offsetof(UW_GameLogo_C, Image_BG) == 0x000290, "Member 'UW_GameLogo_C::Image_BG' has a wrong offset!");
static_assert(offsetof(UW_GameLogo_C, Image_GameLogo) == 0x000298, "Member 'UW_GameLogo_C::Image_GameLogo' has a wrong offset!");

}

