#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_GraphicsMenu

#include "Basic.hpp"

#include "Survival_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "NISBlueprint_structs.hpp"


namespace SDK::Params
{

// Function W_GraphicsMenu.W_GraphicsMenu_C.BndEvt__W_GraphicsMenu_W_SettingRow_3DResolution_K2Node_ComponentBoundEvent_15_ValueHasBeenChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_3DResolution_K2Node_ComponentBoundEvent_15_ValueHasBeenChanged__DelegateSignature final
{
public:
	double                                        NewValue;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_3DResolution_K2Node_ComponentBoundEvent_15_ValueHasBeenChanged__DelegateSignature) == 0x000008, "Wrong alignment on W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_3DResolution_K2Node_ComponentBoundEvent_15_ValueHasBeenChanged__DelegateSignature");
static_assert(sizeof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_3DResolution_K2Node_ComponentBoundEvent_15_ValueHasBeenChanged__DelegateSignature) == 0x000008, "Wrong size on W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_3DResolution_K2Node_ComponentBoundEvent_15_ValueHasBeenChanged__DelegateSignature");
static_assert(offsetof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_3DResolution_K2Node_ComponentBoundEvent_15_ValueHasBeenChanged__DelegateSignature, NewValue) == 0x000000, "Member 'W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_3DResolution_K2Node_ComponentBoundEvent_15_ValueHasBeenChanged__DelegateSignature::NewValue' has a wrong offset!");

// Function W_GraphicsMenu.W_GraphicsMenu_C.BndEvt__W_GraphicsMenu_W_SettingRow_AntiAliasingQuality_K2Node_ComponentBoundEvent_19_IndexHasBeenChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_AntiAliasingQuality_K2Node_ComponentBoundEvent_19_IndexHasBeenChanged__DelegateSignature final
{
public:
	int32                                         NewIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_AntiAliasingQuality_K2Node_ComponentBoundEvent_19_IndexHasBeenChanged__DelegateSignature) == 0x000004, "Wrong alignment on W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_AntiAliasingQuality_K2Node_ComponentBoundEvent_19_IndexHasBeenChanged__DelegateSignature");
static_assert(sizeof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_AntiAliasingQuality_K2Node_ComponentBoundEvent_19_IndexHasBeenChanged__DelegateSignature) == 0x000004, "Wrong size on W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_AntiAliasingQuality_K2Node_ComponentBoundEvent_19_IndexHasBeenChanged__DelegateSignature");
static_assert(offsetof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_AntiAliasingQuality_K2Node_ComponentBoundEvent_19_IndexHasBeenChanged__DelegateSignature, NewIndex) == 0x000000, "Member 'W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_AntiAliasingQuality_K2Node_ComponentBoundEvent_19_IndexHasBeenChanged__DelegateSignature::NewIndex' has a wrong offset!");

// Function W_GraphicsMenu.W_GraphicsMenu_C.BndEvt__W_GraphicsMenu_W_SettingRow_DLSS_K2Node_ComponentBoundEvent_8_IndexHasBeenChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_DLSS_K2Node_ComponentBoundEvent_8_IndexHasBeenChanged__DelegateSignature final
{
public:
	int32                                         NewIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_DLSS_K2Node_ComponentBoundEvent_8_IndexHasBeenChanged__DelegateSignature) == 0x000004, "Wrong alignment on W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_DLSS_K2Node_ComponentBoundEvent_8_IndexHasBeenChanged__DelegateSignature");
static_assert(sizeof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_DLSS_K2Node_ComponentBoundEvent_8_IndexHasBeenChanged__DelegateSignature) == 0x000004, "Wrong size on W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_DLSS_K2Node_ComponentBoundEvent_8_IndexHasBeenChanged__DelegateSignature");
static_assert(offsetof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_DLSS_K2Node_ComponentBoundEvent_8_IndexHasBeenChanged__DelegateSignature, NewIndex) == 0x000000, "Member 'W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_DLSS_K2Node_ComponentBoundEvent_8_IndexHasBeenChanged__DelegateSignature::NewIndex' has a wrong offset!");

// Function W_GraphicsMenu.W_GraphicsMenu_C.BndEvt__W_GraphicsMenu_W_SettingRow_DLSSFrameGeneration_K2Node_ComponentBoundEvent_30_IndexHasBeenChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_DLSSFrameGeneration_K2Node_ComponentBoundEvent_30_IndexHasBeenChanged__DelegateSignature final
{
public:
	int32                                         NewIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_DLSSFrameGeneration_K2Node_ComponentBoundEvent_30_IndexHasBeenChanged__DelegateSignature) == 0x000004, "Wrong alignment on W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_DLSSFrameGeneration_K2Node_ComponentBoundEvent_30_IndexHasBeenChanged__DelegateSignature");
static_assert(sizeof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_DLSSFrameGeneration_K2Node_ComponentBoundEvent_30_IndexHasBeenChanged__DelegateSignature) == 0x000004, "Wrong size on W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_DLSSFrameGeneration_K2Node_ComponentBoundEvent_30_IndexHasBeenChanged__DelegateSignature");
static_assert(offsetof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_DLSSFrameGeneration_K2Node_ComponentBoundEvent_30_IndexHasBeenChanged__DelegateSignature, NewIndex) == 0x000000, "Member 'W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_DLSSFrameGeneration_K2Node_ComponentBoundEvent_30_IndexHasBeenChanged__DelegateSignature::NewIndex' has a wrong offset!");

// Function W_GraphicsMenu.W_GraphicsMenu_C.BndEvt__W_GraphicsMenu_W_SettingRow_DLSSFrameGeneration_K2Node_ComponentBoundEvent_9_IndexHasBeenChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_DLSSFrameGeneration_K2Node_ComponentBoundEvent_9_IndexHasBeenChanged__DelegateSignature final
{
public:
	int32                                         NewIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_DLSSFrameGeneration_K2Node_ComponentBoundEvent_9_IndexHasBeenChanged__DelegateSignature) == 0x000004, "Wrong alignment on W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_DLSSFrameGeneration_K2Node_ComponentBoundEvent_9_IndexHasBeenChanged__DelegateSignature");
static_assert(sizeof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_DLSSFrameGeneration_K2Node_ComponentBoundEvent_9_IndexHasBeenChanged__DelegateSignature) == 0x000004, "Wrong size on W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_DLSSFrameGeneration_K2Node_ComponentBoundEvent_9_IndexHasBeenChanged__DelegateSignature");
static_assert(offsetof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_DLSSFrameGeneration_K2Node_ComponentBoundEvent_9_IndexHasBeenChanged__DelegateSignature, NewIndex) == 0x000000, "Member 'W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_DLSSFrameGeneration_K2Node_ComponentBoundEvent_9_IndexHasBeenChanged__DelegateSignature::NewIndex' has a wrong offset!");

// Function W_GraphicsMenu.W_GraphicsMenu_C.BndEvt__W_GraphicsMenu_W_SettingRow_EffectsQuality_K2Node_ComponentBoundEvent_16_IndexHasBeenChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_EffectsQuality_K2Node_ComponentBoundEvent_16_IndexHasBeenChanged__DelegateSignature final
{
public:
	int32                                         NewIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_EffectsQuality_K2Node_ComponentBoundEvent_16_IndexHasBeenChanged__DelegateSignature) == 0x000004, "Wrong alignment on W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_EffectsQuality_K2Node_ComponentBoundEvent_16_IndexHasBeenChanged__DelegateSignature");
static_assert(sizeof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_EffectsQuality_K2Node_ComponentBoundEvent_16_IndexHasBeenChanged__DelegateSignature) == 0x000004, "Wrong size on W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_EffectsQuality_K2Node_ComponentBoundEvent_16_IndexHasBeenChanged__DelegateSignature");
static_assert(offsetof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_EffectsQuality_K2Node_ComponentBoundEvent_16_IndexHasBeenChanged__DelegateSignature, NewIndex) == 0x000000, "Member 'W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_EffectsQuality_K2Node_ComponentBoundEvent_16_IndexHasBeenChanged__DelegateSignature::NewIndex' has a wrong offset!");

// Function W_GraphicsMenu.W_GraphicsMenu_C.BndEvt__W_GraphicsMenu_W_SettingRow_FoliageQuality_K2Node_ComponentBoundEvent_6_IndexHasBeenChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_FoliageQuality_K2Node_ComponentBoundEvent_6_IndexHasBeenChanged__DelegateSignature final
{
public:
	int32                                         NewIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_FoliageQuality_K2Node_ComponentBoundEvent_6_IndexHasBeenChanged__DelegateSignature) == 0x000004, "Wrong alignment on W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_FoliageQuality_K2Node_ComponentBoundEvent_6_IndexHasBeenChanged__DelegateSignature");
static_assert(sizeof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_FoliageQuality_K2Node_ComponentBoundEvent_6_IndexHasBeenChanged__DelegateSignature) == 0x000004, "Wrong size on W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_FoliageQuality_K2Node_ComponentBoundEvent_6_IndexHasBeenChanged__DelegateSignature");
static_assert(offsetof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_FoliageQuality_K2Node_ComponentBoundEvent_6_IndexHasBeenChanged__DelegateSignature, NewIndex) == 0x000000, "Member 'W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_FoliageQuality_K2Node_ComponentBoundEvent_6_IndexHasBeenChanged__DelegateSignature::NewIndex' has a wrong offset!");

// Function W_GraphicsMenu.W_GraphicsMenu_C.BndEvt__W_GraphicsMenu_W_SettingRow_FSR2_K2Node_ComponentBoundEvent_10_IndexHasBeenChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_FSR2_K2Node_ComponentBoundEvent_10_IndexHasBeenChanged__DelegateSignature final
{
public:
	int32                                         NewIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_FSR2_K2Node_ComponentBoundEvent_10_IndexHasBeenChanged__DelegateSignature) == 0x000004, "Wrong alignment on W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_FSR2_K2Node_ComponentBoundEvent_10_IndexHasBeenChanged__DelegateSignature");
static_assert(sizeof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_FSR2_K2Node_ComponentBoundEvent_10_IndexHasBeenChanged__DelegateSignature) == 0x000004, "Wrong size on W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_FSR2_K2Node_ComponentBoundEvent_10_IndexHasBeenChanged__DelegateSignature");
static_assert(offsetof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_FSR2_K2Node_ComponentBoundEvent_10_IndexHasBeenChanged__DelegateSignature, NewIndex) == 0x000000, "Member 'W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_FSR2_K2Node_ComponentBoundEvent_10_IndexHasBeenChanged__DelegateSignature::NewIndex' has a wrong offset!");

// Function W_GraphicsMenu.W_GraphicsMenu_C.BndEvt__W_GraphicsMenu_W_SettingRow_GRAPHICSQUALITY_K2Node_ComponentBoundEvent_13_IndexHasBeenChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_GRAPHICSQUALITY_K2Node_ComponentBoundEvent_13_IndexHasBeenChanged__DelegateSignature final
{
public:
	int32                                         NewIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_GRAPHICSQUALITY_K2Node_ComponentBoundEvent_13_IndexHasBeenChanged__DelegateSignature) == 0x000004, "Wrong alignment on W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_GRAPHICSQUALITY_K2Node_ComponentBoundEvent_13_IndexHasBeenChanged__DelegateSignature");
static_assert(sizeof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_GRAPHICSQUALITY_K2Node_ComponentBoundEvent_13_IndexHasBeenChanged__DelegateSignature) == 0x000004, "Wrong size on W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_GRAPHICSQUALITY_K2Node_ComponentBoundEvent_13_IndexHasBeenChanged__DelegateSignature");
static_assert(offsetof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_GRAPHICSQUALITY_K2Node_ComponentBoundEvent_13_IndexHasBeenChanged__DelegateSignature, NewIndex) == 0x000000, "Member 'W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_GRAPHICSQUALITY_K2Node_ComponentBoundEvent_13_IndexHasBeenChanged__DelegateSignature::NewIndex' has a wrong offset!");

// Function W_GraphicsMenu.W_GraphicsMenu_C.BndEvt__W_GraphicsMenu_W_SettingRow_LightMethod_K2Node_ComponentBoundEvent_5_IndexHasBeenChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_LightMethod_K2Node_ComponentBoundEvent_5_IndexHasBeenChanged__DelegateSignature final
{
public:
	int32                                         NewIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_LightMethod_K2Node_ComponentBoundEvent_5_IndexHasBeenChanged__DelegateSignature) == 0x000004, "Wrong alignment on W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_LightMethod_K2Node_ComponentBoundEvent_5_IndexHasBeenChanged__DelegateSignature");
static_assert(sizeof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_LightMethod_K2Node_ComponentBoundEvent_5_IndexHasBeenChanged__DelegateSignature) == 0x000004, "Wrong size on W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_LightMethod_K2Node_ComponentBoundEvent_5_IndexHasBeenChanged__DelegateSignature");
static_assert(offsetof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_LightMethod_K2Node_ComponentBoundEvent_5_IndexHasBeenChanged__DelegateSignature, NewIndex) == 0x000000, "Member 'W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_LightMethod_K2Node_ComponentBoundEvent_5_IndexHasBeenChanged__DelegateSignature::NewIndex' has a wrong offset!");

// Function W_GraphicsMenu.W_GraphicsMenu_C.BndEvt__W_GraphicsMenu_W_SettingRow_Monitor_K2Node_ComponentBoundEvent_0_IndexHasBeenChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_Monitor_K2Node_ComponentBoundEvent_0_IndexHasBeenChanged__DelegateSignature final
{
public:
	int32                                         NewIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_Monitor_K2Node_ComponentBoundEvent_0_IndexHasBeenChanged__DelegateSignature) == 0x000004, "Wrong alignment on W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_Monitor_K2Node_ComponentBoundEvent_0_IndexHasBeenChanged__DelegateSignature");
static_assert(sizeof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_Monitor_K2Node_ComponentBoundEvent_0_IndexHasBeenChanged__DelegateSignature) == 0x000004, "Wrong size on W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_Monitor_K2Node_ComponentBoundEvent_0_IndexHasBeenChanged__DelegateSignature");
static_assert(offsetof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_Monitor_K2Node_ComponentBoundEvent_0_IndexHasBeenChanged__DelegateSignature, NewIndex) == 0x000000, "Member 'W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_Monitor_K2Node_ComponentBoundEvent_0_IndexHasBeenChanged__DelegateSignature::NewIndex' has a wrong offset!");

// Function W_GraphicsMenu.W_GraphicsMenu_C.BndEvt__W_GraphicsMenu_W_SettingRow_MultyThreading_K2Node_ComponentBoundEvent_4_IndexHasBeenChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_MultyThreading_K2Node_ComponentBoundEvent_4_IndexHasBeenChanged__DelegateSignature final
{
public:
	int32                                         NewIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_MultyThreading_K2Node_ComponentBoundEvent_4_IndexHasBeenChanged__DelegateSignature) == 0x000004, "Wrong alignment on W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_MultyThreading_K2Node_ComponentBoundEvent_4_IndexHasBeenChanged__DelegateSignature");
static_assert(sizeof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_MultyThreading_K2Node_ComponentBoundEvent_4_IndexHasBeenChanged__DelegateSignature) == 0x000004, "Wrong size on W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_MultyThreading_K2Node_ComponentBoundEvent_4_IndexHasBeenChanged__DelegateSignature");
static_assert(offsetof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_MultyThreading_K2Node_ComponentBoundEvent_4_IndexHasBeenChanged__DelegateSignature, NewIndex) == 0x000000, "Member 'W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_MultyThreading_K2Node_ComponentBoundEvent_4_IndexHasBeenChanged__DelegateSignature::NewIndex' has a wrong offset!");

// Function W_GraphicsMenu.W_GraphicsMenu_C.BndEvt__W_GraphicsMenu_W_SettingRow_NIS_K2Node_ComponentBoundEvent_11_IndexHasBeenChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_NIS_K2Node_ComponentBoundEvent_11_IndexHasBeenChanged__DelegateSignature final
{
public:
	int32                                         NewIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_NIS_K2Node_ComponentBoundEvent_11_IndexHasBeenChanged__DelegateSignature) == 0x000004, "Wrong alignment on W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_NIS_K2Node_ComponentBoundEvent_11_IndexHasBeenChanged__DelegateSignature");
static_assert(sizeof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_NIS_K2Node_ComponentBoundEvent_11_IndexHasBeenChanged__DelegateSignature) == 0x000004, "Wrong size on W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_NIS_K2Node_ComponentBoundEvent_11_IndexHasBeenChanged__DelegateSignature");
static_assert(offsetof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_NIS_K2Node_ComponentBoundEvent_11_IndexHasBeenChanged__DelegateSignature, NewIndex) == 0x000000, "Member 'W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_NIS_K2Node_ComponentBoundEvent_11_IndexHasBeenChanged__DelegateSignature::NewIndex' has a wrong offset!");

// Function W_GraphicsMenu.W_GraphicsMenu_C.BndEvt__W_GraphicsMenu_W_SettingRow_PostprocessingQuality_K2Node_ComponentBoundEvent_20_IndexHasBeenChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_PostprocessingQuality_K2Node_ComponentBoundEvent_20_IndexHasBeenChanged__DelegateSignature final
{
public:
	int32                                         NewIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_PostprocessingQuality_K2Node_ComponentBoundEvent_20_IndexHasBeenChanged__DelegateSignature) == 0x000004, "Wrong alignment on W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_PostprocessingQuality_K2Node_ComponentBoundEvent_20_IndexHasBeenChanged__DelegateSignature");
static_assert(sizeof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_PostprocessingQuality_K2Node_ComponentBoundEvent_20_IndexHasBeenChanged__DelegateSignature) == 0x000004, "Wrong size on W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_PostprocessingQuality_K2Node_ComponentBoundEvent_20_IndexHasBeenChanged__DelegateSignature");
static_assert(offsetof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_PostprocessingQuality_K2Node_ComponentBoundEvent_20_IndexHasBeenChanged__DelegateSignature, NewIndex) == 0x000000, "Member 'W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_PostprocessingQuality_K2Node_ComponentBoundEvent_20_IndexHasBeenChanged__DelegateSignature::NewIndex' has a wrong offset!");

// Function W_GraphicsMenu.W_GraphicsMenu_C.BndEvt__W_GraphicsMenu_W_SettingRow_RayTracing_K2Node_ComponentBoundEvent_26_IndexHasBeenChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_RayTracing_K2Node_ComponentBoundEvent_26_IndexHasBeenChanged__DelegateSignature final
{
public:
	int32                                         NewIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_RayTracing_K2Node_ComponentBoundEvent_26_IndexHasBeenChanged__DelegateSignature) == 0x000004, "Wrong alignment on W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_RayTracing_K2Node_ComponentBoundEvent_26_IndexHasBeenChanged__DelegateSignature");
static_assert(sizeof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_RayTracing_K2Node_ComponentBoundEvent_26_IndexHasBeenChanged__DelegateSignature) == 0x000004, "Wrong size on W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_RayTracing_K2Node_ComponentBoundEvent_26_IndexHasBeenChanged__DelegateSignature");
static_assert(offsetof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_RayTracing_K2Node_ComponentBoundEvent_26_IndexHasBeenChanged__DelegateSignature, NewIndex) == 0x000000, "Member 'W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_RayTracing_K2Node_ComponentBoundEvent_26_IndexHasBeenChanged__DelegateSignature::NewIndex' has a wrong offset!");

// Function W_GraphicsMenu.W_GraphicsMenu_C.BndEvt__W_GraphicsMenu_W_SettingRow_ReflectionMethod_K2Node_ComponentBoundEvent_28_IndexHasBeenChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_ReflectionMethod_K2Node_ComponentBoundEvent_28_IndexHasBeenChanged__DelegateSignature final
{
public:
	int32                                         NewIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_ReflectionMethod_K2Node_ComponentBoundEvent_28_IndexHasBeenChanged__DelegateSignature) == 0x000004, "Wrong alignment on W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_ReflectionMethod_K2Node_ComponentBoundEvent_28_IndexHasBeenChanged__DelegateSignature");
static_assert(sizeof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_ReflectionMethod_K2Node_ComponentBoundEvent_28_IndexHasBeenChanged__DelegateSignature) == 0x000004, "Wrong size on W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_ReflectionMethod_K2Node_ComponentBoundEvent_28_IndexHasBeenChanged__DelegateSignature");
static_assert(offsetof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_ReflectionMethod_K2Node_ComponentBoundEvent_28_IndexHasBeenChanged__DelegateSignature, NewIndex) == 0x000000, "Member 'W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_ReflectionMethod_K2Node_ComponentBoundEvent_28_IndexHasBeenChanged__DelegateSignature::NewIndex' has a wrong offset!");

// Function W_GraphicsMenu.W_GraphicsMenu_C.BndEvt__W_GraphicsMenu_W_SettingRow_ReflectionQuality_K2Node_ComponentBoundEvent_3_IndexHasBeenChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_ReflectionQuality_K2Node_ComponentBoundEvent_3_IndexHasBeenChanged__DelegateSignature final
{
public:
	int32                                         NewIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_ReflectionQuality_K2Node_ComponentBoundEvent_3_IndexHasBeenChanged__DelegateSignature) == 0x000004, "Wrong alignment on W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_ReflectionQuality_K2Node_ComponentBoundEvent_3_IndexHasBeenChanged__DelegateSignature");
static_assert(sizeof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_ReflectionQuality_K2Node_ComponentBoundEvent_3_IndexHasBeenChanged__DelegateSignature) == 0x000004, "Wrong size on W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_ReflectionQuality_K2Node_ComponentBoundEvent_3_IndexHasBeenChanged__DelegateSignature");
static_assert(offsetof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_ReflectionQuality_K2Node_ComponentBoundEvent_3_IndexHasBeenChanged__DelegateSignature, NewIndex) == 0x000000, "Member 'W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_ReflectionQuality_K2Node_ComponentBoundEvent_3_IndexHasBeenChanged__DelegateSignature::NewIndex' has a wrong offset!");

// Function W_GraphicsMenu.W_GraphicsMenu_C.BndEvt__W_GraphicsMenu_W_SettingRow_Render_K2Node_ComponentBoundEvent_1_IndexHasBeenChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_Render_K2Node_ComponentBoundEvent_1_IndexHasBeenChanged__DelegateSignature final
{
public:
	int32                                         NewIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_Render_K2Node_ComponentBoundEvent_1_IndexHasBeenChanged__DelegateSignature) == 0x000004, "Wrong alignment on W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_Render_K2Node_ComponentBoundEvent_1_IndexHasBeenChanged__DelegateSignature");
static_assert(sizeof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_Render_K2Node_ComponentBoundEvent_1_IndexHasBeenChanged__DelegateSignature) == 0x000004, "Wrong size on W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_Render_K2Node_ComponentBoundEvent_1_IndexHasBeenChanged__DelegateSignature");
static_assert(offsetof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_Render_K2Node_ComponentBoundEvent_1_IndexHasBeenChanged__DelegateSignature, NewIndex) == 0x000000, "Member 'W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_Render_K2Node_ComponentBoundEvent_1_IndexHasBeenChanged__DelegateSignature::NewIndex' has a wrong offset!");

// Function W_GraphicsMenu.W_GraphicsMenu_C.BndEvt__W_GraphicsMenu_W_SettingRow_Screen_K2Node_ComponentBoundEvent_12_IndexHasBeenChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_Screen_K2Node_ComponentBoundEvent_12_IndexHasBeenChanged__DelegateSignature final
{
public:
	int32                                         NewIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_Screen_K2Node_ComponentBoundEvent_12_IndexHasBeenChanged__DelegateSignature) == 0x000004, "Wrong alignment on W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_Screen_K2Node_ComponentBoundEvent_12_IndexHasBeenChanged__DelegateSignature");
static_assert(sizeof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_Screen_K2Node_ComponentBoundEvent_12_IndexHasBeenChanged__DelegateSignature) == 0x000004, "Wrong size on W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_Screen_K2Node_ComponentBoundEvent_12_IndexHasBeenChanged__DelegateSignature");
static_assert(offsetof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_Screen_K2Node_ComponentBoundEvent_12_IndexHasBeenChanged__DelegateSignature, NewIndex) == 0x000000, "Member 'W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_Screen_K2Node_ComponentBoundEvent_12_IndexHasBeenChanged__DelegateSignature::NewIndex' has a wrong offset!");

// Function W_GraphicsMenu.W_GraphicsMenu_C.BndEvt__W_GraphicsMenu_W_SettingRow_ScreenMode_K2Node_ComponentBoundEvent_14_IndexHasBeenChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_ScreenMode_K2Node_ComponentBoundEvent_14_IndexHasBeenChanged__DelegateSignature final
{
public:
	int32                                         NewIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_ScreenMode_K2Node_ComponentBoundEvent_14_IndexHasBeenChanged__DelegateSignature) == 0x000004, "Wrong alignment on W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_ScreenMode_K2Node_ComponentBoundEvent_14_IndexHasBeenChanged__DelegateSignature");
static_assert(sizeof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_ScreenMode_K2Node_ComponentBoundEvent_14_IndexHasBeenChanged__DelegateSignature) == 0x000004, "Wrong size on W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_ScreenMode_K2Node_ComponentBoundEvent_14_IndexHasBeenChanged__DelegateSignature");
static_assert(offsetof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_ScreenMode_K2Node_ComponentBoundEvent_14_IndexHasBeenChanged__DelegateSignature, NewIndex) == 0x000000, "Member 'W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_ScreenMode_K2Node_ComponentBoundEvent_14_IndexHasBeenChanged__DelegateSignature::NewIndex' has a wrong offset!");

// Function W_GraphicsMenu.W_GraphicsMenu_C.BndEvt__W_GraphicsMenu_W_SettingRow_ShadingQuality_K2Node_ComponentBoundEvent_18_IndexHasBeenChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_ShadingQuality_K2Node_ComponentBoundEvent_18_IndexHasBeenChanged__DelegateSignature final
{
public:
	int32                                         NewIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_ShadingQuality_K2Node_ComponentBoundEvent_18_IndexHasBeenChanged__DelegateSignature) == 0x000004, "Wrong alignment on W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_ShadingQuality_K2Node_ComponentBoundEvent_18_IndexHasBeenChanged__DelegateSignature");
static_assert(sizeof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_ShadingQuality_K2Node_ComponentBoundEvent_18_IndexHasBeenChanged__DelegateSignature) == 0x000004, "Wrong size on W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_ShadingQuality_K2Node_ComponentBoundEvent_18_IndexHasBeenChanged__DelegateSignature");
static_assert(offsetof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_ShadingQuality_K2Node_ComponentBoundEvent_18_IndexHasBeenChanged__DelegateSignature, NewIndex) == 0x000000, "Member 'W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_ShadingQuality_K2Node_ComponentBoundEvent_18_IndexHasBeenChanged__DelegateSignature::NewIndex' has a wrong offset!");

// Function W_GraphicsMenu.W_GraphicsMenu_C.BndEvt__W_GraphicsMenu_W_SettingRow_ShadowQuality_K2Node_ComponentBoundEvent_17_IndexHasBeenChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_ShadowQuality_K2Node_ComponentBoundEvent_17_IndexHasBeenChanged__DelegateSignature final
{
public:
	int32                                         NewIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_ShadowQuality_K2Node_ComponentBoundEvent_17_IndexHasBeenChanged__DelegateSignature) == 0x000004, "Wrong alignment on W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_ShadowQuality_K2Node_ComponentBoundEvent_17_IndexHasBeenChanged__DelegateSignature");
static_assert(sizeof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_ShadowQuality_K2Node_ComponentBoundEvent_17_IndexHasBeenChanged__DelegateSignature) == 0x000004, "Wrong size on W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_ShadowQuality_K2Node_ComponentBoundEvent_17_IndexHasBeenChanged__DelegateSignature");
static_assert(offsetof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_ShadowQuality_K2Node_ComponentBoundEvent_17_IndexHasBeenChanged__DelegateSignature, NewIndex) == 0x000000, "Member 'W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_ShadowQuality_K2Node_ComponentBoundEvent_17_IndexHasBeenChanged__DelegateSignature::NewIndex' has a wrong offset!");

// Function W_GraphicsMenu.W_GraphicsMenu_C.BndEvt__W_GraphicsMenu_W_SettingRow_TextureQuality_K2Node_ComponentBoundEvent_2_IndexHasBeenChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_TextureQuality_K2Node_ComponentBoundEvent_2_IndexHasBeenChanged__DelegateSignature final
{
public:
	int32                                         NewIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_TextureQuality_K2Node_ComponentBoundEvent_2_IndexHasBeenChanged__DelegateSignature) == 0x000004, "Wrong alignment on W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_TextureQuality_K2Node_ComponentBoundEvent_2_IndexHasBeenChanged__DelegateSignature");
static_assert(sizeof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_TextureQuality_K2Node_ComponentBoundEvent_2_IndexHasBeenChanged__DelegateSignature) == 0x000004, "Wrong size on W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_TextureQuality_K2Node_ComponentBoundEvent_2_IndexHasBeenChanged__DelegateSignature");
static_assert(offsetof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_TextureQuality_K2Node_ComponentBoundEvent_2_IndexHasBeenChanged__DelegateSignature, NewIndex) == 0x000000, "Member 'W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_TextureQuality_K2Node_ComponentBoundEvent_2_IndexHasBeenChanged__DelegateSignature::NewIndex' has a wrong offset!");

// Function W_GraphicsMenu.W_GraphicsMenu_C.BndEvt__W_GraphicsMenu_W_SettingRow_ViewDistanceQuality_K2Node_ComponentBoundEvent_7_IndexHasBeenChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_ViewDistanceQuality_K2Node_ComponentBoundEvent_7_IndexHasBeenChanged__DelegateSignature final
{
public:
	int32                                         NewIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_ViewDistanceQuality_K2Node_ComponentBoundEvent_7_IndexHasBeenChanged__DelegateSignature) == 0x000004, "Wrong alignment on W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_ViewDistanceQuality_K2Node_ComponentBoundEvent_7_IndexHasBeenChanged__DelegateSignature");
static_assert(sizeof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_ViewDistanceQuality_K2Node_ComponentBoundEvent_7_IndexHasBeenChanged__DelegateSignature) == 0x000004, "Wrong size on W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_ViewDistanceQuality_K2Node_ComponentBoundEvent_7_IndexHasBeenChanged__DelegateSignature");
static_assert(offsetof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_ViewDistanceQuality_K2Node_ComponentBoundEvent_7_IndexHasBeenChanged__DelegateSignature, NewIndex) == 0x000000, "Member 'W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_ViewDistanceQuality_K2Node_ComponentBoundEvent_7_IndexHasBeenChanged__DelegateSignature::NewIndex' has a wrong offset!");

// Function W_GraphicsMenu.W_GraphicsMenu_C.BndEvt__W_GraphicsMenu_W_SettingRow_VSync_K2Node_ComponentBoundEvent_23_IndexHasBeenChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_VSync_K2Node_ComponentBoundEvent_23_IndexHasBeenChanged__DelegateSignature final
{
public:
	int32                                         NewIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_VSync_K2Node_ComponentBoundEvent_23_IndexHasBeenChanged__DelegateSignature) == 0x000004, "Wrong alignment on W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_VSync_K2Node_ComponentBoundEvent_23_IndexHasBeenChanged__DelegateSignature");
static_assert(sizeof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_VSync_K2Node_ComponentBoundEvent_23_IndexHasBeenChanged__DelegateSignature) == 0x000004, "Wrong size on W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_VSync_K2Node_ComponentBoundEvent_23_IndexHasBeenChanged__DelegateSignature");
static_assert(offsetof(W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_VSync_K2Node_ComponentBoundEvent_23_IndexHasBeenChanged__DelegateSignature, NewIndex) == 0x000000, "Member 'W_GraphicsMenu_C_BndEvt__W_GraphicsMenu_W_SettingRow_VSync_K2Node_ComponentBoundEvent_23_IndexHasBeenChanged__DelegateSignature::NewIndex' has a wrong offset!");

// Function W_GraphicsMenu.W_GraphicsMenu_C.CheckDriverSupport
// 0x0058 (0x0058 - 0x0000)
struct W_GraphicsMenu_C_CheckDriverSupport final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_7;                              // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_8;                              // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_9;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_10;                             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_11;                             // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStreamlineFeatureSupported_ReturnValue; // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStreamlineFeatureSupported_ReturnValue_1; // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNISSupported_ReturnValue;               // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDLSSModeInformation_bIsSupported;      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDLSSModeInformation_OptimalScreenPercentage; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDLSSModeInformation_bIsFixedScreenPercentage; // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDLSSModeInformation_MinScreenPercentage; // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDLSSModeInformation_MaxScreenPercentage; // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDLSSModeInformation_OptimalSharpness;  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival;                  // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USurvivalGameUserSettings*              CallFunc_GetSurvivalUserSettings_ReturnValue;      // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVSyncEnabled_ReturnValue;               // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_1;                           // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_2;                           // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_3;                           // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_GraphicsMenu_C_CheckDriverSupport) == 0x000008, "Wrong alignment on W_GraphicsMenu_C_CheckDriverSupport");
static_assert(sizeof(W_GraphicsMenu_C_CheckDriverSupport) == 0x000058, "Wrong size on W_GraphicsMenu_C_CheckDriverSupport");
static_assert(offsetof(W_GraphicsMenu_C_CheckDriverSupport, Temp_bool_Variable) == 0x000000, "Member 'W_GraphicsMenu_C_CheckDriverSupport::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_GraphicsMenu_C_CheckDriverSupport, Temp_bool_Variable_1) == 0x000001, "Member 'W_GraphicsMenu_C_CheckDriverSupport::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(W_GraphicsMenu_C_CheckDriverSupport, Temp_bool_Variable_2) == 0x000002, "Member 'W_GraphicsMenu_C_CheckDriverSupport::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(W_GraphicsMenu_C_CheckDriverSupport, Temp_bool_Variable_3) == 0x000003, "Member 'W_GraphicsMenu_C_CheckDriverSupport::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(W_GraphicsMenu_C_CheckDriverSupport, Temp_bool_Variable_4) == 0x000004, "Member 'W_GraphicsMenu_C_CheckDriverSupport::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(W_GraphicsMenu_C_CheckDriverSupport, Temp_int_Variable) == 0x000008, "Member 'W_GraphicsMenu_C_CheckDriverSupport::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(W_GraphicsMenu_C_CheckDriverSupport, Temp_bool_Variable_5) == 0x00000C, "Member 'W_GraphicsMenu_C_CheckDriverSupport::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(W_GraphicsMenu_C_CheckDriverSupport, Temp_bool_Variable_6) == 0x00000D, "Member 'W_GraphicsMenu_C_CheckDriverSupport::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(W_GraphicsMenu_C_CheckDriverSupport, Temp_bool_Variable_7) == 0x00000E, "Member 'W_GraphicsMenu_C_CheckDriverSupport::Temp_bool_Variable_7' has a wrong offset!");
static_assert(offsetof(W_GraphicsMenu_C_CheckDriverSupport, Temp_bool_Variable_8) == 0x00000F, "Member 'W_GraphicsMenu_C_CheckDriverSupport::Temp_bool_Variable_8' has a wrong offset!");
static_assert(offsetof(W_GraphicsMenu_C_CheckDriverSupport, Temp_bool_Variable_9) == 0x000010, "Member 'W_GraphicsMenu_C_CheckDriverSupport::Temp_bool_Variable_9' has a wrong offset!");
static_assert(offsetof(W_GraphicsMenu_C_CheckDriverSupport, Temp_bool_Variable_10) == 0x000011, "Member 'W_GraphicsMenu_C_CheckDriverSupport::Temp_bool_Variable_10' has a wrong offset!");
static_assert(offsetof(W_GraphicsMenu_C_CheckDriverSupport, Temp_bool_Variable_11) == 0x000012, "Member 'W_GraphicsMenu_C_CheckDriverSupport::Temp_bool_Variable_11' has a wrong offset!");
static_assert(offsetof(W_GraphicsMenu_C_CheckDriverSupport, CallFunc_IsStreamlineFeatureSupported_ReturnValue) == 0x000013, "Member 'W_GraphicsMenu_C_CheckDriverSupport::CallFunc_IsStreamlineFeatureSupported_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_GraphicsMenu_C_CheckDriverSupport, CallFunc_IsStreamlineFeatureSupported_ReturnValue_1) == 0x000014, "Member 'W_GraphicsMenu_C_CheckDriverSupport::CallFunc_IsStreamlineFeatureSupported_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_GraphicsMenu_C_CheckDriverSupport, CallFunc_IsNISSupported_ReturnValue) == 0x000015, "Member 'W_GraphicsMenu_C_CheckDriverSupport::CallFunc_IsNISSupported_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_GraphicsMenu_C_CheckDriverSupport, CallFunc_GetGameInstance_ReturnValue) == 0x000018, "Member 'W_GraphicsMenu_C_CheckDriverSupport::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_GraphicsMenu_C_CheckDriverSupport, CallFunc_GetDLSSModeInformation_bIsSupported) == 0x000020, "Member 'W_GraphicsMenu_C_CheckDriverSupport::CallFunc_GetDLSSModeInformation_bIsSupported' has a wrong offset!");
static_assert(offsetof(W_GraphicsMenu_C_CheckDriverSupport, CallFunc_GetDLSSModeInformation_OptimalScreenPercentage) == 0x000024, "Member 'W_GraphicsMenu_C_CheckDriverSupport::CallFunc_GetDLSSModeInformation_OptimalScreenPercentage' has a wrong offset!");
static_assert(offsetof(W_GraphicsMenu_C_CheckDriverSupport, CallFunc_GetDLSSModeInformation_bIsFixedScreenPercentage) == 0x000028, "Member 'W_GraphicsMenu_C_CheckDriverSupport::CallFunc_GetDLSSModeInformation_bIsFixedScreenPercentage' has a wrong offset!");
static_assert(offsetof(W_GraphicsMenu_C_CheckDriverSupport, CallFunc_GetDLSSModeInformation_MinScreenPercentage) == 0x00002C, "Member 'W_GraphicsMenu_C_CheckDriverSupport::CallFunc_GetDLSSModeInformation_MinScreenPercentage' has a wrong offset!");
static_assert(offsetof(W_GraphicsMenu_C_CheckDriverSupport, CallFunc_GetDLSSModeInformation_MaxScreenPercentage) == 0x000030, "Member 'W_GraphicsMenu_C_CheckDriverSupport::CallFunc_GetDLSSModeInformation_MaxScreenPercentage' has a wrong offset!");
static_assert(offsetof(W_GraphicsMenu_C_CheckDriverSupport, CallFunc_GetDLSSModeInformation_OptimalSharpness) == 0x000034, "Member 'W_GraphicsMenu_C_CheckDriverSupport::CallFunc_GetDLSSModeInformation_OptimalSharpness' has a wrong offset!");
static_assert(offsetof(W_GraphicsMenu_C_CheckDriverSupport, K2Node_DynamicCast_AsGI_Survival) == 0x000038, "Member 'W_GraphicsMenu_C_CheckDriverSupport::K2Node_DynamicCast_AsGI_Survival' has a wrong offset!");
static_assert(offsetof(W_GraphicsMenu_C_CheckDriverSupport, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'W_GraphicsMenu_C_CheckDriverSupport::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_GraphicsMenu_C_CheckDriverSupport, CallFunc_GetSurvivalUserSettings_ReturnValue) == 0x000048, "Member 'W_GraphicsMenu_C_CheckDriverSupport::CallFunc_GetSurvivalUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_GraphicsMenu_C_CheckDriverSupport, CallFunc_IsVSyncEnabled_ReturnValue) == 0x000050, "Member 'W_GraphicsMenu_C_CheckDriverSupport::CallFunc_IsVSyncEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_GraphicsMenu_C_CheckDriverSupport, K2Node_Select_Default) == 0x000051, "Member 'W_GraphicsMenu_C_CheckDriverSupport::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_GraphicsMenu_C_CheckDriverSupport, K2Node_Select_Default_1) == 0x000052, "Member 'W_GraphicsMenu_C_CheckDriverSupport::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(W_GraphicsMenu_C_CheckDriverSupport, K2Node_Select_Default_2) == 0x000053, "Member 'W_GraphicsMenu_C_CheckDriverSupport::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(W_GraphicsMenu_C_CheckDriverSupport, K2Node_Select_Default_3) == 0x000054, "Member 'W_GraphicsMenu_C_CheckDriverSupport::K2Node_Select_Default_3' has a wrong offset!");

// Function W_GraphicsMenu.W_GraphicsMenu_C.CheckForConflicts
// 0x0048 (0x0048 - 0x0000)
struct W_GraphicsMenu_C_CheckForConflicts final
{
public:
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival_1;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_2;            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival_2;                // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_GraphicsMenu_C_CheckForConflicts) == 0x000008, "Wrong alignment on W_GraphicsMenu_C_CheckForConflicts");
static_assert(sizeof(W_GraphicsMenu_C_CheckForConflicts) == 0x000048, "Wrong size on W_GraphicsMenu_C_CheckForConflicts");
static_assert(offsetof(W_GraphicsMenu_C_CheckForConflicts, CallFunc_GetGameInstance_ReturnValue) == 0x000000, "Member 'W_GraphicsMenu_C_CheckForConflicts::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_GraphicsMenu_C_CheckForConflicts, K2Node_DynamicCast_AsGI_Survival) == 0x000008, "Member 'W_GraphicsMenu_C_CheckForConflicts::K2Node_DynamicCast_AsGI_Survival' has a wrong offset!");
static_assert(offsetof(W_GraphicsMenu_C_CheckForConflicts, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'W_GraphicsMenu_C_CheckForConflicts::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_GraphicsMenu_C_CheckForConflicts, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000011, "Member 'W_GraphicsMenu_C_CheckForConflicts::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_GraphicsMenu_C_CheckForConflicts, CallFunc_GetGameInstance_ReturnValue_1) == 0x000018, "Member 'W_GraphicsMenu_C_CheckForConflicts::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_GraphicsMenu_C_CheckForConflicts, K2Node_DynamicCast_AsGI_Survival_1) == 0x000020, "Member 'W_GraphicsMenu_C_CheckForConflicts::K2Node_DynamicCast_AsGI_Survival_1' has a wrong offset!");
static_assert(offsetof(W_GraphicsMenu_C_CheckForConflicts, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'W_GraphicsMenu_C_CheckForConflicts::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_GraphicsMenu_C_CheckForConflicts, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000029, "Member 'W_GraphicsMenu_C_CheckForConflicts::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_GraphicsMenu_C_CheckForConflicts, CallFunc_Not_PreBool_ReturnValue) == 0x00002A, "Member 'W_GraphicsMenu_C_CheckForConflicts::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_GraphicsMenu_C_CheckForConflicts, CallFunc_GetGameInstance_ReturnValue_2) == 0x000030, "Member 'W_GraphicsMenu_C_CheckForConflicts::CallFunc_GetGameInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_GraphicsMenu_C_CheckForConflicts, K2Node_DynamicCast_AsGI_Survival_2) == 0x000038, "Member 'W_GraphicsMenu_C_CheckForConflicts::K2Node_DynamicCast_AsGI_Survival_2' has a wrong offset!");
static_assert(offsetof(W_GraphicsMenu_C_CheckForConflicts, K2Node_DynamicCast_bSuccess_2) == 0x000040, "Member 'W_GraphicsMenu_C_CheckForConflicts::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(W_GraphicsMenu_C_CheckForConflicts, CallFunc_BooleanAND_ReturnValue) == 0x000041, "Member 'W_GraphicsMenu_C_CheckForConflicts::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_GraphicsMenu_C_CheckForConflicts, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x000042, "Member 'W_GraphicsMenu_C_CheckForConflicts::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
