#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_GymBar

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "E_Training_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_GymBar.W_GymBar_C
// 0x0078 (0x02F8 - 0x0280)
class UW_GymBar_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UProgressBar*                           ProgressBar;                                       // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_ProgressBar;                               // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Interact_C*                          W_Interact;                                        // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FTimerHandle                           Timer;                                             // 0x02A0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Temp;                                              // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnCloseWGymBar;                                    // 0x02B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	double                                        CurrentHoldTime;                                   // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanUpdateInteract;                                 // 0x02C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      As_Survival_Player;                                // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnHoldButton;                                      // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FTimerHandle                           TimerHold;                                         // 0x02E8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	E_Training                                    Training_Type;                                     // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Destruct();
	void ExecuteUbergraph_W_GymBar(int32 EntryPoint);
	void FillProgressBar(double In_Percent);
	void FillProgressBar_();
	void Init(E_Training TrainingType);
	void InitStartInteract();
	void InitStopInteract();
	void LateInteractCancel();
	void LateInteractFinish();
	void LateInteractStart();
	void OnCloseWGymBar_();
	void OnCloseWGymBar__DelegateSignature();
	void OnHoldButton_();
	void OnHoldButton__DelegateSignature();
	void PreConstruct(bool IsDesignTime);
	void UpdateInteractProgressBar();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_GymBar_C">();
	}
	static class UW_GymBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_GymBar_C>();
	}
};
static_assert(alignof(UW_GymBar_C) == 0x000008, "Wrong alignment on UW_GymBar_C");
static_assert(sizeof(UW_GymBar_C) == 0x0002F8, "Wrong size on UW_GymBar_C");
static_assert(offsetof(UW_GymBar_C, UberGraphFrame) == 0x000280, "Member 'UW_GymBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_GymBar_C, ProgressBar) == 0x000288, "Member 'UW_GymBar_C::ProgressBar' has a wrong offset!");
static_assert(offsetof(UW_GymBar_C, SizeBox_ProgressBar) == 0x000290, "Member 'UW_GymBar_C::SizeBox_ProgressBar' has a wrong offset!");
static_assert(offsetof(UW_GymBar_C, W_Interact) == 0x000298, "Member 'UW_GymBar_C::W_Interact' has a wrong offset!");
static_assert(offsetof(UW_GymBar_C, Timer) == 0x0002A0, "Member 'UW_GymBar_C::Timer' has a wrong offset!");
static_assert(offsetof(UW_GymBar_C, Temp) == 0x0002A8, "Member 'UW_GymBar_C::Temp' has a wrong offset!");
static_assert(offsetof(UW_GymBar_C, OnCloseWGymBar) == 0x0002B0, "Member 'UW_GymBar_C::OnCloseWGymBar' has a wrong offset!");
static_assert(offsetof(UW_GymBar_C, CurrentHoldTime) == 0x0002C0, "Member 'UW_GymBar_C::CurrentHoldTime' has a wrong offset!");
static_assert(offsetof(UW_GymBar_C, CanUpdateInteract) == 0x0002C8, "Member 'UW_GymBar_C::CanUpdateInteract' has a wrong offset!");
static_assert(offsetof(UW_GymBar_C, As_Survival_Player) == 0x0002D0, "Member 'UW_GymBar_C::As_Survival_Player' has a wrong offset!");
static_assert(offsetof(UW_GymBar_C, OnHoldButton) == 0x0002D8, "Member 'UW_GymBar_C::OnHoldButton' has a wrong offset!");
static_assert(offsetof(UW_GymBar_C, TimerHold) == 0x0002E8, "Member 'UW_GymBar_C::TimerHold' has a wrong offset!");
static_assert(offsetof(UW_GymBar_C, Training_Type) == 0x0002F0, "Member 'UW_GymBar_C::Training_Type' has a wrong offset!");

}

