#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_GymBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_Training_structs.hpp"


namespace SDK::Params
{

// Function W_GymBar.W_GymBar_C.ExecuteUbergraph_W_GymBar
// 0x0158 (0x0158 - 0x0000)
struct W_GymBar_C_ExecuteUbergraph_W_GymBar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0008(0x0018)()
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Training                                    K2Node_CustomEvent_TrainingType;                   // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_V2_C*                   K2Node_DynamicCast_AsSurvival_Player_V2;           // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0070(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x008C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x009C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_1;                 // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_1;        // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_V2_C*                   K2Node_DynamicCast_AsSurvival_Player_V2_1;         // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00DC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x00EC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0100(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10A[0x6];                                      // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0110(0x0018)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameHUD_C>        K2Node_DynamicCast_AsBPI_Game_HUD;                 // 0x0138(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_PlayerMain_C*                      CallFunc_GetGUI_GUI;                               // 0x0150(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_GymBar_C_ExecuteUbergraph_W_GymBar) == 0x000008, "Wrong alignment on W_GymBar_C_ExecuteUbergraph_W_GymBar");
static_assert(sizeof(W_GymBar_C_ExecuteUbergraph_W_GymBar) == 0x000158, "Wrong size on W_GymBar_C_ExecuteUbergraph_W_GymBar");
static_assert(offsetof(W_GymBar_C_ExecuteUbergraph_W_GymBar, EntryPoint) == 0x000000, "Member 'W_GymBar_C_ExecuteUbergraph_W_GymBar::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_GymBar_C_ExecuteUbergraph_W_GymBar, CallFunc_MakeLiteralText_ReturnValue) == 0x000008, "Member 'W_GymBar_C_ExecuteUbergraph_W_GymBar::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_GymBar_C_ExecuteUbergraph_W_GymBar, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000020, "Member 'W_GymBar_C_ExecuteUbergraph_W_GymBar::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_GymBar_C_ExecuteUbergraph_W_GymBar, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000028, "Member 'W_GymBar_C_ExecuteUbergraph_W_GymBar::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_GymBar_C_ExecuteUbergraph_W_GymBar, K2Node_CustomEvent_TrainingType) == 0x000029, "Member 'W_GymBar_C_ExecuteUbergraph_W_GymBar::K2Node_CustomEvent_TrainingType' has a wrong offset!");
static_assert(offsetof(W_GymBar_C_ExecuteUbergraph_W_GymBar, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000030, "Member 'W_GymBar_C_ExecuteUbergraph_W_GymBar::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_GymBar_C_ExecuteUbergraph_W_GymBar, CallFunc_GetPlayerController_ReturnValue) == 0x000038, "Member 'W_GymBar_C_ExecuteUbergraph_W_GymBar::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_GymBar_C_ExecuteUbergraph_W_GymBar, CallFunc_K2_GetPawn_ReturnValue) == 0x000040, "Member 'W_GymBar_C_ExecuteUbergraph_W_GymBar::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_GymBar_C_ExecuteUbergraph_W_GymBar, CallFunc_IsLocallyControlled_ReturnValue) == 0x000048, "Member 'W_GymBar_C_ExecuteUbergraph_W_GymBar::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_GymBar_C_ExecuteUbergraph_W_GymBar, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000050, "Member 'W_GymBar_C_ExecuteUbergraph_W_GymBar::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_GymBar_C_ExecuteUbergraph_W_GymBar, K2Node_DynamicCast_AsSurvival_Player_V2) == 0x000058, "Member 'W_GymBar_C_ExecuteUbergraph_W_GymBar::K2Node_DynamicCast_AsSurvival_Player_V2' has a wrong offset!");
static_assert(offsetof(W_GymBar_C_ExecuteUbergraph_W_GymBar, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'W_GymBar_C_ExecuteUbergraph_W_GymBar::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_GymBar_C_ExecuteUbergraph_W_GymBar, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000068, "Member 'W_GymBar_C_ExecuteUbergraph_W_GymBar::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_GymBar_C_ExecuteUbergraph_W_GymBar, K2Node_CreateDelegate_OutputDelegate) == 0x000070, "Member 'W_GymBar_C_ExecuteUbergraph_W_GymBar::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_GymBar_C_ExecuteUbergraph_W_GymBar, K2Node_DynamicCast_AsSurvival_Player) == 0x000080, "Member 'W_GymBar_C_ExecuteUbergraph_W_GymBar::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(W_GymBar_C_ExecuteUbergraph_W_GymBar, K2Node_DynamicCast_bSuccess_1) == 0x000088, "Member 'W_GymBar_C_ExecuteUbergraph_W_GymBar::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_GymBar_C_ExecuteUbergraph_W_GymBar, K2Node_CreateDelegate_OutputDelegate_1) == 0x00008C, "Member 'W_GymBar_C_ExecuteUbergraph_W_GymBar::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(W_GymBar_C_ExecuteUbergraph_W_GymBar, K2Node_CreateDelegate_OutputDelegate_2) == 0x00009C, "Member 'W_GymBar_C_ExecuteUbergraph_W_GymBar::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(W_GymBar_C_ExecuteUbergraph_W_GymBar, CallFunc_GetPlayerController_ReturnValue_1) == 0x0000B0, "Member 'W_GymBar_C_ExecuteUbergraph_W_GymBar::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_GymBar_C_ExecuteUbergraph_W_GymBar, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x0000B8, "Member 'W_GymBar_C_ExecuteUbergraph_W_GymBar::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_GymBar_C_ExecuteUbergraph_W_GymBar, CallFunc_K2_GetPawn_ReturnValue_1) == 0x0000C0, "Member 'W_GymBar_C_ExecuteUbergraph_W_GymBar::CallFunc_K2_GetPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_GymBar_C_ExecuteUbergraph_W_GymBar, CallFunc_IsLocallyControlled_ReturnValue_1) == 0x0000C8, "Member 'W_GymBar_C_ExecuteUbergraph_W_GymBar::CallFunc_IsLocallyControlled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_GymBar_C_ExecuteUbergraph_W_GymBar, K2Node_DynamicCast_AsSurvival_Player_V2_1) == 0x0000D0, "Member 'W_GymBar_C_ExecuteUbergraph_W_GymBar::K2Node_DynamicCast_AsSurvival_Player_V2_1' has a wrong offset!");
static_assert(offsetof(W_GymBar_C_ExecuteUbergraph_W_GymBar, K2Node_DynamicCast_bSuccess_2) == 0x0000D8, "Member 'W_GymBar_C_ExecuteUbergraph_W_GymBar::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(W_GymBar_C_ExecuteUbergraph_W_GymBar, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000DC, "Member 'W_GymBar_C_ExecuteUbergraph_W_GymBar::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(W_GymBar_C_ExecuteUbergraph_W_GymBar, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000EC, "Member 'W_GymBar_C_ExecuteUbergraph_W_GymBar::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(W_GymBar_C_ExecuteUbergraph_W_GymBar, CallFunc_IsValid_ReturnValue) == 0x0000FC, "Member 'W_GymBar_C_ExecuteUbergraph_W_GymBar::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_GymBar_C_ExecuteUbergraph_W_GymBar, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000100, "Member 'W_GymBar_C_ExecuteUbergraph_W_GymBar::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_GymBar_C_ExecuteUbergraph_W_GymBar, K2Node_Event_IsDesignTime) == 0x000108, "Member 'W_GymBar_C_ExecuteUbergraph_W_GymBar::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_GymBar_C_ExecuteUbergraph_W_GymBar, K2Node_SwitchEnum_CmpSuccess) == 0x000109, "Member 'W_GymBar_C_ExecuteUbergraph_W_GymBar::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_GymBar_C_ExecuteUbergraph_W_GymBar, CallFunc_MakeLiteralText_ReturnValue_1) == 0x000110, "Member 'W_GymBar_C_ExecuteUbergraph_W_GymBar::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_GymBar_C_ExecuteUbergraph_W_GymBar, CallFunc_GetPlayerController_ReturnValue_2) == 0x000128, "Member 'W_GymBar_C_ExecuteUbergraph_W_GymBar::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_GymBar_C_ExecuteUbergraph_W_GymBar, CallFunc_GetHUD_ReturnValue) == 0x000130, "Member 'W_GymBar_C_ExecuteUbergraph_W_GymBar::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_GymBar_C_ExecuteUbergraph_W_GymBar, K2Node_DynamicCast_AsBPI_Game_HUD) == 0x000138, "Member 'W_GymBar_C_ExecuteUbergraph_W_GymBar::K2Node_DynamicCast_AsBPI_Game_HUD' has a wrong offset!");
static_assert(offsetof(W_GymBar_C_ExecuteUbergraph_W_GymBar, K2Node_DynamicCast_bSuccess_3) == 0x000148, "Member 'W_GymBar_C_ExecuteUbergraph_W_GymBar::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(W_GymBar_C_ExecuteUbergraph_W_GymBar, CallFunc_GetGUI_GUI) == 0x000150, "Member 'W_GymBar_C_ExecuteUbergraph_W_GymBar::CallFunc_GetGUI_GUI' has a wrong offset!");

// Function W_GymBar.W_GymBar_C.FillProgressBar
// 0x0018 (0x0018 - 0x0000)
struct W_GymBar_C_FillProgressBar final
{
public:
	double                                        In_Percent;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NormalizeToRange_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_GymBar_C_FillProgressBar) == 0x000008, "Wrong alignment on W_GymBar_C_FillProgressBar");
static_assert(sizeof(W_GymBar_C_FillProgressBar) == 0x000018, "Wrong size on W_GymBar_C_FillProgressBar");
static_assert(offsetof(W_GymBar_C_FillProgressBar, In_Percent) == 0x000000, "Member 'W_GymBar_C_FillProgressBar::In_Percent' has a wrong offset!");
static_assert(offsetof(W_GymBar_C_FillProgressBar, CallFunc_NormalizeToRange_ReturnValue) == 0x000008, "Member 'W_GymBar_C_FillProgressBar::CallFunc_NormalizeToRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_GymBar_C_FillProgressBar, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x000010, "Member 'W_GymBar_C_FillProgressBar::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");

// Function W_GymBar.W_GymBar_C.Init
// 0x0001 (0x0001 - 0x0000)
struct W_GymBar_C_Init final
{
public:
	E_Training                                    TrainingType;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_GymBar_C_Init) == 0x000001, "Wrong alignment on W_GymBar_C_Init");
static_assert(sizeof(W_GymBar_C_Init) == 0x000001, "Wrong size on W_GymBar_C_Init");
static_assert(offsetof(W_GymBar_C_Init, TrainingType) == 0x000000, "Member 'W_GymBar_C_Init::TrainingType' has a wrong offset!");

// Function W_GymBar.W_GymBar_C.OnHoldButton 
// 0x0018 (0x0018 - 0x0000)
struct W_GymBar_C_OnHoldButton_ final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_GymBar_C_OnHoldButton_) == 0x000008, "Wrong alignment on W_GymBar_C_OnHoldButton_");
static_assert(sizeof(W_GymBar_C_OnHoldButton_) == 0x000018, "Wrong size on W_GymBar_C_OnHoldButton_");
static_assert(offsetof(W_GymBar_C_OnHoldButton_, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'W_GymBar_C_OnHoldButton_::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_GymBar_C_OnHoldButton_, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000010, "Member 'W_GymBar_C_OnHoldButton_::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function W_GymBar.W_GymBar_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_GymBar_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_GymBar_C_PreConstruct) == 0x000001, "Wrong alignment on W_GymBar_C_PreConstruct");
static_assert(sizeof(W_GymBar_C_PreConstruct) == 0x000001, "Wrong size on W_GymBar_C_PreConstruct");
static_assert(offsetof(W_GymBar_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_GymBar_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

