#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_HintButtonCircular

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_HintButtonCircular.W_HintButtonCircular_C.ExecuteUbergraph_W_HintButtonCircular
// 0x0120 (0x0120 - 0x0000)
struct W_HintButtonCircular_C_ExecuteUbergraph_W_HintButtonCircular final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_MakeBrushFromSprite_ReturnValue;          // 0x0030(0x00D0)()
	double                                        K2Node_CustomEvent_PlaybackSpeed;                  // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimationForward_PlaybackSpeed_ImplicitCast; // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_HintButtonCircular_C_ExecuteUbergraph_W_HintButtonCircular) == 0x000010, "Wrong alignment on W_HintButtonCircular_C_ExecuteUbergraph_W_HintButtonCircular");
static_assert(sizeof(W_HintButtonCircular_C_ExecuteUbergraph_W_HintButtonCircular) == 0x000120, "Wrong size on W_HintButtonCircular_C_ExecuteUbergraph_W_HintButtonCircular");
static_assert(offsetof(W_HintButtonCircular_C_ExecuteUbergraph_W_HintButtonCircular, EntryPoint) == 0x000000, "Member 'W_HintButtonCircular_C_ExecuteUbergraph_W_HintButtonCircular::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_HintButtonCircular_C_ExecuteUbergraph_W_HintButtonCircular, K2Node_Event_IsDesignTime) == 0x000004, "Member 'W_HintButtonCircular_C_ExecuteUbergraph_W_HintButtonCircular::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_HintButtonCircular_C_ExecuteUbergraph_W_HintButtonCircular, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'W_HintButtonCircular_C_ExecuteUbergraph_W_HintButtonCircular::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_HintButtonCircular_C_ExecuteUbergraph_W_HintButtonCircular, CallFunc_BreakVector2D_X) == 0x000010, "Member 'W_HintButtonCircular_C_ExecuteUbergraph_W_HintButtonCircular::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(W_HintButtonCircular_C_ExecuteUbergraph_W_HintButtonCircular, CallFunc_BreakVector2D_Y) == 0x000018, "Member 'W_HintButtonCircular_C_ExecuteUbergraph_W_HintButtonCircular::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(W_HintButtonCircular_C_ExecuteUbergraph_W_HintButtonCircular, CallFunc_FTrunc_ReturnValue) == 0x000020, "Member 'W_HintButtonCircular_C_ExecuteUbergraph_W_HintButtonCircular::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_HintButtonCircular_C_ExecuteUbergraph_W_HintButtonCircular, CallFunc_FTrunc_ReturnValue_1) == 0x000024, "Member 'W_HintButtonCircular_C_ExecuteUbergraph_W_HintButtonCircular::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_HintButtonCircular_C_ExecuteUbergraph_W_HintButtonCircular, CallFunc_MakeBrushFromSprite_ReturnValue) == 0x000030, "Member 'W_HintButtonCircular_C_ExecuteUbergraph_W_HintButtonCircular::CallFunc_MakeBrushFromSprite_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_HintButtonCircular_C_ExecuteUbergraph_W_HintButtonCircular, K2Node_CustomEvent_PlaybackSpeed) == 0x000100, "Member 'W_HintButtonCircular_C_ExecuteUbergraph_W_HintButtonCircular::K2Node_CustomEvent_PlaybackSpeed' has a wrong offset!");
static_assert(offsetof(W_HintButtonCircular_C_ExecuteUbergraph_W_HintButtonCircular, CallFunc_PlayAnimationForward_ReturnValue) == 0x000108, "Member 'W_HintButtonCircular_C_ExecuteUbergraph_W_HintButtonCircular::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_HintButtonCircular_C_ExecuteUbergraph_W_HintButtonCircular, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000110, "Member 'W_HintButtonCircular_C_ExecuteUbergraph_W_HintButtonCircular::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_HintButtonCircular_C_ExecuteUbergraph_W_HintButtonCircular, CallFunc_PlayAnimationForward_PlaybackSpeed_ImplicitCast) == 0x000118, "Member 'W_HintButtonCircular_C_ExecuteUbergraph_W_HintButtonCircular::CallFunc_PlayAnimationForward_PlaybackSpeed_ImplicitCast' has a wrong offset!");

// Function W_HintButtonCircular.W_HintButtonCircular_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_HintButtonCircular_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_HintButtonCircular_C_PreConstruct) == 0x000001, "Wrong alignment on W_HintButtonCircular_C_PreConstruct");
static_assert(sizeof(W_HintButtonCircular_C_PreConstruct) == 0x000001, "Wrong size on W_HintButtonCircular_C_PreConstruct");
static_assert(offsetof(W_HintButtonCircular_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_HintButtonCircular_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_HintButtonCircular.W_HintButtonCircular_C.StartFilling
// 0x0008 (0x0008 - 0x0000)
struct W_HintButtonCircular_C_StartFilling final
{
public:
	double                                        PlaybackSpeed;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_HintButtonCircular_C_StartFilling) == 0x000008, "Wrong alignment on W_HintButtonCircular_C_StartFilling");
static_assert(sizeof(W_HintButtonCircular_C_StartFilling) == 0x000008, "Wrong size on W_HintButtonCircular_C_StartFilling");
static_assert(offsetof(W_HintButtonCircular_C_StartFilling, PlaybackSpeed) == 0x000000, "Member 'W_HintButtonCircular_C_StartFilling::PlaybackSpeed' has a wrong offset!");

}

