#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_HouseShopCategory

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function W_HouseShopCategory.W_HouseShopCategory_C.ButtonToggle
// 0x0001 (0x0001 - 0x0000)
struct W_HouseShopCategory_C_ButtonToggle final
{
public:
	bool                                          Is_Enabled;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_HouseShopCategory_C_ButtonToggle) == 0x000001, "Wrong alignment on W_HouseShopCategory_C_ButtonToggle");
static_assert(sizeof(W_HouseShopCategory_C_ButtonToggle) == 0x000001, "Wrong size on W_HouseShopCategory_C_ButtonToggle");
static_assert(offsetof(W_HouseShopCategory_C_ButtonToggle, Is_Enabled) == 0x000000, "Member 'W_HouseShopCategory_C_ButtonToggle::Is_Enabled' has a wrong offset!");

// Function W_HouseShopCategory.W_HouseShopCategory_C.ExecuteUbergraph_W_HouseShopCategory
// 0x0020 (0x0020 - 0x0000)
struct W_HouseShopCategory_C_ExecuteUbergraph_W_HouseShopCategory final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0008(0x0018)()
};
static_assert(alignof(W_HouseShopCategory_C_ExecuteUbergraph_W_HouseShopCategory) == 0x000008, "Wrong alignment on W_HouseShopCategory_C_ExecuteUbergraph_W_HouseShopCategory");
static_assert(sizeof(W_HouseShopCategory_C_ExecuteUbergraph_W_HouseShopCategory) == 0x000020, "Wrong size on W_HouseShopCategory_C_ExecuteUbergraph_W_HouseShopCategory");
static_assert(offsetof(W_HouseShopCategory_C_ExecuteUbergraph_W_HouseShopCategory, EntryPoint) == 0x000000, "Member 'W_HouseShopCategory_C_ExecuteUbergraph_W_HouseShopCategory::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_HouseShopCategory_C_ExecuteUbergraph_W_HouseShopCategory, K2Node_Event_IsDesignTime) == 0x000004, "Member 'W_HouseShopCategory_C_ExecuteUbergraph_W_HouseShopCategory::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_HouseShopCategory_C_ExecuteUbergraph_W_HouseShopCategory, CallFunc_GetText_ReturnValue) == 0x000008, "Member 'W_HouseShopCategory_C_ExecuteUbergraph_W_HouseShopCategory::CallFunc_GetText_ReturnValue' has a wrong offset!");

// Function W_HouseShopCategory.W_HouseShopCategory_C.Hovered
// 0x0010 (0x0010 - 0x0000)
struct W_HouseShopCategory_C_Hovered final
{
public:
	bool                                          Param_Hovered;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          With_Anim;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_HouseShopCategory_C_Hovered) == 0x000008, "Wrong alignment on W_HouseShopCategory_C_Hovered");
static_assert(sizeof(W_HouseShopCategory_C_Hovered) == 0x000010, "Wrong size on W_HouseShopCategory_C_Hovered");
static_assert(offsetof(W_HouseShopCategory_C_Hovered, Param_Hovered) == 0x000000, "Member 'W_HouseShopCategory_C_Hovered::Param_Hovered' has a wrong offset!");
static_assert(offsetof(W_HouseShopCategory_C_Hovered, With_Anim) == 0x000001, "Member 'W_HouseShopCategory_C_Hovered::With_Anim' has a wrong offset!");
static_assert(offsetof(W_HouseShopCategory_C_Hovered, Temp_bool_Variable) == 0x000002, "Member 'W_HouseShopCategory_C_Hovered::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_HouseShopCategory_C_Hovered, Temp_byte_Variable) == 0x000003, "Member 'W_HouseShopCategory_C_Hovered::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_HouseShopCategory_C_Hovered, Temp_byte_Variable_1) == 0x000004, "Member 'W_HouseShopCategory_C_Hovered::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_HouseShopCategory_C_Hovered, K2Node_Select_Default) == 0x000005, "Member 'W_HouseShopCategory_C_Hovered::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_HouseShopCategory_C_Hovered, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'W_HouseShopCategory_C_Hovered::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function W_HouseShopCategory.W_HouseShopCategory_C.OnHouseCategorySelected__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct W_HouseShopCategory_C_OnHouseCategorySelected__DelegateSignature final
{
public:
	class FText                                   NewSelectedCategoryName;                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UW_HouseShopCategory_C*                 ShopCategory;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_HouseShopCategory_C_OnHouseCategorySelected__DelegateSignature) == 0x000008, "Wrong alignment on W_HouseShopCategory_C_OnHouseCategorySelected__DelegateSignature");
static_assert(sizeof(W_HouseShopCategory_C_OnHouseCategorySelected__DelegateSignature) == 0x000020, "Wrong size on W_HouseShopCategory_C_OnHouseCategorySelected__DelegateSignature");
static_assert(offsetof(W_HouseShopCategory_C_OnHouseCategorySelected__DelegateSignature, NewSelectedCategoryName) == 0x000000, "Member 'W_HouseShopCategory_C_OnHouseCategorySelected__DelegateSignature::NewSelectedCategoryName' has a wrong offset!");
static_assert(offsetof(W_HouseShopCategory_C_OnHouseCategorySelected__DelegateSignature, ShopCategory) == 0x000018, "Member 'W_HouseShopCategory_C_OnHouseCategorySelected__DelegateSignature::ShopCategory' has a wrong offset!");

// Function W_HouseShopCategory.W_HouseShopCategory_C.Selected
// 0x0001 (0x0001 - 0x0000)
struct W_HouseShopCategory_C_Selected final
{
public:
	bool                                          Param_Selected;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_HouseShopCategory_C_Selected) == 0x000001, "Wrong alignment on W_HouseShopCategory_C_Selected");
static_assert(sizeof(W_HouseShopCategory_C_Selected) == 0x000001, "Wrong size on W_HouseShopCategory_C_Selected");
static_assert(offsetof(W_HouseShopCategory_C_Selected, Param_Selected) == 0x000000, "Member 'W_HouseShopCategory_C_Selected::Param_Selected' has a wrong offset!");

// Function W_HouseShopCategory.W_HouseShopCategory_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_HouseShopCategory_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_HouseShopCategory_C_PreConstruct) == 0x000001, "Wrong alignment on W_HouseShopCategory_C_PreConstruct");
static_assert(sizeof(W_HouseShopCategory_C_PreConstruct) == 0x000001, "Wrong size on W_HouseShopCategory_C_PreConstruct");
static_assert(offsetof(W_HouseShopCategory_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_HouseShopCategory_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

