#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_HouseShopSlot

#include "Basic.hpp"

#include "FItemInfo_structs.hpp"
#include "ContainerPickupsInfo_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FMODStudio_structs.hpp"


namespace SDK::Params
{

// Function W_HouseShopSlot.W_HouseShopSlot_C.ExecuteUbergraph_W_HouseShopSlot
// 0x0CB8 (0x0CB8 - 0x0000)
struct W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0008(0x0018)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFItemInfo                             CallFunc_GetDataTableRowFromName_OutRow;           // 0x0030(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0258(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_479[0x7];                                      // 0x0479(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0480(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0488(0x0050)(HasGetValueTypeHash)
	class UWBP_CarShopAcceptBuyWindow_C*          CallFunc_Create_ReturnValue;                       // 0x04D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x04E0(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0530(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0540(0x0018)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0558(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0568(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0578(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC;                  // 0x0580(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0590(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_591[0x7];                                      // 0x0591(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      CallFunc_GetPlayerRef_SurvivalPlayer;              // 0x0598(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x05A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x05B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x05B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B5[0x3];                                      // 0x05B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x05B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_CarShopAcceptBuyWindow_C*          CallFunc_Create_ReturnValue_1;                     // 0x05C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x05C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x05D8(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0628(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0678(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0688(0x0018)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x06A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x06A8(0x0018)(ConstParm)
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC_1;                // 0x06C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x06D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D1[0x7];                                      // 0x06D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      CallFunc_GetPlayerRef_SurvivalPlayer_1;            // 0x06D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x06E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x06F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F4[0x4];                                      // 0x06F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FContainerPickupsInfo>          K2Node_MakeArray_Array_2;                          // 0x06F8(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FFItemInfo                             K2Node_SetFieldsInStruct_StructOut;                // 0x0708(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_JSAddItem_Ad;                             // 0x0928(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_929[0x3];                                      // 0x0929(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x092C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_93C[0x4];                                      // 0x093C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFItemInfo>                     K2Node_MakeArray_Array_3;                          // 0x0940(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_CanAddItems_Can;                          // 0x0950(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_951[0x3];                                      // 0x0951(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_CanAddItems_ItemsLeft;                    // 0x0954(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0958(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC_2;                // 0x0960(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0970(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_971[0x7];                                      // 0x0971(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_1;                              // 0x0978(0x0018)(ConstParm)
	class ASurvivalPlayer_C*                      CallFunc_GetPlayerRef_SurvivalPlayer_2;            // 0x0990(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0998(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_2;                     // 0x09A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9AC[0x4];                                      // 0x09AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             K2Node_SetFieldsInStruct_StructOut_1;              // 0x09B0(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFItemInfo>                     K2Node_MakeArray_Array_4;                          // 0x0BD0(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_CanAddItems_Can_1;                        // 0x0BE0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BE1[0x3];                                      // 0x0BE1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_CanAddItems_ItemsLeft_1;                  // 0x0BE4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0BE8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0BE9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BEA[0x6];                                      // 0x0BEA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0BF0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0BF8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_Test_C*                 K2Node_DynamicCast_AsSurvival_Player_Test;         // 0x0C00(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0C08(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C09[0x7];                                      // 0x0C09(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival;                  // 0x0C10(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0C18(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C19[0x7];                                      // 0x0C19(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_2;            // 0x0C20(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_2;          // 0x0C28(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UWBP_CarShopAcceptBuyWindow_C*          CallFunc_Create_ReturnValue_2;                     // 0x0C38(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0C40(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0C41(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C42[0x6];                                      // 0x0C42(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_2;                              // 0x0C48(0x0018)(ConstParm)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0C60(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C61[0x7];                                      // 0x0C61(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWidgetTransform                       K2Node_MakeStruct_WidgetTransform;                 // 0x0C68(0x0038)(NoDestructor)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x0CA0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_1;                // 0x0CA8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_2;                // 0x0CB0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot) == 0x000008, "Wrong alignment on W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot");
static_assert(sizeof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot) == 0x000CB8, "Wrong size on W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, EntryPoint) == 0x000000, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, CallFunc_MakeLiteralText_ReturnValue) == 0x000008, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, CallFunc_GetDataTableRowFromName_OutRow) == 0x000030, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000250, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000258, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000478, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, CallFunc_GetOwningPlayer_ReturnValue) == 0x000480, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, K2Node_MakeStruct_FormatArgumentData) == 0x000488, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, CallFunc_Create_ReturnValue) == 0x0004D8, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, K2Node_MakeStruct_FormatArgumentData_1) == 0x0004E0, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, K2Node_MakeArray_Array) == 0x000530, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, CallFunc_Format_ReturnValue) == 0x000540, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, K2Node_CreateDelegate_OutputDelegate_1) == 0x000558, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, K2Node_CreateDelegate_OutputDelegate_2) == 0x000568, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, CallFunc_GetPlayerController_ReturnValue) == 0x000578, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, K2Node_DynamicCast_AsBPI_Surv_PC) == 0x000580, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::K2Node_DynamicCast_AsBPI_Surv_PC' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, K2Node_DynamicCast_bSuccess) == 0x000590, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, CallFunc_GetPlayerRef_SurvivalPlayer) == 0x000598, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::CallFunc_GetPlayerRef_SurvivalPlayer' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, CallFunc_Conv_NameToString_ReturnValue) == 0x0005A0, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, CallFunc_FTrunc_ReturnValue) == 0x0005B0, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, K2Node_SwitchEnum_CmpSuccess) == 0x0005B4, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x0005B8, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, CallFunc_Create_ReturnValue_1) == 0x0005C0, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, K2Node_CreateDelegate_OutputDelegate_3) == 0x0005C8, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, K2Node_MakeStruct_FormatArgumentData_2) == 0x0005D8, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, K2Node_MakeStruct_FormatArgumentData_3) == 0x000628, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, K2Node_MakeArray_Array_1) == 0x000678, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, CallFunc_Format_ReturnValue_1) == 0x000688, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, CallFunc_GetPlayerController_ReturnValue_1) == 0x0006A0, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, Temp_text_Variable) == 0x0006A8, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, K2Node_DynamicCast_AsBPI_Surv_PC_1) == 0x0006C0, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::K2Node_DynamicCast_AsBPI_Surv_PC_1' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, K2Node_DynamicCast_bSuccess_1) == 0x0006D0, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, CallFunc_GetPlayerRef_SurvivalPlayer_1) == 0x0006D8, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::CallFunc_GetPlayerRef_SurvivalPlayer_1' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, CallFunc_Conv_NameToString_ReturnValue_1) == 0x0006E0, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::CallFunc_Conv_NameToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, CallFunc_FTrunc_ReturnValue_1) == 0x0006F0, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, K2Node_MakeArray_Array_2) == 0x0006F8, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, K2Node_SetFieldsInStruct_StructOut) == 0x000708, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, CallFunc_JSAddItem_Ad) == 0x000928, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::CallFunc_JSAddItem_Ad' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, K2Node_CreateDelegate_OutputDelegate_4) == 0x00092C, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, K2Node_MakeArray_Array_3) == 0x000940, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, CallFunc_CanAddItems_Can) == 0x000950, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::CallFunc_CanAddItems_Can' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, CallFunc_CanAddItems_ItemsLeft) == 0x000954, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::CallFunc_CanAddItems_ItemsLeft' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, CallFunc_GetPlayerController_ReturnValue_2) == 0x000958, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, K2Node_DynamicCast_AsBPI_Surv_PC_2) == 0x000960, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::K2Node_DynamicCast_AsBPI_Surv_PC_2' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, K2Node_DynamicCast_bSuccess_2) == 0x000970, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, Temp_text_Variable_1) == 0x000978, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, CallFunc_GetPlayerRef_SurvivalPlayer_2) == 0x000990, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::CallFunc_GetPlayerRef_SurvivalPlayer_2' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, K2Node_CreateDelegate_OutputDelegate_5) == 0x000998, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, CallFunc_FTrunc_ReturnValue_2) == 0x0009A8, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::CallFunc_FTrunc_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, K2Node_SetFieldsInStruct_StructOut_1) == 0x0009B0, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::K2Node_SetFieldsInStruct_StructOut_1' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, K2Node_MakeArray_Array_4) == 0x000BD0, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, CallFunc_CanAddItems_Can_1) == 0x000BE0, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::CallFunc_CanAddItems_Can_1' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, CallFunc_CanAddItems_ItemsLeft_1) == 0x000BE4, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::CallFunc_CanAddItems_ItemsLeft_1' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000BE8, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000BE9, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000BF0, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, CallFunc_GetGameInstance_ReturnValue) == 0x000BF8, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, K2Node_DynamicCast_AsSurvival_Player_Test) == 0x000C00, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::K2Node_DynamicCast_AsSurvival_Player_Test' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, K2Node_DynamicCast_bSuccess_3) == 0x000C08, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, K2Node_DynamicCast_AsGI_Survival) == 0x000C10, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::K2Node_DynamicCast_AsGI_Survival' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, K2Node_DynamicCast_bSuccess_4) == 0x000C18, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, CallFunc_GetOwningPlayer_ReturnValue_2) == 0x000C20, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::CallFunc_GetOwningPlayer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, CallFunc_Conv_NameToString_ReturnValue_2) == 0x000C28, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::CallFunc_Conv_NameToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, CallFunc_Create_ReturnValue_2) == 0x000C38, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000C40, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, CallFunc_Not_PreBool_ReturnValue) == 0x000C41, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, Temp_text_Variable_2) == 0x000C48, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000C60, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, K2Node_MakeStruct_WidgetTransform) == 0x000C68, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::K2Node_MakeStruct_WidgetTransform' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, CallFunc_PlayEvent2D_ReturnValue) == 0x000CA0, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::CallFunc_PlayEvent2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, CallFunc_PlayEvent2D_ReturnValue_1) == 0x000CA8, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::CallFunc_PlayEvent2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot, CallFunc_PlayEvent2D_ReturnValue_2) == 0x000CB0, "Member 'W_HouseShopSlot_C_ExecuteUbergraph_W_HouseShopSlot::CallFunc_PlayEvent2D_ReturnValue_2' has a wrong offset!");

// Function W_HouseShopSlot.W_HouseShopSlot_C.OnHouseSelectedSlot__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_HouseShopSlot_C_OnHouseSelectedSlot__DelegateSignature final
{
public:
	class UW_HouseShopSlot_C*                     NewParam;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_HouseShopSlot_C_OnHouseSelectedSlot__DelegateSignature) == 0x000008, "Wrong alignment on W_HouseShopSlot_C_OnHouseSelectedSlot__DelegateSignature");
static_assert(sizeof(W_HouseShopSlot_C_OnHouseSelectedSlot__DelegateSignature) == 0x000008, "Wrong size on W_HouseShopSlot_C_OnHouseSelectedSlot__DelegateSignature");
static_assert(offsetof(W_HouseShopSlot_C_OnHouseSelectedSlot__DelegateSignature, NewParam) == 0x000000, "Member 'W_HouseShopSlot_C_OnHouseSelectedSlot__DelegateSignature::NewParam' has a wrong offset!");

// Function W_HouseShopSlot.W_HouseShopSlot_C.Remove Money
// 0x0250 (0x0250 - 0x0000)
struct W_HouseShopSlot_C_Remove_Money final
{
public:
	class ASurvivalPlayer_C*                      Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             CallFunc_GetDataTableRowFromName_OutRow;           // 0x0010(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0238(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemByName_ReturnedCount;              // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_HouseShopSlot_C_Remove_Money) == 0x000008, "Wrong alignment on W_HouseShopSlot_C_Remove_Money");
static_assert(sizeof(W_HouseShopSlot_C_Remove_Money) == 0x000250, "Wrong size on W_HouseShopSlot_C_Remove_Money");
static_assert(offsetof(W_HouseShopSlot_C_Remove_Money, Target) == 0x000000, "Member 'W_HouseShopSlot_C_Remove_Money::Target' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_Remove_Money, Count) == 0x000008, "Member 'W_HouseShopSlot_C_Remove_Money::Count' has a wrong offset!");
static_assert(offsetof(W_HouseShopSlot_C_Remove_Money, CallFunc_GetDataTableRowFromName_OutRow) == 0x000010, "Member 'W_HouseShopSlot_C_Remove_Money::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
