#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_InventoryCounter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_InventoryCounter.W_InventoryCounter_C
// 0x0048 (0x02C8 - 0x0280)
class UW_InventoryCounter_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             ValueText;                                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ZerosText;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Value;                                             // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxDigitNum;                                       // 0x029C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         FontSize;                                          // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                FontType;                                          // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Typeface;                                          // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Value_Color;                                       // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Destruct();
	void ExecuteUbergraph_W_InventoryCounter(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void UpdateValue(int32 Param_Value);

	void GetValueDigitNum(int32* Result) const;
	void GetZeros(int32 ValueDigitNum, class FString* Zeros) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_InventoryCounter_C">();
	}
	static class UW_InventoryCounter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_InventoryCounter_C>();
	}
};
static_assert(alignof(UW_InventoryCounter_C) == 0x000008, "Wrong alignment on UW_InventoryCounter_C");
static_assert(sizeof(UW_InventoryCounter_C) == 0x0002C8, "Wrong size on UW_InventoryCounter_C");
static_assert(offsetof(UW_InventoryCounter_C, UberGraphFrame) == 0x000280, "Member 'UW_InventoryCounter_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_InventoryCounter_C, ValueText) == 0x000288, "Member 'UW_InventoryCounter_C::ValueText' has a wrong offset!");
static_assert(offsetof(UW_InventoryCounter_C, ZerosText) == 0x000290, "Member 'UW_InventoryCounter_C::ZerosText' has a wrong offset!");
static_assert(offsetof(UW_InventoryCounter_C, Value) == 0x000298, "Member 'UW_InventoryCounter_C::Value' has a wrong offset!");
static_assert(offsetof(UW_InventoryCounter_C, MaxDigitNum) == 0x00029C, "Member 'UW_InventoryCounter_C::MaxDigitNum' has a wrong offset!");
static_assert(offsetof(UW_InventoryCounter_C, FontSize) == 0x0002A0, "Member 'UW_InventoryCounter_C::FontSize' has a wrong offset!");
static_assert(offsetof(UW_InventoryCounter_C, FontType) == 0x0002A8, "Member 'UW_InventoryCounter_C::FontType' has a wrong offset!");
static_assert(offsetof(UW_InventoryCounter_C, Typeface) == 0x0002B0, "Member 'UW_InventoryCounter_C::Typeface' has a wrong offset!");
static_assert(offsetof(UW_InventoryCounter_C, Value_Color) == 0x0002B8, "Member 'UW_InventoryCounter_C::Value_Color' has a wrong offset!");

}

