#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ItemInfo

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FItemInfo_structs.hpp"
#include "JSItemType_structs.hpp"
#include "EffectMainContructor_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "EffectContructor_structs.hpp"
#include "AttachmentInfo_structs.hpp"
#include "WS_CharaterPerks_structs.hpp"
#include "S_Attachment_structs.hpp"
#include "Engine_structs.hpp"
#include "BPS_WeaponData_structs.hpp"
#include "InfoType_structs.hpp"
#include "E_TypesOfModes_structs.hpp"
#include "ST_WeaponMaxValue_structs.hpp"


namespace SDK::Params
{

// Function W_ItemInfo.W_ItemInfo_C.AddAttachmentEffects
// 0x01D8 (0x01D8 - 0x0000)
struct W_ItemInfo_C_AddAttachmentEffects final
{
public:
	double                                        Power;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        EffectiveRange;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Stability;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FiringRate;                                        // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PowerModdifu;                                      // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        EffectiveRangeModdifu;                             // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StabilityModdifu;                                  // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FiringRateModdifu;                                 // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAttachmentStats;                                 // 0x0040(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           EffectNames;                                       // 0x0048(0x0010)(Edit, BlueprintVisible)
	double                                        MaxFiring_Rate;                                    // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxStability;                                      // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxEffectiveRange;                                 // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxPower;                                          // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<double>                                K2Node_MakeArray_Array;                            // 0x00A0(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Array_Get_Item;                           // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Abs_ReturnValue;                          // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x00F4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_2;                        // 0x0104(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_3;                        // 0x0114(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_4;                        // 0x0124(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           K2Node_MakeArray_Array_1;                          // 0x0138(0x0010)(ReferenceParm)
	struct FST_WeaponMaxValue                     CallFunc_GetDataTableRowFromName_OutRow;           // 0x0148(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_MathExpression_ReturnValue;                 // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_MathExpression_ReturnValue_1;               // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_MathExpression_ReturnValue_2;               // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_MathExpression_ReturnValue_3;               // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_MathExpression_ReturnValue_4;               // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_MathExpression_ReturnValue_5;               // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_MathExpression_ReturnValue_6;               // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_MathExpression_ReturnValue_7;               // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x01B0(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item_1;                         // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x3];                                      // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_MakeStruct_Top_ImplicitCast;                // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ItemInfo_C_AddAttachmentEffects) == 0x000008, "Wrong alignment on W_ItemInfo_C_AddAttachmentEffects");
static_assert(sizeof(W_ItemInfo_C_AddAttachmentEffects) == 0x0001D8, "Wrong size on W_ItemInfo_C_AddAttachmentEffects");
static_assert(offsetof(W_ItemInfo_C_AddAttachmentEffects, Power) == 0x000000, "Member 'W_ItemInfo_C_AddAttachmentEffects::Power' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_AddAttachmentEffects, EffectiveRange) == 0x000008, "Member 'W_ItemInfo_C_AddAttachmentEffects::EffectiveRange' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_AddAttachmentEffects, Stability) == 0x000010, "Member 'W_ItemInfo_C_AddAttachmentEffects::Stability' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_AddAttachmentEffects, FiringRate) == 0x000018, "Member 'W_ItemInfo_C_AddAttachmentEffects::FiringRate' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_AddAttachmentEffects, PowerModdifu) == 0x000020, "Member 'W_ItemInfo_C_AddAttachmentEffects::PowerModdifu' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_AddAttachmentEffects, EffectiveRangeModdifu) == 0x000028, "Member 'W_ItemInfo_C_AddAttachmentEffects::EffectiveRangeModdifu' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_AddAttachmentEffects, StabilityModdifu) == 0x000030, "Member 'W_ItemInfo_C_AddAttachmentEffects::StabilityModdifu' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_AddAttachmentEffects, FiringRateModdifu) == 0x000038, "Member 'W_ItemInfo_C_AddAttachmentEffects::FiringRateModdifu' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_AddAttachmentEffects, IsAttachmentStats) == 0x000040, "Member 'W_ItemInfo_C_AddAttachmentEffects::IsAttachmentStats' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_AddAttachmentEffects, EffectNames) == 0x000048, "Member 'W_ItemInfo_C_AddAttachmentEffects::EffectNames' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_AddAttachmentEffects, MaxFiring_Rate) == 0x000058, "Member 'W_ItemInfo_C_AddAttachmentEffects::MaxFiring_Rate' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_AddAttachmentEffects, MaxStability) == 0x000060, "Member 'W_ItemInfo_C_AddAttachmentEffects::MaxStability' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_AddAttachmentEffects, MaxEffectiveRange) == 0x000068, "Member 'W_ItemInfo_C_AddAttachmentEffects::MaxEffectiveRange' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_AddAttachmentEffects, MaxPower) == 0x000070, "Member 'W_ItemInfo_C_AddAttachmentEffects::MaxPower' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_AddAttachmentEffects, Temp_int_Array_Index_Variable) == 0x000078, "Member 'W_ItemInfo_C_AddAttachmentEffects::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_AddAttachmentEffects, CallFunc_GetChildrenCount_ReturnValue) == 0x00007C, "Member 'W_ItemInfo_C_AddAttachmentEffects::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_AddAttachmentEffects, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000080, "Member 'W_ItemInfo_C_AddAttachmentEffects::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_AddAttachmentEffects, CallFunc_SelectFloat_ReturnValue) == 0x000088, "Member 'W_ItemInfo_C_AddAttachmentEffects::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_AddAttachmentEffects, K2Node_MakeStruct_Margin) == 0x000090, "Member 'W_ItemInfo_C_AddAttachmentEffects::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_AddAttachmentEffects, K2Node_MakeArray_Array) == 0x0000A0, "Member 'W_ItemInfo_C_AddAttachmentEffects::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_AddAttachmentEffects, Temp_int_Loop_Counter_Variable) == 0x0000B0, "Member 'W_ItemInfo_C_AddAttachmentEffects::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_AddAttachmentEffects, CallFunc_Array_Length_ReturnValue) == 0x0000B4, "Member 'W_ItemInfo_C_AddAttachmentEffects::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_AddAttachmentEffects, CallFunc_Add_IntInt_ReturnValue) == 0x0000B8, "Member 'W_ItemInfo_C_AddAttachmentEffects::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_AddAttachmentEffects, Temp_int_Array_Index_Variable_1) == 0x0000BC, "Member 'W_ItemInfo_C_AddAttachmentEffects::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_AddAttachmentEffects, CallFunc_Array_Get_Item) == 0x0000C0, "Member 'W_ItemInfo_C_AddAttachmentEffects::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_AddAttachmentEffects, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000C8, "Member 'W_ItemInfo_C_AddAttachmentEffects::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_AddAttachmentEffects, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0000D0, "Member 'W_ItemInfo_C_AddAttachmentEffects::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_AddAttachmentEffects, Temp_int_Loop_Counter_Variable_1) == 0x0000D8, "Member 'W_ItemInfo_C_AddAttachmentEffects::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_AddAttachmentEffects, CallFunc_Less_IntInt_ReturnValue) == 0x0000DC, "Member 'W_ItemInfo_C_AddAttachmentEffects::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_AddAttachmentEffects, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000E0, "Member 'W_ItemInfo_C_AddAttachmentEffects::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_AddAttachmentEffects, CallFunc_Abs_ReturnValue) == 0x0000E8, "Member 'W_ItemInfo_C_AddAttachmentEffects::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_AddAttachmentEffects, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0000F0, "Member 'W_ItemInfo_C_AddAttachmentEffects::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_AddAttachmentEffects, K2Node_MakeStruct_Margin_1) == 0x0000F4, "Member 'W_ItemInfo_C_AddAttachmentEffects::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_AddAttachmentEffects, K2Node_MakeStruct_Margin_2) == 0x000104, "Member 'W_ItemInfo_C_AddAttachmentEffects::K2Node_MakeStruct_Margin_2' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_AddAttachmentEffects, K2Node_MakeStruct_Margin_3) == 0x000114, "Member 'W_ItemInfo_C_AddAttachmentEffects::K2Node_MakeStruct_Margin_3' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_AddAttachmentEffects, K2Node_MakeStruct_Margin_4) == 0x000124, "Member 'W_ItemInfo_C_AddAttachmentEffects::K2Node_MakeStruct_Margin_4' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_AddAttachmentEffects, K2Node_MakeArray_Array_1) == 0x000138, "Member 'W_ItemInfo_C_AddAttachmentEffects::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_AddAttachmentEffects, CallFunc_GetDataTableRowFromName_OutRow) == 0x000148, "Member 'W_ItemInfo_C_AddAttachmentEffects::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_AddAttachmentEffects, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000168, "Member 'W_ItemInfo_C_AddAttachmentEffects::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_AddAttachmentEffects, K2Node_MathExpression_ReturnValue) == 0x000170, "Member 'W_ItemInfo_C_AddAttachmentEffects::K2Node_MathExpression_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_AddAttachmentEffects, K2Node_MathExpression_ReturnValue_1) == 0x000178, "Member 'W_ItemInfo_C_AddAttachmentEffects::K2Node_MathExpression_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_AddAttachmentEffects, K2Node_MathExpression_ReturnValue_2) == 0x000180, "Member 'W_ItemInfo_C_AddAttachmentEffects::K2Node_MathExpression_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_AddAttachmentEffects, K2Node_MathExpression_ReturnValue_3) == 0x000188, "Member 'W_ItemInfo_C_AddAttachmentEffects::K2Node_MathExpression_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_AddAttachmentEffects, K2Node_MathExpression_ReturnValue_4) == 0x000190, "Member 'W_ItemInfo_C_AddAttachmentEffects::K2Node_MathExpression_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_AddAttachmentEffects, K2Node_MathExpression_ReturnValue_5) == 0x000198, "Member 'W_ItemInfo_C_AddAttachmentEffects::K2Node_MathExpression_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_AddAttachmentEffects, K2Node_MathExpression_ReturnValue_6) == 0x0001A0, "Member 'W_ItemInfo_C_AddAttachmentEffects::K2Node_MathExpression_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_AddAttachmentEffects, K2Node_MathExpression_ReturnValue_7) == 0x0001A8, "Member 'W_ItemInfo_C_AddAttachmentEffects::K2Node_MathExpression_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_AddAttachmentEffects, CallFunc_GetAllChildren_ReturnValue) == 0x0001B0, "Member 'W_ItemInfo_C_AddAttachmentEffects::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_AddAttachmentEffects, CallFunc_Array_Length_ReturnValue_1) == 0x0001C0, "Member 'W_ItemInfo_C_AddAttachmentEffects::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_AddAttachmentEffects, CallFunc_Array_Get_Item_1) == 0x0001C8, "Member 'W_ItemInfo_C_AddAttachmentEffects::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_AddAttachmentEffects, CallFunc_Less_IntInt_ReturnValue_1) == 0x0001D0, "Member 'W_ItemInfo_C_AddAttachmentEffects::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_AddAttachmentEffects, K2Node_MakeStruct_Top_ImplicitCast) == 0x0001D4, "Member 'W_ItemInfo_C_AddAttachmentEffects::K2Node_MakeStruct_Top_ImplicitCast' has a wrong offset!");

// Function W_ItemInfo.W_ItemInfo_C.AddStatsModifiersForAttachment
// 0x0040 (0x0040 - 0x0000)
struct W_ItemInfo_C_AddStatsModifiersForAttachment final
{
public:
	double                                        Stats;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Stats1;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Stats2;                                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Stats3;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_EffectRowForItemInfo_C*              CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ItemInfo_C_AddStatsModifiersForAttachment) == 0x000008, "Wrong alignment on W_ItemInfo_C_AddStatsModifiersForAttachment");
static_assert(sizeof(W_ItemInfo_C_AddStatsModifiersForAttachment) == 0x000040, "Wrong size on W_ItemInfo_C_AddStatsModifiersForAttachment");
static_assert(offsetof(W_ItemInfo_C_AddStatsModifiersForAttachment, Stats) == 0x000000, "Member 'W_ItemInfo_C_AddStatsModifiersForAttachment::Stats' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_AddStatsModifiersForAttachment, Stats1) == 0x000008, "Member 'W_ItemInfo_C_AddStatsModifiersForAttachment::Stats1' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_AddStatsModifiersForAttachment, Stats2) == 0x000010, "Member 'W_ItemInfo_C_AddStatsModifiersForAttachment::Stats2' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_AddStatsModifiersForAttachment, Stats3) == 0x000018, "Member 'W_ItemInfo_C_AddStatsModifiersForAttachment::Stats3' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_AddStatsModifiersForAttachment, CallFunc_Create_ReturnValue) == 0x000020, "Member 'W_ItemInfo_C_AddStatsModifiersForAttachment::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_AddStatsModifiersForAttachment, K2Node_MakeStruct_Margin) == 0x000028, "Member 'W_ItemInfo_C_AddStatsModifiersForAttachment::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_AddStatsModifiersForAttachment, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000038, "Member 'W_ItemInfo_C_AddStatsModifiersForAttachment::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");

// Function W_ItemInfo.W_ItemInfo_C.CalculatePrice
// 0x0740 (0x0740 - 0x0000)
struct W_ItemInfo_C_CalculatePrice final
{
public:
	struct FFItemInfo                             ItemInfo;                                          // 0x0000(0x0220)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0220(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Price;                                             // 0x0228(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJSItemType                                   Temp_byte_Variable;                                // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4;                              // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_279[0x3];                                      // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_CountOut_OutInt;                          // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_294[0x4];                                      // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFItemInfo                             CallFunc_GetDataTableRowFromName_OutRow;           // 0x02B0(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D1[0x3];                                      // 0x04D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAttachmentInfo                        CallFunc_Array_Get_Item;                           // 0x04D4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x04E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x04E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E9[0x7];                                      // 0x04E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x04F0(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0710(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_711[0x7];                                      // 0x0711(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0718(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0720(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0728(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0730(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0738(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ItemInfo_C_CalculatePrice) == 0x000008, "Wrong alignment on W_ItemInfo_C_CalculatePrice");
static_assert(sizeof(W_ItemInfo_C_CalculatePrice) == 0x000740, "Wrong size on W_ItemInfo_C_CalculatePrice");
static_assert(offsetof(W_ItemInfo_C_CalculatePrice, ItemInfo) == 0x000000, "Member 'W_ItemInfo_C_CalculatePrice::ItemInfo' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_CalculatePrice, ReturnValue) == 0x000220, "Member 'W_ItemInfo_C_CalculatePrice::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_CalculatePrice, Price) == 0x000228, "Member 'W_ItemInfo_C_CalculatePrice::Price' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_CalculatePrice, Temp_byte_Variable) == 0x000230, "Member 'W_ItemInfo_C_CalculatePrice::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_CalculatePrice, Temp_real_Variable) == 0x000238, "Member 'W_ItemInfo_C_CalculatePrice::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_CalculatePrice, Temp_real_Variable_1) == 0x000240, "Member 'W_ItemInfo_C_CalculatePrice::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_CalculatePrice, Temp_real_Variable_2) == 0x000248, "Member 'W_ItemInfo_C_CalculatePrice::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_CalculatePrice, Temp_real_Variable_3) == 0x000250, "Member 'W_ItemInfo_C_CalculatePrice::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_CalculatePrice, Temp_real_Variable_4) == 0x000258, "Member 'W_ItemInfo_C_CalculatePrice::Temp_real_Variable_4' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_CalculatePrice, CallFunc_GetPlayerController_ReturnValue) == 0x000260, "Member 'W_ItemInfo_C_CalculatePrice::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_CalculatePrice, CallFunc_K2_GetPawn_ReturnValue) == 0x000268, "Member 'W_ItemInfo_C_CalculatePrice::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_CalculatePrice, K2Node_DynamicCast_AsSurvival_Player) == 0x000270, "Member 'W_ItemInfo_C_CalculatePrice::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_CalculatePrice, K2Node_DynamicCast_bSuccess) == 0x000278, "Member 'W_ItemInfo_C_CalculatePrice::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_CalculatePrice, CallFunc_CountOut_OutInt) == 0x00027C, "Member 'W_ItemInfo_C_CalculatePrice::CallFunc_CountOut_OutInt' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_CalculatePrice, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000280, "Member 'W_ItemInfo_C_CalculatePrice::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_CalculatePrice, Temp_int_Array_Index_Variable) == 0x000288, "Member 'W_ItemInfo_C_CalculatePrice::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_CalculatePrice, Temp_int_Loop_Counter_Variable) == 0x00028C, "Member 'W_ItemInfo_C_CalculatePrice::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_CalculatePrice, CallFunc_Add_IntInt_ReturnValue) == 0x000290, "Member 'W_ItemInfo_C_CalculatePrice::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_CalculatePrice, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000298, "Member 'W_ItemInfo_C_CalculatePrice::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_CalculatePrice, CallFunc_Round_ReturnValue) == 0x0002A0, "Member 'W_ItemInfo_C_CalculatePrice::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_CalculatePrice, K2Node_Select_Default) == 0x0002A8, "Member 'W_ItemInfo_C_CalculatePrice::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_CalculatePrice, CallFunc_GetDataTableRowFromName_OutRow) == 0x0002B0, "Member 'W_ItemInfo_C_CalculatePrice::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_CalculatePrice, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0004D0, "Member 'W_ItemInfo_C_CalculatePrice::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_CalculatePrice, CallFunc_Array_Get_Item) == 0x0004D4, "Member 'W_ItemInfo_C_CalculatePrice::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_CalculatePrice, CallFunc_Array_Length_ReturnValue) == 0x0004E4, "Member 'W_ItemInfo_C_CalculatePrice::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_CalculatePrice, CallFunc_Less_IntInt_ReturnValue) == 0x0004E8, "Member 'W_ItemInfo_C_CalculatePrice::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_CalculatePrice, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x0004F0, "Member 'W_ItemInfo_C_CalculatePrice::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_CalculatePrice, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000710, "Member 'W_ItemInfo_C_CalculatePrice::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_CalculatePrice, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000718, "Member 'W_ItemInfo_C_CalculatePrice::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_CalculatePrice, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000720, "Member 'W_ItemInfo_C_CalculatePrice::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_CalculatePrice, CallFunc_SelectFloat_ReturnValue) == 0x000728, "Member 'W_ItemInfo_C_CalculatePrice::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_CalculatePrice, CallFunc_SelectFloat_ReturnValue_1) == 0x000730, "Member 'W_ItemInfo_C_CalculatePrice::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_CalculatePrice, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000738, "Member 'W_ItemInfo_C_CalculatePrice::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");

// Function W_ItemInfo.W_ItemInfo_C.ConvertInfoType
// 0x0030 (0x0030 - 0x0000)
struct W_ItemInfo_C_ConvertInfoType final
{
public:
	class FString                                 In;                                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   Out;                                               // 0x0010(0x0018)(Parm, OutParm)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ItemInfo_C_ConvertInfoType) == 0x000008, "Wrong alignment on W_ItemInfo_C_ConvertInfoType");
static_assert(sizeof(W_ItemInfo_C_ConvertInfoType) == 0x000030, "Wrong size on W_ItemInfo_C_ConvertInfoType");
static_assert(offsetof(W_ItemInfo_C_ConvertInfoType, In) == 0x000000, "Member 'W_ItemInfo_C_ConvertInfoType::In' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_ConvertInfoType, Out) == 0x000010, "Member 'W_ItemInfo_C_ConvertInfoType::Out' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_ConvertInfoType, K2Node_SwitchString_CmpSuccess) == 0x000028, "Member 'W_ItemInfo_C_ConvertInfoType::K2Node_SwitchString_CmpSuccess' has a wrong offset!");

// Function W_ItemInfo.W_ItemInfo_C.CreateEffectRowWidget
// 0x0050 (0x0050 - 0x0000)
struct W_ItemInfo_C_CreateEffectRowWidget final
{
public:
	class FText                                   EffectName;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	double                                        Stats;                                             // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StatsModdifu;                                      // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowNumericValues;                                 // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                InPadding;                                         // 0x002C(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_EffectRowForItemInfo_C*              CallFunc_Create_ReturnValue;                       // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ItemInfo_C_CreateEffectRowWidget) == 0x000008, "Wrong alignment on W_ItemInfo_C_CreateEffectRowWidget");
static_assert(sizeof(W_ItemInfo_C_CreateEffectRowWidget) == 0x000050, "Wrong size on W_ItemInfo_C_CreateEffectRowWidget");
static_assert(offsetof(W_ItemInfo_C_CreateEffectRowWidget, EffectName) == 0x000000, "Member 'W_ItemInfo_C_CreateEffectRowWidget::EffectName' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_CreateEffectRowWidget, Stats) == 0x000018, "Member 'W_ItemInfo_C_CreateEffectRowWidget::Stats' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_CreateEffectRowWidget, StatsModdifu) == 0x000020, "Member 'W_ItemInfo_C_CreateEffectRowWidget::StatsModdifu' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_CreateEffectRowWidget, ShowNumericValues) == 0x000028, "Member 'W_ItemInfo_C_CreateEffectRowWidget::ShowNumericValues' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_CreateEffectRowWidget, InPadding) == 0x00002C, "Member 'W_ItemInfo_C_CreateEffectRowWidget::InPadding' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_CreateEffectRowWidget, CallFunc_Create_ReturnValue) == 0x000040, "Member 'W_ItemInfo_C_CreateEffectRowWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_CreateEffectRowWidget, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000048, "Member 'W_ItemInfo_C_CreateEffectRowWidget::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");

// Function W_ItemInfo.W_ItemInfo_C.ExecuteUbergraph_W_ItemInfo
// 0x0028 (0x0028 - 0x0000)
struct W_ItemInfo_C_ExecuteUbergraph_W_ItemInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetViewportSize_ReturnValue;              // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DVector2D_ReturnValue;      // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ItemInfo_C_ExecuteUbergraph_W_ItemInfo) == 0x000008, "Wrong alignment on W_ItemInfo_C_ExecuteUbergraph_W_ItemInfo");
static_assert(sizeof(W_ItemInfo_C_ExecuteUbergraph_W_ItemInfo) == 0x000028, "Wrong size on W_ItemInfo_C_ExecuteUbergraph_W_ItemInfo");
static_assert(offsetof(W_ItemInfo_C_ExecuteUbergraph_W_ItemInfo, EntryPoint) == 0x000000, "Member 'W_ItemInfo_C_ExecuteUbergraph_W_ItemInfo::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_ExecuteUbergraph_W_ItemInfo, CallFunc_GetViewportSize_ReturnValue) == 0x000008, "Member 'W_ItemInfo_C_ExecuteUbergraph_W_ItemInfo::CallFunc_GetViewportSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_ExecuteUbergraph_W_ItemInfo, CallFunc_Divide_Vector2DVector2D_ReturnValue) == 0x000018, "Member 'W_ItemInfo_C_ExecuteUbergraph_W_ItemInfo::CallFunc_Divide_Vector2DVector2D_ReturnValue' has a wrong offset!");

// Function W_ItemInfo.W_ItemInfo_C.FindBaseStatsWeapon
// 0x0520 (0x0520 - 0x0000)
struct W_ItemInfo_C_FindBaseStatsWeapon final
{
public:
	class FName                                   Param_Name;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Power;                                             // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        EffectiveRange;                                    // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Stability;                                         // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FireRatio;                                         // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0038(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBPS_WeaponData                        CallFunc_GetDataTableRowFromName_OutRow;           // 0x0058(0x04C0)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0518(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0519(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ItemInfo_C_FindBaseStatsWeapon) == 0x000008, "Wrong alignment on W_ItemInfo_C_FindBaseStatsWeapon");
static_assert(sizeof(W_ItemInfo_C_FindBaseStatsWeapon) == 0x000520, "Wrong size on W_ItemInfo_C_FindBaseStatsWeapon");
static_assert(offsetof(W_ItemInfo_C_FindBaseStatsWeapon, Param_Name) == 0x000000, "Member 'W_ItemInfo_C_FindBaseStatsWeapon::Param_Name' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_FindBaseStatsWeapon, Power) == 0x000008, "Member 'W_ItemInfo_C_FindBaseStatsWeapon::Power' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_FindBaseStatsWeapon, EffectiveRange) == 0x000010, "Member 'W_ItemInfo_C_FindBaseStatsWeapon::EffectiveRange' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_FindBaseStatsWeapon, Stability) == 0x000018, "Member 'W_ItemInfo_C_FindBaseStatsWeapon::Stability' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_FindBaseStatsWeapon, FireRatio) == 0x000020, "Member 'W_ItemInfo_C_FindBaseStatsWeapon::FireRatio' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_FindBaseStatsWeapon, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'W_ItemInfo_C_FindBaseStatsWeapon::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_FindBaseStatsWeapon, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'W_ItemInfo_C_FindBaseStatsWeapon::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_FindBaseStatsWeapon, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'W_ItemInfo_C_FindBaseStatsWeapon::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_FindBaseStatsWeapon, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000038, "Member 'W_ItemInfo_C_FindBaseStatsWeapon::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_FindBaseStatsWeapon, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'W_ItemInfo_C_FindBaseStatsWeapon::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_FindBaseStatsWeapon, CallFunc_Array_Get_Item) == 0x00004C, "Member 'W_ItemInfo_C_FindBaseStatsWeapon::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_FindBaseStatsWeapon, CallFunc_Less_IntInt_ReturnValue) == 0x000054, "Member 'W_ItemInfo_C_FindBaseStatsWeapon::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_FindBaseStatsWeapon, CallFunc_GetDataTableRowFromName_OutRow) == 0x000058, "Member 'W_ItemInfo_C_FindBaseStatsWeapon::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_FindBaseStatsWeapon, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000518, "Member 'W_ItemInfo_C_FindBaseStatsWeapon::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_FindBaseStatsWeapon, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000519, "Member 'W_ItemInfo_C_FindBaseStatsWeapon::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");

// Function W_ItemInfo.W_ItemInfo_C.GetItemInfo
// 0x0230 (0x0230 - 0x0000)
struct W_ItemInfo_C_GetItemInfo final
{
public:
	struct FFItemInfo                             ItemInfo;                                          // 0x0000(0x0220)(Parm, OutParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UUserWidget*                            Param_TriggerUserWidget;                           // 0x0220(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x022A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x022B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ItemInfo_C_GetItemInfo) == 0x000008, "Wrong alignment on W_ItemInfo_C_GetItemInfo");
static_assert(sizeof(W_ItemInfo_C_GetItemInfo) == 0x000230, "Wrong size on W_ItemInfo_C_GetItemInfo");
static_assert(offsetof(W_ItemInfo_C_GetItemInfo, ItemInfo) == 0x000000, "Member 'W_ItemInfo_C_GetItemInfo::ItemInfo' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_GetItemInfo, Param_TriggerUserWidget) == 0x000220, "Member 'W_ItemInfo_C_GetItemInfo::Param_TriggerUserWidget' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_GetItemInfo, CallFunc_IsValid_ReturnValue) == 0x000228, "Member 'W_ItemInfo_C_GetItemInfo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_GetItemInfo, CallFunc_IsHovered_ReturnValue) == 0x000229, "Member 'W_ItemInfo_C_GetItemInfo::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_GetItemInfo, CallFunc_IsValid_ReturnValue_1) == 0x00022A, "Member 'W_ItemInfo_C_GetItemInfo::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_GetItemInfo, CallFunc_BooleanAND_ReturnValue) == 0x00022B, "Member 'W_ItemInfo_C_GetItemInfo::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function W_ItemInfo.W_ItemInfo_C.GetRepairPrice
// 0x0018 (0x0018 - 0x0000)
struct W_ItemInfo_C_GetRepairPrice final
{
public:
	int32                                         RepairPrice;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJSI_Slot_C*                            K2Node_DynamicCast_AsJSI_Slot;                     // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Get_Repair_Price_RepairPrice;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ItemInfo_C_GetRepairPrice) == 0x000008, "Wrong alignment on W_ItemInfo_C_GetRepairPrice");
static_assert(sizeof(W_ItemInfo_C_GetRepairPrice) == 0x000018, "Wrong size on W_ItemInfo_C_GetRepairPrice");
static_assert(offsetof(W_ItemInfo_C_GetRepairPrice, RepairPrice) == 0x000000, "Member 'W_ItemInfo_C_GetRepairPrice::RepairPrice' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_GetRepairPrice, K2Node_DynamicCast_AsJSI_Slot) == 0x000008, "Member 'W_ItemInfo_C_GetRepairPrice::K2Node_DynamicCast_AsJSI_Slot' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_GetRepairPrice, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'W_ItemInfo_C_GetRepairPrice::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_GetRepairPrice, CallFunc_Get_Repair_Price_RepairPrice) == 0x000014, "Member 'W_ItemInfo_C_GetRepairPrice::CallFunc_Get_Repair_Price_RepairPrice' has a wrong offset!");

// Function W_ItemInfo.W_ItemInfo_C.OnHideWidget
// 0x0038 (0x0038 - 0x0000)
struct W_ItemInfo_C_OnHideWidget final
{
public:
	double                                        Power;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        EffectiveRange;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Stability;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FiringRate;                                        // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WithoutAnim;                                       // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ItemInfo_C_OnHideWidget) == 0x000008, "Wrong alignment on W_ItemInfo_C_OnHideWidget");
static_assert(sizeof(W_ItemInfo_C_OnHideWidget) == 0x000038, "Wrong size on W_ItemInfo_C_OnHideWidget");
static_assert(offsetof(W_ItemInfo_C_OnHideWidget, Power) == 0x000000, "Member 'W_ItemInfo_C_OnHideWidget::Power' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_OnHideWidget, EffectiveRange) == 0x000008, "Member 'W_ItemInfo_C_OnHideWidget::EffectiveRange' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_OnHideWidget, Stability) == 0x000010, "Member 'W_ItemInfo_C_OnHideWidget::Stability' has a wrong offset!");
static_assert(offsetof(W_ItemInfo_C_OnHideWidget, FiringRate) == 0x000018, "Member 'W_ItemInfo_C_OnHideWidget::FiringRate' has a wrong offset!");
