#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ItemInfo

#include "Basic.hpp"

#include "E_TypesOfModes_structs.hpp"
#include "InfoType_structs.hpp"
#include "Engine_structs.hpp"
#include "WS_CharaterPerks_structs.hpp"
#include "FItemInfo_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "JSItemType_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_ItemInfo.W_ItemInfo_C
// 0x0448 (0x06C8 - 0x0280)
class UW_ItemInfo_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ToggleAnim;                                        // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UW_EffectRowForItemInfo_C*              DebugEffectRow01;                                  // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_EffectRowForItemInfo_C*              DebugEffectRow02;                                  // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_EffectRowForItemInfo_C*              DebugEffectRow03;                                  // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_EffectRowForItemInfo_C*              DebugEffectRow04;                                  // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_60;                                  // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Armor;                               // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_AttachmentsPanel;                    // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Durability;                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Price;                               // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_RepairFor;                           // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_SlotDim;                             // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Weight;                              // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_207;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Durability;                                  // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_EquipmentMark;                               // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Props;                                     // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Separator_Durability;                              // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_EquipSlotInfo;                             // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Root;                                      // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_RepairPrice;                                  // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_WCoin;                                        // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Armor;                                   // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_CanDismantle;                            // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Description;                             // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Durability;                              // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ItemName;                                // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ItemType;                                // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_MaxDurability;                           // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_SellPrice;                               // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_SlotDemention;                           // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Weight;                                  // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Effects;                               // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_FoodEffects;                           // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_EffectRowForItemInfo_C*              W_EnergyEffect;                                    // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_EffectRowForItemInfo_C*              W_HydrationEffect;                                 // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FTimerHandle                           ToggleTimerHandle;                                 // 0x03A8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          VisibilityWidget;                                  // 0x03B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            TriggerUserWidget;                                 // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFItemInfo                             Item;                                              // 0x03C0(0x0220)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CompareAttachmentToWeapon;                         // 0x05E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E1[0x7];                                      // 0x05E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWS_CharaterPerks                      TraitsInfo;                                        // 0x05E8(0x00B8)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          Is_Traits;                                         // 0x06A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A1[0x7];                                      // 0x06A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   AttachmentInWeapon;                                // 0x06A8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	EInfoType                                     AttachmentInWeaponEnum;                            // 0x06C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_TypesOfModes                                ETypeOfModes;                                      // 0x06C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddAttachmentEffects(double Power, double EffectiveRange, double Stability, double FiringRate, double PowerModdifu, double EffectiveRangeModdifu, double StabilityModdifu, double FiringRateModdifu, bool IsAttachmentStats);
	void AddStatsModifiersForAttachment(double Stats, double Stats1, double Stats2, double Stats3);
	int32 CalculatePrice(const struct FFItemInfo& ItemInfo);
	void Construct();
	void ConvertInfoType(const class FString& In, class FText* Out);
	void CreateEffectRowWidget(const class FText& EffectName, double Stats, double StatsModdifu, bool ShowNumericValues, const struct FMargin& InPadding);
	void Destruct();
	void ExecuteUbergraph_W_ItemInfo(int32 EntryPoint);
	void FindBaseStatsWeapon(class FName Param_Name, double* Power, double* EffectiveRange, double* Stability, double* FireRatio);
	void GetItemInfo(struct FFItemInfo* ItemInfo, class UUserWidget** Param_TriggerUserWidget);
	void GetRepairPrice(int32* RepairPrice);
	void OnHideWidget(double Power, double EffectiveRange, double Stability, double FiringRate, bool WithoutAnim);
	void OnPrepareAtatchmentsEffects(const struct FFItemInfo& Param_Item);
	void OnPrepareAttachments(const struct FFItemInfo& Param_Item);
	void OnPrepareFoodEffects(const struct FFItemInfo& Param_Item);
	void OnPrepareIcons(const struct FFItemInfo& Param_Item);
	void OnPrepareWidget(const struct FFItemInfo& Param_Item, bool* Result);
	void OnPrepareWidgetTraits(const struct FWS_CharaterPerks& TRAITS, bool* Result);
	void OnShowWidget();
	void OnToggleWidget(bool NewState, class UUserWidget* UserWidget, const struct FFItemInfo& Param_Item, double Delay, bool Param_CompareAttachmentToWeapon, const struct FWS_CharaterPerks& TRAITS, bool IsTraits, EInfoType AttachmentType, E_TypesOfModes TypeOfModes, bool JustHideWithoutAnim);
	void OnUpdatePosition();
	void OnUpdateWidgetPosition(class UWidget* Widget);
	void ResetTextForDeutchLocalization(class UTextBlock* TextBlock);
	int32 SamplePrice();
	void Set_Color_Durability();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_ItemInfo_C">();
	}
	static class UW_ItemInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_ItemInfo_C>();
	}
};
static_assert(alignof(UW_ItemInfo_C) == 0x000008, "Wrong alignment on UW_ItemInfo_C");
static_assert(sizeof(UW_ItemInfo_C) == 0x0006C8, "Wrong size on UW_ItemInfo_C");
static_assert(offsetof(UW_ItemInfo_C, UberGraphFrame) == 0x000280, "Member 'UW_ItemInfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_ItemInfo_C, ToggleAnim) == 0x000288, "Member 'UW_ItemInfo_C::ToggleAnim' has a wrong offset!");
static_assert(offsetof(UW_ItemInfo_C, DebugEffectRow01) == 0x000290, "Member 'UW_ItemInfo_C::DebugEffectRow01' has a wrong offset!");
static_assert(offsetof(UW_ItemInfo_C, DebugEffectRow02) == 0x000298, "Member 'UW_ItemInfo_C::DebugEffectRow02' has a wrong offset!");
static_assert(offsetof(UW_ItemInfo_C, DebugEffectRow03) == 0x0002A0, "Member 'UW_ItemInfo_C::DebugEffectRow03' has a wrong offset!");
static_assert(offsetof(UW_ItemInfo_C, DebugEffectRow04) == 0x0002A8, "Member 'UW_ItemInfo_C::DebugEffectRow04' has a wrong offset!");
static_assert(offsetof(UW_ItemInfo_C, HorizontalBox_60) == 0x0002B0, "Member 'UW_ItemInfo_C::HorizontalBox_60' has a wrong offset!");
static_assert(offsetof(UW_ItemInfo_C, HorizontalBox_Armor) == 0x0002B8, "Member 'UW_ItemInfo_C::HorizontalBox_Armor' has a wrong offset!");
static_assert(offsetof(UW_ItemInfo_C, HorizontalBox_AttachmentsPanel) == 0x0002C0, "Member 'UW_ItemInfo_C::HorizontalBox_AttachmentsPanel' has a wrong offset!");
static_assert(offsetof(UW_ItemInfo_C, HorizontalBox_Durability) == 0x0002C8, "Member 'UW_ItemInfo_C::HorizontalBox_Durability' has a wrong offset!");
static_assert(offsetof(UW_ItemInfo_C, HorizontalBox_Price) == 0x0002D0, "Member 'UW_ItemInfo_C::HorizontalBox_Price' has a wrong offset!");
static_assert(offsetof(UW_ItemInfo_C, HorizontalBox_RepairFor) == 0x0002D8, "Member 'UW_ItemInfo_C::HorizontalBox_RepairFor' has a wrong offset!");
static_assert(offsetof(UW_ItemInfo_C, HorizontalBox_SlotDim) == 0x0002E0, "Member 'UW_ItemInfo_C::HorizontalBox_SlotDim' has a wrong offset!");
static_assert(offsetof(UW_ItemInfo_C, HorizontalBox_Weight) == 0x0002E8, "Member 'UW_ItemInfo_C::HorizontalBox_Weight' has a wrong offset!");
static_assert(offsetof(UW_ItemInfo_C, Image_207) == 0x0002F0, "Member 'UW_ItemInfo_C::Image_207' has a wrong offset!");
static_assert(offsetof(UW_ItemInfo_C, Image_Durability) == 0x0002F8, "Member 'UW_ItemInfo_C::Image_Durability' has a wrong offset!");
static_assert(offsetof(UW_ItemInfo_C, Image_EquipmentMark) == 0x000300, "Member 'UW_ItemInfo_C::Image_EquipmentMark' has a wrong offset!");
static_assert(offsetof(UW_ItemInfo_C, Overlay_Props) == 0x000308, "Member 'UW_ItemInfo_C::Overlay_Props' has a wrong offset!");
static_assert(offsetof(UW_ItemInfo_C, Separator_Durability) == 0x000310, "Member 'UW_ItemInfo_C::Separator_Durability' has a wrong offset!");
static_assert(offsetof(UW_ItemInfo_C, SizeBox_EquipSlotInfo) == 0x000318, "Member 'UW_ItemInfo_C::SizeBox_EquipSlotInfo' has a wrong offset!");
static_assert(offsetof(UW_ItemInfo_C, SizeBox_Root) == 0x000320, "Member 'UW_ItemInfo_C::SizeBox_Root' has a wrong offset!");
static_assert(offsetof(UW_ItemInfo_C, Text_RepairPrice) == 0x000328, "Member 'UW_ItemInfo_C::Text_RepairPrice' has a wrong offset!");
static_assert(offsetof(UW_ItemInfo_C, Text_WCoin) == 0x000330, "Member 'UW_ItemInfo_C::Text_WCoin' has a wrong offset!");
static_assert(offsetof(UW_ItemInfo_C, TextBlock_Armor) == 0x000338, "Member 'UW_ItemInfo_C::TextBlock_Armor' has a wrong offset!");
static_assert(offsetof(UW_ItemInfo_C, TextBlock_CanDismantle) == 0x000340, "Member 'UW_ItemInfo_C::TextBlock_CanDismantle' has a wrong offset!");
static_assert(offsetof(UW_ItemInfo_C, TextBlock_Description) == 0x000348, "Member 'UW_ItemInfo_C::TextBlock_Description' has a wrong offset!");
static_assert(offsetof(UW_ItemInfo_C, TextBlock_Durability) == 0x000350, "Member 'UW_ItemInfo_C::TextBlock_Durability' has a wrong offset!");
static_assert(offsetof(UW_ItemInfo_C, TextBlock_ItemName) == 0x000358, "Member 'UW_ItemInfo_C::TextBlock_ItemName' has a wrong offset!");
static_assert(offsetof(UW_ItemInfo_C, TextBlock_ItemType) == 0x000360, "Member 'UW_ItemInfo_C::TextBlock_ItemType' has a wrong offset!");
static_assert(offsetof(UW_ItemInfo_C, TextBlock_MaxDurability) == 0x000368, "Member 'UW_ItemInfo_C::TextBlock_MaxDurability' has a wrong offset!");
static_assert(offsetof(UW_ItemInfo_C, TextBlock_SellPrice) == 0x000370, "Member 'UW_ItemInfo_C::TextBlock_SellPrice' has a wrong offset!");
static_assert(offsetof(UW_ItemInfo_C, TextBlock_SlotDemention) == 0x000378, "Member 'UW_ItemInfo_C::TextBlock_SlotDemention' has a wrong offset!");
static_assert(offsetof(UW_ItemInfo_C, TextBlock_Weight) == 0x000380, "Member 'UW_ItemInfo_C::TextBlock_Weight' has a wrong offset!");
static_assert(offsetof(UW_ItemInfo_C, VerticalBox_Effects) == 0x000388, "Member 'UW_ItemInfo_C::VerticalBox_Effects' has a wrong offset!");
static_assert(offsetof(UW_ItemInfo_C, VerticalBox_FoodEffects) == 0x000390, "Member 'UW_ItemInfo_C::VerticalBox_FoodEffects' has a wrong offset!");
static_assert(offsetof(UW_ItemInfo_C, W_EnergyEffect) == 0x000398, "Member 'UW_ItemInfo_C::W_EnergyEffect' has a wrong offset!");
static_assert(offsetof(UW_ItemInfo_C, W_HydrationEffect) == 0x0003A0, "Member 'UW_ItemInfo_C::W_HydrationEffect' has a wrong offset!");
static_assert(offsetof(UW_ItemInfo_C, ToggleTimerHandle) == 0x0003A8, "Member 'UW_ItemInfo_C::ToggleTimerHandle' has a wrong offset!");
static_assert(offsetof(UW_ItemInfo_C, VisibilityWidget) == 0x0003B0, "Member 'UW_ItemInfo_C::VisibilityWidget' has a wrong offset!");
static_assert(offsetof(UW_ItemInfo_C, TriggerUserWidget) == 0x0003B8, "Member 'UW_ItemInfo_C::TriggerUserWidget' has a wrong offset!");
static_assert(offsetof(UW_ItemInfo_C, Item) == 0x0003C0, "Member 'UW_ItemInfo_C::Item' has a wrong offset!");
static_assert(offsetof(UW_ItemInfo_C, CompareAttachmentToWeapon) == 0x0005E0, "Member 'UW_ItemInfo_C::CompareAttachmentToWeapon' has a wrong offset!");
static_assert(offsetof(UW_ItemInfo_C, TraitsInfo) == 0x0005E8, "Member 'UW_ItemInfo_C::TraitsInfo' has a wrong offset!");
static_assert(offsetof(UW_ItemInfo_C, Is_Traits) == 0x0006A0, "Member 'UW_ItemInfo_C::Is_Traits' has a wrong offset!");
static_assert(offsetof(UW_ItemInfo_C, AttachmentInWeapon) == 0x0006A8, "Member 'UW_ItemInfo_C::AttachmentInWeapon' has a wrong offset!");
static_assert(offsetof(UW_ItemInfo_C, AttachmentInWeaponEnum) == 0x0006C0, "Member 'UW_ItemInfo_C::AttachmentInWeaponEnum' has a wrong offset!");
static_assert(offsetof(UW_ItemInfo_C, ETypeOfModes) == 0x0006C1, "Member 'UW_ItemInfo_C::ETypeOfModes' has a wrong offset!");

}

