#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_LabelTextShop

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_LabelTextShop.W_LabelTextShop_C.ExecuteUbergraph_W_LabelTextShop
// 0x0008 (0x0008 - 0x0000)
struct W_LabelTextShop_C_ExecuteUbergraph_W_LabelTextShop final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_LabelTextShop_C_ExecuteUbergraph_W_LabelTextShop) == 0x000004, "Wrong alignment on W_LabelTextShop_C_ExecuteUbergraph_W_LabelTextShop");
static_assert(sizeof(W_LabelTextShop_C_ExecuteUbergraph_W_LabelTextShop) == 0x000008, "Wrong size on W_LabelTextShop_C_ExecuteUbergraph_W_LabelTextShop");
static_assert(offsetof(W_LabelTextShop_C_ExecuteUbergraph_W_LabelTextShop, EntryPoint) == 0x000000, "Member 'W_LabelTextShop_C_ExecuteUbergraph_W_LabelTextShop::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_LabelTextShop_C_ExecuteUbergraph_W_LabelTextShop, K2Node_Event_IsDesignTime) == 0x000004, "Member 'W_LabelTextShop_C_ExecuteUbergraph_W_LabelTextShop::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function W_LabelTextShop.W_LabelTextShop_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_LabelTextShop_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_LabelTextShop_C_PreConstruct) == 0x000001, "Wrong alignment on W_LabelTextShop_C_PreConstruct");
static_assert(sizeof(W_LabelTextShop_C_PreConstruct) == 0x000001, "Wrong size on W_LabelTextShop_C_PreConstruct");
static_assert(offsetof(W_LabelTextShop_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_LabelTextShop_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

