#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Loan

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Loan.W_Loan_C
// 0x00D8 (0x0358 - 0x0280)
class UW_Loan_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hide;                                              // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Show;                                              // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_319;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_CurrentValue;                                 // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_LoanBalance;                                  // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ModalWindowButton_C*                 W_ModalWindowButton;                               // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ModalWindowButton_C*                 W_ModalWindowButton_142;                           // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemInteractionValueChangeButton_C* WBP_ButtonMinus;                                   // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemInteractionValueChangeButton_C* WBP_ButtonPlus;                                    // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ASurvPC_C*                              As_Surv_PC;                                        // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnCloseWLoan;                                      // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnPressedToPlay;                                   // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         LoanBalance;                                       // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxValue;                                          // 0x02FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentValue;                                      // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StepValue;                                         // 0x0304(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      Player_Ref;                                        // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnRepaidLoan;                                      // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FTimerHandle                           TimerPlus;                                         // 0x0320(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TimerMinus;                                        // 0x0328(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsHold_;                                           // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnHoldButtonPlus;                                  // 0x0338(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnHoldButtonMinus;                                 // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__W_Loan_W_ModalWindowButton_142_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature();
	void BndEvt__W_Loan_W_ModalWindowButton_K2Node_ComponentBoundEvent_3_OnPressed__DelegateSignature();
	void BndEvt__W_Loan_WBP_ButtonMinus_K2Node_ComponentBoundEvent_5_OnChangeValueButtonPressed__DelegateSignature();
	void BndEvt__W_Loan_WBP_ButtonMinus_K2Node_ComponentBoundEvent_6_OnReleased__DelegateSignature();
	void BndEvt__W_Loan_WBP_ButtonPlus_K2Node_ComponentBoundEvent_1_OnReleased__DelegateSignature();
	void BndEvt__W_Loan_WBP_ButtonPlus_K2Node_ComponentBoundEvent_4_OnChangeValueButtonPressed__DelegateSignature();
	void ExecuteUbergraph_W_Loan(int32 EntryPoint);
	void Hold_Button_Minus();
	void Hold_Button_Plus();
	void HoldButtonMinus();
	void HoldButtonPlus();
	void OnClose();
	void OnCloseWLoan__DelegateSignature();
	void OnHoldButtonMinus__DelegateSignature();
	void OnHoldButtonPlus__DelegateSignature();
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	struct FEventReply OnKeyUp(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnMouseButtonUp(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnPressedToPay();
	void OnPressedToPlay__DelegateSignature(int32 Param_CurrentValue);
	void OnRepaidLoan__DelegateSignature();
	void PreConstruct(bool IsDesignTime);
	void PressedMinus();
	void PressedPlus();
	void SetInputUIMode();
	void SetTextCurrentValue(int32 Param_CurrentValue);
	void SetTextLoanBalance(int32 LoadBalance);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Loan_C">();
	}
	static class UW_Loan_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Loan_C>();
	}
};
static_assert(alignof(UW_Loan_C) == 0x000008, "Wrong alignment on UW_Loan_C");
static_assert(sizeof(UW_Loan_C) == 0x000358, "Wrong size on UW_Loan_C");
static_assert(offsetof(UW_Loan_C, UberGraphFrame) == 0x000280, "Member 'UW_Loan_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Loan_C, Hide) == 0x000288, "Member 'UW_Loan_C::Hide' has a wrong offset!");
static_assert(offsetof(UW_Loan_C, Show) == 0x000290, "Member 'UW_Loan_C::Show' has a wrong offset!");
static_assert(offsetof(UW_Loan_C, Image_319) == 0x000298, "Member 'UW_Loan_C::Image_319' has a wrong offset!");
static_assert(offsetof(UW_Loan_C, Text_CurrentValue) == 0x0002A0, "Member 'UW_Loan_C::Text_CurrentValue' has a wrong offset!");
static_assert(offsetof(UW_Loan_C, Text_LoanBalance) == 0x0002A8, "Member 'UW_Loan_C::Text_LoanBalance' has a wrong offset!");
static_assert(offsetof(UW_Loan_C, W_ModalWindowButton) == 0x0002B0, "Member 'UW_Loan_C::W_ModalWindowButton' has a wrong offset!");
static_assert(offsetof(UW_Loan_C, W_ModalWindowButton_142) == 0x0002B8, "Member 'UW_Loan_C::W_ModalWindowButton_142' has a wrong offset!");
static_assert(offsetof(UW_Loan_C, WBP_ButtonMinus) == 0x0002C0, "Member 'UW_Loan_C::WBP_ButtonMinus' has a wrong offset!");
static_assert(offsetof(UW_Loan_C, WBP_ButtonPlus) == 0x0002C8, "Member 'UW_Loan_C::WBP_ButtonPlus' has a wrong offset!");
static_assert(offsetof(UW_Loan_C, As_Surv_PC) == 0x0002D0, "Member 'UW_Loan_C::As_Surv_PC' has a wrong offset!");
static_assert(offsetof(UW_Loan_C, OnCloseWLoan) == 0x0002D8, "Member 'UW_Loan_C::OnCloseWLoan' has a wrong offset!");
static_assert(offsetof(UW_Loan_C, OnPressedToPlay) == 0x0002E8, "Member 'UW_Loan_C::OnPressedToPlay' has a wrong offset!");
static_assert(offsetof(UW_Loan_C, LoanBalance) == 0x0002F8, "Member 'UW_Loan_C::LoanBalance' has a wrong offset!");
static_assert(offsetof(UW_Loan_C, MaxValue) == 0x0002FC, "Member 'UW_Loan_C::MaxValue' has a wrong offset!");
static_assert(offsetof(UW_Loan_C, CurrentValue) == 0x000300, "Member 'UW_Loan_C::CurrentValue' has a wrong offset!");
static_assert(offsetof(UW_Loan_C, StepValue) == 0x000304, "Member 'UW_Loan_C::StepValue' has a wrong offset!");
static_assert(offsetof(UW_Loan_C, Player_Ref) == 0x000308, "Member 'UW_Loan_C::Player_Ref' has a wrong offset!");
static_assert(offsetof(UW_Loan_C, OnRepaidLoan) == 0x000310, "Member 'UW_Loan_C::OnRepaidLoan' has a wrong offset!");
static_assert(offsetof(UW_Loan_C, TimerPlus) == 0x000320, "Member 'UW_Loan_C::TimerPlus' has a wrong offset!");
static_assert(offsetof(UW_Loan_C, TimerMinus) == 0x000328, "Member 'UW_Loan_C::TimerMinus' has a wrong offset!");
static_assert(offsetof(UW_Loan_C, IsHold_) == 0x000330, "Member 'UW_Loan_C::IsHold_' has a wrong offset!");
static_assert(offsetof(UW_Loan_C, OnHoldButtonPlus) == 0x000338, "Member 'UW_Loan_C::OnHoldButtonPlus' has a wrong offset!");
static_assert(offsetof(UW_Loan_C, OnHoldButtonMinus) == 0x000348, "Member 'UW_Loan_C::OnHoldButtonMinus' has a wrong offset!");

}

