#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Loan

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "FMODStudio_structs.hpp"


namespace SDK::Params
{

// Function W_Loan.W_Loan_C.ExecuteUbergraph_W_Loan
// 0x0070 (0x0070 - 0x0000)
struct W_Loan_C_ExecuteUbergraph_W_Loan final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_1;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Loan_C_ExecuteUbergraph_W_Loan) == 0x000008, "Wrong alignment on W_Loan_C_ExecuteUbergraph_W_Loan");
static_assert(sizeof(W_Loan_C_ExecuteUbergraph_W_Loan) == 0x000070, "Wrong size on W_Loan_C_ExecuteUbergraph_W_Loan");
static_assert(offsetof(W_Loan_C_ExecuteUbergraph_W_Loan, EntryPoint) == 0x000000, "Member 'W_Loan_C_ExecuteUbergraph_W_Loan::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Loan_C_ExecuteUbergraph_W_Loan, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000004, "Member 'W_Loan_C_ExecuteUbergraph_W_Loan::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Loan_C_ExecuteUbergraph_W_Loan, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'W_Loan_C_ExecuteUbergraph_W_Loan::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Loan_C_ExecuteUbergraph_W_Loan, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00000C, "Member 'W_Loan_C_ExecuteUbergraph_W_Loan::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Loan_C_ExecuteUbergraph_W_Loan, CallFunc_PlayEvent2D_ReturnValue) == 0x000010, "Member 'W_Loan_C_ExecuteUbergraph_W_Loan::CallFunc_PlayEvent2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Loan_C_ExecuteUbergraph_W_Loan, CallFunc_Subtract_IntInt_ReturnValue) == 0x000018, "Member 'W_Loan_C_ExecuteUbergraph_W_Loan::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Loan_C_ExecuteUbergraph_W_Loan, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00001C, "Member 'W_Loan_C_ExecuteUbergraph_W_Loan::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Loan_C_ExecuteUbergraph_W_Loan, CallFunc_PlayEvent2D_ReturnValue_1) == 0x000020, "Member 'W_Loan_C_ExecuteUbergraph_W_Loan::CallFunc_PlayEvent2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Loan_C_ExecuteUbergraph_W_Loan, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000028, "Member 'W_Loan_C_ExecuteUbergraph_W_Loan::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Loan_C_ExecuteUbergraph_W_Loan, K2Node_CreateDelegate_OutputDelegate) == 0x00002C, "Member 'W_Loan_C_ExecuteUbergraph_W_Loan::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_Loan_C_ExecuteUbergraph_W_Loan, K2Node_Event_IsDesignTime) == 0x00003C, "Member 'W_Loan_C_ExecuteUbergraph_W_Loan::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_Loan_C_ExecuteUbergraph_W_Loan, K2Node_CreateDelegate_OutputDelegate_1) == 0x000040, "Member 'W_Loan_C_ExecuteUbergraph_W_Loan::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(W_Loan_C_ExecuteUbergraph_W_Loan, K2Node_CreateDelegate_OutputDelegate_2) == 0x000050, "Member 'W_Loan_C_ExecuteUbergraph_W_Loan::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(W_Loan_C_ExecuteUbergraph_W_Loan, K2Node_CreateDelegate_OutputDelegate_3) == 0x000060, "Member 'W_Loan_C_ExecuteUbergraph_W_Loan::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");

// Function W_Loan.W_Loan_C.HoldButtonMinus
// 0x0048 (0x0048 - 0x0000)
struct W_Loan_C_HoldButtonMinus final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetInputKeyTimeDown_ReturnValue;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F[0x1];                                       // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Loan_C_HoldButtonMinus) == 0x000008, "Wrong alignment on W_Loan_C_HoldButtonMinus");
static_assert(sizeof(W_Loan_C_HoldButtonMinus) == 0x000048, "Wrong size on W_Loan_C_HoldButtonMinus");
static_assert(offsetof(W_Loan_C_HoldButtonMinus, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'W_Loan_C_HoldButtonMinus::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_Loan_C_HoldButtonMinus, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'W_Loan_C_HoldButtonMinus::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Loan_C_HoldButtonMinus, CallFunc_GetInputKeyTimeDown_ReturnValue) == 0x000018, "Member 'W_Loan_C_HoldButtonMinus::CallFunc_GetInputKeyTimeDown_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Loan_C_HoldButtonMinus, CallFunc_Less_DoubleDouble_ReturnValue) == 0x00001C, "Member 'W_Loan_C_HoldButtonMinus::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Loan_C_HoldButtonMinus, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x00001D, "Member 'W_Loan_C_HoldButtonMinus::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Loan_C_HoldButtonMinus, CallFunc_BooleanAND_ReturnValue) == 0x00001E, "Member 'W_Loan_C_HoldButtonMinus::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Loan_C_HoldButtonMinus, CallFunc_SelectFloat_ReturnValue) == 0x000020, "Member 'W_Loan_C_HoldButtonMinus::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Loan_C_HoldButtonMinus, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'W_Loan_C_HoldButtonMinus::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Loan_C_HoldButtonMinus, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x000030, "Member 'W_Loan_C_HoldButtonMinus::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_Loan_C_HoldButtonMinus, CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast) == 0x000038, "Member 'W_Loan_C_HoldButtonMinus::CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_Loan_C_HoldButtonMinus, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x000040, "Member 'W_Loan_C_HoldButtonMinus::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");

// Function W_Loan.W_Loan_C.HoldButtonPlus
// 0x0048 (0x0048 - 0x0000)
struct W_Loan_C_HoldButtonPlus final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetInputKeyTimeDown_ReturnValue;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F[0x1];                                       // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Loan_C_HoldButtonPlus) == 0x000008, "Wrong alignment on W_Loan_C_HoldButtonPlus");
static_assert(sizeof(W_Loan_C_HoldButtonPlus) == 0x000048, "Wrong size on W_Loan_C_HoldButtonPlus");
static_assert(offsetof(W_Loan_C_HoldButtonPlus, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'W_Loan_C_HoldButtonPlus::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_Loan_C_HoldButtonPlus, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'W_Loan_C_HoldButtonPlus::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Loan_C_HoldButtonPlus, CallFunc_GetInputKeyTimeDown_ReturnValue) == 0x000018, "Member 'W_Loan_C_HoldButtonPlus::CallFunc_GetInputKeyTimeDown_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Loan_C_HoldButtonPlus, CallFunc_Less_DoubleDouble_ReturnValue) == 0x00001C, "Member 'W_Loan_C_HoldButtonPlus::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Loan_C_HoldButtonPlus, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x00001D, "Member 'W_Loan_C_HoldButtonPlus::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Loan_C_HoldButtonPlus, CallFunc_BooleanAND_ReturnValue) == 0x00001E, "Member 'W_Loan_C_HoldButtonPlus::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Loan_C_HoldButtonPlus, CallFunc_SelectFloat_ReturnValue) == 0x000020, "Member 'W_Loan_C_HoldButtonPlus::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Loan_C_HoldButtonPlus, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'W_Loan_C_HoldButtonPlus::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Loan_C_HoldButtonPlus, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x000030, "Member 'W_Loan_C_HoldButtonPlus::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_Loan_C_HoldButtonPlus, CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast) == 0x000038, "Member 'W_Loan_C_HoldButtonPlus::CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_Loan_C_HoldButtonPlus, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x000040, "Member 'W_Loan_C_HoldButtonPlus::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");

// Function W_Loan.W_Loan_C.OnKeyDown
// 0x0130 (0x0130 - 0x0000)
struct W_Loan_C_OnKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0078(0x00B8)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(W_Loan_C_OnKeyDown) == 0x000008, "Wrong alignment on W_Loan_C_OnKeyDown");
static_assert(sizeof(W_Loan_C_OnKeyDown) == 0x000130, "Wrong size on W_Loan_C_OnKeyDown");
static_assert(offsetof(W_Loan_C_OnKeyDown, MyGeometry) == 0x000000, "Member 'W_Loan_C_OnKeyDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_Loan_C_OnKeyDown, InKeyEvent) == 0x000038, "Member 'W_Loan_C_OnKeyDown::InKeyEvent' has a wrong offset!");
static_assert(offsetof(W_Loan_C_OnKeyDown, ReturnValue) == 0x000078, "Member 'W_Loan_C_OnKeyDown::ReturnValue' has a wrong offset!");

// Function W_Loan.W_Loan_C.OnKeyUp
// 0x0130 (0x0130 - 0x0000)
struct W_Loan_C_OnKeyUp final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0078(0x00B8)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(W_Loan_C_OnKeyUp) == 0x000008, "Wrong alignment on W_Loan_C_OnKeyUp");
static_assert(sizeof(W_Loan_C_OnKeyUp) == 0x000130, "Wrong size on W_Loan_C_OnKeyUp");
static_assert(offsetof(W_Loan_C_OnKeyUp, MyGeometry) == 0x000000, "Member 'W_Loan_C_OnKeyUp::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_Loan_C_OnKeyUp, InKeyEvent) == 0x000038, "Member 'W_Loan_C_OnKeyUp::InKeyEvent' has a wrong offset!");
static_assert(offsetof(W_Loan_C_OnKeyUp, ReturnValue) == 0x000078, "Member 'W_Loan_C_OnKeyUp::ReturnValue' has a wrong offset!");

// Function W_Loan.W_Loan_C.OnMouseButtonDown
// 0x0168 (0x0168 - 0x0000)
struct W_Loan_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(W_Loan_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on W_Loan_C_OnMouseButtonDown");
static_assert(sizeof(W_Loan_C_OnMouseButtonDown) == 0x000168, "Wrong size on W_Loan_C_OnMouseButtonDown");
static_assert(offsetof(W_Loan_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'W_Loan_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_Loan_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'W_Loan_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(W_Loan_C_OnMouseButtonDown, ReturnValue) == 0x0000B0, "Member 'W_Loan_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");

// Function W_Loan.W_Loan_C.OnMouseButtonUp
// 0x0168 (0x0168 - 0x0000)
struct W_Loan_C_OnMouseButtonUp final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(W_Loan_C_OnMouseButtonUp) == 0x000008, "Wrong alignment on W_Loan_C_OnMouseButtonUp");
static_assert(sizeof(W_Loan_C_OnMouseButtonUp) == 0x000168, "Wrong size on W_Loan_C_OnMouseButtonUp");
static_assert(offsetof(W_Loan_C_OnMouseButtonUp, MyGeometry) == 0x000000, "Member 'W_Loan_C_OnMouseButtonUp::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_Loan_C_OnMouseButtonUp, MouseEvent) == 0x000038, "Member 'W_Loan_C_OnMouseButtonUp::MouseEvent' has a wrong offset!");
static_assert(offsetof(W_Loan_C_OnMouseButtonUp, ReturnValue) == 0x0000B0, "Member 'W_Loan_C_OnMouseButtonUp::ReturnValue' has a wrong offset!");

// Function W_Loan.W_Loan_C.OnPressedToPlay__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_Loan_C_OnPressedToPlay__DelegateSignature final
{
public:
	int32                                         Param_CurrentValue;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Loan_C_OnPressedToPlay__DelegateSignature) == 0x000004, "Wrong alignment on W_Loan_C_OnPressedToPlay__DelegateSignature");
static_assert(sizeof(W_Loan_C_OnPressedToPlay__DelegateSignature) == 0x000004, "Wrong size on W_Loan_C_OnPressedToPlay__DelegateSignature");
static_assert(offsetof(W_Loan_C_OnPressedToPlay__DelegateSignature, Param_CurrentValue) == 0x000000, "Member 'W_Loan_C_OnPressedToPlay__DelegateSignature::Param_CurrentValue' has a wrong offset!");

// Function W_Loan.W_Loan_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_Loan_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Loan_C_PreConstruct) == 0x000001, "Wrong alignment on W_Loan_C_PreConstruct");
static_assert(sizeof(W_Loan_C_PreConstruct) == 0x000001, "Wrong size on W_Loan_C_PreConstruct");
static_assert(offsetof(W_Loan_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_Loan_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_Loan.W_Loan_C.SetInputUIMode
// 0x0018 (0x0018 - 0x0000)
struct W_Loan_C_SetInputUIMode final
{
public:
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvPC_C*                              K2Node_DynamicCast_AsSurv_PC;                      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Loan_C_SetInputUIMode) == 0x000008, "Wrong alignment on W_Loan_C_SetInputUIMode");
static_assert(sizeof(W_Loan_C_SetInputUIMode) == 0x000018, "Wrong size on W_Loan_C_SetInputUIMode");
static_assert(offsetof(W_Loan_C_SetInputUIMode, CallFunc_GetOwningPlayer_ReturnValue) == 0x000000, "Member 'W_Loan_C_SetInputUIMode::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Loan_C_SetInputUIMode, K2Node_DynamicCast_AsSurv_PC) == 0x000008, "Member 'W_Loan_C_SetInputUIMode::K2Node_DynamicCast_AsSurv_PC' has a wrong offset!");
static_assert(offsetof(W_Loan_C_SetInputUIMode, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'W_Loan_C_SetInputUIMode::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function W_Loan.W_Loan_C.SetTextCurrentValue
// 0x0088 (0x0088 - 0x0000)
struct W_Loan_C_SetTextCurrentValue final
{
public:
	int32                                         Param_CurrentValue;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0010(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0070(0x0018)()
};
static_assert(alignof(W_Loan_C_SetTextCurrentValue) == 0x000008, "Wrong alignment on W_Loan_C_SetTextCurrentValue");
static_assert(sizeof(W_Loan_C_SetTextCurrentValue) == 0x000088, "Wrong size on W_Loan_C_SetTextCurrentValue");
static_assert(offsetof(W_Loan_C_SetTextCurrentValue, Param_CurrentValue) == 0x000000, "Member 'W_Loan_C_SetTextCurrentValue::Param_CurrentValue' has a wrong offset!");
static_assert(offsetof(W_Loan_C_SetTextCurrentValue, CallFunc_Greater_IntInt_ReturnValue) == 0x000004, "Member 'W_Loan_C_SetTextCurrentValue::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Loan_C_SetTextCurrentValue, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000008, "Member 'W_Loan_C_SetTextCurrentValue::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Loan_C_SetTextCurrentValue, K2Node_MakeStruct_FormatArgumentData) == 0x000010, "Member 'W_Loan_C_SetTextCurrentValue::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_Loan_C_SetTextCurrentValue, K2Node_MakeArray_Array) == 0x000060, "Member 'W_Loan_C_SetTextCurrentValue::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_Loan_C_SetTextCurrentValue, CallFunc_Format_ReturnValue) == 0x000070, "Member 'W_Loan_C_SetTextCurrentValue::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function W_Loan.W_Loan_C.SetTextLoanBalance
// 0x0020 (0x0020 - 0x0000)
struct W_Loan_C_SetTextLoanBalance final
{
public:
	int32                                         LoadBalance;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
};
static_assert(alignof(W_Loan_C_SetTextLoanBalance) == 0x000008, "Wrong alignment on W_Loan_C_SetTextLoanBalance");
static_assert(sizeof(W_Loan_C_SetTextLoanBalance) == 0x000020, "Wrong size on W_Loan_C_SetTextLoanBalance");
static_assert(offsetof(W_Loan_C_SetTextLoanBalance, LoadBalance) == 0x000000, "Member 'W_Loan_C_SetTextLoanBalance::LoadBalance' has a wrong offset!");
static_assert(offsetof(W_Loan_C_SetTextLoanBalance, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'W_Loan_C_SetTextLoanBalance::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

}

