#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_LockpickingInfo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_LockpickingInfo.W_LockpickingInfo_C
// 0x0028 (0x02A8 - 0x0280)
class UW_LockpickingInfo_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       LockpickingAlarmAnim;                              // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Message;                                 // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 Text;                                              // 0x0298(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void CollapsedMesage();
	void Construct();
	void ExecuteUbergraph_W_LockpickingInfo(int32 EntryPoint);
	void ShowCustomMessage(const class FString& Message);
	void ShowCustomMessageAllTime(const class FString& InString);
	void ShowCustomMessageWithTime(const class FString& Message, double Duration);
	void ShowDefaultMessage();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_LockpickingInfo_C">();
	}
	static class UW_LockpickingInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_LockpickingInfo_C>();
	}
};
static_assert(alignof(UW_LockpickingInfo_C) == 0x000008, "Wrong alignment on UW_LockpickingInfo_C");
static_assert(sizeof(UW_LockpickingInfo_C) == 0x0002A8, "Wrong size on UW_LockpickingInfo_C");
static_assert(offsetof(UW_LockpickingInfo_C, UberGraphFrame) == 0x000280, "Member 'UW_LockpickingInfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_LockpickingInfo_C, LockpickingAlarmAnim) == 0x000288, "Member 'UW_LockpickingInfo_C::LockpickingAlarmAnim' has a wrong offset!");
static_assert(offsetof(UW_LockpickingInfo_C, TextBlock_Message) == 0x000290, "Member 'UW_LockpickingInfo_C::TextBlock_Message' has a wrong offset!");
static_assert(offsetof(UW_LockpickingInfo_C, Text) == 0x000298, "Member 'UW_LockpickingInfo_C::Text' has a wrong offset!");

}

