#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_MainMenu

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"
#include "FMODStudio_structs.hpp"


namespace SDK::Params
{

// Function W_MainMenu.W_MainMenu_C.ExecuteUbergraph_W_MainMenu
// 0x0698 (0x0698 - 0x0000)
struct W_MainMenu_C_ExecuteUbergraph_W_MainMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTDB_LevelInspectorSubsystem*           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCurrentLevelLoadedFull_ReturnValue;    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F[0x1];                                       // 0x003F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0040(0x0010)(ConstParm, ReferenceParm)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival;                  // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival_1;                // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ChooseCharacter_C*                  CallFunc_GetActorOfClass_ReturnValue;              // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_CreateCharacter_C*                  CallFunc_GetActorOfClass_ReturnValue_1;            // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x00B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class ABP_ChooseCharacter_C*                  CallFunc_GetActorOfClass_ReturnValue_2;            // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C3[0x5];                                       // 0x00C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array_1;                          // 0x00C8(0x0010)(ConstParm, ReferenceParm)
	bool                                          K2Node_CustomEvent_bSkipAnimations;                // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_RefreshMesh;                    // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_BoxOverlapActors_OutActors;               // 0x00E0(0x0010)(ReferenceParm)
	bool                                          CallFunc_BoxOverlapActors_ReturnValue;             // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_ChooseCharacter_C*                  CallFunc_GetActorOfClass_ReturnValue_3;            // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ABP_ChooseCharacter_C*                  CallFunc_GetActorOfClass_ReturnValue_4;            // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_IconCharacter_C*                    CallFunc_GetActorOfClass_ReturnValue_5;            // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_1;                // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0134(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0170(0x0018)()
	bool                                          CallFunc_IsVisible_ReturnValue_1;                  // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x01B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B3[0x5];                                      // 0x01B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_1;                              // 0x01B8(0x0018)()
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_2;            // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_GI_Survival_C>      K2Node_DynamicCast_AsI_GI_Survival;                // 0x01D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFirstStart_IsFirstStart;                // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EA[0x6];                                      // 0x01EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_TimerExistsHandle_ReturnValue;         // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_202[0x2];                                      // 0x0202(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0204(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0218(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_3;            // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_GI_Survival_C>      K2Node_DynamicCast_AsI_GI_Survival_1;              // 0x0228(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_4;            // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_GetShadersRemainingPSO_Count;             // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_GI_Survival_C>      K2Node_DynamicCast_AsI_GI_Survival_2;              // 0x0250(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_GetShadersRemainingPSO_Count_1;           // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0270(0x0050)(HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x02C8(0x0050)(HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x0318(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0330(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0340(0x0018)()
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_5;            // 0x0358(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_6;            // 0x0360(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_GI_Survival_C>      K2Node_DynamicCast_AsI_GI_Survival_3;              // 0x0368(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_379[0x7];                                      // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_GI_Survival_C>      K2Node_DynamicCast_AsI_GI_Survival_4;              // 0x0380(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_391[0x7];                                      // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_7;            // 0x0398(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_GI_Survival_C>      K2Node_DynamicCast_AsI_GI_Survival_5;              // 0x03A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x03B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B2[0x6];                                      // 0x03B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x03B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C1[0x7];                                      // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APC_MainMenu_C*                         K2Node_DynamicCast_AsPC_Main_Menu;                 // 0x03C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D1[0x7];                                      // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AA_GateCamera_C*                        CallFunc_GetActorOfClass_ReturnValue_6;            // 0x03D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ChooseCharacter_C*                  CallFunc_GetActorOfClass_ReturnValue_7;            // 0x03E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x03E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x03F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F2[0x6];                                      // 0x03F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_2;                // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0400(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_404[0x4];                                      // 0x0404(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0408(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_414[0x4];                                      // 0x0414(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0418(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_421[0x7];                                      // 0x0421(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_5;        // 0x0428(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_3;                // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0438(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD_MainMenu_C*                        K2Node_DynamicCast_AsHUD_Main_Menu;                // 0x0440(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0449(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x044A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44B[0x5];                                      // 0x044B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_8;            // 0x0450(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival_2;                // 0x0458(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_461[0x7];                                      // 0x0461(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_6;        // 0x0468(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue_1;                     // 0x0470(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_479[0x7];                                      // 0x0479(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUD_MainMenu_C*                        K2Node_DynamicCast_AsHUD_Main_Menu_1;              // 0x0480(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_489[0x7];                                      // 0x0489(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0490(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0498(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49C[0x4];                                      // 0x049C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APC_MainMenu_C*                         K2Node_DynamicCast_AsPC_Main_Menu_1;               // 0x04A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_13;                    // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A9[0x3];                                      // 0x04A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x04AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B1[0x7];                                      // 0x04B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_7;        // 0x04B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue_2;                     // 0x04C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD_MainMenu_C*                        K2Node_DynamicCast_AsHUD_Main_Menu_2;              // 0x04C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_14;                    // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D1[0x7];                                      // 0x04D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_9;            // 0x04D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival_3;                // 0x04E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_15;                    // 0x04E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E9[0x7];                                      // 0x04E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_8;        // 0x04F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F9[0x3];                                      // 0x04F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x04FC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x050C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51C[0x4];                                      // 0x051C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ChooseCharacter_C*                  CallFunc_GetActorOfClass_ReturnValue_8;            // 0x0520(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_10;           // 0x0528(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival_4;                // 0x0530(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_16;                    // 0x0538(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_539[0x7];                                      // 0x0539(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_11;           // 0x0540(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival_5;                // 0x0548(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_17;                    // 0x0550(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_551[0x7];                                      // 0x0551(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AA_GateCamera_C*                        CallFunc_GetActorOfClass_ReturnValue_9;            // 0x0558(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x0560(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_561[0x7];                                      // 0x0561(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_9;        // 0x0568(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_12;           // 0x0570(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_GI_Survival_C>      K2Node_DynamicCast_AsI_GI_Survival_6;              // 0x0578(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_18;                    // 0x0588(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_589[0x7];                                      // 0x0589(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_10;       // 0x0590(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0598(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_599[0x3];                                      // 0x0599(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x059C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AC[0x4];                                      // 0x05AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key;                          // 0x05B0(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x05C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_1;          // 0x05C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x05CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_2;          // 0x05CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_3;          // 0x05CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x05CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_4;          // 0x05CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x05CF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x05D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x05D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x05D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D3[0x1];                                      // 0x05D3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x05D4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E4[0x4];                                      // 0x05E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_1;  // 0x05E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1; // 0x05F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_13;                   // 0x05F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F9[0x3];                                      // 0x05F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x05FC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60C[0x4];                                      // 0x060C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0610(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_11;       // 0x0618(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_2;  // 0x0620(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_2; // 0x0628(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x0630(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_14;                   // 0x0640(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_641[0x7];                                      // 0x0641(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_12;       // 0x0648(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_13;       // 0x0650(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_14;       // 0x0658(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_13;           // 0x0660(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_15;       // 0x0668(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival_6;                // 0x0670(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_19;                    // 0x0678(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_679[0x3];                                      // 0x0679(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x067C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_68C[0x4];                                      // 0x068C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x0690(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu) == 0x000008, "Wrong alignment on W_MainMenu_C_ExecuteUbergraph_W_MainMenu");
static_assert(sizeof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu) == 0x000698, "Wrong size on W_MainMenu_C_ExecuteUbergraph_W_MainMenu");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, EntryPoint) == 0x000000, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_GetCurrentLevelLoadedFull_ReturnValue) == 0x000018, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_GetCurrentLevelLoadedFull_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, K2Node_CreateDelegate_OutputDelegate_1) == 0x00002C, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, Temp_bool_Has_Been_Initd_Variable) == 0x00003C, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_IsValid_ReturnValue) == 0x00003D, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, Temp_bool_IsClosed_Variable) == 0x00003E, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, K2Node_MakeArray_Array) == 0x000040, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_GetPlayerController_ReturnValue) == 0x000050, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_GetGameInstance_ReturnValue) == 0x000058, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, K2Node_DynamicCast_AsGI_Survival) == 0x000060, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::K2Node_DynamicCast_AsGI_Survival' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_PlayAnimation_ReturnValue_1) == 0x000070, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_GetGameInstance_ReturnValue_1) == 0x000078, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, K2Node_DynamicCast_AsGI_Survival_1) == 0x000080, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::K2Node_DynamicCast_AsGI_Survival_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, K2Node_DynamicCast_bSuccess_1) == 0x000088, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_PlayAnimation_ReturnValue_2) == 0x000090, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_GetActorOfClass_ReturnValue) == 0x000098, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_GetPlayerController_ReturnValue_1) == 0x0000A0, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_GetActorOfClass_ReturnValue_1) == 0x0000A8, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_GetActorOfClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_K2_SetTimer_ReturnValue) == 0x0000B0, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_GetActorOfClass_ReturnValue_2) == 0x0000B8, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_GetActorOfClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, Temp_bool_Has_Been_Initd_Variable_1) == 0x0000C0, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_IsValid_ReturnValue_1) == 0x0000C1, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, Temp_bool_IsClosed_Variable_1) == 0x0000C2, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, K2Node_MakeArray_Array_1) == 0x0000C8, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, K2Node_CustomEvent_bSkipAnimations) == 0x0000D8, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::K2Node_CustomEvent_bSkipAnimations' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, K2Node_CustomEvent_RefreshMesh) == 0x0000D9, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::K2Node_CustomEvent_RefreshMesh' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_BoxOverlapActors_OutActors) == 0x0000E0, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_BoxOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_BoxOverlapActors_ReturnValue) == 0x0000F0, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_BoxOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Array_Length_ReturnValue) == 0x0000F4, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000F8, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Max_ReturnValue) == 0x0000FC, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_GetActorOfClass_ReturnValue_3) == 0x000100, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_GetActorOfClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_PlayEvent2D_ReturnValue) == 0x000108, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_PlayEvent2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_GetActorOfClass_ReturnValue_4) == 0x000110, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_GetActorOfClass_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_GetActorOfClass_ReturnValue_5) == 0x000118, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_GetActorOfClass_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_PlayEvent2D_ReturnValue_1) == 0x000120, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_PlayEvent2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_PlayAnimationForward_ReturnValue) == 0x000128, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_IsVisible_ReturnValue) == 0x000130, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, K2Node_Event_MyGeometry) == 0x000134, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, K2Node_Event_InDeltaTime) == 0x00016C, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, Temp_text_Variable) == 0x000170, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_IsVisible_ReturnValue_1) == 0x000188, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_IsVisible_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_GetOwningPlayer_ReturnValue) == 0x000190, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_GetPlayerController_ReturnValue_2) == 0x000198, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_IsValid_ReturnValue_2) == 0x0001A0, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_GetPlayerController_ReturnValue_3) == 0x0001A8, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_IsValid_ReturnValue_3) == 0x0001B0, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_IsValid_ReturnValue_4) == 0x0001B1, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_IsValid_ReturnValue_5) == 0x0001B2, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, Temp_text_Variable_1) == 0x0001B8, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_GetGameInstance_ReturnValue_2) == 0x0001D0, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_GetGameInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, K2Node_DynamicCast_AsI_GI_Survival) == 0x0001D8, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::K2Node_DynamicCast_AsI_GI_Survival' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, K2Node_DynamicCast_bSuccess_2) == 0x0001E8, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_IsFirstStart_IsFirstStart) == 0x0001E9, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_IsFirstStart_IsFirstStart' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x0001F0, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x0001F8, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_IsValid_ReturnValue_6) == 0x000200, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_K2_TimerExistsHandle_ReturnValue) == 0x000201, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_K2_TimerExistsHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, K2Node_CreateDelegate_OutputDelegate_2) == 0x000204, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000218, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_GetGameInstance_ReturnValue_3) == 0x000220, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_GetGameInstance_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, K2Node_DynamicCast_AsI_GI_Survival_1) == 0x000228, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::K2Node_DynamicCast_AsI_GI_Survival_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, K2Node_DynamicCast_bSuccess_3) == 0x000238, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_GetGameInstance_ReturnValue_4) == 0x000240, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_GetGameInstance_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_GetShadersRemainingPSO_Count) == 0x000248, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_GetShadersRemainingPSO_Count' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, K2Node_DynamicCast_AsI_GI_Survival_2) == 0x000250, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::K2Node_DynamicCast_AsI_GI_Survival_2' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, K2Node_DynamicCast_bSuccess_4) == 0x000260, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_GetShadersRemainingPSO_Count_1) == 0x000268, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_GetShadersRemainingPSO_Count_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, K2Node_MakeStruct_FormatArgumentData) == 0x000270, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, Temp_bool_Variable) == 0x0002C0, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, K2Node_MakeStruct_FormatArgumentData_1) == 0x0002C8, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, K2Node_Select_Default) == 0x000318, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, K2Node_MakeArray_Array_2) == 0x000330, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Format_ReturnValue) == 0x000340, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_GetGameInstance_ReturnValue_5) == 0x000358, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_GetGameInstance_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_GetGameInstance_ReturnValue_6) == 0x000360, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_GetGameInstance_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, K2Node_DynamicCast_AsI_GI_Survival_3) == 0x000368, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::K2Node_DynamicCast_AsI_GI_Survival_3' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, K2Node_DynamicCast_bSuccess_5) == 0x000378, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, K2Node_DynamicCast_AsI_GI_Survival_4) == 0x000380, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::K2Node_DynamicCast_AsI_GI_Survival_4' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, K2Node_DynamicCast_bSuccess_6) == 0x000390, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_GetGameInstance_ReturnValue_7) == 0x000398, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_GetGameInstance_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, K2Node_DynamicCast_AsI_GI_Survival_5) == 0x0003A0, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::K2Node_DynamicCast_AsI_GI_Survival_5' has a wrong offset!");
