#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_MenuButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "FMODStudio_structs.hpp"


namespace SDK::Params
{

// Function W_MenuButton.W_MenuButton_C.ButtonHover
// 0x0044 (0x0044 - 0x0000)
struct W_MenuButton_C_ButtonHover final
{
public:
	bool                                          Hovered;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          With_Anim;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Selected;                                          // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0004(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0018(0x0014)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_Select_Default;                             // 0x0030(0x0014)()
};
static_assert(alignof(W_MenuButton_C_ButtonHover) == 0x000004, "Wrong alignment on W_MenuButton_C_ButtonHover");
static_assert(sizeof(W_MenuButton_C_ButtonHover) == 0x000044, "Wrong size on W_MenuButton_C_ButtonHover");
static_assert(offsetof(W_MenuButton_C_ButtonHover, Hovered) == 0x000000, "Member 'W_MenuButton_C_ButtonHover::Hovered' has a wrong offset!");
static_assert(offsetof(W_MenuButton_C_ButtonHover, With_Anim) == 0x000001, "Member 'W_MenuButton_C_ButtonHover::With_Anim' has a wrong offset!");
static_assert(offsetof(W_MenuButton_C_ButtonHover, Selected) == 0x000002, "Member 'W_MenuButton_C_ButtonHover::Selected' has a wrong offset!");
static_assert(offsetof(W_MenuButton_C_ButtonHover, Temp_bool_Variable) == 0x000003, "Member 'W_MenuButton_C_ButtonHover::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_MenuButton_C_ButtonHover, K2Node_MakeStruct_SlateColor) == 0x000004, "Member 'W_MenuButton_C_ButtonHover::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_MenuButton_C_ButtonHover, K2Node_MakeStruct_SlateColor_1) == 0x000018, "Member 'W_MenuButton_C_ButtonHover::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_MenuButton_C_ButtonHover, CallFunc_Not_PreBool_ReturnValue) == 0x00002C, "Member 'W_MenuButton_C_ButtonHover::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MenuButton_C_ButtonHover, K2Node_Select_Default) == 0x000030, "Member 'W_MenuButton_C_ButtonHover::K2Node_Select_Default' has a wrong offset!");

// Function W_MenuButton.W_MenuButton_C.ExecuteUbergraph_W_MenuButton
// 0x0048 (0x0048 - 0x0000)
struct W_MenuButton_C_ExecuteUbergraph_W_MenuButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0004(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0018(0x0014)()
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_1;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_MenuButton_C_ExecuteUbergraph_W_MenuButton) == 0x000008, "Wrong alignment on W_MenuButton_C_ExecuteUbergraph_W_MenuButton");
static_assert(sizeof(W_MenuButton_C_ExecuteUbergraph_W_MenuButton) == 0x000048, "Wrong size on W_MenuButton_C_ExecuteUbergraph_W_MenuButton");
static_assert(offsetof(W_MenuButton_C_ExecuteUbergraph_W_MenuButton, EntryPoint) == 0x000000, "Member 'W_MenuButton_C_ExecuteUbergraph_W_MenuButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_MenuButton_C_ExecuteUbergraph_W_MenuButton, K2Node_MakeStruct_SlateColor) == 0x000004, "Member 'W_MenuButton_C_ExecuteUbergraph_W_MenuButton::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_MenuButton_C_ExecuteUbergraph_W_MenuButton, K2Node_MakeStruct_SlateColor_1) == 0x000018, "Member 'W_MenuButton_C_ExecuteUbergraph_W_MenuButton::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_MenuButton_C_ExecuteUbergraph_W_MenuButton, CallFunc_PlayEvent2D_ReturnValue) == 0x000030, "Member 'W_MenuButton_C_ExecuteUbergraph_W_MenuButton::CallFunc_PlayEvent2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MenuButton_C_ExecuteUbergraph_W_MenuButton, CallFunc_PlayEvent2D_ReturnValue_1) == 0x000038, "Member 'W_MenuButton_C_ExecuteUbergraph_W_MenuButton::CallFunc_PlayEvent2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_MenuButton_C_ExecuteUbergraph_W_MenuButton, K2Node_Event_IsDesignTime) == 0x000040, "Member 'W_MenuButton_C_ExecuteUbergraph_W_MenuButton::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function W_MenuButton.W_MenuButton_C.OnSelectedButtonChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_MenuButton_C_OnSelectedButtonChanged__DelegateSignature final
{
public:
	class UW_MenuButton_C*                        SelectedMenuButton;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_MenuButton_C_OnSelectedButtonChanged__DelegateSignature) == 0x000008, "Wrong alignment on W_MenuButton_C_OnSelectedButtonChanged__DelegateSignature");
static_assert(sizeof(W_MenuButton_C_OnSelectedButtonChanged__DelegateSignature) == 0x000008, "Wrong size on W_MenuButton_C_OnSelectedButtonChanged__DelegateSignature");
static_assert(offsetof(W_MenuButton_C_OnSelectedButtonChanged__DelegateSignature, SelectedMenuButton) == 0x000000, "Member 'W_MenuButton_C_OnSelectedButtonChanged__DelegateSignature::SelectedMenuButton' has a wrong offset!");

// Function W_MenuButton.W_MenuButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_MenuButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_MenuButton_C_PreConstruct) == 0x000001, "Wrong alignment on W_MenuButton_C_PreConstruct");
static_assert(sizeof(W_MenuButton_C_PreConstruct) == 0x000001, "Wrong size on W_MenuButton_C_PreConstruct");
static_assert(offsetof(W_MenuButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_MenuButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_MenuButton.W_MenuButton_C.SetSelected
// 0x0040 (0x0040 - 0x0000)
struct W_MenuButton_C_SetSelected final
{
public:
	bool                                          Selected;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0004(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0018(0x0014)()
	struct FSlateColor                            K2Node_Select_Default;                             // 0x002C(0x0014)()
};
static_assert(alignof(W_MenuButton_C_SetSelected) == 0x000004, "Wrong alignment on W_MenuButton_C_SetSelected");
static_assert(sizeof(W_MenuButton_C_SetSelected) == 0x000040, "Wrong size on W_MenuButton_C_SetSelected");
static_assert(offsetof(W_MenuButton_C_SetSelected, Selected) == 0x000000, "Member 'W_MenuButton_C_SetSelected::Selected' has a wrong offset!");
static_assert(offsetof(W_MenuButton_C_SetSelected, Temp_bool_Variable) == 0x000001, "Member 'W_MenuButton_C_SetSelected::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_MenuButton_C_SetSelected, K2Node_MakeStruct_SlateColor) == 0x000004, "Member 'W_MenuButton_C_SetSelected::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_MenuButton_C_SetSelected, K2Node_MakeStruct_SlateColor_1) == 0x000018, "Member 'W_MenuButton_C_SetSelected::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_MenuButton_C_SetSelected, K2Node_Select_Default) == 0x00002C, "Member 'W_MenuButton_C_SetSelected::K2Node_Select_Default' has a wrong offset!");

// Function W_MenuButton.W_MenuButton_C.SetText
// 0x0018 (0x0018 - 0x0000)
struct W_MenuButton_C_SetText final
{
public:
	class FText                                   Param_ButtonText;                                  // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(W_MenuButton_C_SetText) == 0x000008, "Wrong alignment on W_MenuButton_C_SetText");
static_assert(sizeof(W_MenuButton_C_SetText) == 0x000018, "Wrong size on W_MenuButton_C_SetText");
static_assert(offsetof(W_MenuButton_C_SetText, Param_ButtonText) == 0x000000, "Member 'W_MenuButton_C_SetText::Param_ButtonText' has a wrong offset!");

}

