#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ModalWindowButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"
#include "E_HintButtonType_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FMODStudio_structs.hpp"


namespace SDK::Params
{

// Function W_ModalWindowButton.W_ModalWindowButton_C.ExecuteUbergraph_W_ModalWindowButton
// 0x0270 (0x0270 - 0x0000)
struct W_ModalWindowButton_C_ExecuteUbergraph_W_ModalWindowButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_HintButtonType                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_HintButtonType                              Temp_byte_Variable_5;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPaperSprite*                           Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPaperSprite*                           Temp_object_Variable_1;                            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 K2Node_CustomEvent_Image_Fill;                     // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         K2Node_Select_Default;                             // 0x0038(0x0058)(HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0090(0x0014)()
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A6[0xA];                                       // 0x00A6(0x000A)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_MakeBrushFromSprite_ReturnValue;          // 0x00B0(0x00D0)()
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPaperSprite*                           K2Node_Select_Default_4;                           // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_198[0x8];                                      // 0x0198(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_MakeBrushFromSprite_ReturnValue_1;        // 0x01A0(0x00D0)()
};
static_assert(alignof(W_ModalWindowButton_C_ExecuteUbergraph_W_ModalWindowButton) == 0x000010, "Wrong alignment on W_ModalWindowButton_C_ExecuteUbergraph_W_ModalWindowButton");
static_assert(sizeof(W_ModalWindowButton_C_ExecuteUbergraph_W_ModalWindowButton) == 0x000270, "Wrong size on W_ModalWindowButton_C_ExecuteUbergraph_W_ModalWindowButton");
static_assert(offsetof(W_ModalWindowButton_C_ExecuteUbergraph_W_ModalWindowButton, EntryPoint) == 0x000000, "Member 'W_ModalWindowButton_C_ExecuteUbergraph_W_ModalWindowButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_ModalWindowButton_C_ExecuteUbergraph_W_ModalWindowButton, Temp_byte_Variable) == 0x000004, "Member 'W_ModalWindowButton_C_ExecuteUbergraph_W_ModalWindowButton::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_ModalWindowButton_C_ExecuteUbergraph_W_ModalWindowButton, Temp_bool_Variable) == 0x000005, "Member 'W_ModalWindowButton_C_ExecuteUbergraph_W_ModalWindowButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_ModalWindowButton_C_ExecuteUbergraph_W_ModalWindowButton, Temp_byte_Variable_1) == 0x000006, "Member 'W_ModalWindowButton_C_ExecuteUbergraph_W_ModalWindowButton::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_ModalWindowButton_C_ExecuteUbergraph_W_ModalWindowButton, Temp_byte_Variable_2) == 0x000007, "Member 'W_ModalWindowButton_C_ExecuteUbergraph_W_ModalWindowButton::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(W_ModalWindowButton_C_ExecuteUbergraph_W_ModalWindowButton, Temp_bool_Variable_1) == 0x000008, "Member 'W_ModalWindowButton_C_ExecuteUbergraph_W_ModalWindowButton::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(W_ModalWindowButton_C_ExecuteUbergraph_W_ModalWindowButton, Temp_byte_Variable_3) == 0x000009, "Member 'W_ModalWindowButton_C_ExecuteUbergraph_W_ModalWindowButton::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(W_ModalWindowButton_C_ExecuteUbergraph_W_ModalWindowButton, Temp_byte_Variable_4) == 0x00000A, "Member 'W_ModalWindowButton_C_ExecuteUbergraph_W_ModalWindowButton::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(W_ModalWindowButton_C_ExecuteUbergraph_W_ModalWindowButton, Temp_byte_Variable_5) == 0x00000B, "Member 'W_ModalWindowButton_C_ExecuteUbergraph_W_ModalWindowButton::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(W_ModalWindowButton_C_ExecuteUbergraph_W_ModalWindowButton, Temp_object_Variable) == 0x000010, "Member 'W_ModalWindowButton_C_ExecuteUbergraph_W_ModalWindowButton::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(W_ModalWindowButton_C_ExecuteUbergraph_W_ModalWindowButton, Temp_object_Variable_1) == 0x000018, "Member 'W_ModalWindowButton_C_ExecuteUbergraph_W_ModalWindowButton::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(W_ModalWindowButton_C_ExecuteUbergraph_W_ModalWindowButton, Temp_bool_Variable_2) == 0x000020, "Member 'W_ModalWindowButton_C_ExecuteUbergraph_W_ModalWindowButton::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(W_ModalWindowButton_C_ExecuteUbergraph_W_ModalWindowButton, Temp_byte_Variable_6) == 0x000021, "Member 'W_ModalWindowButton_C_ExecuteUbergraph_W_ModalWindowButton::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(W_ModalWindowButton_C_ExecuteUbergraph_W_ModalWindowButton, Temp_byte_Variable_7) == 0x000022, "Member 'W_ModalWindowButton_C_ExecuteUbergraph_W_ModalWindowButton::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(W_ModalWindowButton_C_ExecuteUbergraph_W_ModalWindowButton, K2Node_CustomEvent_Image_Fill) == 0x000028, "Member 'W_ModalWindowButton_C_ExecuteUbergraph_W_ModalWindowButton::K2Node_CustomEvent_Image_Fill' has a wrong offset!");
static_assert(offsetof(W_ModalWindowButton_C_ExecuteUbergraph_W_ModalWindowButton, K2Node_Event_IsDesignTime) == 0x000030, "Member 'W_ModalWindowButton_C_ExecuteUbergraph_W_ModalWindowButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_ModalWindowButton_C_ExecuteUbergraph_W_ModalWindowButton, K2Node_Select_Default) == 0x000038, "Member 'W_ModalWindowButton_C_ExecuteUbergraph_W_ModalWindowButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_ModalWindowButton_C_ExecuteUbergraph_W_ModalWindowButton, K2Node_MakeStruct_SlateColor) == 0x000090, "Member 'W_ModalWindowButton_C_ExecuteUbergraph_W_ModalWindowButton::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_ModalWindowButton_C_ExecuteUbergraph_W_ModalWindowButton, K2Node_Select_Default_1) == 0x0000A4, "Member 'W_ModalWindowButton_C_ExecuteUbergraph_W_ModalWindowButton::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(W_ModalWindowButton_C_ExecuteUbergraph_W_ModalWindowButton, K2Node_Select_Default_2) == 0x0000A5, "Member 'W_ModalWindowButton_C_ExecuteUbergraph_W_ModalWindowButton::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(W_ModalWindowButton_C_ExecuteUbergraph_W_ModalWindowButton, CallFunc_MakeBrushFromSprite_ReturnValue) == 0x0000B0, "Member 'W_ModalWindowButton_C_ExecuteUbergraph_W_ModalWindowButton::CallFunc_MakeBrushFromSprite_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ModalWindowButton_C_ExecuteUbergraph_W_ModalWindowButton, CallFunc_PlayEvent2D_ReturnValue) == 0x000180, "Member 'W_ModalWindowButton_C_ExecuteUbergraph_W_ModalWindowButton::CallFunc_PlayEvent2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ModalWindowButton_C_ExecuteUbergraph_W_ModalWindowButton, K2Node_Select_Default_3) == 0x000188, "Member 'W_ModalWindowButton_C_ExecuteUbergraph_W_ModalWindowButton::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(W_ModalWindowButton_C_ExecuteUbergraph_W_ModalWindowButton, K2Node_Select_Default_4) == 0x000190, "Member 'W_ModalWindowButton_C_ExecuteUbergraph_W_ModalWindowButton::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(W_ModalWindowButton_C_ExecuteUbergraph_W_ModalWindowButton, CallFunc_MakeBrushFromSprite_ReturnValue_1) == 0x0001A0, "Member 'W_ModalWindowButton_C_ExecuteUbergraph_W_ModalWindowButton::CallFunc_MakeBrushFromSprite_ReturnValue_1' has a wrong offset!");

// Function W_ModalWindowButton.W_ModalWindowButton_C.ImageFilled
// 0x0008 (0x0008 - 0x0000)
struct W_ModalWindowButton_C_ImageFilled final
{
public:
	class UImage*                                 Image_Fill;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ModalWindowButton_C_ImageFilled) == 0x000008, "Wrong alignment on W_ModalWindowButton_C_ImageFilled");
static_assert(sizeof(W_ModalWindowButton_C_ImageFilled) == 0x000008, "Wrong size on W_ModalWindowButton_C_ImageFilled");
static_assert(offsetof(W_ModalWindowButton_C_ImageFilled, Image_Fill) == 0x000000, "Member 'W_ModalWindowButton_C_ImageFilled::Image_Fill' has a wrong offset!");

// Function W_ModalWindowButton.W_ModalWindowButton_C.OnFocus
// 0x0010 (0x0010 - 0x0000)
struct W_ModalWindowButton_C_OnFocus final
{
public:
	bool                                          NewState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ModalWindowButton_C_OnFocus) == 0x000008, "Wrong alignment on W_ModalWindowButton_C_OnFocus");
static_assert(sizeof(W_ModalWindowButton_C_OnFocus) == 0x000010, "Wrong size on W_ModalWindowButton_C_OnFocus");
static_assert(offsetof(W_ModalWindowButton_C_OnFocus, NewState) == 0x000000, "Member 'W_ModalWindowButton_C_OnFocus::NewState' has a wrong offset!");
static_assert(offsetof(W_ModalWindowButton_C_OnFocus, Temp_bool_Variable) == 0x000001, "Member 'W_ModalWindowButton_C_OnFocus::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_ModalWindowButton_C_OnFocus, Temp_byte_Variable) == 0x000002, "Member 'W_ModalWindowButton_C_OnFocus::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_ModalWindowButton_C_OnFocus, Temp_byte_Variable_1) == 0x000003, "Member 'W_ModalWindowButton_C_OnFocus::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_ModalWindowButton_C_OnFocus, K2Node_Select_Default) == 0x000004, "Member 'W_ModalWindowButton_C_OnFocus::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_ModalWindowButton_C_OnFocus, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'W_ModalWindowButton_C_OnFocus::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function W_ModalWindowButton.W_ModalWindowButton_C.OnPlayAnimation
// 0x0018 (0x0018 - 0x0000)
struct W_ModalWindowButton_C_OnPlayAnimation final
{
public:
	class UWidgetAnimation*                       Animation;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          NewState;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default;                             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ModalWindowButton_C_OnPlayAnimation) == 0x000008, "Wrong alignment on W_ModalWindowButton_C_OnPlayAnimation");
static_assert(sizeof(W_ModalWindowButton_C_OnPlayAnimation) == 0x000018, "Wrong size on W_ModalWindowButton_C_OnPlayAnimation");
static_assert(offsetof(W_ModalWindowButton_C_OnPlayAnimation, Animation) == 0x000000, "Member 'W_ModalWindowButton_C_OnPlayAnimation::Animation' has a wrong offset!");
static_assert(offsetof(W_ModalWindowButton_C_OnPlayAnimation, NewState) == 0x000008, "Member 'W_ModalWindowButton_C_OnPlayAnimation::NewState' has a wrong offset!");
static_assert(offsetof(W_ModalWindowButton_C_OnPlayAnimation, Temp_bool_Variable) == 0x000009, "Member 'W_ModalWindowButton_C_OnPlayAnimation::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_ModalWindowButton_C_OnPlayAnimation, Temp_byte_Variable) == 0x00000A, "Member 'W_ModalWindowButton_C_OnPlayAnimation::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_ModalWindowButton_C_OnPlayAnimation, Temp_byte_Variable_1) == 0x00000B, "Member 'W_ModalWindowButton_C_OnPlayAnimation::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_ModalWindowButton_C_OnPlayAnimation, K2Node_Select_Default) == 0x00000C, "Member 'W_ModalWindowButton_C_OnPlayAnimation::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_ModalWindowButton_C_OnPlayAnimation, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'W_ModalWindowButton_C_OnPlayAnimation::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function W_ModalWindowButton.W_ModalWindowButton_C.OnPreviewKeyDown
// 0x02C0 (0x02C0 - 0x0000)
struct W_ModalWindowButton_C_OnPreviewKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0078(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x0130(0x0018)(HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0148(0x00B8)()
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0208(0x00B8)()
};
static_assert(alignof(W_ModalWindowButton_C_OnPreviewKeyDown) == 0x000008, "Wrong alignment on W_ModalWindowButton_C_OnPreviewKeyDown");
static_assert(sizeof(W_ModalWindowButton_C_OnPreviewKeyDown) == 0x0002C0, "Wrong size on W_ModalWindowButton_C_OnPreviewKeyDown");
static_assert(offsetof(W_ModalWindowButton_C_OnPreviewKeyDown, MyGeometry) == 0x000000, "Member 'W_ModalWindowButton_C_OnPreviewKeyDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_ModalWindowButton_C_OnPreviewKeyDown, InKeyEvent) == 0x000038, "Member 'W_ModalWindowButton_C_OnPreviewKeyDown::InKeyEvent' has a wrong offset!");
static_assert(offsetof(W_ModalWindowButton_C_OnPreviewKeyDown, ReturnValue) == 0x000078, "Member 'W_ModalWindowButton_C_OnPreviewKeyDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ModalWindowButton_C_OnPreviewKeyDown, CallFunc_GetKey_ReturnValue) == 0x000130, "Member 'W_ModalWindowButton_C_OnPreviewKeyDown::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ModalWindowButton_C_OnPreviewKeyDown, CallFunc_Unhandled_ReturnValue) == 0x000148, "Member 'W_ModalWindowButton_C_OnPreviewKeyDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ModalWindowButton_C_OnPreviewKeyDown, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000200, "Member 'W_ModalWindowButton_C_OnPreviewKeyDown::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ModalWindowButton_C_OnPreviewKeyDown, CallFunc_Handled_ReturnValue) == 0x000208, "Member 'W_ModalWindowButton_C_OnPreviewKeyDown::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function W_ModalWindowButton.W_ModalWindowButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_ModalWindowButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ModalWindowButton_C_PreConstruct) == 0x000001, "Wrong alignment on W_ModalWindowButton_C_PreConstruct");
static_assert(sizeof(W_ModalWindowButton_C_PreConstruct) == 0x000001, "Wrong size on W_ModalWindowButton_C_PreConstruct");
static_assert(offsetof(W_ModalWindowButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_ModalWindowButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_ModalWindowButton.W_ModalWindowButton_C.PressedButtonAnimation
// 0x0008 (0x0008 - 0x0000)
struct W_ModalWindowButton_C_PressedButtonAnimation final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ModalWindowButton_C_PressedButtonAnimation) == 0x000008, "Wrong alignment on W_ModalWindowButton_C_PressedButtonAnimation");
static_assert(sizeof(W_ModalWindowButton_C_PressedButtonAnimation) == 0x000008, "Wrong size on W_ModalWindowButton_C_PressedButtonAnimation");
static_assert(offsetof(W_ModalWindowButton_C_PressedButtonAnimation, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'W_ModalWindowButton_C_PressedButtonAnimation::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function W_ModalWindowButton.W_ModalWindowButton_C.SetBackgroundColorAndOpacity
// 0x0030 (0x0030 - 0x0000)
struct W_ModalWindowButton_C_SetBackgroundColorAndOpacity final
{
public:
	struct FLinearColor                           InColorAndOpacity;                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_R;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A;                             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ModalWindowButton_C_SetBackgroundColorAndOpacity) == 0x000004, "Wrong alignment on W_ModalWindowButton_C_SetBackgroundColorAndOpacity");
static_assert(sizeof(W_ModalWindowButton_C_SetBackgroundColorAndOpacity) == 0x000030, "Wrong size on W_ModalWindowButton_C_SetBackgroundColorAndOpacity");
static_assert(offsetof(W_ModalWindowButton_C_SetBackgroundColorAndOpacity, InColorAndOpacity) == 0x000000, "Member 'W_ModalWindowButton_C_SetBackgroundColorAndOpacity::InColorAndOpacity' has a wrong offset!");
static_assert(offsetof(W_ModalWindowButton_C_SetBackgroundColorAndOpacity, CallFunc_BreakColor_R) == 0x000010, "Member 'W_ModalWindowButton_C_SetBackgroundColorAndOpacity::CallFunc_BreakColor_R' has a wrong offset!");
static_assert(offsetof(W_ModalWindowButton_C_SetBackgroundColorAndOpacity, CallFunc_BreakColor_G) == 0x000014, "Member 'W_ModalWindowButton_C_SetBackgroundColorAndOpacity::CallFunc_BreakColor_G' has a wrong offset!");
static_assert(offsetof(W_ModalWindowButton_C_SetBackgroundColorAndOpacity, CallFunc_BreakColor_B) == 0x000018, "Member 'W_ModalWindowButton_C_SetBackgroundColorAndOpacity::CallFunc_BreakColor_B' has a wrong offset!");
static_assert(offsetof(W_ModalWindowButton_C_SetBackgroundColorAndOpacity, CallFunc_BreakColor_A) == 0x00001C, "Member 'W_ModalWindowButton_C_SetBackgroundColorAndOpacity::CallFunc_BreakColor_A' has a wrong offset!");
static_assert(offsetof(W_ModalWindowButton_C_SetBackgroundColorAndOpacity, K2Node_MakeStruct_LinearColor) == 0x000020, "Member 'W_ModalWindowButton_C_SetBackgroundColorAndOpacity::K2Node_MakeStruct_LinearColor' has a wrong offset!");

// Function W_ModalWindowButton.W_ModalWindowButton_C.SetButtonEnabled
// 0x0038 (0x0038 - 0x0000)
struct W_ModalWindowButton_C_SetButtonEnabled final
{
public:
	bool                                          InIsEnabled;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0014(0x0014)()
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ModalWindowButton_C_SetButtonEnabled) == 0x000004, "Wrong alignment on W_ModalWindowButton_C_SetButtonEnabled");
static_assert(sizeof(W_ModalWindowButton_C_SetButtonEnabled) == 0x000038, "Wrong size on W_ModalWindowButton_C_SetButtonEnabled");
static_assert(offsetof(W_ModalWindowButton_C_SetButtonEnabled, InIsEnabled) == 0x000000, "Member 'W_ModalWindowButton_C_SetButtonEnabled::InIsEnabled' has a wrong offset!");
static_assert(offsetof(W_ModalWindowButton_C_SetButtonEnabled, Temp_bool_Variable) == 0x000001, "Member 'W_ModalWindowButton_C_SetButtonEnabled::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_ModalWindowButton_C_SetButtonEnabled, K2Node_Select_Default) == 0x000004, "Member 'W_ModalWindowButton_C_SetButtonEnabled::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_ModalWindowButton_C_SetButtonEnabled, K2Node_MakeStruct_SlateColor) == 0x000014, "Member 'W_ModalWindowButton_C_SetButtonEnabled::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_ModalWindowButton_C_SetButtonEnabled, CallFunc_SelectColor_ReturnValue) == 0x000028, "Member 'W_ModalWindowButton_C_SetButtonEnabled::CallFunc_SelectColor_ReturnValue' has a wrong offset!");

// Function W_ModalWindowButton.W_ModalWindowButton_C.SetButtonTextColorAndOpacity
// 0x0044 (0x0044 - 0x0000)
struct W_ModalWindowButton_C_SetButtonTextColorAndOpacity final
{
public:
	struct FLinearColor                           InColorAndOpacity;                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0010(0x0014)()
	float                                         CallFunc_BreakColor_R;                             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G;                             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B;                             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A;                             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ModalWindowButton_C_SetButtonTextColorAndOpacity) == 0x000004, "Wrong alignment on W_ModalWindowButton_C_SetButtonTextColorAndOpacity");
static_assert(sizeof(W_ModalWindowButton_C_SetButtonTextColorAndOpacity) == 0x000044, "Wrong size on W_ModalWindowButton_C_SetButtonTextColorAndOpacity");
static_assert(offsetof(W_ModalWindowButton_C_SetButtonTextColorAndOpacity, InColorAndOpacity) == 0x000000, "Member 'W_ModalWindowButton_C_SetButtonTextColorAndOpacity::InColorAndOpacity' has a wrong offset!");
static_assert(offsetof(W_ModalWindowButton_C_SetButtonTextColorAndOpacity, K2Node_MakeStruct_SlateColor) == 0x000010, "Member 'W_ModalWindowButton_C_SetButtonTextColorAndOpacity::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_ModalWindowButton_C_SetButtonTextColorAndOpacity, CallFunc_BreakColor_R) == 0x000024, "Member 'W_ModalWindowButton_C_SetButtonTextColorAndOpacity::CallFunc_BreakColor_R' has a wrong offset!");
static_assert(offsetof(W_ModalWindowButton_C_SetButtonTextColorAndOpacity, CallFunc_BreakColor_G) == 0x000028, "Member 'W_ModalWindowButton_C_SetButtonTextColorAndOpacity::CallFunc_BreakColor_G' has a wrong offset!");
static_assert(offsetof(W_ModalWindowButton_C_SetButtonTextColorAndOpacity, CallFunc_BreakColor_B) == 0x00002C, "Member 'W_ModalWindowButton_C_SetButtonTextColorAndOpacity::CallFunc_BreakColor_B' has a wrong offset!");
static_assert(offsetof(W_ModalWindowButton_C_SetButtonTextColorAndOpacity, CallFunc_BreakColor_A) == 0x000030, "Member 'W_ModalWindowButton_C_SetButtonTextColorAndOpacity::CallFunc_BreakColor_A' has a wrong offset!");
static_assert(offsetof(W_ModalWindowButton_C_SetButtonTextColorAndOpacity, K2Node_MakeStruct_LinearColor) == 0x000034, "Member 'W_ModalWindowButton_C_SetButtonTextColorAndOpacity::K2Node_MakeStruct_LinearColor' has a wrong offset!");

// Function W_ModalWindowButton.W_ModalWindowButton_C.SetText
// 0x0018 (0x0018 - 0x0000)
struct W_ModalWindowButton_C_SetText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(W_ModalWindowButton_C_SetText) == 0x000008, "Wrong alignment on W_ModalWindowButton_C_SetText");
static_assert(sizeof(W_ModalWindowButton_C_SetText) == 0x000018, "Wrong size on W_ModalWindowButton_C_SetText");
static_assert(offsetof(W_ModalWindowButton_C_SetText, Text) == 0x000000, "Member 'W_ModalWindowButton_C_SetText::Text' has a wrong offset!");

// Function W_ModalWindowButton.W_ModalWindowButton_C.SetTextHidden
// 0x000F (0x000F - 0x0000)
struct W_ModalWindowButton_C_SetTextHidden final
{
public:
	bool                                          bInIsHidden;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ModalWindowButton_C_SetTextHidden) == 0x000001, "Wrong alignment on W_ModalWindowButton_C_SetTextHidden");
static_assert(sizeof(W_ModalWindowButton_C_SetTextHidden) == 0x00000F, "Wrong size on W_ModalWindowButton_C_SetTextHidden");
static_assert(offsetof(W_ModalWindowButton_C_SetTextHidden, bInIsHidden) == 0x000000, "Member 'W_ModalWindowButton_C_SetTextHidden::bInIsHidden' has a wrong offset!");
static_assert(offsetof(W_ModalWindowButton_C_SetTextHidden, Temp_bool_Variable) == 0x000001, "Member 'W_ModalWindowButton_C_SetTextHidden::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_ModalWindowButton_C_SetTextHidden, Temp_byte_Variable) == 0x000002, "Member 'W_ModalWindowButton_C_SetTextHidden::Temp_byte_Variable' has a wrong offset!");
