#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_NavigationHint

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_NavigationHint.W_NavigationHint_C.ExecuteUbergraph_W_NavigationHint
// 0x0068 (0x0068 - 0x0000)
struct W_NavigationHint_C_ExecuteUbergraph_W_NavigationHint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0010(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasInputKeyJustPressed_ReturnValue;       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_NavigationHint_C_ExecuteUbergraph_W_NavigationHint) == 0x000008, "Wrong alignment on W_NavigationHint_C_ExecuteUbergraph_W_NavigationHint");
static_assert(sizeof(W_NavigationHint_C_ExecuteUbergraph_W_NavigationHint) == 0x000068, "Wrong size on W_NavigationHint_C_ExecuteUbergraph_W_NavigationHint");
static_assert(offsetof(W_NavigationHint_C_ExecuteUbergraph_W_NavigationHint, EntryPoint) == 0x000000, "Member 'W_NavigationHint_C_ExecuteUbergraph_W_NavigationHint::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_NavigationHint_C_ExecuteUbergraph_W_NavigationHint, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'W_NavigationHint_C_ExecuteUbergraph_W_NavigationHint::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_NavigationHint_C_ExecuteUbergraph_W_NavigationHint, K2Node_Event_MyGeometry) == 0x000010, "Member 'W_NavigationHint_C_ExecuteUbergraph_W_NavigationHint::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_NavigationHint_C_ExecuteUbergraph_W_NavigationHint, K2Node_Event_InDeltaTime) == 0x000048, "Member 'W_NavigationHint_C_ExecuteUbergraph_W_NavigationHint::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(W_NavigationHint_C_ExecuteUbergraph_W_NavigationHint, CallFunc_GetPlayerController_ReturnValue) == 0x000050, "Member 'W_NavigationHint_C_ExecuteUbergraph_W_NavigationHint::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_NavigationHint_C_ExecuteUbergraph_W_NavigationHint, CallFunc_WasInputKeyJustPressed_ReturnValue) == 0x000058, "Member 'W_NavigationHint_C_ExecuteUbergraph_W_NavigationHint::CallFunc_WasInputKeyJustPressed_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_NavigationHint_C_ExecuteUbergraph_W_NavigationHint, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000060, "Member 'W_NavigationHint_C_ExecuteUbergraph_W_NavigationHint::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");

// Function W_NavigationHint.W_NavigationHint_C.Tick
// 0x003C (0x003C - 0x0000)
struct W_NavigationHint_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_NavigationHint_C_Tick) == 0x000004, "Wrong alignment on W_NavigationHint_C_Tick");
static_assert(sizeof(W_NavigationHint_C_Tick) == 0x00003C, "Wrong size on W_NavigationHint_C_Tick");
static_assert(offsetof(W_NavigationHint_C_Tick, MyGeometry) == 0x000000, "Member 'W_NavigationHint_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_NavigationHint_C_Tick, InDeltaTime) == 0x000038, "Member 'W_NavigationHint_C_Tick::InDeltaTime' has a wrong offset!");

}

