#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Notification

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Notification.W_Notification_C
// 0x0068 (0x02E8 - 0x0280)
class UW_Notification_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_Icon;                                        // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Body;                                    // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Title;                                   // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPaperSprite*                           IconSprite;                                        // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FText                                   Title;                                             // 0x02B8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   Body;                                              // 0x02D0(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void ExecuteUbergraph_W_Notification(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Notification_C">();
	}
	static class UW_Notification_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Notification_C>();
	}
};
static_assert(alignof(UW_Notification_C) == 0x000008, "Wrong alignment on UW_Notification_C");
static_assert(sizeof(UW_Notification_C) == 0x0002E8, "Wrong size on UW_Notification_C");
static_assert(offsetof(UW_Notification_C, UberGraphFrame) == 0x000280, "Member 'UW_Notification_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Notification_C, Image_Icon) == 0x000288, "Member 'UW_Notification_C::Image_Icon' has a wrong offset!");
static_assert(offsetof(UW_Notification_C, TextBlock_Body) == 0x000290, "Member 'UW_Notification_C::TextBlock_Body' has a wrong offset!");
static_assert(offsetof(UW_Notification_C, TextBlock_Title) == 0x000298, "Member 'UW_Notification_C::TextBlock_Title' has a wrong offset!");
static_assert(offsetof(UW_Notification_C, IconSprite) == 0x0002A0, "Member 'UW_Notification_C::IconSprite' has a wrong offset!");
static_assert(offsetof(UW_Notification_C, Color) == 0x0002A8, "Member 'UW_Notification_C::Color' has a wrong offset!");
static_assert(offsetof(UW_Notification_C, Title) == 0x0002B8, "Member 'UW_Notification_C::Title' has a wrong offset!");
static_assert(offsetof(UW_Notification_C, Body) == 0x0002D0, "Member 'UW_Notification_C::Body' has a wrong offset!");

}

