#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Note

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Note.W_Note_C
// 0x0030 (0x02B0 - 0x0280)
class UW_Note_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBackgroundBlur*                        BackgroundBlur;                                    // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_Main;                                  // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Text;                                    // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Title;                                   // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Button_E_C*                          W_Button_E;                                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__W_Button_E_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();
	void ExecuteUbergraph_W_Note(int32 EntryPoint);
	void SetNote(const class FText& Title, const class FText& Text);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Note_C">();
	}
	static class UW_Note_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Note_C>();
	}
};
static_assert(alignof(UW_Note_C) == 0x000008, "Wrong alignment on UW_Note_C");
static_assert(sizeof(UW_Note_C) == 0x0002B0, "Wrong size on UW_Note_C");
static_assert(offsetof(UW_Note_C, UberGraphFrame) == 0x000280, "Member 'UW_Note_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Note_C, BackgroundBlur) == 0x000288, "Member 'UW_Note_C::BackgroundBlur' has a wrong offset!");
static_assert(offsetof(UW_Note_C, CanvasPanel_Main) == 0x000290, "Member 'UW_Note_C::CanvasPanel_Main' has a wrong offset!");
static_assert(offsetof(UW_Note_C, TextBlock_Text) == 0x000298, "Member 'UW_Note_C::TextBlock_Text' has a wrong offset!");
static_assert(offsetof(UW_Note_C, TextBlock_Title) == 0x0002A0, "Member 'UW_Note_C::TextBlock_Title' has a wrong offset!");
static_assert(offsetof(UW_Note_C, W_Button_E) == 0x0002A8, "Member 'UW_Note_C::W_Button_E' has a wrong offset!");

}

