#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Options

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_Options_Type_structs.hpp"
#include "FMODStudio_structs.hpp"


namespace SDK::Params
{

// Function W_Options.W_Options_C.BndEvt__W_Options_W_ControlsMenu_K2Node_ComponentBoundEvent_2_OnKeyValueChanging__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct W_Options_C_BndEvt__W_Options_W_ControlsMenu_K2Node_ComponentBoundEvent_2_OnKeyValueChanging__DelegateSignature final
{
public:
	bool                                          KeyValueChanging;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Options_C_BndEvt__W_Options_W_ControlsMenu_K2Node_ComponentBoundEvent_2_OnKeyValueChanging__DelegateSignature) == 0x000001, "Wrong alignment on W_Options_C_BndEvt__W_Options_W_ControlsMenu_K2Node_ComponentBoundEvent_2_OnKeyValueChanging__DelegateSignature");
static_assert(sizeof(W_Options_C_BndEvt__W_Options_W_ControlsMenu_K2Node_ComponentBoundEvent_2_OnKeyValueChanging__DelegateSignature) == 0x000001, "Wrong size on W_Options_C_BndEvt__W_Options_W_ControlsMenu_K2Node_ComponentBoundEvent_2_OnKeyValueChanging__DelegateSignature");
static_assert(offsetof(W_Options_C_BndEvt__W_Options_W_ControlsMenu_K2Node_ComponentBoundEvent_2_OnKeyValueChanging__DelegateSignature, KeyValueChanging) == 0x000000, "Member 'W_Options_C_BndEvt__W_Options_W_ControlsMenu_K2Node_ComponentBoundEvent_2_OnKeyValueChanging__DelegateSignature::KeyValueChanging' has a wrong offset!");

// Function W_Options.W_Options_C.BndEvt__W_Options_WBP_MainCategorySelector_K2Node_ComponentBoundEvent_0_OnCategoryChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_Options_C_BndEvt__W_Options_WBP_MainCategorySelector_K2Node_ComponentBoundEvent_0_OnCategoryChanged__DelegateSignature final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Options_C_BndEvt__W_Options_WBP_MainCategorySelector_K2Node_ComponentBoundEvent_0_OnCategoryChanged__DelegateSignature) == 0x000004, "Wrong alignment on W_Options_C_BndEvt__W_Options_WBP_MainCategorySelector_K2Node_ComponentBoundEvent_0_OnCategoryChanged__DelegateSignature");
static_assert(sizeof(W_Options_C_BndEvt__W_Options_WBP_MainCategorySelector_K2Node_ComponentBoundEvent_0_OnCategoryChanged__DelegateSignature) == 0x000004, "Wrong size on W_Options_C_BndEvt__W_Options_WBP_MainCategorySelector_K2Node_ComponentBoundEvent_0_OnCategoryChanged__DelegateSignature");
static_assert(offsetof(W_Options_C_BndEvt__W_Options_WBP_MainCategorySelector_K2Node_ComponentBoundEvent_0_OnCategoryChanged__DelegateSignature, Param_Index) == 0x000000, "Member 'W_Options_C_BndEvt__W_Options_WBP_MainCategorySelector_K2Node_ComponentBoundEvent_0_OnCategoryChanged__DelegateSignature::Param_Index' has a wrong offset!");

// Function W_Options.W_Options_C.ChangeCategoriesAnim
// 0x0008 (0x0008 - 0x0000)
struct W_Options_C_ChangeCategoriesAnim final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Options_C_ChangeCategoriesAnim) == 0x000008, "Wrong alignment on W_Options_C_ChangeCategoriesAnim");
static_assert(sizeof(W_Options_C_ChangeCategoriesAnim) == 0x000008, "Wrong size on W_Options_C_ChangeCategoriesAnim");
static_assert(offsetof(W_Options_C_ChangeCategoriesAnim, CallFunc_PlayAnimationForward_ReturnValue) == 0x000000, "Member 'W_Options_C_ChangeCategoriesAnim::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function W_Options.W_Options_C.CheckForDefaultSettings
// 0x0006 (0x0006 - 0x0000)
struct W_Options_C_CheckForDefaultSettings final
{
public:
	bool                                          Changed;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckingForValuesChanges_Changed;         // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckingForValuesChanges_Changed_1;       // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckingForValuesChanges_Changed_2;       // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckingForValuesChanges_Changed_3;       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Options_C_CheckForDefaultSettings) == 0x000001, "Wrong alignment on W_Options_C_CheckForDefaultSettings");
static_assert(sizeof(W_Options_C_CheckForDefaultSettings) == 0x000006, "Wrong size on W_Options_C_CheckForDefaultSettings");
static_assert(offsetof(W_Options_C_CheckForDefaultSettings, Changed) == 0x000000, "Member 'W_Options_C_CheckForDefaultSettings::Changed' has a wrong offset!");
static_assert(offsetof(W_Options_C_CheckForDefaultSettings, CallFunc_CheckingForValuesChanges_Changed) == 0x000001, "Member 'W_Options_C_CheckForDefaultSettings::CallFunc_CheckingForValuesChanges_Changed' has a wrong offset!");
static_assert(offsetof(W_Options_C_CheckForDefaultSettings, CallFunc_CheckingForValuesChanges_Changed_1) == 0x000002, "Member 'W_Options_C_CheckForDefaultSettings::CallFunc_CheckingForValuesChanges_Changed_1' has a wrong offset!");
static_assert(offsetof(W_Options_C_CheckForDefaultSettings, CallFunc_CheckingForValuesChanges_Changed_2) == 0x000003, "Member 'W_Options_C_CheckForDefaultSettings::CallFunc_CheckingForValuesChanges_Changed_2' has a wrong offset!");
static_assert(offsetof(W_Options_C_CheckForDefaultSettings, CallFunc_CheckingForValuesChanges_Changed_3) == 0x000004, "Member 'W_Options_C_CheckForDefaultSettings::CallFunc_CheckingForValuesChanges_Changed_3' has a wrong offset!");
static_assert(offsetof(W_Options_C_CheckForDefaultSettings, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'W_Options_C_CheckForDefaultSettings::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function W_Options.W_Options_C.DefaultControlSettings
// 0x0030 (0x0030 - 0x0000)
struct W_Options_C_DefaultControlSettings final
{
public:
	TArray<struct FInputActionKeyMapping>         NewLocalVar;                                       // 0x0000(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_ControlMapping_C*                    CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Options_C_DefaultControlSettings) == 0x000008, "Wrong alignment on W_Options_C_DefaultControlSettings");
static_assert(sizeof(W_Options_C_DefaultControlSettings) == 0x000030, "Wrong size on W_Options_C_DefaultControlSettings");
static_assert(offsetof(W_Options_C_DefaultControlSettings, NewLocalVar) == 0x000000, "Member 'W_Options_C_DefaultControlSettings::NewLocalVar' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultControlSettings, Temp_int_Array_Index_Variable) == 0x000010, "Member 'W_Options_C_DefaultControlSettings::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultControlSettings, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'W_Options_C_DefaultControlSettings::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultControlSettings, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'W_Options_C_DefaultControlSettings::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultControlSettings, CallFunc_Array_Get_Item) == 0x000020, "Member 'W_Options_C_DefaultControlSettings::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultControlSettings, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'W_Options_C_DefaultControlSettings::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultControlSettings, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'W_Options_C_DefaultControlSettings::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function W_Options.W_Options_C.DefaultGameSettings
// 0x0010 (0x0010 - 0x0000)
struct W_Options_C_DefaultGameSettings final
{
public:
	TArray<struct FInputActionKeyMapping>         NewLocalVar;                                       // 0x0000(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(W_Options_C_DefaultGameSettings) == 0x000008, "Wrong alignment on W_Options_C_DefaultGameSettings");
static_assert(sizeof(W_Options_C_DefaultGameSettings) == 0x000010, "Wrong size on W_Options_C_DefaultGameSettings");
static_assert(offsetof(W_Options_C_DefaultGameSettings, NewLocalVar) == 0x000000, "Member 'W_Options_C_DefaultGameSettings::NewLocalVar' has a wrong offset!");

// Function W_Options.W_Options_C.DefaultSoundSettings
// 0x0028 (0x0028 - 0x0000)
struct W_Options_C_DefaultSoundSettings final
{
public:
	class USurvivalGameUserSettings*              CallFunc_GetSurvivalUserSettings_ReturnValue;      // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USurvivalGameUserSettings*              CallFunc_GetSurvivalUserSettings_ReturnValue_1;    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USurvivalGameUserSettings*              CallFunc_GetSurvivalUserSettings_ReturnValue_2;    // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USurvivalGameUserSettings*              CallFunc_GetSurvivalUserSettings_ReturnValue_3;    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USurvivalGameUserSettings*              CallFunc_GetSurvivalUserSettings_ReturnValue_4;    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Options_C_DefaultSoundSettings) == 0x000008, "Wrong alignment on W_Options_C_DefaultSoundSettings");
static_assert(sizeof(W_Options_C_DefaultSoundSettings) == 0x000028, "Wrong size on W_Options_C_DefaultSoundSettings");
static_assert(offsetof(W_Options_C_DefaultSoundSettings, CallFunc_GetSurvivalUserSettings_ReturnValue) == 0x000000, "Member 'W_Options_C_DefaultSoundSettings::CallFunc_GetSurvivalUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultSoundSettings, CallFunc_GetSurvivalUserSettings_ReturnValue_1) == 0x000008, "Member 'W_Options_C_DefaultSoundSettings::CallFunc_GetSurvivalUserSettings_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultSoundSettings, CallFunc_GetSurvivalUserSettings_ReturnValue_2) == 0x000010, "Member 'W_Options_C_DefaultSoundSettings::CallFunc_GetSurvivalUserSettings_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultSoundSettings, CallFunc_GetSurvivalUserSettings_ReturnValue_3) == 0x000018, "Member 'W_Options_C_DefaultSoundSettings::CallFunc_GetSurvivalUserSettings_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultSoundSettings, CallFunc_GetSurvivalUserSettings_ReturnValue_4) == 0x000020, "Member 'W_Options_C_DefaultSoundSettings::CallFunc_GetSurvivalUserSettings_ReturnValue_4' has a wrong offset!");

// Function W_Options.W_Options_C.DefaultVideoSettings
// 0x0168 (0x0168 - 0x0000)
struct W_Options_C_DefaultVideoSettings final
{
public:
	int32                                         Effects_Quality;                                   // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Shading_Quality;                                   // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Anti_Aliacing_Quality;                             // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Post_process_Quality_;                             // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Textures_Quality;                                  // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ShadowsQuality;                                    // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USurvivalGameUserSettings*              CallFunc_GetSurvivalUserSettings_ReturnValue;      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival;                  // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival_1;                // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_2;            // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival_2;                // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_3;            // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival_3;                // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_4;            // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival_4;                // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_5;            // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival_5;                // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USurvivalGameUserSettings*              CallFunc_GetSurvivalUserSettings_ReturnValue_1;    // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USurvivalGameUserSettings*              CallFunc_GetSurvivalUserSettings_ReturnValue_2;    // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USurvivalGameUserSettings*              CallFunc_GetSurvivalUserSettings_ReturnValue_3;    // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USurvivalGameUserSettings*              CallFunc_GetSurvivalUserSettings_ReturnValue_4;    // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USurvivalGameUserSettings*              CallFunc_GetSurvivalUserSettings_ReturnValue_5;    // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USurvivalGameUserSettings*              CallFunc_GetSurvivalUserSettings_ReturnValue_6;    // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USurvivalGameUserSettings*              CallFunc_GetSurvivalUserSettings_ReturnValue_7;    // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USurvivalGameUserSettings*              CallFunc_GetSurvivalUserSettings_ReturnValue_8;    // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USurvivalGameUserSettings*              CallFunc_GetSurvivalUserSettings_ReturnValue_9;    // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USurvivalGameUserSettings*              CallFunc_GetSurvivalUserSettings_ReturnValue_10;   // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USurvivalGameUserSettings*              CallFunc_GetSurvivalUserSettings_ReturnValue_11;   // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              K2Node_MakeStruct_IntPoint;                        // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USurvivalGameUserSettings*              CallFunc_GetSurvivalUserSettings_ReturnValue_12;   // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USurvivalGameUserSettings*              CallFunc_GetSurvivalUserSettings_ReturnValue_13;   // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FIntPoint>                      CallFunc_GetSupportedFullscreenResolutions_Resolutions; // 0x0120(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetSupportedFullscreenResolutions_ReturnValue; // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              CallFunc_Array_Get_Item;                           // 0x013C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0145(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0146(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_147[0x1];                                      // 0x0147(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class USurvivalGameUserSettings*              CallFunc_GetSurvivalUserSettings_ReturnValue_14;   // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_152[0x2];                                      // 0x0152(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Options_C_DefaultVideoSettings) == 0x000008, "Wrong alignment on W_Options_C_DefaultVideoSettings");
static_assert(sizeof(W_Options_C_DefaultVideoSettings) == 0x000168, "Wrong size on W_Options_C_DefaultVideoSettings");
static_assert(offsetof(W_Options_C_DefaultVideoSettings, Effects_Quality) == 0x000000, "Member 'W_Options_C_DefaultVideoSettings::Effects_Quality' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultVideoSettings, Shading_Quality) == 0x000004, "Member 'W_Options_C_DefaultVideoSettings::Shading_Quality' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultVideoSettings, Anti_Aliacing_Quality) == 0x000008, "Member 'W_Options_C_DefaultVideoSettings::Anti_Aliacing_Quality' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultVideoSettings, Post_process_Quality_) == 0x00000C, "Member 'W_Options_C_DefaultVideoSettings::Post_process_Quality_' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultVideoSettings, Textures_Quality) == 0x000010, "Member 'W_Options_C_DefaultVideoSettings::Textures_Quality' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultVideoSettings, ShadowsQuality) == 0x000014, "Member 'W_Options_C_DefaultVideoSettings::ShadowsQuality' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultVideoSettings, CallFunc_GetSurvivalUserSettings_ReturnValue) == 0x000018, "Member 'W_Options_C_DefaultVideoSettings::CallFunc_GetSurvivalUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultVideoSettings, CallFunc_GetGameInstance_ReturnValue) == 0x000020, "Member 'W_Options_C_DefaultVideoSettings::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultVideoSettings, K2Node_DynamicCast_AsGI_Survival) == 0x000028, "Member 'W_Options_C_DefaultVideoSettings::K2Node_DynamicCast_AsGI_Survival' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultVideoSettings, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'W_Options_C_DefaultVideoSettings::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultVideoSettings, CallFunc_GetGameInstance_ReturnValue_1) == 0x000038, "Member 'W_Options_C_DefaultVideoSettings::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultVideoSettings, K2Node_DynamicCast_AsGI_Survival_1) == 0x000040, "Member 'W_Options_C_DefaultVideoSettings::K2Node_DynamicCast_AsGI_Survival_1' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultVideoSettings, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'W_Options_C_DefaultVideoSettings::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultVideoSettings, CallFunc_GetGameInstance_ReturnValue_2) == 0x000050, "Member 'W_Options_C_DefaultVideoSettings::CallFunc_GetGameInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultVideoSettings, K2Node_DynamicCast_AsGI_Survival_2) == 0x000058, "Member 'W_Options_C_DefaultVideoSettings::K2Node_DynamicCast_AsGI_Survival_2' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultVideoSettings, K2Node_DynamicCast_bSuccess_2) == 0x000060, "Member 'W_Options_C_DefaultVideoSettings::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultVideoSettings, CallFunc_GetGameInstance_ReturnValue_3) == 0x000068, "Member 'W_Options_C_DefaultVideoSettings::CallFunc_GetGameInstance_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultVideoSettings, K2Node_DynamicCast_AsGI_Survival_3) == 0x000070, "Member 'W_Options_C_DefaultVideoSettings::K2Node_DynamicCast_AsGI_Survival_3' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultVideoSettings, K2Node_DynamicCast_bSuccess_3) == 0x000078, "Member 'W_Options_C_DefaultVideoSettings::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultVideoSettings, CallFunc_GetGameInstance_ReturnValue_4) == 0x000080, "Member 'W_Options_C_DefaultVideoSettings::CallFunc_GetGameInstance_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultVideoSettings, K2Node_DynamicCast_AsGI_Survival_4) == 0x000088, "Member 'W_Options_C_DefaultVideoSettings::K2Node_DynamicCast_AsGI_Survival_4' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultVideoSettings, K2Node_DynamicCast_bSuccess_4) == 0x000090, "Member 'W_Options_C_DefaultVideoSettings::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultVideoSettings, CallFunc_GetGameInstance_ReturnValue_5) == 0x000098, "Member 'W_Options_C_DefaultVideoSettings::CallFunc_GetGameInstance_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultVideoSettings, K2Node_DynamicCast_AsGI_Survival_5) == 0x0000A0, "Member 'W_Options_C_DefaultVideoSettings::K2Node_DynamicCast_AsGI_Survival_5' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultVideoSettings, K2Node_DynamicCast_bSuccess_5) == 0x0000A8, "Member 'W_Options_C_DefaultVideoSettings::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultVideoSettings, CallFunc_GetSurvivalUserSettings_ReturnValue_1) == 0x0000B0, "Member 'W_Options_C_DefaultVideoSettings::CallFunc_GetSurvivalUserSettings_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultVideoSettings, CallFunc_GetSurvivalUserSettings_ReturnValue_2) == 0x0000B8, "Member 'W_Options_C_DefaultVideoSettings::CallFunc_GetSurvivalUserSettings_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultVideoSettings, CallFunc_GetSurvivalUserSettings_ReturnValue_3) == 0x0000C0, "Member 'W_Options_C_DefaultVideoSettings::CallFunc_GetSurvivalUserSettings_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultVideoSettings, CallFunc_GetSurvivalUserSettings_ReturnValue_4) == 0x0000C8, "Member 'W_Options_C_DefaultVideoSettings::CallFunc_GetSurvivalUserSettings_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultVideoSettings, CallFunc_GetSurvivalUserSettings_ReturnValue_5) == 0x0000D0, "Member 'W_Options_C_DefaultVideoSettings::CallFunc_GetSurvivalUserSettings_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultVideoSettings, CallFunc_GetSurvivalUserSettings_ReturnValue_6) == 0x0000D8, "Member 'W_Options_C_DefaultVideoSettings::CallFunc_GetSurvivalUserSettings_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultVideoSettings, CallFunc_GetSurvivalUserSettings_ReturnValue_7) == 0x0000E0, "Member 'W_Options_C_DefaultVideoSettings::CallFunc_GetSurvivalUserSettings_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultVideoSettings, CallFunc_GetSurvivalUserSettings_ReturnValue_8) == 0x0000E8, "Member 'W_Options_C_DefaultVideoSettings::CallFunc_GetSurvivalUserSettings_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultVideoSettings, CallFunc_GetSurvivalUserSettings_ReturnValue_9) == 0x0000F0, "Member 'W_Options_C_DefaultVideoSettings::CallFunc_GetSurvivalUserSettings_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultVideoSettings, CallFunc_GetSurvivalUserSettings_ReturnValue_10) == 0x0000F8, "Member 'W_Options_C_DefaultVideoSettings::CallFunc_GetSurvivalUserSettings_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultVideoSettings, CallFunc_GetSurvivalUserSettings_ReturnValue_11) == 0x000100, "Member 'W_Options_C_DefaultVideoSettings::CallFunc_GetSurvivalUserSettings_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultVideoSettings, K2Node_MakeStruct_IntPoint) == 0x000108, "Member 'W_Options_C_DefaultVideoSettings::K2Node_MakeStruct_IntPoint' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultVideoSettings, CallFunc_GetSurvivalUserSettings_ReturnValue_12) == 0x000110, "Member 'W_Options_C_DefaultVideoSettings::CallFunc_GetSurvivalUserSettings_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultVideoSettings, CallFunc_GetSurvivalUserSettings_ReturnValue_13) == 0x000118, "Member 'W_Options_C_DefaultVideoSettings::CallFunc_GetSurvivalUserSettings_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultVideoSettings, CallFunc_GetSupportedFullscreenResolutions_Resolutions) == 0x000120, "Member 'W_Options_C_DefaultVideoSettings::CallFunc_GetSupportedFullscreenResolutions_Resolutions' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultVideoSettings, CallFunc_GetSupportedFullscreenResolutions_ReturnValue) == 0x000130, "Member 'W_Options_C_DefaultVideoSettings::CallFunc_GetSupportedFullscreenResolutions_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultVideoSettings, CallFunc_Array_Length_ReturnValue) == 0x000134, "Member 'W_Options_C_DefaultVideoSettings::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultVideoSettings, Temp_int_Array_Index_Variable) == 0x000138, "Member 'W_Options_C_DefaultVideoSettings::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultVideoSettings, CallFunc_Array_Get_Item) == 0x00013C, "Member 'W_Options_C_DefaultVideoSettings::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultVideoSettings, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000144, "Member 'W_Options_C_DefaultVideoSettings::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultVideoSettings, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000145, "Member 'W_Options_C_DefaultVideoSettings::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultVideoSettings, CallFunc_BooleanAND_ReturnValue) == 0x000146, "Member 'W_Options_C_DefaultVideoSettings::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultVideoSettings, CallFunc_GetSurvivalUserSettings_ReturnValue_14) == 0x000148, "Member 'W_Options_C_DefaultVideoSettings::CallFunc_GetSurvivalUserSettings_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultVideoSettings, Temp_bool_True_if_break_was_hit_Variable) == 0x000150, "Member 'W_Options_C_DefaultVideoSettings::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultVideoSettings, CallFunc_Not_PreBool_ReturnValue) == 0x000151, "Member 'W_Options_C_DefaultVideoSettings::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultVideoSettings, Temp_int_Loop_Counter_Variable) == 0x000154, "Member 'W_Options_C_DefaultVideoSettings::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultVideoSettings, CallFunc_Less_IntInt_ReturnValue) == 0x000158, "Member 'W_Options_C_DefaultVideoSettings::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultVideoSettings, CallFunc_Add_IntInt_ReturnValue) == 0x00015C, "Member 'W_Options_C_DefaultVideoSettings::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Options_C_DefaultVideoSettings, CallFunc_BooleanAND_ReturnValue_1) == 0x000160, "Member 'W_Options_C_DefaultVideoSettings::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function W_Options.W_Options_C.DeselectRow_Slider
// 0x0030 (0x0030 - 0x0000)
struct W_Options_C_DeselectRow_Slider final
{
public:
	TScriptInterface<class IBPI_SettingRow_C>     K2Node_DynamicCast_AsBPI_Setting_Row;              // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_SettingRow_C>     K2Node_DynamicCast_AsBPI_Setting_Row_1;            // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Options_C_DeselectRow_Slider) == 0x000008, "Wrong alignment on W_Options_C_DeselectRow_Slider");
static_assert(sizeof(W_Options_C_DeselectRow_Slider) == 0x000030, "Wrong size on W_Options_C_DeselectRow_Slider");
static_assert(offsetof(W_Options_C_DeselectRow_Slider, K2Node_DynamicCast_AsBPI_Setting_Row) == 0x000000, "Member 'W_Options_C_DeselectRow_Slider::K2Node_DynamicCast_AsBPI_Setting_Row' has a wrong offset!");
static_assert(offsetof(W_Options_C_DeselectRow_Slider, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'W_Options_C_DeselectRow_Slider::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_Options_C_DeselectRow_Slider, K2Node_DynamicCast_AsBPI_Setting_Row_1) == 0x000018, "Member 'W_Options_C_DeselectRow_Slider::K2Node_DynamicCast_AsBPI_Setting_Row_1' has a wrong offset!");
static_assert(offsetof(W_Options_C_DeselectRow_Slider, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'W_Options_C_DeselectRow_Slider::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function W_Options.W_Options_C.ExecuteUbergraph_W_Options
// 0x0128 (0x0128 - 0x0000)
struct W_Options_C_ExecuteUbergraph_W_Options final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckForDefaultSettings_Changed;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_KeyValueChanging;       // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_1;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_ComponentBoundEvent_Index;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_PageIndex_1;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PageIndex;                      // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_2;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_SettingRow_Slider_C*                 K2Node_DynamicCast_AsW_Setting_Row_Slider;         // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_SettingRow_Slider_C*                 K2Node_DynamicCast_AsW_Setting_Row_Slider_1;       // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckForDefaultSettings_Changed_1;        // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1;  // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_93[0x5];                                       // 0x0093(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A3[0x5];                                       // 0x00A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_GameHUD_C*                          K2Node_DynamicCast_AsBP_Game_HUD;                  // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue_1;                     // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_GameHUD_C*                          K2Node_DynamicCast_AsBP_Game_HUD_1;                // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00FC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x010C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_3;                // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_Options_C_ExecuteUbergraph_W_Options) == 0x000008, "Wrong alignment on W_Options_C_ExecuteUbergraph_W_Options");
static_assert(sizeof(W_Options_C_ExecuteUbergraph_W_Options) == 0x000128, "Wrong size on W_Options_C_ExecuteUbergraph_W_Options");
static_assert(offsetof(W_Options_C_ExecuteUbergraph_W_Options, EntryPoint) == 0x000000, "Member 'W_Options_C_ExecuteUbergraph_W_Options::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Options_C_ExecuteUbergraph_W_Options, Temp_byte_Variable) == 0x000004, "Member 'W_Options_C_ExecuteUbergraph_W_Options::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_Options_C_ExecuteUbergraph_W_Options, Temp_byte_Variable_1) == 0x000005, "Member 'W_Options_C_ExecuteUbergraph_W_Options::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_Options_C_ExecuteUbergraph_W_Options, Temp_bool_Variable) == 0x000006, "Member 'W_Options_C_ExecuteUbergraph_W_Options::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_Options_C_ExecuteUbergraph_W_Options, K2Node_SwitchInteger_CmpSuccess) == 0x000007, "Member 'W_Options_C_ExecuteUbergraph_W_Options::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_Options_C_ExecuteUbergraph_W_Options, CallFunc_CheckForDefaultSettings_Changed) == 0x000008, "Member 'W_Options_C_ExecuteUbergraph_W_Options::CallFunc_CheckForDefaultSettings_Changed' has a wrong offset!");
static_assert(offsetof(W_Options_C_ExecuteUbergraph_W_Options, K2Node_ComponentBoundEvent_KeyValueChanging) == 0x000009, "Member 'W_Options_C_ExecuteUbergraph_W_Options::K2Node_ComponentBoundEvent_KeyValueChanging' has a wrong offset!");
static_assert(offsetof(W_Options_C_ExecuteUbergraph_W_Options, CallFunc_Not_PreBool_ReturnValue) == 0x00000A, "Member 'W_Options_C_ExecuteUbergraph_W_Options::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Options_C_ExecuteUbergraph_W_Options, CallFunc_BooleanAND_ReturnValue) == 0x00000B, "Member 'W_Options_C_ExecuteUbergraph_W_Options::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Options_C_ExecuteUbergraph_W_Options, CallFunc_PlayEvent2D_ReturnValue) == 0x000010, "Member 'W_Options_C_ExecuteUbergraph_W_Options::CallFunc_PlayEvent2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Options_C_ExecuteUbergraph_W_Options, CallFunc_PlayEvent2D_ReturnValue_1) == 0x000018, "Member 'W_Options_C_ExecuteUbergraph_W_Options::CallFunc_PlayEvent2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Options_C_ExecuteUbergraph_W_Options, K2Node_ComponentBoundEvent_Index) == 0x000020, "Member 'W_Options_C_ExecuteUbergraph_W_Options::K2Node_ComponentBoundEvent_Index' has a wrong offset!");
static_assert(offsetof(W_Options_C_ExecuteUbergraph_W_Options, CallFunc_Greater_IntInt_ReturnValue) == 0x000024, "Member 'W_Options_C_ExecuteUbergraph_W_Options::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Options_C_ExecuteUbergraph_W_Options, K2Node_CustomEvent_PageIndex_1) == 0x000028, "Member 'W_Options_C_ExecuteUbergraph_W_Options::K2Node_CustomEvent_PageIndex_1' has a wrong offset!");
static_assert(offsetof(W_Options_C_ExecuteUbergraph_W_Options, K2Node_CustomEvent_PageIndex) == 0x00002C, "Member 'W_Options_C_ExecuteUbergraph_W_Options::K2Node_CustomEvent_PageIndex' has a wrong offset!");
static_assert(offsetof(W_Options_C_ExecuteUbergraph_W_Options, CallFunc_PlayAnimation_ReturnValue) == 0x000030, "Member 'W_Options_C_ExecuteUbergraph_W_Options::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Options_C_ExecuteUbergraph_W_Options, CallFunc_PlayEvent2D_ReturnValue_2) == 0x000038, "Member 'W_Options_C_ExecuteUbergraph_W_Options::CallFunc_PlayEvent2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_Options_C_ExecuteUbergraph_W_Options, K2Node_Event_IsDesignTime) == 0x000040, "Member 'W_Options_C_ExecuteUbergraph_W_Options::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_Options_C_ExecuteUbergraph_W_Options, CallFunc_K2_SetTimer_ReturnValue) == 0x000048, "Member 'W_Options_C_ExecuteUbergraph_W_Options::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Options_C_ExecuteUbergraph_W_Options, Temp_bool_Has_Been_Initd_Variable) == 0x000050, "Member 'W_Options_C_ExecuteUbergraph_W_Options::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(W_Options_C_ExecuteUbergraph_W_Options, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000058, "Member 'W_Options_C_ExecuteUbergraph_W_Options::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Options_C_ExecuteUbergraph_W_Options, K2Node_DynamicCast_AsW_Setting_Row_Slider) == 0x000060, "Member 'W_Options_C_ExecuteUbergraph_W_Options::K2Node_DynamicCast_AsW_Setting_Row_Slider' has a wrong offset!");
static_assert(offsetof(W_Options_C_ExecuteUbergraph_W_Options, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'W_Options_C_ExecuteUbergraph_W_Options::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_Options_C_ExecuteUbergraph_W_Options, K2Node_DynamicCast_AsW_Setting_Row_Slider_1) == 0x000070, "Member 'W_Options_C_ExecuteUbergraph_W_Options::K2Node_DynamicCast_AsW_Setting_Row_Slider_1' has a wrong offset!");
static_assert(offsetof(W_Options_C_ExecuteUbergraph_W_Options, K2Node_DynamicCast_bSuccess_1) == 0x000078, "Member 'W_Options_C_ExecuteUbergraph_W_Options::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_Options_C_ExecuteUbergraph_W_Options, CallFunc_Not_PreBool_ReturnValue_1) == 0x000079, "Member 'W_Options_C_ExecuteUbergraph_W_Options::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Options_C_ExecuteUbergraph_W_Options, CallFunc_CheckForDefaultSettings_Changed_1) == 0x00007A, "Member 'W_Options_C_ExecuteUbergraph_W_Options::CallFunc_CheckForDefaultSettings_Changed_1' has a wrong offset!");
static_assert(offsetof(W_Options_C_ExecuteUbergraph_W_Options, CallFunc_BooleanAND_ReturnValue_1) == 0x00007B, "Member 'W_Options_C_ExecuteUbergraph_W_Options::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Options_C_ExecuteUbergraph_W_Options, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000080, "Member 'W_Options_C_ExecuteUbergraph_W_Options::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Options_C_ExecuteUbergraph_W_Options, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000088, "Member 'W_Options_C_ExecuteUbergraph_W_Options::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Options_C_ExecuteUbergraph_W_Options, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000090, "Member 'W_Options_C_ExecuteUbergraph_W_Options::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Options_C_ExecuteUbergraph_W_Options, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1) == 0x000091, "Member 'W_Options_C_ExecuteUbergraph_W_Options::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Options_C_ExecuteUbergraph_W_Options, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000092, "Member 'W_Options_C_ExecuteUbergraph_W_Options::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Options_C_ExecuteUbergraph_W_Options, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000098, "Member 'W_Options_C_ExecuteUbergraph_W_Options::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Options_C_ExecuteUbergraph_W_Options, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x0000A0, "Member 'W_Options_C_ExecuteUbergraph_W_Options::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Options_C_ExecuteUbergraph_W_Options, K2Node_Select_Default) == 0x0000A1, "Member 'W_Options_C_ExecuteUbergraph_W_Options::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_Options_C_ExecuteUbergraph_W_Options, Temp_bool_IsClosed_Variable) == 0x0000A2, "Member 'W_Options_C_ExecuteUbergraph_W_Options::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(W_Options_C_ExecuteUbergraph_W_Options, CallFunc_GetPlayerController_ReturnValue) == 0x0000A8, "Member 'W_Options_C_ExecuteUbergraph_W_Options::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Options_C_ExecuteUbergraph_W_Options, CallFunc_GetHUD_ReturnValue) == 0x0000B0, "Member 'W_Options_C_ExecuteUbergraph_W_Options::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Options_C_ExecuteUbergraph_W_Options, K2Node_DynamicCast_AsBP_Game_HUD) == 0x0000B8, "Member 'W_Options_C_ExecuteUbergraph_W_Options::K2Node_DynamicCast_AsBP_Game_HUD' has a wrong offset!");
static_assert(offsetof(W_Options_C_ExecuteUbergraph_W_Options, K2Node_DynamicCast_bSuccess_2) == 0x0000C0, "Member 'W_Options_C_ExecuteUbergraph_W_Options::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(W_Options_C_ExecuteUbergraph_W_Options, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x0000C4, "Member 'W_Options_C_ExecuteUbergraph_W_Options::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Options_C_ExecuteUbergraph_W_Options, K2Node_CreateDelegate_OutputDelegate) == 0x0000C8, "Member 'W_Options_C_ExecuteUbergraph_W_Options::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_Options_C_ExecuteUbergraph_W_Options, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0000D8, "Member 'W_Options_C_ExecuteUbergraph_W_Options::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Options_C_ExecuteUbergraph_W_Options, CallFunc_GetPlayerController_ReturnValue_1) == 0x0000E0, "Member 'W_Options_C_ExecuteUbergraph_W_Options::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Options_C_ExecuteUbergraph_W_Options, CallFunc_GetHUD_ReturnValue_1) == 0x0000E8, "Member 'W_Options_C_ExecuteUbergraph_W_Options::CallFunc_GetHUD_ReturnValue_1' has a wrong offset!");
