#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_PerkItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "S_PerkData_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_PerkItem.W_PerkItem_C
// 0x0138 (0x03B8 - 0x0280)
class UW_PerkItem_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 back;                                              // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PerkSprite;                                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FS_PerkData                            PerkData;                                          // 0x0298(0x0100)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          PerkBlocked;                                       // 0x0398(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPC_PerkSystem_C*                      PerkSystem;                                        // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          PerkActivated;                                     // 0x03A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_PerksForTest_C*                      PerkContainer;                                     // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void Activate();
	void bLocked(bool Param_PerkBlocked);
	void Deactivate();
	void ExecuteUbergraph_W_PerkItem(int32 EntryPoint);
	void Init();
	struct FEventReply On_PerkSprite_MouseButtonDown_0(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_PerkItem_C">();
	}
	static class UW_PerkItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_PerkItem_C>();
	}
};
static_assert(alignof(UW_PerkItem_C) == 0x000008, "Wrong alignment on UW_PerkItem_C");
static_assert(sizeof(UW_PerkItem_C) == 0x0003B8, "Wrong size on UW_PerkItem_C");
static_assert(offsetof(UW_PerkItem_C, UberGraphFrame) == 0x000280, "Member 'UW_PerkItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_PerkItem_C, back) == 0x000288, "Member 'UW_PerkItem_C::back' has a wrong offset!");
static_assert(offsetof(UW_PerkItem_C, PerkSprite) == 0x000290, "Member 'UW_PerkItem_C::PerkSprite' has a wrong offset!");
static_assert(offsetof(UW_PerkItem_C, PerkData) == 0x000298, "Member 'UW_PerkItem_C::PerkData' has a wrong offset!");
static_assert(offsetof(UW_PerkItem_C, PerkBlocked) == 0x000398, "Member 'UW_PerkItem_C::PerkBlocked' has a wrong offset!");
static_assert(offsetof(UW_PerkItem_C, PerkSystem) == 0x0003A0, "Member 'UW_PerkItem_C::PerkSystem' has a wrong offset!");
static_assert(offsetof(UW_PerkItem_C, PerkActivated) == 0x0003A8, "Member 'UW_PerkItem_C::PerkActivated' has a wrong offset!");
static_assert(offsetof(UW_PerkItem_C, PerkContainer) == 0x0003B0, "Member 'UW_PerkItem_C::PerkContainer' has a wrong offset!");

}

