#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_RegionCellEmpty

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function W_RegionCellEmpty.W_RegionCellEmpty_C.ExecuteUbergraph_W_RegionCellEmpty
// 0x0028 (0x0028 - 0x0000)
struct W_RegionCellEmpty_C_ExecuteUbergraph_W_RegionCellEmpty final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RegionCellEmpty_C_ExecuteUbergraph_W_RegionCellEmpty) == 0x000008, "Wrong alignment on W_RegionCellEmpty_C_ExecuteUbergraph_W_RegionCellEmpty");
static_assert(sizeof(W_RegionCellEmpty_C_ExecuteUbergraph_W_RegionCellEmpty) == 0x000028, "Wrong size on W_RegionCellEmpty_C_ExecuteUbergraph_W_RegionCellEmpty");
static_assert(offsetof(W_RegionCellEmpty_C_ExecuteUbergraph_W_RegionCellEmpty, EntryPoint) == 0x000000, "Member 'W_RegionCellEmpty_C_ExecuteUbergraph_W_RegionCellEmpty::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_RegionCellEmpty_C_ExecuteUbergraph_W_RegionCellEmpty, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'W_RegionCellEmpty_C_ExecuteUbergraph_W_RegionCellEmpty::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_RegionCellEmpty_C_ExecuteUbergraph_W_RegionCellEmpty, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'W_RegionCellEmpty_C_ExecuteUbergraph_W_RegionCellEmpty::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RegionCellEmpty_C_ExecuteUbergraph_W_RegionCellEmpty, CallFunc_PlayAnimationForward_ReturnValue) == 0x000020, "Member 'W_RegionCellEmpty_C_ExecuteUbergraph_W_RegionCellEmpty::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

}

