#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_RegionEntry

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "FMODStudio_structs.hpp"


namespace SDK::Params
{

// Function W_RegionEntry.W_RegionEntry_C.ExecuteUbergraph_W_RegionEntry
// 0x0068 (0x0068 - 0x0000)
struct W_RegionEntry_C_ExecuteUbergraph_W_RegionEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_GameHUD_C*                          K2Node_DynamicCast_AsBP_Game_HUD;                  // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_GameHUD_C*                          K2Node_DynamicCast_AsBP_Game_HUD_1;                // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RegionEntry_C_ExecuteUbergraph_W_RegionEntry) == 0x000008, "Wrong alignment on W_RegionEntry_C_ExecuteUbergraph_W_RegionEntry");
static_assert(sizeof(W_RegionEntry_C_ExecuteUbergraph_W_RegionEntry) == 0x000068, "Wrong size on W_RegionEntry_C_ExecuteUbergraph_W_RegionEntry");
static_assert(offsetof(W_RegionEntry_C_ExecuteUbergraph_W_RegionEntry, EntryPoint) == 0x000000, "Member 'W_RegionEntry_C_ExecuteUbergraph_W_RegionEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_RegionEntry_C_ExecuteUbergraph_W_RegionEntry, CallFunc_PlayEvent2D_ReturnValue) == 0x000008, "Member 'W_RegionEntry_C_ExecuteUbergraph_W_RegionEntry::CallFunc_PlayEvent2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RegionEntry_C_ExecuteUbergraph_W_RegionEntry, K2Node_MakeStruct_Margin) == 0x000010, "Member 'W_RegionEntry_C_ExecuteUbergraph_W_RegionEntry::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(W_RegionEntry_C_ExecuteUbergraph_W_RegionEntry, K2Node_MakeStruct_Margin_1) == 0x000020, "Member 'W_RegionEntry_C_ExecuteUbergraph_W_RegionEntry::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(W_RegionEntry_C_ExecuteUbergraph_W_RegionEntry, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'W_RegionEntry_C_ExecuteUbergraph_W_RegionEntry::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RegionEntry_C_ExecuteUbergraph_W_RegionEntry, CallFunc_GetPlayerController_ReturnValue) == 0x000038, "Member 'W_RegionEntry_C_ExecuteUbergraph_W_RegionEntry::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RegionEntry_C_ExecuteUbergraph_W_RegionEntry, CallFunc_GetHUD_ReturnValue) == 0x000040, "Member 'W_RegionEntry_C_ExecuteUbergraph_W_RegionEntry::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RegionEntry_C_ExecuteUbergraph_W_RegionEntry, K2Node_DynamicCast_AsBP_Game_HUD) == 0x000048, "Member 'W_RegionEntry_C_ExecuteUbergraph_W_RegionEntry::K2Node_DynamicCast_AsBP_Game_HUD' has a wrong offset!");
static_assert(offsetof(W_RegionEntry_C_ExecuteUbergraph_W_RegionEntry, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'W_RegionEntry_C_ExecuteUbergraph_W_RegionEntry::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_RegionEntry_C_ExecuteUbergraph_W_RegionEntry, K2Node_DynamicCast_AsBP_Game_HUD_1) == 0x000058, "Member 'W_RegionEntry_C_ExecuteUbergraph_W_RegionEntry::K2Node_DynamicCast_AsBP_Game_HUD_1' has a wrong offset!");
static_assert(offsetof(W_RegionEntry_C_ExecuteUbergraph_W_RegionEntry, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'W_RegionEntry_C_ExecuteUbergraph_W_RegionEntry::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function W_RegionEntry.W_RegionEntry_C.OnMouseButtonDown_0
// 0x0240 (0x0240 - 0x0000)
struct W_RegionEntry_C_OnMouseButtonDown_0 final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0170(0x00B8)()
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_GameHUD_C*                          K2Node_DynamicCast_AsBP_Game_HUD;                  // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RegionEntry_C_OnMouseButtonDown_0) == 0x000008, "Wrong alignment on W_RegionEntry_C_OnMouseButtonDown_0");
static_assert(sizeof(W_RegionEntry_C_OnMouseButtonDown_0) == 0x000240, "Wrong size on W_RegionEntry_C_OnMouseButtonDown_0");
static_assert(offsetof(W_RegionEntry_C_OnMouseButtonDown_0, MyGeometry) == 0x000000, "Member 'W_RegionEntry_C_OnMouseButtonDown_0::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_RegionEntry_C_OnMouseButtonDown_0, MouseEvent) == 0x000038, "Member 'W_RegionEntry_C_OnMouseButtonDown_0::MouseEvent' has a wrong offset!");
static_assert(offsetof(W_RegionEntry_C_OnMouseButtonDown_0, ReturnValue) == 0x0000B0, "Member 'W_RegionEntry_C_OnMouseButtonDown_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RegionEntry_C_OnMouseButtonDown_0, CallFunc_GetPlayerController_ReturnValue) == 0x000168, "Member 'W_RegionEntry_C_OnMouseButtonDown_0::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RegionEntry_C_OnMouseButtonDown_0, CallFunc_Handled_ReturnValue) == 0x000170, "Member 'W_RegionEntry_C_OnMouseButtonDown_0::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RegionEntry_C_OnMouseButtonDown_0, CallFunc_GetHUD_ReturnValue) == 0x000228, "Member 'W_RegionEntry_C_OnMouseButtonDown_0::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RegionEntry_C_OnMouseButtonDown_0, K2Node_DynamicCast_AsBP_Game_HUD) == 0x000230, "Member 'W_RegionEntry_C_OnMouseButtonDown_0::K2Node_DynamicCast_AsBP_Game_HUD' has a wrong offset!");
static_assert(offsetof(W_RegionEntry_C_OnMouseButtonDown_0, K2Node_DynamicCast_bSuccess) == 0x000238, "Member 'W_RegionEntry_C_OnMouseButtonDown_0::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

