#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_RPShopSlot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_ShopContainer_structs.hpp"
#include "FItemInfo_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_RPShopSlot.W_RPShopSlot_C
// 0x02E8 (0x0568 - 0x0280)
class UW_RPShopSlot_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hovered;                                           // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button;                                            // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Default;                                           // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Dollar;                                            // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Empty;                                             // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox;                                     // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_1;                                   // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ItemImage;                                         // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ItemName;                                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Price;                                             // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RPoints;                                           // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             RPoints_Text;                                      // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Selected;                                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_PlayerName;                                   // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Status;                                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FFItemInfo                             ItemInfo;                                          // 0x0300(0x0220)(Edit, BlueprintVisible, ContainsInstancedReference, ExposeOnSpawn, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnPressed_RPShopSlot_;                             // 0x0520(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         RPoint;                                            // 0x0530(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	E_ShopContainer                               SetShopState;                                      // 0x0534(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_535[0x3];                                      // 0x0535(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   PlayerName;                                        // 0x0538(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ExposeOnSpawn)
	class FText                                   PlayerStatus;                                      // 0x0550(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ExposeOnSpawn)

public:
	void BndEvt__W_RPShopSlot_Button_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__W_RPShopSlot_Button_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__W_RPShopSlot_Button_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void ExecuteUbergraph_W_RPShopSlot(int32 EntryPoint);
	void Hovered_(bool With_Anim, bool Param_Hovered);
	void Init();
	void OnPressed_RPShopSlot___DelegateSignature(class UW_RPShopSlot_C* Ref);
	void PreConstruct(bool IsDesignTime);
	void Selected_(bool Param_Selected);
	void SetPlayerStatus();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_RPShopSlot_C">();
	}
	static class UW_RPShopSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_RPShopSlot_C>();
	}
};
static_assert(alignof(UW_RPShopSlot_C) == 0x000008, "Wrong alignment on UW_RPShopSlot_C");
static_assert(sizeof(UW_RPShopSlot_C) == 0x000568, "Wrong size on UW_RPShopSlot_C");
static_assert(offsetof(UW_RPShopSlot_C, UberGraphFrame) == 0x000280, "Member 'UW_RPShopSlot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_RPShopSlot_C, Hovered) == 0x000288, "Member 'UW_RPShopSlot_C::Hovered' has a wrong offset!");
static_assert(offsetof(UW_RPShopSlot_C, Button) == 0x000290, "Member 'UW_RPShopSlot_C::Button' has a wrong offset!");
static_assert(offsetof(UW_RPShopSlot_C, Default) == 0x000298, "Member 'UW_RPShopSlot_C::Default' has a wrong offset!");
static_assert(offsetof(UW_RPShopSlot_C, Dollar) == 0x0002A0, "Member 'UW_RPShopSlot_C::Dollar' has a wrong offset!");
static_assert(offsetof(UW_RPShopSlot_C, Empty) == 0x0002A8, "Member 'UW_RPShopSlot_C::Empty' has a wrong offset!");
static_assert(offsetof(UW_RPShopSlot_C, HorizontalBox) == 0x0002B0, "Member 'UW_RPShopSlot_C::HorizontalBox' has a wrong offset!");
static_assert(offsetof(UW_RPShopSlot_C, HorizontalBox_1) == 0x0002B8, "Member 'UW_RPShopSlot_C::HorizontalBox_1' has a wrong offset!");
static_assert(offsetof(UW_RPShopSlot_C, ItemImage) == 0x0002C0, "Member 'UW_RPShopSlot_C::ItemImage' has a wrong offset!");
static_assert(offsetof(UW_RPShopSlot_C, ItemName) == 0x0002C8, "Member 'UW_RPShopSlot_C::ItemName' has a wrong offset!");
static_assert(offsetof(UW_RPShopSlot_C, Price) == 0x0002D0, "Member 'UW_RPShopSlot_C::Price' has a wrong offset!");
static_assert(offsetof(UW_RPShopSlot_C, RPoints) == 0x0002D8, "Member 'UW_RPShopSlot_C::RPoints' has a wrong offset!");
static_assert(offsetof(UW_RPShopSlot_C, RPoints_Text) == 0x0002E0, "Member 'UW_RPShopSlot_C::RPoints_Text' has a wrong offset!");
static_assert(offsetof(UW_RPShopSlot_C, Selected) == 0x0002E8, "Member 'UW_RPShopSlot_C::Selected' has a wrong offset!");
static_assert(offsetof(UW_RPShopSlot_C, Text_PlayerName) == 0x0002F0, "Member 'UW_RPShopSlot_C::Text_PlayerName' has a wrong offset!");
static_assert(offsetof(UW_RPShopSlot_C, Text_Status) == 0x0002F8, "Member 'UW_RPShopSlot_C::Text_Status' has a wrong offset!");
static_assert(offsetof(UW_RPShopSlot_C, ItemInfo) == 0x000300, "Member 'UW_RPShopSlot_C::ItemInfo' has a wrong offset!");
static_assert(offsetof(UW_RPShopSlot_C, OnPressed_RPShopSlot_) == 0x000520, "Member 'UW_RPShopSlot_C::OnPressed_RPShopSlot_' has a wrong offset!");
static_assert(offsetof(UW_RPShopSlot_C, RPoint) == 0x000530, "Member 'UW_RPShopSlot_C::RPoint' has a wrong offset!");
static_assert(offsetof(UW_RPShopSlot_C, SetShopState) == 0x000534, "Member 'UW_RPShopSlot_C::SetShopState' has a wrong offset!");
static_assert(offsetof(UW_RPShopSlot_C, PlayerName) == 0x000538, "Member 'UW_RPShopSlot_C::PlayerName' has a wrong offset!");
static_assert(offsetof(UW_RPShopSlot_C, PlayerStatus) == 0x000550, "Member 'UW_RPShopSlot_C::PlayerStatus' has a wrong offset!");

}

