#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_RPShop

#include "Basic.hpp"

#include "ContainerPickupsInfo_structs.hpp"
#include "ShopCategory_structs.hpp"
#include "FItemInfo_structs.hpp"
#include "JSItemType_structs.hpp"
#include "AttachmentInfo_structs.hpp"
#include "InputCore_structs.hpp"
#include "S_ShopItemList_structs.hpp"
#include "SlateCore_structs.hpp"
#include "E_ReasonForCancelingTransaction_structs.hpp"
#include "Engine_structs.hpp"
#include "FMODStudio_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function W_RPShop.W_RPShop_C.Add Item Remove Money
// 0x04C0 (0x04C0 - 0x0000)
struct W_RPShop_C_Add_Item_Remove_Money final
{
public:
	class ASurvivalPlayer_C*                      PlayerReference;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFItemInfo                             ItemInfo;                                          // 0x0008(0x0220)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         MoneyCount;                                        // 0x0228(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RPoints;                                           // 0x022C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0238(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x3];                                      // 0x0249(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x3];                                      // 0x0251(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_RPShopSlot_C*                        CallFunc_Array_Get_Item;                           // 0x0260(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFItemInfo                             CallFunc_GetDataTableRowFromName_OutRow;           // 0x0268(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_489[0x7];                                      // 0x0489(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FContainerPickupsInfo>          K2Node_MakeArray_Array;                            // 0x0490(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_JSAddItem_Ad;                             // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A1[0x7];                                      // 0x04A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x04A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemByName_ReturnedCount;              // 0x04B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RPShop_C_Add_Item_Remove_Money) == 0x000008, "Wrong alignment on W_RPShop_C_Add_Item_Remove_Money");
static_assert(sizeof(W_RPShop_C_Add_Item_Remove_Money) == 0x0004C0, "Wrong size on W_RPShop_C_Add_Item_Remove_Money");
static_assert(offsetof(W_RPShop_C_Add_Item_Remove_Money, PlayerReference) == 0x000000, "Member 'W_RPShop_C_Add_Item_Remove_Money::PlayerReference' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Add_Item_Remove_Money, ItemInfo) == 0x000008, "Member 'W_RPShop_C_Add_Item_Remove_Money::ItemInfo' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Add_Item_Remove_Money, MoneyCount) == 0x000228, "Member 'W_RPShop_C_Add_Item_Remove_Money::MoneyCount' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Add_Item_Remove_Money, RPoints) == 0x00022C, "Member 'W_RPShop_C_Add_Item_Remove_Money::RPoints' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Add_Item_Remove_Money, CallFunc_Multiply_IntInt_ReturnValue) == 0x000230, "Member 'W_RPShop_C_Add_Item_Remove_Money::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Add_Item_Remove_Money, CallFunc_Array_Length_ReturnValue) == 0x000234, "Member 'W_RPShop_C_Add_Item_Remove_Money::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Add_Item_Remove_Money, CallFunc_Conv_TextToString_ReturnValue) == 0x000238, "Member 'W_RPShop_C_Add_Item_Remove_Money::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Add_Item_Remove_Money, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000248, "Member 'W_RPShop_C_Add_Item_Remove_Money::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Add_Item_Remove_Money, Temp_int_Loop_Counter_Variable) == 0x00024C, "Member 'W_RPShop_C_Add_Item_Remove_Money::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Add_Item_Remove_Money, CallFunc_Less_IntInt_ReturnValue) == 0x000250, "Member 'W_RPShop_C_Add_Item_Remove_Money::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Add_Item_Remove_Money, CallFunc_Add_IntInt_ReturnValue) == 0x000254, "Member 'W_RPShop_C_Add_Item_Remove_Money::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Add_Item_Remove_Money, Temp_int_Array_Index_Variable) == 0x000258, "Member 'W_RPShop_C_Add_Item_Remove_Money::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Add_Item_Remove_Money, CallFunc_Array_Get_Item) == 0x000260, "Member 'W_RPShop_C_Add_Item_Remove_Money::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Add_Item_Remove_Money, CallFunc_GetDataTableRowFromName_OutRow) == 0x000268, "Member 'W_RPShop_C_Add_Item_Remove_Money::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Add_Item_Remove_Money, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000488, "Member 'W_RPShop_C_Add_Item_Remove_Money::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Add_Item_Remove_Money, K2Node_MakeArray_Array) == 0x000490, "Member 'W_RPShop_C_Add_Item_Remove_Money::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Add_Item_Remove_Money, CallFunc_JSAddItem_Ad) == 0x0004A0, "Member 'W_RPShop_C_Add_Item_Remove_Money::CallFunc_JSAddItem_Ad' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Add_Item_Remove_Money, CallFunc_Conv_NameToString_ReturnValue) == 0x0004A8, "Member 'W_RPShop_C_Add_Item_Remove_Money::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Add_Item_Remove_Money, CallFunc_GetItemByName_ReturnedCount) == 0x0004B8, "Member 'W_RPShop_C_Add_Item_Remove_Money::CallFunc_GetItemByName_ReturnedCount' has a wrong offset!");

// Function W_RPShop.W_RPShop_C.BndEvt__W_RPShop_WBP_MainCategorySelector_K2Node_ComponentBoundEvent_1_OnCategoryChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_RPShop_C_BndEvt__W_RPShop_WBP_MainCategorySelector_K2Node_ComponentBoundEvent_1_OnCategoryChanged__DelegateSignature final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RPShop_C_BndEvt__W_RPShop_WBP_MainCategorySelector_K2Node_ComponentBoundEvent_1_OnCategoryChanged__DelegateSignature) == 0x000004, "Wrong alignment on W_RPShop_C_BndEvt__W_RPShop_WBP_MainCategorySelector_K2Node_ComponentBoundEvent_1_OnCategoryChanged__DelegateSignature");
static_assert(sizeof(W_RPShop_C_BndEvt__W_RPShop_WBP_MainCategorySelector_K2Node_ComponentBoundEvent_1_OnCategoryChanged__DelegateSignature) == 0x000004, "Wrong size on W_RPShop_C_BndEvt__W_RPShop_WBP_MainCategorySelector_K2Node_ComponentBoundEvent_1_OnCategoryChanged__DelegateSignature");
static_assert(offsetof(W_RPShop_C_BndEvt__W_RPShop_WBP_MainCategorySelector_K2Node_ComponentBoundEvent_1_OnCategoryChanged__DelegateSignature, Param_Index) == 0x000000, "Member 'W_RPShop_C_BndEvt__W_RPShop_WBP_MainCategorySelector_K2Node_ComponentBoundEvent_1_OnCategoryChanged__DelegateSignature::Param_Index' has a wrong offset!");

// Function W_RPShop.W_RPShop_C.BndEvt__W_RPShop_WBP_ShopDialogue_K2Node_ComponentBoundEvent_2_OnPressedAccept__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct W_RPShop_C_BndEvt__W_RPShop_WBP_ShopDialogue_K2Node_ComponentBoundEvent_2_OnPressedAccept__DelegateSignature final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJSI_Slot_C*                            Ref_slot;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RPShop_C_BndEvt__W_RPShop_WBP_ShopDialogue_K2Node_ComponentBoundEvent_2_OnPressedAccept__DelegateSignature) == 0x000008, "Wrong alignment on W_RPShop_C_BndEvt__W_RPShop_WBP_ShopDialogue_K2Node_ComponentBoundEvent_2_OnPressedAccept__DelegateSignature");
static_assert(sizeof(W_RPShop_C_BndEvt__W_RPShop_WBP_ShopDialogue_K2Node_ComponentBoundEvent_2_OnPressedAccept__DelegateSignature) == 0x000010, "Wrong size on W_RPShop_C_BndEvt__W_RPShop_WBP_ShopDialogue_K2Node_ComponentBoundEvent_2_OnPressedAccept__DelegateSignature");
static_assert(offsetof(W_RPShop_C_BndEvt__W_RPShop_WBP_ShopDialogue_K2Node_ComponentBoundEvent_2_OnPressedAccept__DelegateSignature, Count) == 0x000000, "Member 'W_RPShop_C_BndEvt__W_RPShop_WBP_ShopDialogue_K2Node_ComponentBoundEvent_2_OnPressedAccept__DelegateSignature::Count' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_BndEvt__W_RPShop_WBP_ShopDialogue_K2Node_ComponentBoundEvent_2_OnPressedAccept__DelegateSignature, Ref_slot) == 0x000008, "Member 'W_RPShop_C_BndEvt__W_RPShop_WBP_ShopDialogue_K2Node_ComponentBoundEvent_2_OnPressedAccept__DelegateSignature::Ref_slot' has a wrong offset!");

// Function W_RPShop.W_RPShop_C.Buyback Item
// 0x06B8 (0x06B8 - 0x0000)
struct W_RPShop_C_Buyback_Item final
{
public:
	struct FFItemInfo                             FItemInfo;                                         // 0x0000(0x0220)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x0220(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJSI_Slot_C*                            JSI_Slot;                                          // 0x0228(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFItemInfo                             K2Node_SetFieldsInStruct_StructOut;                // 0x0230(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FFItemInfo                             CallFunc_GetDataTableRowFromName_OutRow;           // 0x0450(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0670(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveInventoryItemByRef_Removed;         // 0x0671(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_672[0x2];                                      // 0x0672(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Calculate_Result_Price_ReturnValue;       // 0x0674(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0678(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x067C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67D[0x3];                                      // 0x067D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RemoveBuybackItems_Index;                 // 0x0680(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveBuybackItems_ItemRemoved;           // 0x0684(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_685[0x3];                                      // 0x0685(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0688(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC;                  // 0x0690(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x06A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A1[0x7];                                      // 0x06A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      CallFunc_GetPlayerRef_SurvivalPlayer;              // 0x06A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Can_Add_or_Equip_Item_Return;             // 0x06B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RPShop_C_Buyback_Item) == 0x000008, "Wrong alignment on W_RPShop_C_Buyback_Item");
static_assert(sizeof(W_RPShop_C_Buyback_Item) == 0x0006B8, "Wrong size on W_RPShop_C_Buyback_Item");
static_assert(offsetof(W_RPShop_C_Buyback_Item, FItemInfo) == 0x000000, "Member 'W_RPShop_C_Buyback_Item::FItemInfo' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Buyback_Item, Count) == 0x000220, "Member 'W_RPShop_C_Buyback_Item::Count' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Buyback_Item, JSI_Slot) == 0x000228, "Member 'W_RPShop_C_Buyback_Item::JSI_Slot' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Buyback_Item, K2Node_SetFieldsInStruct_StructOut) == 0x000230, "Member 'W_RPShop_C_Buyback_Item::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Buyback_Item, CallFunc_GetDataTableRowFromName_OutRow) == 0x000450, "Member 'W_RPShop_C_Buyback_Item::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Buyback_Item, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000670, "Member 'W_RPShop_C_Buyback_Item::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Buyback_Item, CallFunc_RemoveInventoryItemByRef_Removed) == 0x000671, "Member 'W_RPShop_C_Buyback_Item::CallFunc_RemoveInventoryItemByRef_Removed' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Buyback_Item, CallFunc_Calculate_Result_Price_ReturnValue) == 0x000674, "Member 'W_RPShop_C_Buyback_Item::CallFunc_Calculate_Result_Price_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Buyback_Item, CallFunc_Multiply_IntInt_ReturnValue) == 0x000678, "Member 'W_RPShop_C_Buyback_Item::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Buyback_Item, CallFunc_IsValid_ReturnValue) == 0x00067C, "Member 'W_RPShop_C_Buyback_Item::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Buyback_Item, CallFunc_RemoveBuybackItems_Index) == 0x000680, "Member 'W_RPShop_C_Buyback_Item::CallFunc_RemoveBuybackItems_Index' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Buyback_Item, CallFunc_RemoveBuybackItems_ItemRemoved) == 0x000684, "Member 'W_RPShop_C_Buyback_Item::CallFunc_RemoveBuybackItems_ItemRemoved' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Buyback_Item, CallFunc_GetPlayerController_ReturnValue) == 0x000688, "Member 'W_RPShop_C_Buyback_Item::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Buyback_Item, K2Node_DynamicCast_AsBPI_Surv_PC) == 0x000690, "Member 'W_RPShop_C_Buyback_Item::K2Node_DynamicCast_AsBPI_Surv_PC' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Buyback_Item, K2Node_DynamicCast_bSuccess) == 0x0006A0, "Member 'W_RPShop_C_Buyback_Item::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Buyback_Item, CallFunc_GetPlayerRef_SurvivalPlayer) == 0x0006A8, "Member 'W_RPShop_C_Buyback_Item::CallFunc_GetPlayerRef_SurvivalPlayer' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Buyback_Item, CallFunc_Can_Add_or_Equip_Item_Return) == 0x0006B0, "Member 'W_RPShop_C_Buyback_Item::CallFunc_Can_Add_or_Equip_Item_Return' has a wrong offset!");

// Function W_RPShop.W_RPShop_C.BuyItem
// 0x0260 (0x0260 - 0x0000)
struct W_RPShop_C_BuyItem final
{
public:
	struct FFItemInfo                             FItemInfo;                                         // 0x0000(0x0220)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         RPoints;                                           // 0x0220(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Calculate_Result_Price_ReturnValue;       // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC;                  // 0x0238(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      CallFunc_GetPlayerRef_SurvivalPlayer;              // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Can_Add_or_Equip_Item_Return;             // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RPShop_C_BuyItem) == 0x000008, "Wrong alignment on W_RPShop_C_BuyItem");
static_assert(sizeof(W_RPShop_C_BuyItem) == 0x000260, "Wrong size on W_RPShop_C_BuyItem");
static_assert(offsetof(W_RPShop_C_BuyItem, FItemInfo) == 0x000000, "Member 'W_RPShop_C_BuyItem::FItemInfo' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_BuyItem, RPoints) == 0x000220, "Member 'W_RPShop_C_BuyItem::RPoints' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_BuyItem, CallFunc_GetPlayerController_ReturnValue) == 0x000228, "Member 'W_RPShop_C_BuyItem::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_BuyItem, CallFunc_Calculate_Result_Price_ReturnValue) == 0x000230, "Member 'W_RPShop_C_BuyItem::CallFunc_Calculate_Result_Price_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_BuyItem, K2Node_DynamicCast_AsBPI_Surv_PC) == 0x000238, "Member 'W_RPShop_C_BuyItem::K2Node_DynamicCast_AsBPI_Surv_PC' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_BuyItem, K2Node_DynamicCast_bSuccess) == 0x000248, "Member 'W_RPShop_C_BuyItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_BuyItem, CallFunc_GetPlayerRef_SurvivalPlayer) == 0x000250, "Member 'W_RPShop_C_BuyItem::CallFunc_GetPlayerRef_SurvivalPlayer' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_BuyItem, CallFunc_Multiply_IntInt_ReturnValue) == 0x000258, "Member 'W_RPShop_C_BuyItem::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_BuyItem, CallFunc_Can_Add_or_Equip_Item_Return) == 0x00025C, "Member 'W_RPShop_C_BuyItem::CallFunc_Can_Add_or_Equip_Item_Return' has a wrong offset!");

// Function W_RPShop.W_RPShop_C.Calculate Result Price
// 0x0768 (0x0768 - 0x0000)
struct W_RPShop_C_Calculate_Result_Price final
{
public:
	struct FFItemInfo                             FItemInfo;                                         // 0x0000(0x0220)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0220(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPC_PlayerStatsComponent_C*            Player_Stats_Comp__local_;                         // 0x0228(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        Price__local_;                                     // 0x0230(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJSItemType                                   Temp_byte_Variable;                                // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFItemInfo                             CallFunc_GetDataTableRowFromName_OutRow;           // 0x0248(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_469[0x7];                                      // 0x0469(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_1;                              // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0478(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47C[0x4];                                      // 0x047C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_2;                              // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4;                              // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJSItemType                                   Temp_byte_Variable_1;                              // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_499[0x7];                                      // 0x0499(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_5;                              // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_6;                              // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_7;                              // 0x04B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_8;                              // 0x04B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_9;                              // 0x04C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x04C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x04CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAttachmentInfo                        CallFunc_Array_Get_Item;                           // 0x04D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E1[0x7];                                      // 0x04E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x04E8(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0708(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_709[0x3];                                      // 0x0709(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x070C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default;                             // 0x0710(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0718(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71C[0x4];                                      // 0x071C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0720(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0728(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0730(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default_1;                           // 0x0738(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC;                  // 0x0740(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0750(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_751[0x7];                                      // 0x0751(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0758(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      CallFunc_GetPlayerRef_SurvivalPlayer;              // 0x0760(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RPShop_C_Calculate_Result_Price) == 0x000008, "Wrong alignment on W_RPShop_C_Calculate_Result_Price");
static_assert(sizeof(W_RPShop_C_Calculate_Result_Price) == 0x000768, "Wrong size on W_RPShop_C_Calculate_Result_Price");
static_assert(offsetof(W_RPShop_C_Calculate_Result_Price, FItemInfo) == 0x000000, "Member 'W_RPShop_C_Calculate_Result_Price::FItemInfo' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Calculate_Result_Price, ReturnValue) == 0x000220, "Member 'W_RPShop_C_Calculate_Result_Price::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Calculate_Result_Price, Player_Stats_Comp__local_) == 0x000228, "Member 'W_RPShop_C_Calculate_Result_Price::Player_Stats_Comp__local_' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Calculate_Result_Price, Price__local_) == 0x000230, "Member 'W_RPShop_C_Calculate_Result_Price::Price__local_' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Calculate_Result_Price, Temp_byte_Variable) == 0x000238, "Member 'W_RPShop_C_Calculate_Result_Price::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Calculate_Result_Price, Temp_real_Variable) == 0x000240, "Member 'W_RPShop_C_Calculate_Result_Price::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Calculate_Result_Price, CallFunc_GetDataTableRowFromName_OutRow) == 0x000248, "Member 'W_RPShop_C_Calculate_Result_Price::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Calculate_Result_Price, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000468, "Member 'W_RPShop_C_Calculate_Result_Price::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Calculate_Result_Price, Temp_real_Variable_1) == 0x000470, "Member 'W_RPShop_C_Calculate_Result_Price::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Calculate_Result_Price, CallFunc_Array_Length_ReturnValue) == 0x000478, "Member 'W_RPShop_C_Calculate_Result_Price::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Calculate_Result_Price, Temp_real_Variable_2) == 0x000480, "Member 'W_RPShop_C_Calculate_Result_Price::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Calculate_Result_Price, Temp_real_Variable_3) == 0x000488, "Member 'W_RPShop_C_Calculate_Result_Price::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Calculate_Result_Price, Temp_real_Variable_4) == 0x000490, "Member 'W_RPShop_C_Calculate_Result_Price::Temp_real_Variable_4' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Calculate_Result_Price, Temp_byte_Variable_1) == 0x000498, "Member 'W_RPShop_C_Calculate_Result_Price::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Calculate_Result_Price, Temp_real_Variable_5) == 0x0004A0, "Member 'W_RPShop_C_Calculate_Result_Price::Temp_real_Variable_5' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Calculate_Result_Price, Temp_real_Variable_6) == 0x0004A8, "Member 'W_RPShop_C_Calculate_Result_Price::Temp_real_Variable_6' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Calculate_Result_Price, Temp_real_Variable_7) == 0x0004B0, "Member 'W_RPShop_C_Calculate_Result_Price::Temp_real_Variable_7' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Calculate_Result_Price, Temp_real_Variable_8) == 0x0004B8, "Member 'W_RPShop_C_Calculate_Result_Price::Temp_real_Variable_8' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Calculate_Result_Price, Temp_real_Variable_9) == 0x0004C0, "Member 'W_RPShop_C_Calculate_Result_Price::Temp_real_Variable_9' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Calculate_Result_Price, Temp_int_Array_Index_Variable) == 0x0004C8, "Member 'W_RPShop_C_Calculate_Result_Price::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Calculate_Result_Price, Temp_int_Loop_Counter_Variable) == 0x0004CC, "Member 'W_RPShop_C_Calculate_Result_Price::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Calculate_Result_Price, CallFunc_Array_Get_Item) == 0x0004D0, "Member 'W_RPShop_C_Calculate_Result_Price::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Calculate_Result_Price, CallFunc_Less_IntInt_ReturnValue) == 0x0004E0, "Member 'W_RPShop_C_Calculate_Result_Price::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Calculate_Result_Price, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x0004E8, "Member 'W_RPShop_C_Calculate_Result_Price::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Calculate_Result_Price, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000708, "Member 'W_RPShop_C_Calculate_Result_Price::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Calculate_Result_Price, CallFunc_Add_IntInt_ReturnValue) == 0x00070C, "Member 'W_RPShop_C_Calculate_Result_Price::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Calculate_Result_Price, K2Node_Select_Default) == 0x000710, "Member 'W_RPShop_C_Calculate_Result_Price::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Calculate_Result_Price, CallFunc_Round_ReturnValue) == 0x000718, "Member 'W_RPShop_C_Calculate_Result_Price::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Calculate_Result_Price, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000720, "Member 'W_RPShop_C_Calculate_Result_Price::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Calculate_Result_Price, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000728, "Member 'W_RPShop_C_Calculate_Result_Price::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Calculate_Result_Price, CallFunc_GetPlayerController_ReturnValue) == 0x000730, "Member 'W_RPShop_C_Calculate_Result_Price::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Calculate_Result_Price, K2Node_Select_Default_1) == 0x000738, "Member 'W_RPShop_C_Calculate_Result_Price::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Calculate_Result_Price, K2Node_DynamicCast_AsBPI_Surv_PC) == 0x000740, "Member 'W_RPShop_C_Calculate_Result_Price::K2Node_DynamicCast_AsBPI_Surv_PC' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Calculate_Result_Price, K2Node_DynamicCast_bSuccess) == 0x000750, "Member 'W_RPShop_C_Calculate_Result_Price::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Calculate_Result_Price, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000758, "Member 'W_RPShop_C_Calculate_Result_Price::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Calculate_Result_Price, CallFunc_GetPlayerRef_SurvivalPlayer) == 0x000760, "Member 'W_RPShop_C_Calculate_Result_Price::CallFunc_GetPlayerRef_SurvivalPlayer' has a wrong offset!");

// Function W_RPShop.W_RPShop_C.Category Selected
// 0x0098 (0x0098 - 0x0000)
struct W_RPShop_C_Category_Selected final
{
public:
	class UW_ShopCategory_C*                      Ref;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_;                                            // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0010(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_RPShopSlot_C*                        CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0060(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UW_RPShopSlot_C*                        CallFunc_Array_Get_Item_1;                         // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_Array_Get_Item_2;                         // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_ShopCategory_C*                      K2Node_DynamicCast_AsW_Shop_Category;              // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B[0x5];                                       // 0x008B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_ShopCategory_C*                      K2Node_Select_Default;                             // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RPShop_C_Category_Selected) == 0x000008, "Wrong alignment on W_RPShop_C_Category_Selected");
static_assert(sizeof(W_RPShop_C_Category_Selected) == 0x000098, "Wrong size on W_RPShop_C_Category_Selected");
static_assert(offsetof(W_RPShop_C_Category_Selected, Ref) == 0x000000, "Member 'W_RPShop_C_Category_Selected::Ref' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Category_Selected, Index_) == 0x000008, "Member 'W_RPShop_C_Category_Selected::Index_' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Category_Selected, CallFunc_Conv_NameToText_ReturnValue) == 0x000010, "Member 'W_RPShop_C_Category_Selected::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Category_Selected, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'W_RPShop_C_Category_Selected::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Category_Selected, Temp_bool_Variable) == 0x00002C, "Member 'W_RPShop_C_Category_Selected::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Category_Selected, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'W_RPShop_C_Category_Selected::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Category_Selected, CallFunc_Array_Length_ReturnValue_1) == 0x000034, "Member 'W_RPShop_C_Category_Selected::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Category_Selected, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'W_RPShop_C_Category_Selected::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Category_Selected, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'W_RPShop_C_Category_Selected::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Category_Selected, Temp_int_Array_Index_Variable) == 0x000040, "Member 'W_RPShop_C_Category_Selected::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Category_Selected, CallFunc_Array_Get_Item) == 0x000048, "Member 'W_RPShop_C_Category_Selected::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Category_Selected, Temp_int_Loop_Counter_Variable_1) == 0x000050, "Member 'W_RPShop_C_Category_Selected::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Category_Selected, CallFunc_Less_IntInt_ReturnValue_1) == 0x000054, "Member 'W_RPShop_C_Category_Selected::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Category_Selected, CallFunc_Add_IntInt_ReturnValue_1) == 0x000058, "Member 'W_RPShop_C_Category_Selected::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Category_Selected, Temp_int_Array_Index_Variable_1) == 0x00005C, "Member 'W_RPShop_C_Category_Selected::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Category_Selected, CallFunc_GetAllChildren_ReturnValue) == 0x000060, "Member 'W_RPShop_C_Category_Selected::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Category_Selected, CallFunc_Array_Get_Item_1) == 0x000070, "Member 'W_RPShop_C_Category_Selected::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Category_Selected, CallFunc_Array_Get_Item_2) == 0x000078, "Member 'W_RPShop_C_Category_Selected::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Category_Selected, K2Node_DynamicCast_AsW_Shop_Category) == 0x000080, "Member 'W_RPShop_C_Category_Selected::K2Node_DynamicCast_AsW_Shop_Category' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Category_Selected, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'W_RPShop_C_Category_Selected::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Category_Selected, CallFunc_IsValid_ReturnValue) == 0x000089, "Member 'W_RPShop_C_Category_Selected::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Category_Selected, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x00008A, "Member 'W_RPShop_C_Category_Selected::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Category_Selected, K2Node_Select_Default) == 0x000090, "Member 'W_RPShop_C_Category_Selected::K2Node_Select_Default' has a wrong offset!");

// Function W_RPShop.W_RPShop_C.Change State Preview
// 0x000C (0x000C - 0x0000)
struct W_RPShop_C_Change_State_Preview final
{
public:
	EShopCategory                                 Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EShopCategory                                 Temp_byte_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EShopCategory                                 K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RPShop_C_Change_State_Preview) == 0x000004, "Wrong alignment on W_RPShop_C_Change_State_Preview");
static_assert(sizeof(W_RPShop_C_Change_State_Preview) == 0x00000C, "Wrong size on W_RPShop_C_Change_State_Preview");
static_assert(offsetof(W_RPShop_C_Change_State_Preview, Temp_byte_Variable) == 0x000000, "Member 'W_RPShop_C_Change_State_Preview::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Change_State_Preview, Temp_byte_Variable_1) == 0x000001, "Member 'W_RPShop_C_Change_State_Preview::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Change_State_Preview, Temp_bool_Variable) == 0x000002, "Member 'W_RPShop_C_Change_State_Preview::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Change_State_Preview, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000003, "Member 'W_RPShop_C_Change_State_Preview::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Change_State_Preview, K2Node_Select_Default) == 0x000004, "Member 'W_RPShop_C_Change_State_Preview::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Change_State_Preview, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000005, "Member 'W_RPShop_C_Change_State_Preview::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Change_State_Preview, CallFunc_SelectInt_ReturnValue) == 0x000008, "Member 'W_RPShop_C_Change_State_Preview::CallFunc_SelectInt_ReturnValue' has a wrong offset!");

// Function W_RPShop.W_RPShop_C.ChangeCategoryBuy
// 0x0008 (0x0008 - 0x0000)
struct W_RPShop_C_ChangeCategoryBuy final
{
public:
	class UW_ShopCategory_C*                      Ref;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RPShop_C_ChangeCategoryBuy) == 0x000008, "Wrong alignment on W_RPShop_C_ChangeCategoryBuy");
static_assert(sizeof(W_RPShop_C_ChangeCategoryBuy) == 0x000008, "Wrong size on W_RPShop_C_ChangeCategoryBuy");
static_assert(offsetof(W_RPShop_C_ChangeCategoryBuy, Ref) == 0x000000, "Member 'W_RPShop_C_ChangeCategoryBuy::Ref' has a wrong offset!");

// Function W_RPShop.W_RPShop_C.ChangeShopState
// 0x0001 (0x0001 - 0x0000)
struct W_RPShop_C_ChangeShopState final
{
public:
	EShopCategory                                 New_Shop_State;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RPShop_C_ChangeShopState) == 0x000001, "Wrong alignment on W_RPShop_C_ChangeShopState");
static_assert(sizeof(W_RPShop_C_ChangeShopState) == 0x000001, "Wrong size on W_RPShop_C_ChangeShopState");
static_assert(offsetof(W_RPShop_C_ChangeShopState, New_Shop_State) == 0x000000, "Member 'W_RPShop_C_ChangeShopState::New_Shop_State' has a wrong offset!");

// Function W_RPShop.W_RPShop_C.ChangeStateNext
// 0x000C (0x000C - 0x0000)
struct W_RPShop_C_ChangeStateNext final
{
public:
	EShopCategory                                 Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EShopCategory                                 Temp_byte_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EShopCategory                                 K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RPShop_C_ChangeStateNext) == 0x000004, "Wrong alignment on W_RPShop_C_ChangeStateNext");
static_assert(sizeof(W_RPShop_C_ChangeStateNext) == 0x00000C, "Wrong size on W_RPShop_C_ChangeStateNext");
static_assert(offsetof(W_RPShop_C_ChangeStateNext, Temp_byte_Variable) == 0x000000, "Member 'W_RPShop_C_ChangeStateNext::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_ChangeStateNext, Temp_byte_Variable_1) == 0x000001, "Member 'W_RPShop_C_ChangeStateNext::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_ChangeStateNext, Temp_bool_Variable) == 0x000002, "Member 'W_RPShop_C_ChangeStateNext::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_ChangeStateNext, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000003, "Member 'W_RPShop_C_ChangeStateNext::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_ChangeStateNext, K2Node_Select_Default) == 0x000004, "Member 'W_RPShop_C_ChangeStateNext::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_ChangeStateNext, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000005, "Member 'W_RPShop_C_ChangeStateNext::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_ChangeStateNext, CallFunc_SelectInt_ReturnValue) == 0x000008, "Member 'W_RPShop_C_ChangeStateNext::CallFunc_SelectInt_ReturnValue' has a wrong offset!");

// Function W_RPShop.W_RPShop_C.Check Can Buy
// 0x0250 (0x0250 - 0x0000)
struct W_RPShop_C_Check_Can_Buy final
{
public:
	struct FFItemInfo                             FItemInfo;                                         // 0x0000(0x0220)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0220(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvPC_C*                              K2Node_DynamicCast_AsSurv_PC;                      // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x3];                                      // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Calculate_Result_Price_ReturnValue;       // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTotalMoneyCount_ReturnedCount;         // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RPShop_C_Check_Can_Buy) == 0x000008, "Wrong alignment on W_RPShop_C_Check_Can_Buy");
static_assert(sizeof(W_RPShop_C_Check_Can_Buy) == 0x000250, "Wrong size on W_RPShop_C_Check_Can_Buy");
static_assert(offsetof(W_RPShop_C_Check_Can_Buy, FItemInfo) == 0x000000, "Member 'W_RPShop_C_Check_Can_Buy::FItemInfo' has a wrong offset!");
static_assert(offsetof(W_RPShop_C_Check_Can_Buy, ReturnValue) == 0x000220, "Member 'W_RPShop_C_Check_Can_Buy::ReturnValue' has a wrong offset!");
