#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SettengRow_Button

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "FMODStudio_structs.hpp"


namespace SDK::Params
{

// Function W_SettengRow_Button.W_SettengRow_Button_C.ExecuteUbergraph_W_SettengRow_Button
// 0x0020 (0x0020 - 0x0000)
struct W_SettengRow_Button_C_ExecuteUbergraph_W_SettengRow_Button final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_1;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_SettengRow_Button_C_ExecuteUbergraph_W_SettengRow_Button) == 0x000008, "Wrong alignment on W_SettengRow_Button_C_ExecuteUbergraph_W_SettengRow_Button");
static_assert(sizeof(W_SettengRow_Button_C_ExecuteUbergraph_W_SettengRow_Button) == 0x000020, "Wrong size on W_SettengRow_Button_C_ExecuteUbergraph_W_SettengRow_Button");
static_assert(offsetof(W_SettengRow_Button_C_ExecuteUbergraph_W_SettengRow_Button, EntryPoint) == 0x000000, "Member 'W_SettengRow_Button_C_ExecuteUbergraph_W_SettengRow_Button::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_SettengRow_Button_C_ExecuteUbergraph_W_SettengRow_Button, CallFunc_PlayEvent2D_ReturnValue) == 0x000008, "Member 'W_SettengRow_Button_C_ExecuteUbergraph_W_SettengRow_Button::CallFunc_PlayEvent2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SettengRow_Button_C_ExecuteUbergraph_W_SettengRow_Button, K2Node_Event_IsDesignTime) == 0x000010, "Member 'W_SettengRow_Button_C_ExecuteUbergraph_W_SettengRow_Button::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_SettengRow_Button_C_ExecuteUbergraph_W_SettengRow_Button, CallFunc_Not_PreBool_ReturnValue) == 0x000011, "Member 'W_SettengRow_Button_C_ExecuteUbergraph_W_SettengRow_Button::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SettengRow_Button_C_ExecuteUbergraph_W_SettengRow_Button, CallFunc_PlayEvent2D_ReturnValue_1) == 0x000018, "Member 'W_SettengRow_Button_C_ExecuteUbergraph_W_SettengRow_Button::CallFunc_PlayEvent2D_ReturnValue_1' has a wrong offset!");

// Function W_SettengRow_Button.W_SettengRow_Button_C.Hover
// 0x0010 (0x0010 - 0x0000)
struct W_SettengRow_Button_C_Hover final
{
public:
	bool                                          bHover;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettengRow_Button_C_Hover) == 0x000008, "Wrong alignment on W_SettengRow_Button_C_Hover");
static_assert(sizeof(W_SettengRow_Button_C_Hover) == 0x000010, "Wrong size on W_SettengRow_Button_C_Hover");
static_assert(offsetof(W_SettengRow_Button_C_Hover, bHover) == 0x000000, "Member 'W_SettengRow_Button_C_Hover::bHover' has a wrong offset!");
static_assert(offsetof(W_SettengRow_Button_C_Hover, Temp_bool_Variable) == 0x000001, "Member 'W_SettengRow_Button_C_Hover::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_SettengRow_Button_C_Hover, Temp_byte_Variable) == 0x000002, "Member 'W_SettengRow_Button_C_Hover::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_SettengRow_Button_C_Hover, Temp_byte_Variable_1) == 0x000003, "Member 'W_SettengRow_Button_C_Hover::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_SettengRow_Button_C_Hover, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'W_SettengRow_Button_C_Hover::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SettengRow_Button_C_Hover, K2Node_Select_Default) == 0x000005, "Member 'W_SettengRow_Button_C_Hover::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_SettengRow_Button_C_Hover, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'W_SettengRow_Button_C_Hover::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function W_SettengRow_Button.W_SettengRow_Button_C.OnButtonPressed__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_SettengRow_Button_C_OnButtonPressed__DelegateSignature final
{
public:
	class UW_SettengRow_Button_C*                 RowButton;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettengRow_Button_C_OnButtonPressed__DelegateSignature) == 0x000008, "Wrong alignment on W_SettengRow_Button_C_OnButtonPressed__DelegateSignature");
static_assert(sizeof(W_SettengRow_Button_C_OnButtonPressed__DelegateSignature) == 0x000008, "Wrong size on W_SettengRow_Button_C_OnButtonPressed__DelegateSignature");
static_assert(offsetof(W_SettengRow_Button_C_OnButtonPressed__DelegateSignature, RowButton) == 0x000000, "Member 'W_SettengRow_Button_C_OnButtonPressed__DelegateSignature::RowButton' has a wrong offset!");

// Function W_SettengRow_Button.W_SettengRow_Button_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_SettengRow_Button_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettengRow_Button_C_PreConstruct) == 0x000001, "Wrong alignment on W_SettengRow_Button_C_PreConstruct");
static_assert(sizeof(W_SettengRow_Button_C_PreConstruct) == 0x000001, "Wrong size on W_SettengRow_Button_C_PreConstruct");
static_assert(offsetof(W_SettengRow_Button_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_SettengRow_Button_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_SettengRow_Button.W_SettengRow_Button_C.Select
// 0x0018 (0x0018 - 0x0000)
struct W_SettengRow_Button_C_Select final
{
public:
	bool                                          bSelect;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default;                             // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       K2Node_Select_Default_1;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettengRow_Button_C_Select) == 0x000008, "Wrong alignment on W_SettengRow_Button_C_Select");
static_assert(sizeof(W_SettengRow_Button_C_Select) == 0x000018, "Wrong size on W_SettengRow_Button_C_Select");
static_assert(offsetof(W_SettengRow_Button_C_Select, bSelect) == 0x000000, "Member 'W_SettengRow_Button_C_Select::bSelect' has a wrong offset!");
static_assert(offsetof(W_SettengRow_Button_C_Select, Temp_bool_Variable) == 0x000001, "Member 'W_SettengRow_Button_C_Select::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_SettengRow_Button_C_Select, Temp_byte_Variable) == 0x000002, "Member 'W_SettengRow_Button_C_Select::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_SettengRow_Button_C_Select, Temp_byte_Variable_1) == 0x000003, "Member 'W_SettengRow_Button_C_Select::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_SettengRow_Button_C_Select, Temp_bool_Variable_1) == 0x000004, "Member 'W_SettengRow_Button_C_Select::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(W_SettengRow_Button_C_Select, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000005, "Member 'W_SettengRow_Button_C_Select::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SettengRow_Button_C_Select, K2Node_Select_Default) == 0x000006, "Member 'W_SettengRow_Button_C_Select::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_SettengRow_Button_C_Select, CallFunc_IsHovered_ReturnValue) == 0x000007, "Member 'W_SettengRow_Button_C_Select::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SettengRow_Button_C_Select, K2Node_Select_Default_1) == 0x000008, "Member 'W_SettengRow_Button_C_Select::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(W_SettengRow_Button_C_Select, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'W_SettengRow_Button_C_Select::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

