#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SettingRow_Slider

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_SettingRow_Slider.W_SettingRow_Slider_C
// 0x00E0 (0x0360 - 0x0280)
class UW_SettingRow_Slider_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Deselect_Anim;                                     // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Select_Anim;                                       // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover_Anim;                                        // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_DoScroll;                                   // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_57;                                          // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Default;                                     // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Hovered;                                     // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Selected;                                    // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             MainText;                                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_BG;                                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_89;                                    // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_BG;                                    // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USlider*                                RowSlider;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ValueText;                               // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             ValueHasBeenChanged;                               // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FVector                                SliderValues;                                      // 0x0308(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentValue;                                      // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxValue;                                          // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        MinValue;                                          // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        StepValue;                                         // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsRowHovered;                                     // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsRowSelected;                                    // 0x0341(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_342[0x6];                                      // 0x0342(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            ParentSettingsMenu;                                // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   SettingName;                                       // 0x0350(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        PreValue;                                          // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__W_SettingRow_Slider_Button_DoScroll_K2Node_ComponentBoundEvent_2_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__W_SettingRow_Slider_RowSlider_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature(float Value);
	void BndEvt__W_SettingRow_Slider_RowSlider_K2Node_ComponentBoundEvent_1_OnMouseCaptureBeginEvent__DelegateSignature();
	void Construct();
	void DeselectRow();
	void EnableRow(bool Enable);
	void ExecuteUbergraph_W_SettingRow_Slider(int32 EntryPoint);
	void GetIsDefaultValue(bool* Default);
	void GetSettingName(class FName* Param_SettingName);
	void HoverRow();
	void Init(double Param_CurrentValue, double Param_MinValue, double Param_MaxValue, double Param_StepValue);
	void InitSetting();
	void IsRowHovered(bool* Param_IsHovered);
	void IsRowSelected(bool* IsSelected);
	void OnKeyValueChanged(double Value);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void PreConstruct(bool IsDesignTime);
	void SelectRow();
	void SetDefault();
	void SetHovered();
	void SetParentSettingsWidget(class UUserWidget* SettingsWidgetRef);
	void SetSelected(bool Selected);
	void UnhoverRow();
	void UpdateSliderValues();
	void ValueHasBeenChanged__DelegateSignature(double NewValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_SettingRow_Slider_C">();
	}
	static class UW_SettingRow_Slider_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_SettingRow_Slider_C>();
	}
};
static_assert(alignof(UW_SettingRow_Slider_C) == 0x000008, "Wrong alignment on UW_SettingRow_Slider_C");
static_assert(sizeof(UW_SettingRow_Slider_C) == 0x000360, "Wrong size on UW_SettingRow_Slider_C");
static_assert(offsetof(UW_SettingRow_Slider_C, UberGraphFrame) == 0x000280, "Member 'UW_SettingRow_Slider_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_SettingRow_Slider_C, Deselect_Anim) == 0x000288, "Member 'UW_SettingRow_Slider_C::Deselect_Anim' has a wrong offset!");
static_assert(offsetof(UW_SettingRow_Slider_C, Select_Anim) == 0x000290, "Member 'UW_SettingRow_Slider_C::Select_Anim' has a wrong offset!");
static_assert(offsetof(UW_SettingRow_Slider_C, Hover_Anim) == 0x000298, "Member 'UW_SettingRow_Slider_C::Hover_Anim' has a wrong offset!");
static_assert(offsetof(UW_SettingRow_Slider_C, Button_DoScroll) == 0x0002A0, "Member 'UW_SettingRow_Slider_C::Button_DoScroll' has a wrong offset!");
static_assert(offsetof(UW_SettingRow_Slider_C, Image_57) == 0x0002A8, "Member 'UW_SettingRow_Slider_C::Image_57' has a wrong offset!");
static_assert(offsetof(UW_SettingRow_Slider_C, Image_Default) == 0x0002B0, "Member 'UW_SettingRow_Slider_C::Image_Default' has a wrong offset!");
static_assert(offsetof(UW_SettingRow_Slider_C, Image_Hovered) == 0x0002B8, "Member 'UW_SettingRow_Slider_C::Image_Hovered' has a wrong offset!");
static_assert(offsetof(UW_SettingRow_Slider_C, Image_Selected) == 0x0002C0, "Member 'UW_SettingRow_Slider_C::Image_Selected' has a wrong offset!");
static_assert(offsetof(UW_SettingRow_Slider_C, MainText) == 0x0002C8, "Member 'UW_SettingRow_Slider_C::MainText' has a wrong offset!");
static_assert(offsetof(UW_SettingRow_Slider_C, Overlay_BG) == 0x0002D0, "Member 'UW_SettingRow_Slider_C::Overlay_BG' has a wrong offset!");
static_assert(offsetof(UW_SettingRow_Slider_C, ProgressBar_89) == 0x0002D8, "Member 'UW_SettingRow_Slider_C::ProgressBar_89' has a wrong offset!");
static_assert(offsetof(UW_SettingRow_Slider_C, ProgressBar_BG) == 0x0002E0, "Member 'UW_SettingRow_Slider_C::ProgressBar_BG' has a wrong offset!");
static_assert(offsetof(UW_SettingRow_Slider_C, RowSlider) == 0x0002E8, "Member 'UW_SettingRow_Slider_C::RowSlider' has a wrong offset!");
static_assert(offsetof(UW_SettingRow_Slider_C, TextBlock_ValueText) == 0x0002F0, "Member 'UW_SettingRow_Slider_C::TextBlock_ValueText' has a wrong offset!");
static_assert(offsetof(UW_SettingRow_Slider_C, ValueHasBeenChanged) == 0x0002F8, "Member 'UW_SettingRow_Slider_C::ValueHasBeenChanged' has a wrong offset!");
static_assert(offsetof(UW_SettingRow_Slider_C, SliderValues) == 0x000308, "Member 'UW_SettingRow_Slider_C::SliderValues' has a wrong offset!");
static_assert(offsetof(UW_SettingRow_Slider_C, CurrentValue) == 0x000320, "Member 'UW_SettingRow_Slider_C::CurrentValue' has a wrong offset!");
static_assert(offsetof(UW_SettingRow_Slider_C, MaxValue) == 0x000328, "Member 'UW_SettingRow_Slider_C::MaxValue' has a wrong offset!");
static_assert(offsetof(UW_SettingRow_Slider_C, MinValue) == 0x000330, "Member 'UW_SettingRow_Slider_C::MinValue' has a wrong offset!");
static_assert(offsetof(UW_SettingRow_Slider_C, StepValue) == 0x000338, "Member 'UW_SettingRow_Slider_C::StepValue' has a wrong offset!");
static_assert(offsetof(UW_SettingRow_Slider_C, bIsRowHovered) == 0x000340, "Member 'UW_SettingRow_Slider_C::bIsRowHovered' has a wrong offset!");
static_assert(offsetof(UW_SettingRow_Slider_C, bIsRowSelected) == 0x000341, "Member 'UW_SettingRow_Slider_C::bIsRowSelected' has a wrong offset!");
static_assert(offsetof(UW_SettingRow_Slider_C, ParentSettingsMenu) == 0x000348, "Member 'UW_SettingRow_Slider_C::ParentSettingsMenu' has a wrong offset!");
static_assert(offsetof(UW_SettingRow_Slider_C, SettingName) == 0x000350, "Member 'UW_SettingRow_Slider_C::SettingName' has a wrong offset!");
static_assert(offsetof(UW_SettingRow_Slider_C, PreValue) == 0x000358, "Member 'UW_SettingRow_Slider_C::PreValue' has a wrong offset!");

}

