#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SettingRow_Text

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "S_SettingDescriptionData_structs.hpp"
#include "FMODStudio_structs.hpp"


namespace SDK::Params
{

// Function W_SettingRow_Text.W_SettingRow_Text_C.ExecuteUbergraph_W_SettingRow_Text
// 0x0218 (0x0218 - 0x0000)
struct W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_CurrentIndex;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_1;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x001C(0x0038)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0058(0x0078)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00D0(0x0078)(ConstParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x014B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Settings_C>       K2Node_DynamicCast_AsBPI_Settings;                 // 0x0150(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Settings_C>       K2Node_DynamicCast_AsBPI_Settings_1;               // 0x0168(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Settings_C>       K2Node_DynamicCast_AsBPI_Settings_2;               // 0x0180(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Settings_C>       K2Node_DynamicCast_AsBPI_Settings_3;               // 0x0198(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_Event_SettingsWidgetRef;                    // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_2;                // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_3;                // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_4;                // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_5;                // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_6;                // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E5[0x3];                                      // 0x01E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F2[0x2];                                      // 0x01F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FA[0x6];                                      // 0x01FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Settings_C>       K2Node_DynamicCast_AsBPI_Settings_4;               // 0x0200(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text) == 0x000008, "Wrong alignment on W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text");
static_assert(sizeof(W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text) == 0x000218, "Wrong size on W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text");
static_assert(offsetof(W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text, EntryPoint) == 0x000000, "Member 'W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text, K2Node_CustomEvent_CurrentIndex) == 0x000004, "Member 'W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text::K2Node_CustomEvent_CurrentIndex' has a wrong offset!");
static_assert(offsetof(W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text, CallFunc_PlayEvent2D_ReturnValue) == 0x000008, "Member 'W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text::CallFunc_PlayEvent2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text, CallFunc_PlayEvent2D_ReturnValue_1) == 0x000010, "Member 'W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text::CallFunc_PlayEvent2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text, CallFunc_Not_PreBool_ReturnValue) == 0x000018, "Member 'W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text, CallFunc_Not_PreBool_ReturnValue_1) == 0x000019, "Member 'W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text, CallFunc_Not_PreBool_ReturnValue_2) == 0x00001A, "Member 'W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text, CallFunc_Not_PreBool_ReturnValue_3) == 0x00001B, "Member 'W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text, K2Node_Event_MyGeometry) == 0x00001C, "Member 'W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text, K2Node_Event_MouseEvent_1) == 0x000058, "Member 'W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text, K2Node_Event_MouseEvent) == 0x0000D0, "Member 'W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text, CallFunc_IsValid_ReturnValue) == 0x000148, "Member 'W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text, CallFunc_IsValid_ReturnValue_1) == 0x000149, "Member 'W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text, CallFunc_IsValid_ReturnValue_2) == 0x00014A, "Member 'W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text, CallFunc_IsValid_ReturnValue_3) == 0x00014B, "Member 'W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text, K2Node_DynamicCast_AsBPI_Settings) == 0x000150, "Member 'W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text::K2Node_DynamicCast_AsBPI_Settings' has a wrong offset!");
static_assert(offsetof(W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text, K2Node_DynamicCast_bSuccess) == 0x000160, "Member 'W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text, K2Node_DynamicCast_AsBPI_Settings_1) == 0x000168, "Member 'W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text::K2Node_DynamicCast_AsBPI_Settings_1' has a wrong offset!");
static_assert(offsetof(W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text, K2Node_DynamicCast_bSuccess_1) == 0x000178, "Member 'W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text, K2Node_DynamicCast_AsBPI_Settings_2) == 0x000180, "Member 'W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text::K2Node_DynamicCast_AsBPI_Settings_2' has a wrong offset!");
static_assert(offsetof(W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text, K2Node_DynamicCast_bSuccess_2) == 0x000190, "Member 'W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text, K2Node_DynamicCast_AsBPI_Settings_3) == 0x000198, "Member 'W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text::K2Node_DynamicCast_AsBPI_Settings_3' has a wrong offset!");
static_assert(offsetof(W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text, K2Node_DynamicCast_bSuccess_3) == 0x0001A8, "Member 'W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text, K2Node_Event_SettingsWidgetRef) == 0x0001B0, "Member 'W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text::K2Node_Event_SettingsWidgetRef' has a wrong offset!");
static_assert(offsetof(W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text, CallFunc_PlayEvent2D_ReturnValue_2) == 0x0001B8, "Member 'W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text::CallFunc_PlayEvent2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text, CallFunc_PlayEvent2D_ReturnValue_3) == 0x0001C0, "Member 'W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text::CallFunc_PlayEvent2D_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text, CallFunc_PlayEvent2D_ReturnValue_4) == 0x0001C8, "Member 'W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text::CallFunc_PlayEvent2D_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text, CallFunc_PlayEvent2D_ReturnValue_5) == 0x0001D0, "Member 'W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text::CallFunc_PlayEvent2D_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text, CallFunc_PlayEvent2D_ReturnValue_6) == 0x0001D8, "Member 'W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text::CallFunc_PlayEvent2D_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text, CallFunc_Add_IntInt_ReturnValue) == 0x0001E0, "Member 'W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0001E4, "Member 'W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text, CallFunc_SelectInt_ReturnValue) == 0x0001E8, "Member 'W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text, CallFunc_Subtract_IntInt_ReturnValue) == 0x0001EC, "Member 'W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0001F0, "Member 'W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text, K2Node_Event_IsDesignTime) == 0x0001F1, "Member 'W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text, CallFunc_SelectInt_ReturnValue_1) == 0x0001F4, "Member 'W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text::CallFunc_SelectInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text, CallFunc_IsHovered_ReturnValue) == 0x0001F8, "Member 'W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text, CallFunc_IsValid_ReturnValue_4) == 0x0001F9, "Member 'W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text, K2Node_DynamicCast_AsBPI_Settings_4) == 0x000200, "Member 'W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text::K2Node_DynamicCast_AsBPI_Settings_4' has a wrong offset!");
static_assert(offsetof(W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text, K2Node_DynamicCast_bSuccess_4) == 0x000210, "Member 'W_SettingRow_Text_C_ExecuteUbergraph_W_SettingRow_Text::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");

// Function W_SettingRow_Text.W_SettingRow_Text_C.GetIsDefaultValue
// 0x0002 (0x0002 - 0x0000)
struct W_SettingRow_Text_C_GetIsDefaultValue final
{
public:
	bool                                          Default;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingRow_Text_C_GetIsDefaultValue) == 0x000001, "Wrong alignment on W_SettingRow_Text_C_GetIsDefaultValue");
static_assert(sizeof(W_SettingRow_Text_C_GetIsDefaultValue) == 0x000002, "Wrong size on W_SettingRow_Text_C_GetIsDefaultValue");
static_assert(offsetof(W_SettingRow_Text_C_GetIsDefaultValue, Default) == 0x000000, "Member 'W_SettingRow_Text_C_GetIsDefaultValue::Default' has a wrong offset!");
static_assert(offsetof(W_SettingRow_Text_C_GetIsDefaultValue, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000001, "Member 'W_SettingRow_Text_C_GetIsDefaultValue::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function W_SettingRow_Text.W_SettingRow_Text_C.GetSettingName
// 0x0008 (0x0008 - 0x0000)
struct W_SettingRow_Text_C_GetSettingName final
{
public:
	class FName                                   Param_SettingName;                                 // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingRow_Text_C_GetSettingName) == 0x000004, "Wrong alignment on W_SettingRow_Text_C_GetSettingName");
static_assert(sizeof(W_SettingRow_Text_C_GetSettingName) == 0x000008, "Wrong size on W_SettingRow_Text_C_GetSettingName");
static_assert(offsetof(W_SettingRow_Text_C_GetSettingName, Param_SettingName) == 0x000000, "Member 'W_SettingRow_Text_C_GetSettingName::Param_SettingName' has a wrong offset!");

// Function W_SettingRow_Text.W_SettingRow_Text_C.IndexHasBeenChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_SettingRow_Text_C_IndexHasBeenChanged__DelegateSignature final
{
public:
	int32                                         NewIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingRow_Text_C_IndexHasBeenChanged__DelegateSignature) == 0x000004, "Wrong alignment on W_SettingRow_Text_C_IndexHasBeenChanged__DelegateSignature");
static_assert(sizeof(W_SettingRow_Text_C_IndexHasBeenChanged__DelegateSignature) == 0x000004, "Wrong size on W_SettingRow_Text_C_IndexHasBeenChanged__DelegateSignature");
static_assert(offsetof(W_SettingRow_Text_C_IndexHasBeenChanged__DelegateSignature, NewIndex) == 0x000000, "Member 'W_SettingRow_Text_C_IndexHasBeenChanged__DelegateSignature::NewIndex' has a wrong offset!");

// Function W_SettingRow_Text.W_SettingRow_Text_C.Init
// 0x0004 (0x0004 - 0x0000)
struct W_SettingRow_Text_C_Init final
{
public:
	int32                                         Param_CurrentIndex;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingRow_Text_C_Init) == 0x000004, "Wrong alignment on W_SettingRow_Text_C_Init");
static_assert(sizeof(W_SettingRow_Text_C_Init) == 0x000004, "Wrong size on W_SettingRow_Text_C_Init");
static_assert(offsetof(W_SettingRow_Text_C_Init, Param_CurrentIndex) == 0x000000, "Member 'W_SettingRow_Text_C_Init::Param_CurrentIndex' has a wrong offset!");

// Function W_SettingRow_Text.W_SettingRow_Text_C.InitSetting
// 0x0070 (0x0070 - 0x0000)
struct W_SettingRow_Text_C_InitSetting final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_SettingDescriptionData              CallFunc_GetDataTableRowFromName_OutRow;           // 0x0008(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           K2Node_Select_Default;                             // 0x0060(0x0010)(ReferenceParm)
};
static_assert(alignof(W_SettingRow_Text_C_InitSetting) == 0x000008, "Wrong alignment on W_SettingRow_Text_C_InitSetting");
static_assert(sizeof(W_SettingRow_Text_C_InitSetting) == 0x000070, "Wrong size on W_SettingRow_Text_C_InitSetting");
static_assert(offsetof(W_SettingRow_Text_C_InitSetting, Temp_bool_Variable) == 0x000000, "Member 'W_SettingRow_Text_C_InitSetting::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_SettingRow_Text_C_InitSetting, CallFunc_GetDataTableRowFromName_OutRow) == 0x000008, "Member 'W_SettingRow_Text_C_InitSetting::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(W_SettingRow_Text_C_InitSetting, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000050, "Member 'W_SettingRow_Text_C_InitSetting::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SettingRow_Text_C_InitSetting, CallFunc_Array_Length_ReturnValue) == 0x000054, "Member 'W_SettingRow_Text_C_InitSetting::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SettingRow_Text_C_InitSetting, CallFunc_Greater_IntInt_ReturnValue) == 0x000058, "Member 'W_SettingRow_Text_C_InitSetting::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SettingRow_Text_C_InitSetting, K2Node_Select_Default) == 0x000060, "Member 'W_SettingRow_Text_C_InitSetting::K2Node_Select_Default' has a wrong offset!");

// Function W_SettingRow_Text.W_SettingRow_Text_C.IsRowHovered
// 0x0001 (0x0001 - 0x0000)
struct W_SettingRow_Text_C_IsRowHovered final
{
public:
	bool                                          Param_IsHovered;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingRow_Text_C_IsRowHovered) == 0x000001, "Wrong alignment on W_SettingRow_Text_C_IsRowHovered");
static_assert(sizeof(W_SettingRow_Text_C_IsRowHovered) == 0x000001, "Wrong size on W_SettingRow_Text_C_IsRowHovered");
static_assert(offsetof(W_SettingRow_Text_C_IsRowHovered, Param_IsHovered) == 0x000000, "Member 'W_SettingRow_Text_C_IsRowHovered::Param_IsHovered' has a wrong offset!");

// Function W_SettingRow_Text.W_SettingRow_Text_C.IsRowSelected
// 0x0001 (0x0001 - 0x0000)
struct W_SettingRow_Text_C_IsRowSelected final
{
public:
	bool                                          IsSelected;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingRow_Text_C_IsRowSelected) == 0x000001, "Wrong alignment on W_SettingRow_Text_C_IsRowSelected");
static_assert(sizeof(W_SettingRow_Text_C_IsRowSelected) == 0x000001, "Wrong size on W_SettingRow_Text_C_IsRowSelected");
static_assert(offsetof(W_SettingRow_Text_C_IsRowSelected, IsSelected) == 0x000000, "Member 'W_SettingRow_Text_C_IsRowSelected::IsSelected' has a wrong offset!");

// Function W_SettingRow_Text.W_SettingRow_Text_C.OnMouseEnter
// 0x00B0 (0x00B0 - 0x0000)
struct W_SettingRow_Text_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(W_SettingRow_Text_C_OnMouseEnter) == 0x000008, "Wrong alignment on W_SettingRow_Text_C_OnMouseEnter");
static_assert(sizeof(W_SettingRow_Text_C_OnMouseEnter) == 0x0000B0, "Wrong size on W_SettingRow_Text_C_OnMouseEnter");
static_assert(offsetof(W_SettingRow_Text_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'W_SettingRow_Text_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_SettingRow_Text_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'W_SettingRow_Text_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function W_SettingRow_Text.W_SettingRow_Text_C.OnMouseLeave
// 0x0078 (0x0078 - 0x0000)
struct W_SettingRow_Text_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(W_SettingRow_Text_C_OnMouseLeave) == 0x000008, "Wrong alignment on W_SettingRow_Text_C_OnMouseLeave");
static_assert(sizeof(W_SettingRow_Text_C_OnMouseLeave) == 0x000078, "Wrong size on W_SettingRow_Text_C_OnMouseLeave");
static_assert(offsetof(W_SettingRow_Text_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'W_SettingRow_Text_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function W_SettingRow_Text.W_SettingRow_Text_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_SettingRow_Text_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingRow_Text_C_PreConstruct) == 0x000001, "Wrong alignment on W_SettingRow_Text_C_PreConstruct");
static_assert(sizeof(W_SettingRow_Text_C_PreConstruct) == 0x000001, "Wrong size on W_SettingRow_Text_C_PreConstruct");
static_assert(offsetof(W_SettingRow_Text_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_SettingRow_Text_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_SettingRow_Text.W_SettingRow_Text_C.SetDefault
// 0x0020 (0x0020 - 0x0000)
struct W_SettingRow_Text_C_SetDefault final
{
public:
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0000(0x0014)()
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingRow_Text_C_SetDefault) == 0x000008, "Wrong alignment on W_SettingRow_Text_C_SetDefault");
static_assert(sizeof(W_SettingRow_Text_C_SetDefault) == 0x000020, "Wrong size on W_SettingRow_Text_C_SetDefault");
static_assert(offsetof(W_SettingRow_Text_C_SetDefault, K2Node_MakeStruct_SlateColor) == 0x000000, "Member 'W_SettingRow_Text_C_SetDefault::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_SettingRow_Text_C_SetDefault, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'W_SettingRow_Text_C_SetDefault::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function W_SettingRow_Text.W_SettingRow_Text_C.SetHovered
// 0x0008 (0x0008 - 0x0000)
struct W_SettingRow_Text_C_SetHovered final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingRow_Text_C_SetHovered) == 0x000008, "Wrong alignment on W_SettingRow_Text_C_SetHovered");
static_assert(sizeof(W_SettingRow_Text_C_SetHovered) == 0x000008, "Wrong size on W_SettingRow_Text_C_SetHovered");
static_assert(offsetof(W_SettingRow_Text_C_SetHovered, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'W_SettingRow_Text_C_SetHovered::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function W_SettingRow_Text.W_SettingRow_Text_C.SetParentSettingsWidget
// 0x0008 (0x0008 - 0x0000)
struct W_SettingRow_Text_C_SetParentSettingsWidget final
{
public:
	class UUserWidget*                            SettingsWidgetRef;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingRow_Text_C_SetParentSettingsWidget) == 0x000008, "Wrong alignment on W_SettingRow_Text_C_SetParentSettingsWidget");
static_assert(sizeof(W_SettingRow_Text_C_SetParentSettingsWidget) == 0x000008, "Wrong size on W_SettingRow_Text_C_SetParentSettingsWidget");
static_assert(offsetof(W_SettingRow_Text_C_SetParentSettingsWidget, SettingsWidgetRef) == 0x000000, "Member 'W_SettingRow_Text_C_SetParentSettingsWidget::SettingsWidgetRef' has a wrong offset!");

// Function W_SettingRow_Text.W_SettingRow_Text_C.SetSelected
// 0x0010 (0x0010 - 0x0000)
struct W_SettingRow_Text_C_SetSelected final
{
public:
	bool                                          Selected;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingRow_Text_C_SetSelected) == 0x000008, "Wrong alignment on W_SettingRow_Text_C_SetSelected");
static_assert(sizeof(W_SettingRow_Text_C_SetSelected) == 0x000010, "Wrong size on W_SettingRow_Text_C_SetSelected");
static_assert(offsetof(W_SettingRow_Text_C_SetSelected, Selected) == 0x000000, "Member 'W_SettingRow_Text_C_SetSelected::Selected' has a wrong offset!");
static_assert(offsetof(W_SettingRow_Text_C_SetSelected, Temp_bool_Variable) == 0x000001, "Member 'W_SettingRow_Text_C_SetSelected::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_SettingRow_Text_C_SetSelected, Temp_byte_Variable) == 0x000002, "Member 'W_SettingRow_Text_C_SetSelected::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_SettingRow_Text_C_SetSelected, Temp_byte_Variable_1) == 0x000003, "Member 'W_SettingRow_Text_C_SetSelected::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_SettingRow_Text_C_SetSelected, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x000004, "Member 'W_SettingRow_Text_C_SetSelected::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SettingRow_Text_C_SetSelected, K2Node_Select_Default) == 0x000005, "Member 'W_SettingRow_Text_C_SetSelected::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_SettingRow_Text_C_SetSelected, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'W_SettingRow_Text_C_SetSelected::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function W_SettingRow_Text.W_SettingRow_Text_C.SetTextByIndex
// 0x0004 (0x0004 - 0x0000)
struct W_SettingRow_Text_C_SetTextByIndex final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingRow_Text_C_SetTextByIndex) == 0x000004, "Wrong alignment on W_SettingRow_Text_C_SetTextByIndex");
static_assert(sizeof(W_SettingRow_Text_C_SetTextByIndex) == 0x000004, "Wrong size on W_SettingRow_Text_C_SetTextByIndex");
static_assert(offsetof(W_SettingRow_Text_C_SetTextByIndex, Param_Index) == 0x000000, "Member 'W_SettingRow_Text_C_SetTextByIndex::Param_Index' has a wrong offset!");

// Function W_SettingRow_Text.W_SettingRow_Text_C.SetValues
// 0x0018 (0x0018 - 0x0000)
struct W_SettingRow_Text_C_SetValues final
{
public:
	TArray<class FText>                           Param_Content;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingRow_Text_C_SetValues) == 0x000008, "Wrong alignment on W_SettingRow_Text_C_SetValues");
static_assert(sizeof(W_SettingRow_Text_C_SetValues) == 0x000018, "Wrong size on W_SettingRow_Text_C_SetValues");
static_assert(offsetof(W_SettingRow_Text_C_SetValues, Param_Content) == 0x000000, "Member 'W_SettingRow_Text_C_SetValues::Param_Content' has a wrong offset!");
static_assert(offsetof(W_SettingRow_Text_C_SetValues, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'W_SettingRow_Text_C_SetValues::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SettingRow_Text_C_SetValues, CallFunc_Subtract_IntInt_ReturnValue) == 0x000014, "Member 'W_SettingRow_Text_C_SetValues::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");

}

