#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ServerStatProfileMessage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_ServerStatProfileMessage.W_ServerStatProfileMessage_C
// 0x0020 (0x02A0 - 0x0280)
class UW_ServerStatProfileMessage_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             TextBlock_Net;                                     // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Stat;                                    // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsNetStat;                                         // 0x0298(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_W_ServerStatProfileMessage(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_ServerStatProfileMessage_C">();
	}
	static class UW_ServerStatProfileMessage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_ServerStatProfileMessage_C>();
	}
};
static_assert(alignof(UW_ServerStatProfileMessage_C) == 0x000008, "Wrong alignment on UW_ServerStatProfileMessage_C");
static_assert(sizeof(UW_ServerStatProfileMessage_C) == 0x0002A0, "Wrong size on UW_ServerStatProfileMessage_C");
static_assert(offsetof(UW_ServerStatProfileMessage_C, UberGraphFrame) == 0x000280, "Member 'UW_ServerStatProfileMessage_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_ServerStatProfileMessage_C, TextBlock_Net) == 0x000288, "Member 'UW_ServerStatProfileMessage_C::TextBlock_Net' has a wrong offset!");
static_assert(offsetof(UW_ServerStatProfileMessage_C, TextBlock_Stat) == 0x000290, "Member 'UW_ServerStatProfileMessage_C::TextBlock_Stat' has a wrong offset!");
static_assert(offsetof(UW_ServerStatProfileMessage_C, IsNetStat) == 0x000298, "Member 'UW_ServerStatProfileMessage_C::IsNetStat' has a wrong offset!");

}

