#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ServerCategoryRow_Button

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ENUM_ServerRegions_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_ServerCategoryRow_Button.W_ServerCategoryRow_Button_C
// 0x0078 (0x02F8 - 0x0280)
class UW_ServerCategoryRow_Button_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Select_FromUnhover;                                // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Select_FromHover;                                  // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover_NotSelected;                                 // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_Action;                                     // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BG;                                          // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Hover;                                       // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Select;                                      // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Text;                                    // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x02C8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ExposeOnSpawn)
	FMulticastInlineDelegateProperty_             OnButtonPressed;                                   // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bSelected;                                         // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_ServerRegions                            Region;                                            // 0x02F1(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__W_SettengRow_Button_Button_Action_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__W_SettengRow_Button_Button_Action_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__W_SettengRow_Button_Button_Action_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void ExecuteUbergraph_W_ServerCategoryRow_Button(int32 EntryPoint);
	void Hover(bool bHover);
	void OnButtonPressed__DelegateSignature(class UW_ServerCategoryRow_Button_C* RowButton, ENUM_ServerRegions Param_Region);
	struct FEventReply OnPreviewKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void PreConstruct(bool IsDesignTime);
	void SelectCategory();
	void SetDefault();
	void SetSelected(bool bSelect);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_ServerCategoryRow_Button_C">();
	}
	static class UW_ServerCategoryRow_Button_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_ServerCategoryRow_Button_C>();
	}
};
static_assert(alignof(UW_ServerCategoryRow_Button_C) == 0x000008, "Wrong alignment on UW_ServerCategoryRow_Button_C");
static_assert(sizeof(UW_ServerCategoryRow_Button_C) == 0x0002F8, "Wrong size on UW_ServerCategoryRow_Button_C");
static_assert(offsetof(UW_ServerCategoryRow_Button_C, UberGraphFrame) == 0x000280, "Member 'UW_ServerCategoryRow_Button_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_ServerCategoryRow_Button_C, Select_FromUnhover) == 0x000288, "Member 'UW_ServerCategoryRow_Button_C::Select_FromUnhover' has a wrong offset!");
static_assert(offsetof(UW_ServerCategoryRow_Button_C, Select_FromHover) == 0x000290, "Member 'UW_ServerCategoryRow_Button_C::Select_FromHover' has a wrong offset!");
static_assert(offsetof(UW_ServerCategoryRow_Button_C, Hover_NotSelected) == 0x000298, "Member 'UW_ServerCategoryRow_Button_C::Hover_NotSelected' has a wrong offset!");
static_assert(offsetof(UW_ServerCategoryRow_Button_C, Button_Action) == 0x0002A0, "Member 'UW_ServerCategoryRow_Button_C::Button_Action' has a wrong offset!");
static_assert(offsetof(UW_ServerCategoryRow_Button_C, Image_BG) == 0x0002A8, "Member 'UW_ServerCategoryRow_Button_C::Image_BG' has a wrong offset!");
static_assert(offsetof(UW_ServerCategoryRow_Button_C, Image_Hover) == 0x0002B0, "Member 'UW_ServerCategoryRow_Button_C::Image_Hover' has a wrong offset!");
static_assert(offsetof(UW_ServerCategoryRow_Button_C, Image_Select) == 0x0002B8, "Member 'UW_ServerCategoryRow_Button_C::Image_Select' has a wrong offset!");
static_assert(offsetof(UW_ServerCategoryRow_Button_C, TextBlock_Text) == 0x0002C0, "Member 'UW_ServerCategoryRow_Button_C::TextBlock_Text' has a wrong offset!");
static_assert(offsetof(UW_ServerCategoryRow_Button_C, Text) == 0x0002C8, "Member 'UW_ServerCategoryRow_Button_C::Text' has a wrong offset!");
static_assert(offsetof(UW_ServerCategoryRow_Button_C, OnButtonPressed) == 0x0002E0, "Member 'UW_ServerCategoryRow_Button_C::OnButtonPressed' has a wrong offset!");
static_assert(offsetof(UW_ServerCategoryRow_Button_C, bSelected) == 0x0002F0, "Member 'UW_ServerCategoryRow_Button_C::bSelected' has a wrong offset!");
static_assert(offsetof(UW_ServerCategoryRow_Button_C, Region) == 0x0002F1, "Member 'UW_ServerCategoryRow_Button_C::Region' has a wrong offset!");

}

