#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ShopCategory

#include "Basic.hpp"

#include "InfoType_structs.hpp"
#include "Engine_structs.hpp"
#include "FItemInfo_structs.hpp"
#include "S_CategoryData_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_ShopCategory.W_ShopCategory_C
// 0x02E0 (0x0560 - 0x0280)
class UW_ShopCategory_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Blick;                                             // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_ItemCategory;                               // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BG;                                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Hovered;                                     // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Icon;                                        // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Selected;                                    // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Category;                                     // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FFItemInfo                             FItem;                                             // 0x02C8(0x0220)(Edit, BlueprintVisible, ContainsInstancedReference, ExposeOnSpawn, HasGetValueTypeHash)
	struct FS_CategoryData                        Category_Data;                                     // 0x04E8(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnButtonSelected;                                  // 0x0530(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	EInfoType                                     Info_Type;                                         // 0x0540(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          All_Category;                                      // 0x0541(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_542[0x6];                                      // 0x0542(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CategoryAll;                                       // 0x0548(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FName                                   Category_Name;                                     // 0x0558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__W_ShopCategory_Button_ItemCategory_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__W_ShopCategory_Button_ItemCategory_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__W_ShopCategory_Button_ItemCategory_K2Node_ComponentBoundEvent_2_OnButtonPressedEvent__DelegateSignature();
	void ButtonHover(bool Hovered, bool WithAnim);
	void ExecuteUbergraph_W_ShopCategory(int32 EntryPoint);
	void Init(const struct FFItemInfo& Param_FItem, EInfoType InfoType, class FName Param_Category_Name);
	void InitCategory(class FName Param_Category_Name, class FText* CategoryDisplayName, class UPaperSprite** CategoryIcon);
	void OnButtonSelected__DelegateSignature(class UW_ShopCategory_C* NewParam);
	void PreConstruct(bool IsDesignTime);
	void SetSelected(bool Selected);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_ShopCategory_C">();
	}
	static class UW_ShopCategory_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_ShopCategory_C>();
	}
};
static_assert(alignof(UW_ShopCategory_C) == 0x000008, "Wrong alignment on UW_ShopCategory_C");
static_assert(sizeof(UW_ShopCategory_C) == 0x000560, "Wrong size on UW_ShopCategory_C");
static_assert(offsetof(UW_ShopCategory_C, UberGraphFrame) == 0x000280, "Member 'UW_ShopCategory_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_ShopCategory_C, Blick) == 0x000288, "Member 'UW_ShopCategory_C::Blick' has a wrong offset!");
static_assert(offsetof(UW_ShopCategory_C, Hover) == 0x000290, "Member 'UW_ShopCategory_C::Hover' has a wrong offset!");
static_assert(offsetof(UW_ShopCategory_C, Button_ItemCategory) == 0x000298, "Member 'UW_ShopCategory_C::Button_ItemCategory' has a wrong offset!");
static_assert(offsetof(UW_ShopCategory_C, Image_BG) == 0x0002A0, "Member 'UW_ShopCategory_C::Image_BG' has a wrong offset!");
static_assert(offsetof(UW_ShopCategory_C, Image_Hovered) == 0x0002A8, "Member 'UW_ShopCategory_C::Image_Hovered' has a wrong offset!");
static_assert(offsetof(UW_ShopCategory_C, Image_Icon) == 0x0002B0, "Member 'UW_ShopCategory_C::Image_Icon' has a wrong offset!");
static_assert(offsetof(UW_ShopCategory_C, Image_Selected) == 0x0002B8, "Member 'UW_ShopCategory_C::Image_Selected' has a wrong offset!");
static_assert(offsetof(UW_ShopCategory_C, Text_Category) == 0x0002C0, "Member 'UW_ShopCategory_C::Text_Category' has a wrong offset!");
static_assert(offsetof(UW_ShopCategory_C, FItem) == 0x0002C8, "Member 'UW_ShopCategory_C::FItem' has a wrong offset!");
static_assert(offsetof(UW_ShopCategory_C, Category_Data) == 0x0004E8, "Member 'UW_ShopCategory_C::Category_Data' has a wrong offset!");
static_assert(offsetof(UW_ShopCategory_C, OnButtonSelected) == 0x000530, "Member 'UW_ShopCategory_C::OnButtonSelected' has a wrong offset!");
static_assert(offsetof(UW_ShopCategory_C, Info_Type) == 0x000540, "Member 'UW_ShopCategory_C::Info_Type' has a wrong offset!");
static_assert(offsetof(UW_ShopCategory_C, All_Category) == 0x000541, "Member 'UW_ShopCategory_C::All_Category' has a wrong offset!");
static_assert(offsetof(UW_ShopCategory_C, CategoryAll) == 0x000548, "Member 'UW_ShopCategory_C::CategoryAll' has a wrong offset!");
static_assert(offsetof(UW_ShopCategory_C, Category_Name) == 0x000558, "Member 'UW_ShopCategory_C::Category_Name' has a wrong offset!");

}

