#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Shop

#include "Basic.hpp"

#include "FItemInfo_structs.hpp"
#include "AttachmentInfo_structs.hpp"
#include "InfoType_structs.hpp"
#include "InputCore_structs.hpp"
#include "S_ShopItemList_structs.hpp"
#include "SlateCore_structs.hpp"
#include "E_BaseContainerType_structs.hpp"
#include "ContainerPickupsInfo_structs.hpp"
#include "JSItemType_structs.hpp"
#include "S_CategoryData_structs.hpp"
#include "EDismantleType_structs.hpp"
#include "UMG_structs.hpp"
#include "ShopCategory_structs.hpp"
#include "Engine_structs.hpp"
#include "Slate_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FMODStudio_structs.hpp"
#include "E_SlotStatus_structs.hpp"
#include "E_ReasonForCancelingTransaction_structs.hpp"
#include "NPC_Structure_structs.hpp"


namespace SDK::Params
{

// Function W_Shop.W_Shop_C.AddContentToPlayerWindow
// 0x0018 (0x0018 - 0x0000)
struct W_Shop_C_AddContentToPlayerWindow final
{
public:
	bool                                          All;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CategoryName;                                      // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_BaseSlot_C*                          ItemSlot;                                          // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Shop_C_AddContentToPlayerWindow) == 0x000008, "Wrong alignment on W_Shop_C_AddContentToPlayerWindow");
static_assert(sizeof(W_Shop_C_AddContentToPlayerWindow) == 0x000018, "Wrong size on W_Shop_C_AddContentToPlayerWindow");
static_assert(offsetof(W_Shop_C_AddContentToPlayerWindow, All) == 0x000000, "Member 'W_Shop_C_AddContentToPlayerWindow::All' has a wrong offset!");
static_assert(offsetof(W_Shop_C_AddContentToPlayerWindow, CategoryName) == 0x000004, "Member 'W_Shop_C_AddContentToPlayerWindow::CategoryName' has a wrong offset!");
static_assert(offsetof(W_Shop_C_AddContentToPlayerWindow, ItemSlot) == 0x000010, "Member 'W_Shop_C_AddContentToPlayerWindow::ItemSlot' has a wrong offset!");

// Function W_Shop.W_Shop_C.AddContentToShopWindow
// 0x000C (0x000C - 0x0000)
struct W_Shop_C_AddContentToShopWindow final
{
public:
	bool                                          All;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CategoryName;                                      // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Shop_C_AddContentToShopWindow) == 0x000004, "Wrong alignment on W_Shop_C_AddContentToShopWindow");
static_assert(sizeof(W_Shop_C_AddContentToShopWindow) == 0x00000C, "Wrong size on W_Shop_C_AddContentToShopWindow");
static_assert(offsetof(W_Shop_C_AddContentToShopWindow, All) == 0x000000, "Member 'W_Shop_C_AddContentToShopWindow::All' has a wrong offset!");
static_assert(offsetof(W_Shop_C_AddContentToShopWindow, CategoryName) == 0x000004, "Member 'W_Shop_C_AddContentToShopWindow::CategoryName' has a wrong offset!");

// Function W_Shop.W_Shop_C.AddItemRemoveMoney
// 0x0488 (0x0488 - 0x0000)
struct W_Shop_C_AddItemRemoveMoney final
{
public:
	class ASurvivalPlayer_C*                      PlayerReference;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFItemInfo                             ItemInfo;                                          // 0x0008(0x0220)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         MoneyCount;                                        // 0x0228(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FContainerPickupsInfo>          K2Node_MakeArray_Array;                            // 0x0230(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_JSAddItem_Ad;                             // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             CallFunc_GetDataTableRowFromName_OutRow;           // 0x0248(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_469[0x7];                                      // 0x0469(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0470(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemByName_ReturnedCount;              // 0x0480(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Shop_C_AddItemRemoveMoney) == 0x000008, "Wrong alignment on W_Shop_C_AddItemRemoveMoney");
static_assert(sizeof(W_Shop_C_AddItemRemoveMoney) == 0x000488, "Wrong size on W_Shop_C_AddItemRemoveMoney");
static_assert(offsetof(W_Shop_C_AddItemRemoveMoney, PlayerReference) == 0x000000, "Member 'W_Shop_C_AddItemRemoveMoney::PlayerReference' has a wrong offset!");
static_assert(offsetof(W_Shop_C_AddItemRemoveMoney, ItemInfo) == 0x000008, "Member 'W_Shop_C_AddItemRemoveMoney::ItemInfo' has a wrong offset!");
static_assert(offsetof(W_Shop_C_AddItemRemoveMoney, MoneyCount) == 0x000228, "Member 'W_Shop_C_AddItemRemoveMoney::MoneyCount' has a wrong offset!");
static_assert(offsetof(W_Shop_C_AddItemRemoveMoney, K2Node_MakeArray_Array) == 0x000230, "Member 'W_Shop_C_AddItemRemoveMoney::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_Shop_C_AddItemRemoveMoney, CallFunc_JSAddItem_Ad) == 0x000240, "Member 'W_Shop_C_AddItemRemoveMoney::CallFunc_JSAddItem_Ad' has a wrong offset!");
static_assert(offsetof(W_Shop_C_AddItemRemoveMoney, CallFunc_GetDataTableRowFromName_OutRow) == 0x000248, "Member 'W_Shop_C_AddItemRemoveMoney::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(W_Shop_C_AddItemRemoveMoney, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000468, "Member 'W_Shop_C_AddItemRemoveMoney::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Shop_C_AddItemRemoveMoney, CallFunc_Conv_NameToString_ReturnValue) == 0x000470, "Member 'W_Shop_C_AddItemRemoveMoney::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Shop_C_AddItemRemoveMoney, CallFunc_GetItemByName_ReturnedCount) == 0x000480, "Member 'W_Shop_C_AddItemRemoveMoney::CallFunc_GetItemByName_ReturnedCount' has a wrong offset!");

// Function W_Shop.W_Shop_C.BindSlpitWidgetEvents
// 0x0008 (0x0008 - 0x0000)
struct W_Shop_C_BindSlpitWidgetEvents final
{
public:
	class UW_BaseSplitWidget_C*                   SplitWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Shop_C_BindSlpitWidgetEvents) == 0x000008, "Wrong alignment on W_Shop_C_BindSlpitWidgetEvents");
static_assert(sizeof(W_Shop_C_BindSlpitWidgetEvents) == 0x000008, "Wrong size on W_Shop_C_BindSlpitWidgetEvents");
static_assert(offsetof(W_Shop_C_BindSlpitWidgetEvents, SplitWidget) == 0x000000, "Member 'W_Shop_C_BindSlpitWidgetEvents::SplitWidget' has a wrong offset!");

// Function W_Shop.W_Shop_C.BndEvt__W_Shop_W_ShopCategorySelector_K2Node_ComponentBoundEvent_17_OnCategoryChanged__DelegateSignature
// 0x0050 (0x0050 - 0x0000)
struct W_Shop_C_BndEvt__W_Shop_W_ShopCategorySelector_K2Node_ComponentBoundEvent_17_OnCategoryChanged__DelegateSignature final
{
public:
	struct FS_CategoryData                        CategoryData;                                      // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          All;                                               // 0x0048(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Shop_C_BndEvt__W_Shop_W_ShopCategorySelector_K2Node_ComponentBoundEvent_17_OnCategoryChanged__DelegateSignature) == 0x000008, "Wrong alignment on W_Shop_C_BndEvt__W_Shop_W_ShopCategorySelector_K2Node_ComponentBoundEvent_17_OnCategoryChanged__DelegateSignature");
static_assert(sizeof(W_Shop_C_BndEvt__W_Shop_W_ShopCategorySelector_K2Node_ComponentBoundEvent_17_OnCategoryChanged__DelegateSignature) == 0x000050, "Wrong size on W_Shop_C_BndEvt__W_Shop_W_ShopCategorySelector_K2Node_ComponentBoundEvent_17_OnCategoryChanged__DelegateSignature");
static_assert(offsetof(W_Shop_C_BndEvt__W_Shop_W_ShopCategorySelector_K2Node_ComponentBoundEvent_17_OnCategoryChanged__DelegateSignature, CategoryData) == 0x000000, "Member 'W_Shop_C_BndEvt__W_Shop_W_ShopCategorySelector_K2Node_ComponentBoundEvent_17_OnCategoryChanged__DelegateSignature::CategoryData' has a wrong offset!");
static_assert(offsetof(W_Shop_C_BndEvt__W_Shop_W_ShopCategorySelector_K2Node_ComponentBoundEvent_17_OnCategoryChanged__DelegateSignature, All) == 0x000048, "Member 'W_Shop_C_BndEvt__W_Shop_W_ShopCategorySelector_K2Node_ComponentBoundEvent_17_OnCategoryChanged__DelegateSignature::All' has a wrong offset!");

// Function W_Shop.W_Shop_C.BndEvt__W_Shop_WBP_BuyWindowCurrent_K2Node_ComponentBoundEvent_35_OnBuyProcessFinished__DelegateSignature
// 0x0228 (0x0228 - 0x0000)
struct W_Shop_C_BndEvt__W_Shop_WBP_BuyWindowCurrent_K2Node_ComponentBoundEvent_35_OnBuyProcessFinished__DelegateSignature final
{
public:
	struct FFItemInfo                             FItem;                                             // 0x0000(0x0220)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
	class UJSI_Slot_C*                            Slot_Ref;                                          // 0x0220(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Shop_C_BndEvt__W_Shop_WBP_BuyWindowCurrent_K2Node_ComponentBoundEvent_35_OnBuyProcessFinished__DelegateSignature) == 0x000008, "Wrong alignment on W_Shop_C_BndEvt__W_Shop_WBP_BuyWindowCurrent_K2Node_ComponentBoundEvent_35_OnBuyProcessFinished__DelegateSignature");
static_assert(sizeof(W_Shop_C_BndEvt__W_Shop_WBP_BuyWindowCurrent_K2Node_ComponentBoundEvent_35_OnBuyProcessFinished__DelegateSignature) == 0x000228, "Wrong size on W_Shop_C_BndEvt__W_Shop_WBP_BuyWindowCurrent_K2Node_ComponentBoundEvent_35_OnBuyProcessFinished__DelegateSignature");
static_assert(offsetof(W_Shop_C_BndEvt__W_Shop_WBP_BuyWindowCurrent_K2Node_ComponentBoundEvent_35_OnBuyProcessFinished__DelegateSignature, FItem) == 0x000000, "Member 'W_Shop_C_BndEvt__W_Shop_WBP_BuyWindowCurrent_K2Node_ComponentBoundEvent_35_OnBuyProcessFinished__DelegateSignature::FItem' has a wrong offset!");
static_assert(offsetof(W_Shop_C_BndEvt__W_Shop_WBP_BuyWindowCurrent_K2Node_ComponentBoundEvent_35_OnBuyProcessFinished__DelegateSignature, Slot_Ref) == 0x000220, "Member 'W_Shop_C_BndEvt__W_Shop_WBP_BuyWindowCurrent_K2Node_ComponentBoundEvent_35_OnBuyProcessFinished__DelegateSignature::Slot_Ref' has a wrong offset!");

// Function W_Shop.W_Shop_C.BndEvt__W_Shop_WBP_MainCategorySelector_K2Node_ComponentBoundEvent_39_OnCategoryChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_Shop_C_BndEvt__W_Shop_WBP_MainCategorySelector_K2Node_ComponentBoundEvent_39_OnCategoryChanged__DelegateSignature final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Shop_C_BndEvt__W_Shop_WBP_MainCategorySelector_K2Node_ComponentBoundEvent_39_OnCategoryChanged__DelegateSignature) == 0x000004, "Wrong alignment on W_Shop_C_BndEvt__W_Shop_WBP_MainCategorySelector_K2Node_ComponentBoundEvent_39_OnCategoryChanged__DelegateSignature");
static_assert(sizeof(W_Shop_C_BndEvt__W_Shop_WBP_MainCategorySelector_K2Node_ComponentBoundEvent_39_OnCategoryChanged__DelegateSignature) == 0x000004, "Wrong size on W_Shop_C_BndEvt__W_Shop_WBP_MainCategorySelector_K2Node_ComponentBoundEvent_39_OnCategoryChanged__DelegateSignature");
static_assert(offsetof(W_Shop_C_BndEvt__W_Shop_WBP_MainCategorySelector_K2Node_ComponentBoundEvent_39_OnCategoryChanged__DelegateSignature, Param_Index) == 0x000000, "Member 'W_Shop_C_BndEvt__W_Shop_WBP_MainCategorySelector_K2Node_ComponentBoundEvent_39_OnCategoryChanged__DelegateSignature::Param_Index' has a wrong offset!");

// Function W_Shop.W_Shop_C.BndEvt__W_Shop_WBP_RedeemSellWindow_K2Node_ComponentBoundEvent_37_OnBuyBackProcessFinished__DelegateSignature
// 0x0230 (0x0230 - 0x0000)
struct W_Shop_C_BndEvt__W_Shop_WBP_RedeemSellWindow_K2Node_ComponentBoundEvent_37_OnBuyBackProcessFinished__DelegateSignature final
{
public:
	struct FFItemInfo                             FItem;                                             // 0x0000(0x0220)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
	class UJSI_Slot_C*                            Slot_Ref;                                          // 0x0220(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x0228(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Shop_C_BndEvt__W_Shop_WBP_RedeemSellWindow_K2Node_ComponentBoundEvent_37_OnBuyBackProcessFinished__DelegateSignature) == 0x000008, "Wrong alignment on W_Shop_C_BndEvt__W_Shop_WBP_RedeemSellWindow_K2Node_ComponentBoundEvent_37_OnBuyBackProcessFinished__DelegateSignature");
static_assert(sizeof(W_Shop_C_BndEvt__W_Shop_WBP_RedeemSellWindow_K2Node_ComponentBoundEvent_37_OnBuyBackProcessFinished__DelegateSignature) == 0x000230, "Wrong size on W_Shop_C_BndEvt__W_Shop_WBP_RedeemSellWindow_K2Node_ComponentBoundEvent_37_OnBuyBackProcessFinished__DelegateSignature");
static_assert(offsetof(W_Shop_C_BndEvt__W_Shop_WBP_RedeemSellWindow_K2Node_ComponentBoundEvent_37_OnBuyBackProcessFinished__DelegateSignature, FItem) == 0x000000, "Member 'W_Shop_C_BndEvt__W_Shop_WBP_RedeemSellWindow_K2Node_ComponentBoundEvent_37_OnBuyBackProcessFinished__DelegateSignature::FItem' has a wrong offset!");
static_assert(offsetof(W_Shop_C_BndEvt__W_Shop_WBP_RedeemSellWindow_K2Node_ComponentBoundEvent_37_OnBuyBackProcessFinished__DelegateSignature, Slot_Ref) == 0x000220, "Member 'W_Shop_C_BndEvt__W_Shop_WBP_RedeemSellWindow_K2Node_ComponentBoundEvent_37_OnBuyBackProcessFinished__DelegateSignature::Slot_Ref' has a wrong offset!");
static_assert(offsetof(W_Shop_C_BndEvt__W_Shop_WBP_RedeemSellWindow_K2Node_ComponentBoundEvent_37_OnBuyBackProcessFinished__DelegateSignature, Count) == 0x000228, "Member 'W_Shop_C_BndEvt__W_Shop_WBP_RedeemSellWindow_K2Node_ComponentBoundEvent_37_OnBuyBackProcessFinished__DelegateSignature::Count' has a wrong offset!");

// Function W_Shop.W_Shop_C.BndEvt__W_Shop_WBP_RepairTab_K2Node_ComponentBoundEvent_10_OnRecalculateRepairAllPrice__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct W_Shop_C_BndEvt__W_Shop_WBP_RepairTab_K2Node_ComponentBoundEvent_10_OnRecalculateRepairAllPrice__DelegateSignature final
{
public:
	bool                                          bEnoughMoney;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Shop_C_BndEvt__W_Shop_WBP_RepairTab_K2Node_ComponentBoundEvent_10_OnRecalculateRepairAllPrice__DelegateSignature) == 0x000001, "Wrong alignment on W_Shop_C_BndEvt__W_Shop_WBP_RepairTab_K2Node_ComponentBoundEvent_10_OnRecalculateRepairAllPrice__DelegateSignature");
static_assert(sizeof(W_Shop_C_BndEvt__W_Shop_WBP_RepairTab_K2Node_ComponentBoundEvent_10_OnRecalculateRepairAllPrice__DelegateSignature) == 0x000001, "Wrong size on W_Shop_C_BndEvt__W_Shop_WBP_RepairTab_K2Node_ComponentBoundEvent_10_OnRecalculateRepairAllPrice__DelegateSignature");
static_assert(offsetof(W_Shop_C_BndEvt__W_Shop_WBP_RepairTab_K2Node_ComponentBoundEvent_10_OnRecalculateRepairAllPrice__DelegateSignature, bEnoughMoney) == 0x000000, "Member 'W_Shop_C_BndEvt__W_Shop_WBP_RepairTab_K2Node_ComponentBoundEvent_10_OnRecalculateRepairAllPrice__DelegateSignature::bEnoughMoney' has a wrong offset!");

// Function W_Shop.W_Shop_C.BndEvt__W_Shop_WBP_SellWindow_K2Node_ComponentBoundEvent_0_OnCreateCountChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_Shop_C_BndEvt__W_Shop_WBP_SellWindow_K2Node_ComponentBoundEvent_0_OnCreateCountChanged__DelegateSignature final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Shop_C_BndEvt__W_Shop_WBP_SellWindow_K2Node_ComponentBoundEvent_0_OnCreateCountChanged__DelegateSignature) == 0x000004, "Wrong alignment on W_Shop_C_BndEvt__W_Shop_WBP_SellWindow_K2Node_ComponentBoundEvent_0_OnCreateCountChanged__DelegateSignature");
static_assert(sizeof(W_Shop_C_BndEvt__W_Shop_WBP_SellWindow_K2Node_ComponentBoundEvent_0_OnCreateCountChanged__DelegateSignature) == 0x000004, "Wrong size on W_Shop_C_BndEvt__W_Shop_WBP_SellWindow_K2Node_ComponentBoundEvent_0_OnCreateCountChanged__DelegateSignature");
static_assert(offsetof(W_Shop_C_BndEvt__W_Shop_WBP_SellWindow_K2Node_ComponentBoundEvent_0_OnCreateCountChanged__DelegateSignature, Count) == 0x000000, "Member 'W_Shop_C_BndEvt__W_Shop_WBP_SellWindow_K2Node_ComponentBoundEvent_0_OnCreateCountChanged__DelegateSignature::Count' has a wrong offset!");

// Function W_Shop.W_Shop_C.BndEvt__W_Shop_WBP_SellWindow_K2Node_ComponentBoundEvent_29_ProcessFinished__DelegateSignature
// 0x0230 (0x0230 - 0x0000)
struct W_Shop_C_BndEvt__W_Shop_WBP_SellWindow_K2Node_ComponentBoundEvent_29_ProcessFinished__DelegateSignature final
{
public:
	struct FFItemInfo                             ItemInfo;                                          // 0x0000(0x0220)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x0220(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJSI_Slot_C*                            Ref;                                               // 0x0228(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Shop_C_BndEvt__W_Shop_WBP_SellWindow_K2Node_ComponentBoundEvent_29_ProcessFinished__DelegateSignature) == 0x000008, "Wrong alignment on W_Shop_C_BndEvt__W_Shop_WBP_SellWindow_K2Node_ComponentBoundEvent_29_ProcessFinished__DelegateSignature");
static_assert(sizeof(W_Shop_C_BndEvt__W_Shop_WBP_SellWindow_K2Node_ComponentBoundEvent_29_ProcessFinished__DelegateSignature) == 0x000230, "Wrong size on W_Shop_C_BndEvt__W_Shop_WBP_SellWindow_K2Node_ComponentBoundEvent_29_ProcessFinished__DelegateSignature");
static_assert(offsetof(W_Shop_C_BndEvt__W_Shop_WBP_SellWindow_K2Node_ComponentBoundEvent_29_ProcessFinished__DelegateSignature, ItemInfo) == 0x000000, "Member 'W_Shop_C_BndEvt__W_Shop_WBP_SellWindow_K2Node_ComponentBoundEvent_29_ProcessFinished__DelegateSignature::ItemInfo' has a wrong offset!");
static_assert(offsetof(W_Shop_C_BndEvt__W_Shop_WBP_SellWindow_K2Node_ComponentBoundEvent_29_ProcessFinished__DelegateSignature, Count) == 0x000220, "Member 'W_Shop_C_BndEvt__W_Shop_WBP_SellWindow_K2Node_ComponentBoundEvent_29_ProcessFinished__DelegateSignature::Count' has a wrong offset!");
static_assert(offsetof(W_Shop_C_BndEvt__W_Shop_WBP_SellWindow_K2Node_ComponentBoundEvent_29_ProcessFinished__DelegateSignature, Ref) == 0x000228, "Member 'W_Shop_C_BndEvt__W_Shop_WBP_SellWindow_K2Node_ComponentBoundEvent_29_ProcessFinished__DelegateSignature::Ref' has a wrong offset!");

// Function W_Shop.W_Shop_C.BuyBack
// 0x04B0 (0x04B0 - 0x0000)
struct W_Shop_C_BuyBack final
{
public:
	struct FFItemInfo                             ItemInfo;                                          // 0x0000(0x0220)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x0220(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC;                  // 0x0230(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      CallFunc_GetPlayerRef_SurvivalPlayer;              // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFItemInfo                             CallFunc_GetDataTableRowFromName_OutRow;           // 0x0258(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Can_Add_or_Equip_Item_Return;             // 0x0479(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47A[0x6];                                      // 0x047A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0488(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x048C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48D[0x3];                                      // 0x048D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFItemInfo>                     CallFunc_GetBuybackItems_ItemsBuyback;             // 0x0490(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A1[0x3];                                      // 0x04A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RemoveBuybackItems_Index;                 // 0x04A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveBuybackItems_ItemRemoved;           // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x04A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x04AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveInventoryItemByRef_Removed;         // 0x04AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Shop_C_BuyBack) == 0x000008, "Wrong alignment on W_Shop_C_BuyBack");
static_assert(sizeof(W_Shop_C_BuyBack) == 0x0004B0, "Wrong size on W_Shop_C_BuyBack");
static_assert(offsetof(W_Shop_C_BuyBack, ItemInfo) == 0x000000, "Member 'W_Shop_C_BuyBack::ItemInfo' has a wrong offset!");
static_assert(offsetof(W_Shop_C_BuyBack, Count) == 0x000220, "Member 'W_Shop_C_BuyBack::Count' has a wrong offset!");
static_assert(offsetof(W_Shop_C_BuyBack, CallFunc_GetPlayerController_ReturnValue) == 0x000228, "Member 'W_Shop_C_BuyBack::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Shop_C_BuyBack, K2Node_DynamicCast_AsBPI_Surv_PC) == 0x000230, "Member 'W_Shop_C_BuyBack::K2Node_DynamicCast_AsBPI_Surv_PC' has a wrong offset!");
static_assert(offsetof(W_Shop_C_BuyBack, K2Node_DynamicCast_bSuccess) == 0x000240, "Member 'W_Shop_C_BuyBack::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_Shop_C_BuyBack, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000248, "Member 'W_Shop_C_BuyBack::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Shop_C_BuyBack, CallFunc_GetPlayerRef_SurvivalPlayer) == 0x000250, "Member 'W_Shop_C_BuyBack::CallFunc_GetPlayerRef_SurvivalPlayer' has a wrong offset!");
static_assert(offsetof(W_Shop_C_BuyBack, CallFunc_GetDataTableRowFromName_OutRow) == 0x000258, "Member 'W_Shop_C_BuyBack::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(W_Shop_C_BuyBack, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000478, "Member 'W_Shop_C_BuyBack::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Shop_C_BuyBack, CallFunc_Can_Add_or_Equip_Item_Return) == 0x000479, "Member 'W_Shop_C_BuyBack::CallFunc_Can_Add_or_Equip_Item_Return' has a wrong offset!");
static_assert(offsetof(W_Shop_C_BuyBack, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000480, "Member 'W_Shop_C_BuyBack::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Shop_C_BuyBack, CallFunc_Round_ReturnValue) == 0x000488, "Member 'W_Shop_C_BuyBack::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Shop_C_BuyBack, CallFunc_IsValid_ReturnValue) == 0x00048C, "Member 'W_Shop_C_BuyBack::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Shop_C_BuyBack, CallFunc_GetBuybackItems_ItemsBuyback) == 0x000490, "Member 'W_Shop_C_BuyBack::CallFunc_GetBuybackItems_ItemsBuyback' has a wrong offset!");
static_assert(offsetof(W_Shop_C_BuyBack, CallFunc_Array_IsEmpty_ReturnValue) == 0x0004A0, "Member 'W_Shop_C_BuyBack::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Shop_C_BuyBack, CallFunc_RemoveBuybackItems_Index) == 0x0004A4, "Member 'W_Shop_C_BuyBack::CallFunc_RemoveBuybackItems_Index' has a wrong offset!");
static_assert(offsetof(W_Shop_C_BuyBack, CallFunc_RemoveBuybackItems_ItemRemoved) == 0x0004A8, "Member 'W_Shop_C_BuyBack::CallFunc_RemoveBuybackItems_ItemRemoved' has a wrong offset!");
static_assert(offsetof(W_Shop_C_BuyBack, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0004A9, "Member 'W_Shop_C_BuyBack::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Shop_C_BuyBack, CallFunc_BooleanAND_ReturnValue) == 0x0004AA, "Member 'W_Shop_C_BuyBack::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Shop_C_BuyBack, CallFunc_RemoveInventoryItemByRef_Removed) == 0x0004AB, "Member 'W_Shop_C_BuyBack::CallFunc_RemoveInventoryItemByRef_Removed' has a wrong offset!");

// Function W_Shop.W_Shop_C.BuyItem
// 0x0950 (0x0950 - 0x0000)
struct W_Shop_C_BuyItem final
{
public:
	struct FFItemInfo                             ItemInfo;                                          // 0x0000(0x0220)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFItemInfo                             CallFunc_GetDataTableRowFromName_OutRow;           // 0x0228(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_449[0x7];                                      // 0x0449(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC;                  // 0x0450(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_461[0x7];                                      // 0x0461(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      CallFunc_GetPlayerRef_SurvivalPlayer;              // 0x0468(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFItemInfo                             CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0470(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0690(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_691[0x7];                                      // 0x0691(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             CallFunc_GetDataTableRowFromName_OutRow_2;         // 0x0698(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_2;    // 0x08B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B9[0x7];                                      // 0x08B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x08C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x08D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x08E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x08E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E9[0x3];                                      // 0x08E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Round_ReturnValue;                        // 0x08EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x08F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x08F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8F2[0x6];                                      // 0x08F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x08F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0900(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC_1;                // 0x0908(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0918(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_919[0x7];                                      // 0x0919(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC_2;                // 0x0920(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0930(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_931[0x7];                                      // 0x0931(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      CallFunc_GetPlayerRef_SurvivalPlayer_1;            // 0x0938(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      CallFunc_GetPlayerRef_SurvivalPlayer_2;            // 0x0940(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Can_Add_or_Equip_Item_Return;             // 0x0948(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Shop_C_BuyItem) == 0x000008, "Wrong alignment on W_Shop_C_BuyItem");
static_assert(sizeof(W_Shop_C_BuyItem) == 0x000950, "Wrong size on W_Shop_C_BuyItem");
static_assert(offsetof(W_Shop_C_BuyItem, ItemInfo) == 0x000000, "Member 'W_Shop_C_BuyItem::ItemInfo' has a wrong offset!");
static_assert(offsetof(W_Shop_C_BuyItem, CallFunc_GetPlayerController_ReturnValue) == 0x000220, "Member 'W_Shop_C_BuyItem::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Shop_C_BuyItem, CallFunc_GetDataTableRowFromName_OutRow) == 0x000228, "Member 'W_Shop_C_BuyItem::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(W_Shop_C_BuyItem, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000448, "Member 'W_Shop_C_BuyItem::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Shop_C_BuyItem, K2Node_DynamicCast_AsBPI_Surv_PC) == 0x000450, "Member 'W_Shop_C_BuyItem::K2Node_DynamicCast_AsBPI_Surv_PC' has a wrong offset!");
static_assert(offsetof(W_Shop_C_BuyItem, K2Node_DynamicCast_bSuccess) == 0x000460, "Member 'W_Shop_C_BuyItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_Shop_C_BuyItem, CallFunc_GetPlayerRef_SurvivalPlayer) == 0x000468, "Member 'W_Shop_C_BuyItem::CallFunc_GetPlayerRef_SurvivalPlayer' has a wrong offset!");
static_assert(offsetof(W_Shop_C_BuyItem, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000470, "Member 'W_Shop_C_BuyItem::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(W_Shop_C_BuyItem, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000690, "Member 'W_Shop_C_BuyItem::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Shop_C_BuyItem, CallFunc_GetDataTableRowFromName_OutRow_2) == 0x000698, "Member 'W_Shop_C_BuyItem::CallFunc_GetDataTableRowFromName_OutRow_2' has a wrong offset!");
static_assert(offsetof(W_Shop_C_BuyItem, CallFunc_GetDataTableRowFromName_ReturnValue_2) == 0x0008B8, "Member 'W_Shop_C_BuyItem::CallFunc_GetDataTableRowFromName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_Shop_C_BuyItem, CallFunc_Conv_NameToString_ReturnValue) == 0x0008C0, "Member 'W_Shop_C_BuyItem::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Shop_C_BuyItem, CallFunc_Conv_NameToString_ReturnValue_1) == 0x0008D0, "Member 'W_Shop_C_BuyItem::CallFunc_Conv_NameToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Shop_C_BuyItem, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0008E0, "Member 'W_Shop_C_BuyItem::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Shop_C_BuyItem, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0008E8, "Member 'W_Shop_C_BuyItem::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Shop_C_BuyItem, CallFunc_Round_ReturnValue) == 0x0008EC, "Member 'W_Shop_C_BuyItem::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Shop_C_BuyItem, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0008F0, "Member 'W_Shop_C_BuyItem::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Shop_C_BuyItem, CallFunc_Not_PreBool_ReturnValue) == 0x0008F1, "Member 'W_Shop_C_BuyItem::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Shop_C_BuyItem, CallFunc_GetPlayerController_ReturnValue_1) == 0x0008F8, "Member 'W_Shop_C_BuyItem::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Shop_C_BuyItem, CallFunc_GetPlayerController_ReturnValue_2) == 0x000900, "Member 'W_Shop_C_BuyItem::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_Shop_C_BuyItem, K2Node_DynamicCast_AsBPI_Surv_PC_1) == 0x000908, "Member 'W_Shop_C_BuyItem::K2Node_DynamicCast_AsBPI_Surv_PC_1' has a wrong offset!");
static_assert(offsetof(W_Shop_C_BuyItem, K2Node_DynamicCast_bSuccess_1) == 0x000918, "Member 'W_Shop_C_BuyItem::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_Shop_C_BuyItem, K2Node_DynamicCast_AsBPI_Surv_PC_2) == 0x000920, "Member 'W_Shop_C_BuyItem::K2Node_DynamicCast_AsBPI_Surv_PC_2' has a wrong offset!");
static_assert(offsetof(W_Shop_C_BuyItem, K2Node_DynamicCast_bSuccess_2) == 0x000930, "Member 'W_Shop_C_BuyItem::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(W_Shop_C_BuyItem, CallFunc_GetPlayerRef_SurvivalPlayer_1) == 0x000938, "Member 'W_Shop_C_BuyItem::CallFunc_GetPlayerRef_SurvivalPlayer_1' has a wrong offset!");
static_assert(offsetof(W_Shop_C_BuyItem, CallFunc_GetPlayerRef_SurvivalPlayer_2) == 0x000940, "Member 'W_Shop_C_BuyItem::CallFunc_GetPlayerRef_SurvivalPlayer_2' has a wrong offset!");
static_assert(offsetof(W_Shop_C_BuyItem, CallFunc_Can_Add_or_Equip_Item_Return) == 0x000948, "Member 'W_Shop_C_BuyItem::CallFunc_Can_Add_or_Equip_Item_Return' has a wrong offset!");

// Function W_Shop.W_Shop_C.Calculate Result Price
// 0x0778 (0x0778 - 0x0000)
struct W_Shop_C_Calculate_Result_Price final
{
public:
	struct FFItemInfo                             Item;                                              // 0x0000(0x0220)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          bUseSellPrice;                                     // 0x0220(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x3];                                      // 0x0221(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ResultPrice;                                       // 0x0224(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBPC_PlayerStatsComponent_C*            BPCPlayerStat;                                     // 0x0228(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        Price;                                             // 0x0230(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFItemInfo                             CallFunc_GetDataTableRowFromName_OutRow;           // 0x0240(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_461[0x7];                                      // 0x0461(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_1;                              // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0478(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47C[0x4];                                      // 0x047C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_3;                              // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJSItemType                                   Temp_byte_Variable;                                // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_489[0x7];                                      // 0x0489(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_4;                              // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_5;                              // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_6;                              // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_7;                              // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_8;                              // 0x04B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x04B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x04BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAttachmentInfo                        CallFunc_Array_Get_Item;                           // 0x04C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D1[0x7];                                      // 0x04D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x04D8(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x06F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F9[0x3];                                      // 0x06F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x06FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_9;                              // 0x0700(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0708(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC;                  // 0x0710(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0720(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_721[0x7];                                      // 0x0721(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      CallFunc_GetPlayerRef_SurvivalPlayer;              // 0x0728(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default;                             // 0x0730(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0738(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJSItemType                                   Temp_byte_Variable_1;                              // 0x0740(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_741[0x7];                                      // 0x0741(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default_1;                           // 0x0748(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0750(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0758(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0760(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0768(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76C[0x4];                                      // 0x076C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0770(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Shop_C_Calculate_Result_Price) == 0x000008, "Wrong alignment on W_Shop_C_Calculate_Result_Price");
static_assert(sizeof(W_Shop_C_Calculate_Result_Price) == 0x000778, "Wrong size on W_Shop_C_Calculate_Result_Price");
static_assert(offsetof(W_Shop_C_Calculate_Result_Price, Item) == 0x000000, "Member 'W_Shop_C_Calculate_Result_Price::Item' has a wrong offset!");
static_assert(offsetof(W_Shop_C_Calculate_Result_Price, bUseSellPrice) == 0x000220, "Member 'W_Shop_C_Calculate_Result_Price::bUseSellPrice' has a wrong offset!");
static_assert(offsetof(W_Shop_C_Calculate_Result_Price, ResultPrice) == 0x000224, "Member 'W_Shop_C_Calculate_Result_Price::ResultPrice' has a wrong offset!");
static_assert(offsetof(W_Shop_C_Calculate_Result_Price, BPCPlayerStat) == 0x000228, "Member 'W_Shop_C_Calculate_Result_Price::BPCPlayerStat' has a wrong offset!");
static_assert(offsetof(W_Shop_C_Calculate_Result_Price, Price) == 0x000230, "Member 'W_Shop_C_Calculate_Result_Price::Price' has a wrong offset!");
static_assert(offsetof(W_Shop_C_Calculate_Result_Price, Temp_real_Variable) == 0x000238, "Member 'W_Shop_C_Calculate_Result_Price::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(W_Shop_C_Calculate_Result_Price, CallFunc_GetDataTableRowFromName_OutRow) == 0x000240, "Member 'W_Shop_C_Calculate_Result_Price::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(W_Shop_C_Calculate_Result_Price, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000460, "Member 'W_Shop_C_Calculate_Result_Price::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Shop_C_Calculate_Result_Price, Temp_real_Variable_1) == 0x000468, "Member 'W_Shop_C_Calculate_Result_Price::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(W_Shop_C_Calculate_Result_Price, Temp_real_Variable_2) == 0x000470, "Member 'W_Shop_C_Calculate_Result_Price::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(W_Shop_C_Calculate_Result_Price, CallFunc_Array_Length_ReturnValue) == 0x000478, "Member 'W_Shop_C_Calculate_Result_Price::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Shop_C_Calculate_Result_Price, Temp_real_Variable_3) == 0x000480, "Member 'W_Shop_C_Calculate_Result_Price::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(W_Shop_C_Calculate_Result_Price, Temp_byte_Variable) == 0x000488, "Member 'W_Shop_C_Calculate_Result_Price::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_Shop_C_Calculate_Result_Price, Temp_real_Variable_4) == 0x000490, "Member 'W_Shop_C_Calculate_Result_Price::Temp_real_Variable_4' has a wrong offset!");
static_assert(offsetof(W_Shop_C_Calculate_Result_Price, Temp_real_Variable_5) == 0x000498, "Member 'W_Shop_C_Calculate_Result_Price::Temp_real_Variable_5' has a wrong offset!");
static_assert(offsetof(W_Shop_C_Calculate_Result_Price, Temp_real_Variable_6) == 0x0004A0, "Member 'W_Shop_C_Calculate_Result_Price::Temp_real_Variable_6' has a wrong offset!");
static_assert(offsetof(W_Shop_C_Calculate_Result_Price, Temp_real_Variable_7) == 0x0004A8, "Member 'W_Shop_C_Calculate_Result_Price::Temp_real_Variable_7' has a wrong offset!");
static_assert(offsetof(W_Shop_C_Calculate_Result_Price, Temp_real_Variable_8) == 0x0004B0, "Member 'W_Shop_C_Calculate_Result_Price::Temp_real_Variable_8' has a wrong offset!");
static_assert(offsetof(W_Shop_C_Calculate_Result_Price, Temp_int_Array_Index_Variable) == 0x0004B8, "Member 'W_Shop_C_Calculate_Result_Price::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_Shop_C_Calculate_Result_Price, Temp_int_Loop_Counter_Variable) == 0x0004BC, "Member 'W_Shop_C_Calculate_Result_Price::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_Shop_C_Calculate_Result_Price, CallFunc_Array_Get_Item) == 0x0004C0, "Member 'W_Shop_C_Calculate_Result_Price::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_Shop_C_Calculate_Result_Price, CallFunc_Less_IntInt_ReturnValue) == 0x0004D0, "Member 'W_Shop_C_Calculate_Result_Price::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Shop_C_Calculate_Result_Price, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x0004D8, "Member 'W_Shop_C_Calculate_Result_Price::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(W_Shop_C_Calculate_Result_Price, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x0006F8, "Member 'W_Shop_C_Calculate_Result_Price::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Shop_C_Calculate_Result_Price, CallFunc_Add_IntInt_ReturnValue) == 0x0006FC, "Member 'W_Shop_C_Calculate_Result_Price::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Shop_C_Calculate_Result_Price, Temp_real_Variable_9) == 0x000700, "Member 'W_Shop_C_Calculate_Result_Price::Temp_real_Variable_9' has a wrong offset!");
static_assert(offsetof(W_Shop_C_Calculate_Result_Price, CallFunc_GetPlayerController_ReturnValue) == 0x000708, "Member 'W_Shop_C_Calculate_Result_Price::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Shop_C_Calculate_Result_Price, K2Node_DynamicCast_AsBPI_Surv_PC) == 0x000710, "Member 'W_Shop_C_Calculate_Result_Price::K2Node_DynamicCast_AsBPI_Surv_PC' has a wrong offset!");
static_assert(offsetof(W_Shop_C_Calculate_Result_Price, K2Node_DynamicCast_bSuccess) == 0x000720, "Member 'W_Shop_C_Calculate_Result_Price::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_Shop_C_Calculate_Result_Price, CallFunc_GetPlayerRef_SurvivalPlayer) == 0x000728, "Member 'W_Shop_C_Calculate_Result_Price::CallFunc_GetPlayerRef_SurvivalPlayer' has a wrong offset!");
static_assert(offsetof(W_Shop_C_Calculate_Result_Price, K2Node_Select_Default) == 0x000730, "Member 'W_Shop_C_Calculate_Result_Price::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_Shop_C_Calculate_Result_Price, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000738, "Member 'W_Shop_C_Calculate_Result_Price::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Shop_C_Calculate_Result_Price, Temp_byte_Variable_1) == 0x000740, "Member 'W_Shop_C_Calculate_Result_Price::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_Shop_C_Calculate_Result_Price, K2Node_Select_Default_1) == 0x000748, "Member 'W_Shop_C_Calculate_Result_Price::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(W_Shop_C_Calculate_Result_Price, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000750, "Member 'W_Shop_C_Calculate_Result_Price::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Shop_C_Calculate_Result_Price, CallFunc_SelectFloat_ReturnValue) == 0x000758, "Member 'W_Shop_C_Calculate_Result_Price::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Shop_C_Calculate_Result_Price, CallFunc_SelectFloat_ReturnValue_1) == 0x000760, "Member 'W_Shop_C_Calculate_Result_Price::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Shop_C_Calculate_Result_Price, CallFunc_FTrunc_ReturnValue) == 0x000768, "Member 'W_Shop_C_Calculate_Result_Price::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Shop_C_Calculate_Result_Price, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000770, "Member 'W_Shop_C_Calculate_Result_Price::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");

// Function W_Shop.W_Shop_C.CalculateSteppedScrollOffset
// 0x0150 (0x0150 - 0x0000)
struct W_Shop_C_CalculateSteppedScrollOffset final
{
public:
	class UW_BaseContainer_C*                     ContainerRef;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBoxRef;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        C_OffsetError;                                     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         C_VisibleRows;                                     // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        C_SlotHeight;                                      // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
