#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ShortTip

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_ShortTip.W_ShortTip_C
// 0x0068 (0x02E8 - 0x0280)
class UW_ShortTip_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Fade;                                              // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_BG;                                          // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Content;                                     // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_lmb;                                         // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichTextBlock_Content;                             // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_HintButtonNew_C*                     W_HintButtonNew;                                   // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsShown;                                           // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ContentText;                                       // 0x02C0(0x0018)(Edit, BlueprintVisible)
	FMulticastInlineDelegateProperty_             OnMouseClick;                                      // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_W_ShortTip(int32 EntryPoint);
	void FadeIn();
	void Finished_FFFFBE1540F38BE58934DB99A905695F();
	void OnMouseClick__DelegateSignature();
	void PreConstruct(bool IsDesignTime);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_ShortTip_C">();
	}
	static class UW_ShortTip_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_ShortTip_C>();
	}
};
static_assert(alignof(UW_ShortTip_C) == 0x000008, "Wrong alignment on UW_ShortTip_C");
static_assert(sizeof(UW_ShortTip_C) == 0x0002E8, "Wrong size on UW_ShortTip_C");
static_assert(offsetof(UW_ShortTip_C, UberGraphFrame) == 0x000280, "Member 'UW_ShortTip_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_ShortTip_C, Fade) == 0x000288, "Member 'UW_ShortTip_C::Fade' has a wrong offset!");
static_assert(offsetof(UW_ShortTip_C, Image_BG) == 0x000290, "Member 'UW_ShortTip_C::Image_BG' has a wrong offset!");
static_assert(offsetof(UW_ShortTip_C, Image_Content) == 0x000298, "Member 'UW_ShortTip_C::Image_Content' has a wrong offset!");
static_assert(offsetof(UW_ShortTip_C, Image_lmb) == 0x0002A0, "Member 'UW_ShortTip_C::Image_lmb' has a wrong offset!");
static_assert(offsetof(UW_ShortTip_C, RichTextBlock_Content) == 0x0002A8, "Member 'UW_ShortTip_C::RichTextBlock_Content' has a wrong offset!");
static_assert(offsetof(UW_ShortTip_C, W_HintButtonNew) == 0x0002B0, "Member 'UW_ShortTip_C::W_HintButtonNew' has a wrong offset!");
static_assert(offsetof(UW_ShortTip_C, IsShown) == 0x0002B8, "Member 'UW_ShortTip_C::IsShown' has a wrong offset!");
static_assert(offsetof(UW_ShortTip_C, ContentText) == 0x0002C0, "Member 'UW_ShortTip_C::ContentText' has a wrong offset!");
static_assert(offsetof(UW_ShortTip_C, OnMouseClick) == 0x0002D8, "Member 'UW_ShortTip_C::OnMouseClick' has a wrong offset!");

}

