#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ShopCategoryButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "S_CategoryData_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_ShopCategoryButton.W_ShopCategoryButton_C
// 0x00D8 (0x0358 - 0x0280)
#pragma pack(push, 0x1)
class alignas(0x08) UW_ShopCategoryButton_C : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Deselect_Anim;                                     // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Select_Anim;                                       // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Unhover_Anim;                                      // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover_Anim;                                        // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_Category;                                   // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_46;                                          // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_CategoryName;                            // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsButtonHovered;                                  // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsButtonSelected;                                 // 0x02C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C2[0x2];                                      // 0x02C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Category_Name;                                     // 0x02C4(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnButtonHovered;                                   // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnButtonUnhovered;                                 // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnButtonSelected;                                  // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bIsCommonCategory;                                 // 0x0300(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_CategoryData                        CategoryData;                                      // 0x0308(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         ImageSize;                                         // 0x0350(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__W_ShopCategoryButton_Button_Category_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__W_ShopCategoryButton_Button_Category_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__W_ShopCategoryButton_Button_Category_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void Deselect();
	void ExecuteUbergraph_W_ShopCategoryButton(int32 EntryPoint);
	void GetCategoryData(struct FS_CategoryData* Param_CategoryData);
	void Hover();
	void InitCategory();
	void IsButtonHovered(bool* Param_bIsButtonHovered);
	void IsButtonSelected(bool* Param_bIsButtonSelected);
	void IsCommonCategory(bool* Param_bIsCommonCategory);
	void OnButtonHovered__DelegateSignature(class UW_ShopCategoryButton_C* ButtonRef);
	void OnButtonSelected__DelegateSignature(class UW_ShopCategoryButton_C* ButtonRef);
	void OnButtonUnhovered__DelegateSignature(class UW_ShopCategoryButton_C* ButtonRef);
	void PreConstruct(bool IsDesignTime);
	void Select();
	void Unhover();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_ShopCategoryButton_C">();
	}
	static class UW_ShopCategoryButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_ShopCategoryButton_C>();
	}
};
#pragma pack(pop)
static_assert(alignof(UW_ShopCategoryButton_C) == 0x000008, "Wrong alignment on UW_ShopCategoryButton_C");
static_assert(sizeof(UW_ShopCategoryButton_C) == 0x000358, "Wrong size on UW_ShopCategoryButton_C");
static_assert(offsetof(UW_ShopCategoryButton_C, UberGraphFrame) == 0x000280, "Member 'UW_ShopCategoryButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_ShopCategoryButton_C, Deselect_Anim) == 0x000288, "Member 'UW_ShopCategoryButton_C::Deselect_Anim' has a wrong offset!");
static_assert(offsetof(UW_ShopCategoryButton_C, Select_Anim) == 0x000290, "Member 'UW_ShopCategoryButton_C::Select_Anim' has a wrong offset!");
static_assert(offsetof(UW_ShopCategoryButton_C, Unhover_Anim) == 0x000298, "Member 'UW_ShopCategoryButton_C::Unhover_Anim' has a wrong offset!");
static_assert(offsetof(UW_ShopCategoryButton_C, Hover_Anim) == 0x0002A0, "Member 'UW_ShopCategoryButton_C::Hover_Anim' has a wrong offset!");
static_assert(offsetof(UW_ShopCategoryButton_C, Button_Category) == 0x0002A8, "Member 'UW_ShopCategoryButton_C::Button_Category' has a wrong offset!");
static_assert(offsetof(UW_ShopCategoryButton_C, Image_46) == 0x0002B0, "Member 'UW_ShopCategoryButton_C::Image_46' has a wrong offset!");
static_assert(offsetof(UW_ShopCategoryButton_C, TextBlock_CategoryName) == 0x0002B8, "Member 'UW_ShopCategoryButton_C::TextBlock_CategoryName' has a wrong offset!");
static_assert(offsetof(UW_ShopCategoryButton_C, bIsButtonHovered) == 0x0002C0, "Member 'UW_ShopCategoryButton_C::bIsButtonHovered' has a wrong offset!");
static_assert(offsetof(UW_ShopCategoryButton_C, bIsButtonSelected) == 0x0002C1, "Member 'UW_ShopCategoryButton_C::bIsButtonSelected' has a wrong offset!");
static_assert(offsetof(UW_ShopCategoryButton_C, Category_Name) == 0x0002C4, "Member 'UW_ShopCategoryButton_C::Category_Name' has a wrong offset!");
static_assert(offsetof(UW_ShopCategoryButton_C, OnButtonHovered) == 0x0002D0, "Member 'UW_ShopCategoryButton_C::OnButtonHovered' has a wrong offset!");
static_assert(offsetof(UW_ShopCategoryButton_C, OnButtonUnhovered) == 0x0002E0, "Member 'UW_ShopCategoryButton_C::OnButtonUnhovered' has a wrong offset!");
static_assert(offsetof(UW_ShopCategoryButton_C, OnButtonSelected) == 0x0002F0, "Member 'UW_ShopCategoryButton_C::OnButtonSelected' has a wrong offset!");
static_assert(offsetof(UW_ShopCategoryButton_C, bIsCommonCategory) == 0x000300, "Member 'UW_ShopCategoryButton_C::bIsCommonCategory' has a wrong offset!");
static_assert(offsetof(UW_ShopCategoryButton_C, CategoryData) == 0x000308, "Member 'UW_ShopCategoryButton_C::CategoryData' has a wrong offset!");
static_assert(offsetof(UW_ShopCategoryButton_C, ImageSize) == 0x000350, "Member 'UW_ShopCategoryButton_C::ImageSize' has a wrong offset!");

}

