#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ShopTimer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_ShopTimer.W_ShopTimer_C
// 0x0038 (0x02B8 - 0x0280)
class UW_ShopTimer_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             Timer;                                             // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Opened;                                            // 0x0290(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ZeroTimeFormat;                                    // 0x0298(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         OpenedTime;                                        // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BeforeNTime;                                       // 0x02B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BeforeOpeningTimer();
	void ExecuteUbergraph_W_ShopTimer(int32 EntryPoint);
	void Hide();
	void ShopOpenedTimer();
	void Show();
	void StartTimer();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_ShopTimer_C">();
	}
	static class UW_ShopTimer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_ShopTimer_C>();
	}
};
static_assert(alignof(UW_ShopTimer_C) == 0x000008, "Wrong alignment on UW_ShopTimer_C");
static_assert(sizeof(UW_ShopTimer_C) == 0x0002B8, "Wrong size on UW_ShopTimer_C");
static_assert(offsetof(UW_ShopTimer_C, UberGraphFrame) == 0x000280, "Member 'UW_ShopTimer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_ShopTimer_C, Timer) == 0x000288, "Member 'UW_ShopTimer_C::Timer' has a wrong offset!");
static_assert(offsetof(UW_ShopTimer_C, Opened) == 0x000290, "Member 'UW_ShopTimer_C::Opened' has a wrong offset!");
static_assert(offsetof(UW_ShopTimer_C, ZeroTimeFormat) == 0x000298, "Member 'UW_ShopTimer_C::ZeroTimeFormat' has a wrong offset!");
static_assert(offsetof(UW_ShopTimer_C, OpenedTime) == 0x0002B0, "Member 'UW_ShopTimer_C::OpenedTime' has a wrong offset!");
static_assert(offsetof(UW_ShopTimer_C, BeforeNTime) == 0x0002B4, "Member 'UW_ShopTimer_C::BeforeNTime' has a wrong offset!");

}

