#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ShopCategorySelector

#include "Basic.hpp"

#include "S_CategoryData_structs.hpp"


namespace SDK::Params
{

// Function W_ShopCategorySelector.W_ShopCategorySelector_C.BindButton
// 0x0038 (0x0038 - 0x0000)
struct W_ShopCategorySelector_C_BindButton final
{
public:
	class UW_ShopCategoryButton_C*                ButtonRef;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UW_ShopCategoryButton_C* ButtonRef)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UW_ShopCategoryButton_C* ButtonRef)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UW_ShopCategoryButton_C* ButtonRef)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ShopCategorySelector_C_BindButton) == 0x000008, "Wrong alignment on W_ShopCategorySelector_C_BindButton");
static_assert(sizeof(W_ShopCategorySelector_C_BindButton) == 0x000038, "Wrong size on W_ShopCategorySelector_C_BindButton");
static_assert(offsetof(W_ShopCategorySelector_C_BindButton, ButtonRef) == 0x000000, "Member 'W_ShopCategorySelector_C_BindButton::ButtonRef' has a wrong offset!");
static_assert(offsetof(W_ShopCategorySelector_C_BindButton, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'W_ShopCategorySelector_C_BindButton::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_ShopCategorySelector_C_BindButton, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'W_ShopCategorySelector_C_BindButton::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(W_ShopCategorySelector_C_BindButton, K2Node_CreateDelegate_OutputDelegate_2) == 0x000028, "Member 'W_ShopCategorySelector_C_BindButton::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");

// Function W_ShopCategorySelector.W_ShopCategorySelector_C.ButtonHovered_Handler
// 0x0008 (0x0008 - 0x0000)
struct W_ShopCategorySelector_C_ButtonHovered_Handler final
{
public:
	class UW_ShopCategoryButton_C*                ButtonRef;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ShopCategorySelector_C_ButtonHovered_Handler) == 0x000008, "Wrong alignment on W_ShopCategorySelector_C_ButtonHovered_Handler");
static_assert(sizeof(W_ShopCategorySelector_C_ButtonHovered_Handler) == 0x000008, "Wrong size on W_ShopCategorySelector_C_ButtonHovered_Handler");
static_assert(offsetof(W_ShopCategorySelector_C_ButtonHovered_Handler, ButtonRef) == 0x000000, "Member 'W_ShopCategorySelector_C_ButtonHovered_Handler::ButtonRef' has a wrong offset!");

// Function W_ShopCategorySelector.W_ShopCategorySelector_C.ButtonSelected_Handler
// 0x0018 (0x0018 - 0x0000)
struct W_ShopCategorySelector_C_ButtonSelected_Handler final
{
public:
	class UW_ShopCategoryButton_C*                ButtonRef;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentIndex;                                      // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ShopCategorySelector_C_ButtonSelected_Handler) == 0x000008, "Wrong alignment on W_ShopCategorySelector_C_ButtonSelected_Handler");
static_assert(sizeof(W_ShopCategorySelector_C_ButtonSelected_Handler) == 0x000018, "Wrong size on W_ShopCategorySelector_C_ButtonSelected_Handler");
static_assert(offsetof(W_ShopCategorySelector_C_ButtonSelected_Handler, ButtonRef) == 0x000000, "Member 'W_ShopCategorySelector_C_ButtonSelected_Handler::ButtonRef' has a wrong offset!");
static_assert(offsetof(W_ShopCategorySelector_C_ButtonSelected_Handler, CurrentIndex) == 0x000008, "Member 'W_ShopCategorySelector_C_ButtonSelected_Handler::CurrentIndex' has a wrong offset!");
static_assert(offsetof(W_ShopCategorySelector_C_ButtonSelected_Handler, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00000C, "Member 'W_ShopCategorySelector_C_ButtonSelected_Handler::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ShopCategorySelector_C_ButtonSelected_Handler, CallFunc_Array_Find_ReturnValue) == 0x000010, "Member 'W_ShopCategorySelector_C_ButtonSelected_Handler::CallFunc_Array_Find_ReturnValue' has a wrong offset!");

// Function W_ShopCategorySelector.W_ShopCategorySelector_C.ButtonUnhovered_Handler
// 0x0008 (0x0008 - 0x0000)
struct W_ShopCategorySelector_C_ButtonUnhovered_Handler final
{
public:
	class UW_ShopCategoryButton_C*                ButtonRef;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ShopCategorySelector_C_ButtonUnhovered_Handler) == 0x000008, "Wrong alignment on W_ShopCategorySelector_C_ButtonUnhovered_Handler");
static_assert(sizeof(W_ShopCategorySelector_C_ButtonUnhovered_Handler) == 0x000008, "Wrong size on W_ShopCategorySelector_C_ButtonUnhovered_Handler");
static_assert(offsetof(W_ShopCategorySelector_C_ButtonUnhovered_Handler, ButtonRef) == 0x000000, "Member 'W_ShopCategorySelector_C_ButtonUnhovered_Handler::ButtonRef' has a wrong offset!");

// Function W_ShopCategorySelector.W_ShopCategorySelector_C.ClearCategories
// 0x0020 (0x0020 - 0x0000)
struct W_ShopCategorySelector_C_ClearCategories final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_ShopCategoryButton_C*                CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ShopCategorySelector_C_ClearCategories) == 0x000008, "Wrong alignment on W_ShopCategorySelector_C_ClearCategories");
static_assert(sizeof(W_ShopCategorySelector_C_ClearCategories) == 0x000020, "Wrong size on W_ShopCategorySelector_C_ClearCategories");
static_assert(offsetof(W_ShopCategorySelector_C_ClearCategories, Temp_int_Array_Index_Variable) == 0x000000, "Member 'W_ShopCategorySelector_C_ClearCategories::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_ShopCategorySelector_C_ClearCategories, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'W_ShopCategorySelector_C_ClearCategories::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_ShopCategorySelector_C_ClearCategories, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'W_ShopCategorySelector_C_ClearCategories::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ShopCategorySelector_C_ClearCategories, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'W_ShopCategorySelector_C_ClearCategories::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ShopCategorySelector_C_ClearCategories, CallFunc_Array_Get_Item) == 0x000010, "Member 'W_ShopCategorySelector_C_ClearCategories::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_ShopCategorySelector_C_ClearCategories, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'W_ShopCategorySelector_C_ClearCategories::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function W_ShopCategorySelector.W_ShopCategorySelector_C.ExecuteUbergraph_W_ShopCategorySelector
// 0x000C (0x000C - 0x0000)
struct W_ShopCategorySelector_C_ExecuteUbergraph_W_ShopCategorySelector final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ShopCategorySelector_C_ExecuteUbergraph_W_ShopCategorySelector) == 0x000004, "Wrong alignment on W_ShopCategorySelector_C_ExecuteUbergraph_W_ShopCategorySelector");
static_assert(sizeof(W_ShopCategorySelector_C_ExecuteUbergraph_W_ShopCategorySelector) == 0x00000C, "Wrong size on W_ShopCategorySelector_C_ExecuteUbergraph_W_ShopCategorySelector");
static_assert(offsetof(W_ShopCategorySelector_C_ExecuteUbergraph_W_ShopCategorySelector, EntryPoint) == 0x000000, "Member 'W_ShopCategorySelector_C_ExecuteUbergraph_W_ShopCategorySelector::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_ShopCategorySelector_C_ExecuteUbergraph_W_ShopCategorySelector, K2Node_Event_IsDesignTime) == 0x000004, "Member 'W_ShopCategorySelector_C_ExecuteUbergraph_W_ShopCategorySelector::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_ShopCategorySelector_C_ExecuteUbergraph_W_ShopCategorySelector, CallFunc_Array_Add_ReturnValue) == 0x000008, "Member 'W_ShopCategorySelector_C_ExecuteUbergraph_W_ShopCategorySelector::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function W_ShopCategorySelector.W_ShopCategorySelector_C.GetCurrentButtonRef
// 0x0010 (0x0010 - 0x0000)
struct W_ShopCategorySelector_C_GetCurrentButtonRef final
{
public:
	class UW_ShopCategoryButton_C*                ButtonRef;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_ShopCategoryButton_C*                CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ShopCategorySelector_C_GetCurrentButtonRef) == 0x000008, "Wrong alignment on W_ShopCategorySelector_C_GetCurrentButtonRef");
static_assert(sizeof(W_ShopCategorySelector_C_GetCurrentButtonRef) == 0x000010, "Wrong size on W_ShopCategorySelector_C_GetCurrentButtonRef");
static_assert(offsetof(W_ShopCategorySelector_C_GetCurrentButtonRef, ButtonRef) == 0x000000, "Member 'W_ShopCategorySelector_C_GetCurrentButtonRef::ButtonRef' has a wrong offset!");
static_assert(offsetof(W_ShopCategorySelector_C_GetCurrentButtonRef, CallFunc_Array_Get_Item) == 0x000008, "Member 'W_ShopCategorySelector_C_GetCurrentButtonRef::CallFunc_Array_Get_Item' has a wrong offset!");

// Function W_ShopCategorySelector.W_ShopCategorySelector_C.GetNumButtons
// 0x0008 (0x0008 - 0x0000)
struct W_ShopCategorySelector_C_GetNumButtons final
{
public:
	int32                                         Num;                                               // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ShopCategorySelector_C_GetNumButtons) == 0x000004, "Wrong alignment on W_ShopCategorySelector_C_GetNumButtons");
static_assert(sizeof(W_ShopCategorySelector_C_GetNumButtons) == 0x000008, "Wrong size on W_ShopCategorySelector_C_GetNumButtons");
static_assert(offsetof(W_ShopCategorySelector_C_GetNumButtons, Num) == 0x000000, "Member 'W_ShopCategorySelector_C_GetNumButtons::Num' has a wrong offset!");
static_assert(offsetof(W_ShopCategorySelector_C_GetNumButtons, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'W_ShopCategorySelector_C_GetNumButtons::CallFunc_Array_Length_ReturnValue' has a wrong offset!");

// Function W_ShopCategorySelector.W_ShopCategorySelector_C.OnCategoryChanged__DelegateSignature
// 0x0050 (0x0050 - 0x0000)
struct W_ShopCategorySelector_C_OnCategoryChanged__DelegateSignature final
{
public:
	struct FS_CategoryData                        CategoryData;                                      // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          All;                                               // 0x0048(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ShopCategorySelector_C_OnCategoryChanged__DelegateSignature) == 0x000008, "Wrong alignment on W_ShopCategorySelector_C_OnCategoryChanged__DelegateSignature");
static_assert(sizeof(W_ShopCategorySelector_C_OnCategoryChanged__DelegateSignature) == 0x000050, "Wrong size on W_ShopCategorySelector_C_OnCategoryChanged__DelegateSignature");
static_assert(offsetof(W_ShopCategorySelector_C_OnCategoryChanged__DelegateSignature, CategoryData) == 0x000000, "Member 'W_ShopCategorySelector_C_OnCategoryChanged__DelegateSignature::CategoryData' has a wrong offset!");
static_assert(offsetof(W_ShopCategorySelector_C_OnCategoryChanged__DelegateSignature, All) == 0x000048, "Member 'W_ShopCategorySelector_C_OnCategoryChanged__DelegateSignature::All' has a wrong offset!");

// Function W_ShopCategorySelector.W_ShopCategorySelector_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_ShopCategorySelector_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ShopCategorySelector_C_PreConstruct) == 0x000001, "Wrong alignment on W_ShopCategorySelector_C_PreConstruct");
static_assert(sizeof(W_ShopCategorySelector_C_PreConstruct) == 0x000001, "Wrong size on W_ShopCategorySelector_C_PreConstruct");
static_assert(offsetof(W_ShopCategorySelector_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_ShopCategorySelector_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_ShopCategorySelector.W_ShopCategorySelector_C.ReInit
// 0x0040 (0x0040 - 0x0000)
struct W_ShopCategorySelector_C_ReInit final
{
public:
	TArray<class FName>                           CategoryNames;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_ShopCategoryButton_C*                CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ShopCategorySelector_C_ReInit) == 0x000008, "Wrong alignment on W_ShopCategorySelector_C_ReInit");
static_assert(sizeof(W_ShopCategorySelector_C_ReInit) == 0x000040, "Wrong size on W_ShopCategorySelector_C_ReInit");
static_assert(offsetof(W_ShopCategorySelector_C_ReInit, CategoryNames) == 0x000000, "Member 'W_ShopCategorySelector_C_ReInit::CategoryNames' has a wrong offset!");
static_assert(offsetof(W_ShopCategorySelector_C_ReInit, Temp_int_Array_Index_Variable) == 0x000010, "Member 'W_ShopCategorySelector_C_ReInit::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_ShopCategorySelector_C_ReInit, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'W_ShopCategorySelector_C_ReInit::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_ShopCategorySelector_C_ReInit, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'W_ShopCategorySelector_C_ReInit::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ShopCategorySelector_C_ReInit, CallFunc_AddChild_ReturnValue) == 0x000020, "Member 'W_ShopCategorySelector_C_ReInit::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ShopCategorySelector_C_ReInit, CallFunc_Array_Add_ReturnValue) == 0x000028, "Member 'W_ShopCategorySelector_C_ReInit::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ShopCategorySelector_C_ReInit, CallFunc_Array_Get_Item) == 0x000030, "Member 'W_ShopCategorySelector_C_ReInit::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_ShopCategorySelector_C_ReInit, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'W_ShopCategorySelector_C_ReInit::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ShopCategorySelector_C_ReInit, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'W_ShopCategorySelector_C_ReInit::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function W_ShopCategorySelector.W_ShopCategorySelector_C.SetCategories
// 0x0050 (0x0050 - 0x0000)
struct W_ShopCategorySelector_C_SetCategories final
{
public:
	TArray<class FName>                           CategoryTypes;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UW_ShopCategoryButton_C*                CurrentButton;                                     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_ShopCategoryButton_C*                CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ShopCategorySelector_C_SetCategories) == 0x000008, "Wrong alignment on W_ShopCategorySelector_C_SetCategories");
static_assert(sizeof(W_ShopCategorySelector_C_SetCategories) == 0x000050, "Wrong size on W_ShopCategorySelector_C_SetCategories");
static_assert(offsetof(W_ShopCategorySelector_C_SetCategories, CategoryTypes) == 0x000000, "Member 'W_ShopCategorySelector_C_SetCategories::CategoryTypes' has a wrong offset!");
static_assert(offsetof(W_ShopCategorySelector_C_SetCategories, CurrentButton) == 0x000010, "Member 'W_ShopCategorySelector_C_SetCategories::CurrentButton' has a wrong offset!");
static_assert(offsetof(W_ShopCategorySelector_C_SetCategories, CallFunc_Create_ReturnValue) == 0x000018, "Member 'W_ShopCategorySelector_C_SetCategories::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ShopCategorySelector_C_SetCategories, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'W_ShopCategorySelector_C_SetCategories::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ShopCategorySelector_C_SetCategories, Temp_int_Array_Index_Variable) == 0x000024, "Member 'W_ShopCategorySelector_C_SetCategories::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_ShopCategorySelector_C_SetCategories, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'W_ShopCategorySelector_C_SetCategories::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_ShopCategorySelector_C_SetCategories, CallFunc_Array_Get_Item) == 0x00002C, "Member 'W_ShopCategorySelector_C_SetCategories::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_ShopCategorySelector_C_SetCategories, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'W_ShopCategorySelector_C_SetCategories::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ShopCategorySelector_C_SetCategories, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'W_ShopCategorySelector_C_SetCategories::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ShopCategorySelector_C_SetCategories, CallFunc_AddChild_ReturnValue) == 0x000040, "Member 'W_ShopCategorySelector_C_SetCategories::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ShopCategorySelector_C_SetCategories, CallFunc_Array_Add_ReturnValue) == 0x000048, "Member 'W_ShopCategorySelector_C_SetCategories::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function W_ShopCategorySelector.W_ShopCategorySelector_C.SetCurrentCategory
// 0x0070 (0x0070 - 0x0000)
struct W_ShopCategorySelector_C_SetCurrentCategory final
{
public:
	int32                                         NewIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumButtons_Num;                        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_IntInt_ReturnValue;               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_ShopCategoryButton_C*                CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_ShopCategoryButton_C*                CallFunc_GetCurrentButtonRef_ButtonRef;            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCommonCategory_bIsCommonCategory;       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_CategoryData                        CallFunc_GetCategoryData_CategoryData;             // 0x0028(0x0048)(HasGetValueTypeHash)
};
static_assert(alignof(W_ShopCategorySelector_C_SetCurrentCategory) == 0x000008, "Wrong alignment on W_ShopCategorySelector_C_SetCurrentCategory");
static_assert(sizeof(W_ShopCategorySelector_C_SetCurrentCategory) == 0x000070, "Wrong size on W_ShopCategorySelector_C_SetCurrentCategory");
static_assert(offsetof(W_ShopCategorySelector_C_SetCurrentCategory, NewIndex) == 0x000000, "Member 'W_ShopCategorySelector_C_SetCurrentCategory::NewIndex' has a wrong offset!");
static_assert(offsetof(W_ShopCategorySelector_C_SetCurrentCategory, CallFunc_GetNumButtons_Num) == 0x000004, "Member 'W_ShopCategorySelector_C_SetCurrentCategory::CallFunc_GetNumButtons_Num' has a wrong offset!");
static_assert(offsetof(W_ShopCategorySelector_C_SetCurrentCategory, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000008, "Member 'W_ShopCategorySelector_C_SetCurrentCategory::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ShopCategorySelector_C_SetCurrentCategory, CallFunc_InRange_IntInt_ReturnValue) == 0x000009, "Member 'W_ShopCategorySelector_C_SetCurrentCategory::CallFunc_InRange_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ShopCategorySelector_C_SetCurrentCategory, CallFunc_BooleanAND_ReturnValue) == 0x00000A, "Member 'W_ShopCategorySelector_C_SetCurrentCategory::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ShopCategorySelector_C_SetCurrentCategory, CallFunc_Array_Get_Item) == 0x000010, "Member 'W_ShopCategorySelector_C_SetCurrentCategory::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_ShopCategorySelector_C_SetCurrentCategory, CallFunc_GetCurrentButtonRef_ButtonRef) == 0x000018, "Member 'W_ShopCategorySelector_C_SetCurrentCategory::CallFunc_GetCurrentButtonRef_ButtonRef' has a wrong offset!");
static_assert(offsetof(W_ShopCategorySelector_C_SetCurrentCategory, CallFunc_IsCommonCategory_bIsCommonCategory) == 0x000020, "Member 'W_ShopCategorySelector_C_SetCurrentCategory::CallFunc_IsCommonCategory_bIsCommonCategory' has a wrong offset!");
static_assert(offsetof(W_ShopCategorySelector_C_SetCurrentCategory, CallFunc_GetCategoryData_CategoryData) == 0x000028, "Member 'W_ShopCategorySelector_C_SetCurrentCategory::CallFunc_GetCategoryData_CategoryData' has a wrong offset!");

// Function W_ShopCategorySelector.W_ShopCategorySelector_C.SwitchNextCategory
// 0x0014 (0x0014 - 0x0000)
struct W_ShopCategorySelector_C_SwitchNextCategory final
{
public:
	int32                                         CallFunc_GetNumButtons_Num;                        // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ShopCategorySelector_C_SwitchNextCategory) == 0x000004, "Wrong alignment on W_ShopCategorySelector_C_SwitchNextCategory");
static_assert(sizeof(W_ShopCategorySelector_C_SwitchNextCategory) == 0x000014, "Wrong size on W_ShopCategorySelector_C_SwitchNextCategory");
static_assert(offsetof(W_ShopCategorySelector_C_SwitchNextCategory, CallFunc_GetNumButtons_Num) == 0x000000, "Member 'W_ShopCategorySelector_C_SwitchNextCategory::CallFunc_GetNumButtons_Num' has a wrong offset!");
static_assert(offsetof(W_ShopCategorySelector_C_SwitchNextCategory, CallFunc_Subtract_IntInt_ReturnValue) == 0x000004, "Member 'W_ShopCategorySelector_C_SwitchNextCategory::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ShopCategorySelector_C_SwitchNextCategory, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'W_ShopCategorySelector_C_SwitchNextCategory::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ShopCategorySelector_C_SwitchNextCategory, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00000C, "Member 'W_ShopCategorySelector_C_SwitchNextCategory::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ShopCategorySelector_C_SwitchNextCategory, CallFunc_SelectInt_ReturnValue) == 0x000010, "Member 'W_ShopCategorySelector_C_SwitchNextCategory::CallFunc_SelectInt_ReturnValue' has a wrong offset!");

// Function W_ShopCategorySelector.W_ShopCategorySelector_C.SwitchPrevCategory
// 0x0014 (0x0014 - 0x0000)
struct W_ShopCategorySelector_C_SwitchPrevCategory final
{
public:
	int32                                         CallFunc_GetNumButtons_Num;                        // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ShopCategorySelector_C_SwitchPrevCategory) == 0x000004, "Wrong alignment on W_ShopCategorySelector_C_SwitchPrevCategory");
static_assert(sizeof(W_ShopCategorySelector_C_SwitchPrevCategory) == 0x000014, "Wrong size on W_ShopCategorySelector_C_SwitchPrevCategory");
static_assert(offsetof(W_ShopCategorySelector_C_SwitchPrevCategory, CallFunc_GetNumButtons_Num) == 0x000000, "Member 'W_ShopCategorySelector_C_SwitchPrevCategory::CallFunc_GetNumButtons_Num' has a wrong offset!");
static_assert(offsetof(W_ShopCategorySelector_C_SwitchPrevCategory, CallFunc_Subtract_IntInt_ReturnValue) == 0x000004, "Member 'W_ShopCategorySelector_C_SwitchPrevCategory::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ShopCategorySelector_C_SwitchPrevCategory, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000008, "Member 'W_ShopCategorySelector_C_SwitchPrevCategory::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ShopCategorySelector_C_SwitchPrevCategory, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00000C, "Member 'W_ShopCategorySelector_C_SwitchPrevCategory::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ShopCategorySelector_C_SwitchPrevCategory, CallFunc_SelectInt_ReturnValue) == 0x000010, "Member 'W_ShopCategorySelector_C_SwitchPrevCategory::CallFunc_SelectInt_ReturnValue' has a wrong offset!");

// Function W_ShopCategorySelector.W_ShopCategorySelector_C.UnbindButton
// 0x0038 (0x0038 - 0x0000)
struct W_ShopCategorySelector_C_UnbindButton final
{
public:
	class UW_ShopCategoryButton_C*                ButtonRef;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UW_ShopCategoryButton_C* ButtonRef)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UW_ShopCategoryButton_C* ButtonRef)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UW_ShopCategoryButton_C* ButtonRef)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ShopCategorySelector_C_UnbindButton) == 0x000008, "Wrong alignment on W_ShopCategorySelector_C_UnbindButton");
static_assert(sizeof(W_ShopCategorySelector_C_UnbindButton) == 0x000038, "Wrong size on W_ShopCategorySelector_C_UnbindButton");
static_assert(offsetof(W_ShopCategorySelector_C_UnbindButton, ButtonRef) == 0x000000, "Member 'W_ShopCategorySelector_C_UnbindButton::ButtonRef' has a wrong offset!");
static_assert(offsetof(W_ShopCategorySelector_C_UnbindButton, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'W_ShopCategorySelector_C_UnbindButton::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_ShopCategorySelector_C_UnbindButton, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'W_ShopCategorySelector_C_UnbindButton::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
