#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ShopCategorySelector

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_ShopCategorySelector.W_ShopCategorySelector_C
// 0x0050 (0x02D0 - 0x0280)
class UW_ShopCategorySelector_C : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         HorizontalBox_CategoryButtons;                     // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_HintButtonNew_C*                     W_ButtonNext;                                      // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_HintButtonNew_C*                     W_ButtonPrev;                                      // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ShopCategoryButton_C*                W_ShopCategoryButton_All;                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UW_ShopCategoryButton_C*>        CategoryButtons;                                   // 0x02A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         SelectedButtonIndex;                               // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnCategoryChanged;                                 // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BindButton(class UW_ShopCategoryButton_C* ButtonRef);
	void BndEvt__W_ShopCategorySelector_W_ButtonNext_K2Node_ComponentBoundEvent_3_OnPressed__DelegateSignature();
	void BndEvt__W_ShopCategorySelector_W_ButtonPrev_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature();
	void ButtonHovered_Handler(class UW_ShopCategoryButton_C* ButtonRef);
	void ButtonSelected_Handler(class UW_ShopCategoryButton_C* ButtonRef);
	void ButtonUnhovered_Handler(class UW_ShopCategoryButton_C* ButtonRef);
	void ClearCategories();
	void Destruct();
	void ExecuteUbergraph_W_ShopCategorySelector(int32 EntryPoint);
	void GetCurrentButtonRef(class UW_ShopCategoryButton_C** ButtonRef);
	void GetNumButtons(int32* Num);
	void OnCategoryChanged__DelegateSignature(const struct FS_CategoryData& CategoryData, bool All);
	void PreConstruct(bool IsDesignTime);
	void ReInit(TArray<class FName>& CategoryNames);
	void SetCategories(TArray<class FName>& CategoryTypes);
	void SetCurrentCategory(int32 NewIndex);
	void SwitchNextCategory();
	void SwitchPrevCategory();
	void UnbindButton(class UW_ShopCategoryButton_C* ButtonRef);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_ShopCategorySelector_C">();
	}
	static class UW_ShopCategorySelector_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_ShopCategorySelector_C>();
	}
};
static_assert(alignof(UW_ShopCategorySelector_C) == 0x000008, "Wrong alignment on UW_ShopCategorySelector_C");
static_assert(sizeof(UW_ShopCategorySelector_C) == 0x0002D0, "Wrong size on UW_ShopCategorySelector_C");
static_assert(offsetof(UW_ShopCategorySelector_C, UberGraphFrame) == 0x000280, "Member 'UW_ShopCategorySelector_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_ShopCategorySelector_C, HorizontalBox_CategoryButtons) == 0x000288, "Member 'UW_ShopCategorySelector_C::HorizontalBox_CategoryButtons' has a wrong offset!");
static_assert(offsetof(UW_ShopCategorySelector_C, W_ButtonNext) == 0x000290, "Member 'UW_ShopCategorySelector_C::W_ButtonNext' has a wrong offset!");
static_assert(offsetof(UW_ShopCategorySelector_C, W_ButtonPrev) == 0x000298, "Member 'UW_ShopCategorySelector_C::W_ButtonPrev' has a wrong offset!");
static_assert(offsetof(UW_ShopCategorySelector_C, W_ShopCategoryButton_All) == 0x0002A0, "Member 'UW_ShopCategorySelector_C::W_ShopCategoryButton_All' has a wrong offset!");
static_assert(offsetof(UW_ShopCategorySelector_C, CategoryButtons) == 0x0002A8, "Member 'UW_ShopCategorySelector_C::CategoryButtons' has a wrong offset!");
static_assert(offsetof(UW_ShopCategorySelector_C, SelectedButtonIndex) == 0x0002B8, "Member 'UW_ShopCategorySelector_C::SelectedButtonIndex' has a wrong offset!");
static_assert(offsetof(UW_ShopCategorySelector_C, OnCategoryChanged) == 0x0002C0, "Member 'UW_ShopCategorySelector_C::OnCategoryChanged' has a wrong offset!");

}

