#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ShopCategory

#include "Basic.hpp"

#include "S_CategoryData_structs.hpp"
#include "InfoType_structs.hpp"
#include "FItemInfo_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FMODStudio_structs.hpp"


namespace SDK::Params
{

// Function W_ShopCategory.W_ShopCategory_C.ButtonHover
// 0x0010 (0x0010 - 0x0000)
struct W_ShopCategory_C_ButtonHover final
{
public:
	bool                                          Hovered;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WithAnim;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ShopCategory_C_ButtonHover) == 0x000008, "Wrong alignment on W_ShopCategory_C_ButtonHover");
static_assert(sizeof(W_ShopCategory_C_ButtonHover) == 0x000010, "Wrong size on W_ShopCategory_C_ButtonHover");
static_assert(offsetof(W_ShopCategory_C_ButtonHover, Hovered) == 0x000000, "Member 'W_ShopCategory_C_ButtonHover::Hovered' has a wrong offset!");
static_assert(offsetof(W_ShopCategory_C_ButtonHover, WithAnim) == 0x000001, "Member 'W_ShopCategory_C_ButtonHover::WithAnim' has a wrong offset!");
static_assert(offsetof(W_ShopCategory_C_ButtonHover, Temp_bool_Variable) == 0x000002, "Member 'W_ShopCategory_C_ButtonHover::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_ShopCategory_C_ButtonHover, Temp_byte_Variable) == 0x000003, "Member 'W_ShopCategory_C_ButtonHover::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_ShopCategory_C_ButtonHover, Temp_byte_Variable_1) == 0x000004, "Member 'W_ShopCategory_C_ButtonHover::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_ShopCategory_C_ButtonHover, K2Node_Select_Default) == 0x000005, "Member 'W_ShopCategory_C_ButtonHover::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_ShopCategory_C_ButtonHover, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'W_ShopCategory_C_ButtonHover::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function W_ShopCategory.W_ShopCategory_C.ExecuteUbergraph_W_ShopCategory
// 0x0020 (0x0020 - 0x0000)
struct W_ShopCategory_C_ExecuteUbergraph_W_ShopCategory final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_1;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_ShopCategory_C_ExecuteUbergraph_W_ShopCategory) == 0x000008, "Wrong alignment on W_ShopCategory_C_ExecuteUbergraph_W_ShopCategory");
static_assert(sizeof(W_ShopCategory_C_ExecuteUbergraph_W_ShopCategory) == 0x000020, "Wrong size on W_ShopCategory_C_ExecuteUbergraph_W_ShopCategory");
static_assert(offsetof(W_ShopCategory_C_ExecuteUbergraph_W_ShopCategory, EntryPoint) == 0x000000, "Member 'W_ShopCategory_C_ExecuteUbergraph_W_ShopCategory::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_ShopCategory_C_ExecuteUbergraph_W_ShopCategory, CallFunc_PlayEvent2D_ReturnValue) == 0x000008, "Member 'W_ShopCategory_C_ExecuteUbergraph_W_ShopCategory::CallFunc_PlayEvent2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ShopCategory_C_ExecuteUbergraph_W_ShopCategory, K2Node_Event_IsDesignTime) == 0x000010, "Member 'W_ShopCategory_C_ExecuteUbergraph_W_ShopCategory::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_ShopCategory_C_ExecuteUbergraph_W_ShopCategory, CallFunc_PlayEvent2D_ReturnValue_1) == 0x000018, "Member 'W_ShopCategory_C_ExecuteUbergraph_W_ShopCategory::CallFunc_PlayEvent2D_ReturnValue_1' has a wrong offset!");

// Function W_ShopCategory.W_ShopCategory_C.Init
// 0x0360 (0x0360 - 0x0000)
struct W_ShopCategory_C_Init final
{
public:
	struct FFItemInfo                             Param_FItem;                                       // 0x0000(0x0220)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
	EInfoType                                     InfoType;                                          // 0x0220(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x3];                                      // 0x0221(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Param_Category_Name;                               // 0x0224(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0230(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0240(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0250(0x0018)()
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_InitCategory_CategoryDisplayName;         // 0x0270(0x0018)()
	class UPaperSprite*                           CallFunc_InitCategory_CategoryIcon;                // 0x0288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            CallFunc_MakeBrushFromSprite_ReturnValue;          // 0x0290(0x00D0)()
};
static_assert(alignof(W_ShopCategory_C_Init) == 0x000010, "Wrong alignment on W_ShopCategory_C_Init");
static_assert(sizeof(W_ShopCategory_C_Init) == 0x000360, "Wrong size on W_ShopCategory_C_Init");
static_assert(offsetof(W_ShopCategory_C_Init, Param_FItem) == 0x000000, "Member 'W_ShopCategory_C_Init::Param_FItem' has a wrong offset!");
static_assert(offsetof(W_ShopCategory_C_Init, InfoType) == 0x000220, "Member 'W_ShopCategory_C_Init::InfoType' has a wrong offset!");
static_assert(offsetof(W_ShopCategory_C_Init, Param_Category_Name) == 0x000224, "Member 'W_ShopCategory_C_Init::Param_Category_Name' has a wrong offset!");
static_assert(offsetof(W_ShopCategory_C_Init, CallFunc_Conv_NameToString_ReturnValue) == 0x000230, "Member 'W_ShopCategory_C_Init::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ShopCategory_C_Init, CallFunc_SelectString_ReturnValue) == 0x000240, "Member 'W_ShopCategory_C_Init::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ShopCategory_C_Init, CallFunc_Conv_StringToText_ReturnValue) == 0x000250, "Member 'W_ShopCategory_C_Init::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ShopCategory_C_Init, CallFunc_Conv_StringToName_ReturnValue) == 0x000268, "Member 'W_ShopCategory_C_Init::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ShopCategory_C_Init, CallFunc_InitCategory_CategoryDisplayName) == 0x000270, "Member 'W_ShopCategory_C_Init::CallFunc_InitCategory_CategoryDisplayName' has a wrong offset!");
static_assert(offsetof(W_ShopCategory_C_Init, CallFunc_InitCategory_CategoryIcon) == 0x000288, "Member 'W_ShopCategory_C_Init::CallFunc_InitCategory_CategoryIcon' has a wrong offset!");
static_assert(offsetof(W_ShopCategory_C_Init, CallFunc_MakeBrushFromSprite_ReturnValue) == 0x000290, "Member 'W_ShopCategory_C_Init::CallFunc_MakeBrushFromSprite_ReturnValue' has a wrong offset!");

// Function W_ShopCategory.W_ShopCategory_C.InitCategory
// 0x0078 (0x0078 - 0x0000)
struct W_ShopCategory_C_InitCategory final
{
public:
	class FName                                   Param_Category_Name;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CategoryDisplayName;                               // 0x0008(0x0018)(Parm, OutParm)
	class UPaperSprite*                           CategoryIcon;                                      // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_CategoryData                        CallFunc_GetDataTableRowFromName_OutRow;           // 0x0028(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ShopCategory_C_InitCategory) == 0x000008, "Wrong alignment on W_ShopCategory_C_InitCategory");
static_assert(sizeof(W_ShopCategory_C_InitCategory) == 0x000078, "Wrong size on W_ShopCategory_C_InitCategory");
static_assert(offsetof(W_ShopCategory_C_InitCategory, Param_Category_Name) == 0x000000, "Member 'W_ShopCategory_C_InitCategory::Param_Category_Name' has a wrong offset!");
static_assert(offsetof(W_ShopCategory_C_InitCategory, CategoryDisplayName) == 0x000008, "Member 'W_ShopCategory_C_InitCategory::CategoryDisplayName' has a wrong offset!");
static_assert(offsetof(W_ShopCategory_C_InitCategory, CategoryIcon) == 0x000020, "Member 'W_ShopCategory_C_InitCategory::CategoryIcon' has a wrong offset!");
static_assert(offsetof(W_ShopCategory_C_InitCategory, CallFunc_GetDataTableRowFromName_OutRow) == 0x000028, "Member 'W_ShopCategory_C_InitCategory::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(W_ShopCategory_C_InitCategory, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000070, "Member 'W_ShopCategory_C_InitCategory::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function W_ShopCategory.W_ShopCategory_C.OnButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_ShopCategory_C_OnButtonSelected__DelegateSignature final
{
public:
	class UW_ShopCategory_C*                      NewParam;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ShopCategory_C_OnButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on W_ShopCategory_C_OnButtonSelected__DelegateSignature");
static_assert(sizeof(W_ShopCategory_C_OnButtonSelected__DelegateSignature) == 0x000008, "Wrong size on W_ShopCategory_C_OnButtonSelected__DelegateSignature");
static_assert(offsetof(W_ShopCategory_C_OnButtonSelected__DelegateSignature, NewParam) == 0x000000, "Member 'W_ShopCategory_C_OnButtonSelected__DelegateSignature::NewParam' has a wrong offset!");

// Function W_ShopCategory.W_ShopCategory_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_ShopCategory_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ShopCategory_C_PreConstruct) == 0x000001, "Wrong alignment on W_ShopCategory_C_PreConstruct");
static_assert(sizeof(W_ShopCategory_C_PreConstruct) == 0x000001, "Wrong size on W_ShopCategory_C_PreConstruct");
static_assert(offsetof(W_ShopCategory_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_ShopCategory_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_ShopCategory.W_ShopCategory_C.SetSelected
// 0x0009 (0x0009 - 0x0000)
struct W_ShopCategory_C_SetSelected final
{
public:
	bool                                          Selected;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ShopCategory_C_SetSelected) == 0x000001, "Wrong alignment on W_ShopCategory_C_SetSelected");
static_assert(sizeof(W_ShopCategory_C_SetSelected) == 0x000009, "Wrong size on W_ShopCategory_C_SetSelected");
static_assert(offsetof(W_ShopCategory_C_SetSelected, Selected) == 0x000000, "Member 'W_ShopCategory_C_SetSelected::Selected' has a wrong offset!");
static_assert(offsetof(W_ShopCategory_C_SetSelected, Temp_bool_Variable) == 0x000001, "Member 'W_ShopCategory_C_SetSelected::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_ShopCategory_C_SetSelected, Temp_byte_Variable) == 0x000002, "Member 'W_ShopCategory_C_SetSelected::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_ShopCategory_C_SetSelected, Temp_byte_Variable_1) == 0x000003, "Member 'W_ShopCategory_C_SetSelected::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_ShopCategory_C_SetSelected, Temp_bool_Variable_1) == 0x000004, "Member 'W_ShopCategory_C_SetSelected::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(W_ShopCategory_C_SetSelected, Temp_byte_Variable_2) == 0x000005, "Member 'W_ShopCategory_C_SetSelected::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(W_ShopCategory_C_SetSelected, Temp_byte_Variable_3) == 0x000006, "Member 'W_ShopCategory_C_SetSelected::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(W_ShopCategory_C_SetSelected, K2Node_Select_Default) == 0x000007, "Member 'W_ShopCategory_C_SetSelected::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_ShopCategory_C_SetSelected, K2Node_Select_Default_1) == 0x000008, "Member 'W_ShopCategory_C_SetSelected::K2Node_Select_Default_1' has a wrong offset!");

}

