#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SkinSelect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_SkinSelect.W_SkinSelect_C
// 0x00A0 (0x0320 - 0x0280)
class UW_SkinSelect_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_ST_Next;                                    // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_ST_Preview;                                 // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_36;                                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_152;                                         // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_268;                                         // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             MaxIndex;                                          // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_EditableNumber;                               // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnClickedPreviewST;                                // 0x02C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnClickedNextST;                                   // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   In_Text;                                           // 0x02E8(0x0018)(Edit, BlueprintVisible)
	int32                                         IndexST;                                           // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   MaxIndexText;                                      // 0x0308(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BndEvt__W_SkinSelect_Button_ST_Next_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__W_SkinSelect_Button_ST_Next_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__W_SkinSelect_Button_ST_Preview_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__W_SkinSelect_Button_ST_Preview_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_W_SkinSelect(int32 EntryPoint);
	void OnClickedNextST__DelegateSignature();
	void OnClickedPreviewST__DelegateSignature();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_SkinSelect_C">();
	}
	static class UW_SkinSelect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_SkinSelect_C>();
	}
};
static_assert(alignof(UW_SkinSelect_C) == 0x000008, "Wrong alignment on UW_SkinSelect_C");
static_assert(sizeof(UW_SkinSelect_C) == 0x000320, "Wrong size on UW_SkinSelect_C");
static_assert(offsetof(UW_SkinSelect_C, UberGraphFrame) == 0x000280, "Member 'UW_SkinSelect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_SkinSelect_C, Button_ST_Next) == 0x000288, "Member 'UW_SkinSelect_C::Button_ST_Next' has a wrong offset!");
static_assert(offsetof(UW_SkinSelect_C, Button_ST_Preview) == 0x000290, "Member 'UW_SkinSelect_C::Button_ST_Preview' has a wrong offset!");
static_assert(offsetof(UW_SkinSelect_C, Image) == 0x000298, "Member 'UW_SkinSelect_C::Image' has a wrong offset!");
static_assert(offsetof(UW_SkinSelect_C, Image_36) == 0x0002A0, "Member 'UW_SkinSelect_C::Image_36' has a wrong offset!");
static_assert(offsetof(UW_SkinSelect_C, Image_152) == 0x0002A8, "Member 'UW_SkinSelect_C::Image_152' has a wrong offset!");
static_assert(offsetof(UW_SkinSelect_C, Image_268) == 0x0002B0, "Member 'UW_SkinSelect_C::Image_268' has a wrong offset!");
static_assert(offsetof(UW_SkinSelect_C, MaxIndex) == 0x0002B8, "Member 'UW_SkinSelect_C::MaxIndex' has a wrong offset!");
static_assert(offsetof(UW_SkinSelect_C, Text_EditableNumber) == 0x0002C0, "Member 'UW_SkinSelect_C::Text_EditableNumber' has a wrong offset!");
static_assert(offsetof(UW_SkinSelect_C, OnClickedPreviewST) == 0x0002C8, "Member 'UW_SkinSelect_C::OnClickedPreviewST' has a wrong offset!");
static_assert(offsetof(UW_SkinSelect_C, OnClickedNextST) == 0x0002D8, "Member 'UW_SkinSelect_C::OnClickedNextST' has a wrong offset!");
static_assert(offsetof(UW_SkinSelect_C, In_Text) == 0x0002E8, "Member 'UW_SkinSelect_C::In_Text' has a wrong offset!");
static_assert(offsetof(UW_SkinSelect_C, IndexST) == 0x000300, "Member 'UW_SkinSelect_C::IndexST' has a wrong offset!");
static_assert(offsetof(UW_SkinSelect_C, MaxIndexText) == 0x000308, "Member 'UW_SkinSelect_C::MaxIndexText' has a wrong offset!");

}

