#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SoundSettingsMenu

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_SoundSettingsMenu.W_SoundSettingsMenu_C.BndEvt__W_SoundSettingsMenu_W_SettingRow_DialogeVolume_K2Node_ComponentBoundEvent_7_ValueHasBeenChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_SoundSettingsMenu_C_BndEvt__W_SoundSettingsMenu_W_SettingRow_DialogeVolume_K2Node_ComponentBoundEvent_7_ValueHasBeenChanged__DelegateSignature final
{
public:
	double                                        NewValue;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SoundSettingsMenu_C_BndEvt__W_SoundSettingsMenu_W_SettingRow_DialogeVolume_K2Node_ComponentBoundEvent_7_ValueHasBeenChanged__DelegateSignature) == 0x000008, "Wrong alignment on W_SoundSettingsMenu_C_BndEvt__W_SoundSettingsMenu_W_SettingRow_DialogeVolume_K2Node_ComponentBoundEvent_7_ValueHasBeenChanged__DelegateSignature");
static_assert(sizeof(W_SoundSettingsMenu_C_BndEvt__W_SoundSettingsMenu_W_SettingRow_DialogeVolume_K2Node_ComponentBoundEvent_7_ValueHasBeenChanged__DelegateSignature) == 0x000008, "Wrong size on W_SoundSettingsMenu_C_BndEvt__W_SoundSettingsMenu_W_SettingRow_DialogeVolume_K2Node_ComponentBoundEvent_7_ValueHasBeenChanged__DelegateSignature");
static_assert(offsetof(W_SoundSettingsMenu_C_BndEvt__W_SoundSettingsMenu_W_SettingRow_DialogeVolume_K2Node_ComponentBoundEvent_7_ValueHasBeenChanged__DelegateSignature, NewValue) == 0x000000, "Member 'W_SoundSettingsMenu_C_BndEvt__W_SoundSettingsMenu_W_SettingRow_DialogeVolume_K2Node_ComponentBoundEvent_7_ValueHasBeenChanged__DelegateSignature::NewValue' has a wrong offset!");

// Function W_SoundSettingsMenu.W_SoundSettingsMenu_C.BndEvt__W_SoundSettingsMenu_W_SettingRow_EffectsVolume_K2Node_ComponentBoundEvent_6_ValueHasBeenChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_SoundSettingsMenu_C_BndEvt__W_SoundSettingsMenu_W_SettingRow_EffectsVolume_K2Node_ComponentBoundEvent_6_ValueHasBeenChanged__DelegateSignature final
{
public:
	double                                        NewValue;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SoundSettingsMenu_C_BndEvt__W_SoundSettingsMenu_W_SettingRow_EffectsVolume_K2Node_ComponentBoundEvent_6_ValueHasBeenChanged__DelegateSignature) == 0x000008, "Wrong alignment on W_SoundSettingsMenu_C_BndEvt__W_SoundSettingsMenu_W_SettingRow_EffectsVolume_K2Node_ComponentBoundEvent_6_ValueHasBeenChanged__DelegateSignature");
static_assert(sizeof(W_SoundSettingsMenu_C_BndEvt__W_SoundSettingsMenu_W_SettingRow_EffectsVolume_K2Node_ComponentBoundEvent_6_ValueHasBeenChanged__DelegateSignature) == 0x000008, "Wrong size on W_SoundSettingsMenu_C_BndEvt__W_SoundSettingsMenu_W_SettingRow_EffectsVolume_K2Node_ComponentBoundEvent_6_ValueHasBeenChanged__DelegateSignature");
static_assert(offsetof(W_SoundSettingsMenu_C_BndEvt__W_SoundSettingsMenu_W_SettingRow_EffectsVolume_K2Node_ComponentBoundEvent_6_ValueHasBeenChanged__DelegateSignature, NewValue) == 0x000000, "Member 'W_SoundSettingsMenu_C_BndEvt__W_SoundSettingsMenu_W_SettingRow_EffectsVolume_K2Node_ComponentBoundEvent_6_ValueHasBeenChanged__DelegateSignature::NewValue' has a wrong offset!");

// Function W_SoundSettingsMenu.W_SoundSettingsMenu_C.BndEvt__W_SoundSettingsMenu_W_SettingRow_MasterVolume_K2Node_ComponentBoundEvent_4_ValueHasBeenChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_SoundSettingsMenu_C_BndEvt__W_SoundSettingsMenu_W_SettingRow_MasterVolume_K2Node_ComponentBoundEvent_4_ValueHasBeenChanged__DelegateSignature final
{
public:
	double                                        NewValue;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SoundSettingsMenu_C_BndEvt__W_SoundSettingsMenu_W_SettingRow_MasterVolume_K2Node_ComponentBoundEvent_4_ValueHasBeenChanged__DelegateSignature) == 0x000008, "Wrong alignment on W_SoundSettingsMenu_C_BndEvt__W_SoundSettingsMenu_W_SettingRow_MasterVolume_K2Node_ComponentBoundEvent_4_ValueHasBeenChanged__DelegateSignature");
static_assert(sizeof(W_SoundSettingsMenu_C_BndEvt__W_SoundSettingsMenu_W_SettingRow_MasterVolume_K2Node_ComponentBoundEvent_4_ValueHasBeenChanged__DelegateSignature) == 0x000008, "Wrong size on W_SoundSettingsMenu_C_BndEvt__W_SoundSettingsMenu_W_SettingRow_MasterVolume_K2Node_ComponentBoundEvent_4_ValueHasBeenChanged__DelegateSignature");
static_assert(offsetof(W_SoundSettingsMenu_C_BndEvt__W_SoundSettingsMenu_W_SettingRow_MasterVolume_K2Node_ComponentBoundEvent_4_ValueHasBeenChanged__DelegateSignature, NewValue) == 0x000000, "Member 'W_SoundSettingsMenu_C_BndEvt__W_SoundSettingsMenu_W_SettingRow_MasterVolume_K2Node_ComponentBoundEvent_4_ValueHasBeenChanged__DelegateSignature::NewValue' has a wrong offset!");

// Function W_SoundSettingsMenu.W_SoundSettingsMenu_C.BndEvt__W_SoundSettingsMenu_W_SettingRow_Microphone_Enabled_K2Node_ComponentBoundEvent_0_IndexHasBeenChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_SoundSettingsMenu_C_BndEvt__W_SoundSettingsMenu_W_SettingRow_Microphone_Enabled_K2Node_ComponentBoundEvent_0_IndexHasBeenChanged__DelegateSignature final
{
public:
	int32                                         NewIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SoundSettingsMenu_C_BndEvt__W_SoundSettingsMenu_W_SettingRow_Microphone_Enabled_K2Node_ComponentBoundEvent_0_IndexHasBeenChanged__DelegateSignature) == 0x000004, "Wrong alignment on W_SoundSettingsMenu_C_BndEvt__W_SoundSettingsMenu_W_SettingRow_Microphone_Enabled_K2Node_ComponentBoundEvent_0_IndexHasBeenChanged__DelegateSignature");
static_assert(sizeof(W_SoundSettingsMenu_C_BndEvt__W_SoundSettingsMenu_W_SettingRow_Microphone_Enabled_K2Node_ComponentBoundEvent_0_IndexHasBeenChanged__DelegateSignature) == 0x000004, "Wrong size on W_SoundSettingsMenu_C_BndEvt__W_SoundSettingsMenu_W_SettingRow_Microphone_Enabled_K2Node_ComponentBoundEvent_0_IndexHasBeenChanged__DelegateSignature");
static_assert(offsetof(W_SoundSettingsMenu_C_BndEvt__W_SoundSettingsMenu_W_SettingRow_Microphone_Enabled_K2Node_ComponentBoundEvent_0_IndexHasBeenChanged__DelegateSignature, NewIndex) == 0x000000, "Member 'W_SoundSettingsMenu_C_BndEvt__W_SoundSettingsMenu_W_SettingRow_Microphone_Enabled_K2Node_ComponentBoundEvent_0_IndexHasBeenChanged__DelegateSignature::NewIndex' has a wrong offset!");

// Function W_SoundSettingsMenu.W_SoundSettingsMenu_C.BndEvt__W_SoundSettingsMenu_W_SettingRow_MusicVolume_K2Node_ComponentBoundEvent_8_ValueHasBeenChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_SoundSettingsMenu_C_BndEvt__W_SoundSettingsMenu_W_SettingRow_MusicVolume_K2Node_ComponentBoundEvent_8_ValueHasBeenChanged__DelegateSignature final
{
public:
	double                                        NewValue;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SoundSettingsMenu_C_BndEvt__W_SoundSettingsMenu_W_SettingRow_MusicVolume_K2Node_ComponentBoundEvent_8_ValueHasBeenChanged__DelegateSignature) == 0x000008, "Wrong alignment on W_SoundSettingsMenu_C_BndEvt__W_SoundSettingsMenu_W_SettingRow_MusicVolume_K2Node_ComponentBoundEvent_8_ValueHasBeenChanged__DelegateSignature");
static_assert(sizeof(W_SoundSettingsMenu_C_BndEvt__W_SoundSettingsMenu_W_SettingRow_MusicVolume_K2Node_ComponentBoundEvent_8_ValueHasBeenChanged__DelegateSignature) == 0x000008, "Wrong size on W_SoundSettingsMenu_C_BndEvt__W_SoundSettingsMenu_W_SettingRow_MusicVolume_K2Node_ComponentBoundEvent_8_ValueHasBeenChanged__DelegateSignature");
static_assert(offsetof(W_SoundSettingsMenu_C_BndEvt__W_SoundSettingsMenu_W_SettingRow_MusicVolume_K2Node_ComponentBoundEvent_8_ValueHasBeenChanged__DelegateSignature, NewValue) == 0x000000, "Member 'W_SoundSettingsMenu_C_BndEvt__W_SoundSettingsMenu_W_SettingRow_MusicVolume_K2Node_ComponentBoundEvent_8_ValueHasBeenChanged__DelegateSignature::NewValue' has a wrong offset!");

// Function W_SoundSettingsMenu.W_SoundSettingsMenu_C.BndEvt__W_SoundSettingsMenu_W_SettingRow_VoiceChatVolume_K2Node_ComponentBoundEvent_9_ValueHasBeenChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_SoundSettingsMenu_C_BndEvt__W_SoundSettingsMenu_W_SettingRow_VoiceChatVolume_K2Node_ComponentBoundEvent_9_ValueHasBeenChanged__DelegateSignature final
{
public:
	double                                        NewValue;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SoundSettingsMenu_C_BndEvt__W_SoundSettingsMenu_W_SettingRow_VoiceChatVolume_K2Node_ComponentBoundEvent_9_ValueHasBeenChanged__DelegateSignature) == 0x000008, "Wrong alignment on W_SoundSettingsMenu_C_BndEvt__W_SoundSettingsMenu_W_SettingRow_VoiceChatVolume_K2Node_ComponentBoundEvent_9_ValueHasBeenChanged__DelegateSignature");
static_assert(sizeof(W_SoundSettingsMenu_C_BndEvt__W_SoundSettingsMenu_W_SettingRow_VoiceChatVolume_K2Node_ComponentBoundEvent_9_ValueHasBeenChanged__DelegateSignature) == 0x000008, "Wrong size on W_SoundSettingsMenu_C_BndEvt__W_SoundSettingsMenu_W_SettingRow_VoiceChatVolume_K2Node_ComponentBoundEvent_9_ValueHasBeenChanged__DelegateSignature");
static_assert(offsetof(W_SoundSettingsMenu_C_BndEvt__W_SoundSettingsMenu_W_SettingRow_VoiceChatVolume_K2Node_ComponentBoundEvent_9_ValueHasBeenChanged__DelegateSignature, NewValue) == 0x000000, "Member 'W_SoundSettingsMenu_C_BndEvt__W_SoundSettingsMenu_W_SettingRow_VoiceChatVolume_K2Node_ComponentBoundEvent_9_ValueHasBeenChanged__DelegateSignature::NewValue' has a wrong offset!");

// Function W_SoundSettingsMenu.W_SoundSettingsMenu_C.CheckingForValuesChanges
// 0x0038 (0x0038 - 0x0000)
struct W_SoundSettingsMenu_C_CheckingForValuesChanges final
{
public:
	bool                                          Changed;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_SettingRow_C>     K2Node_DynamicCast_AsBPI_Setting_Row;              // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsDefaultValue_Default;                // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SoundSettingsMenu_C_CheckingForValuesChanges) == 0x000008, "Wrong alignment on W_SoundSettingsMenu_C_CheckingForValuesChanges");
static_assert(sizeof(W_SoundSettingsMenu_C_CheckingForValuesChanges) == 0x000038, "Wrong size on W_SoundSettingsMenu_C_CheckingForValuesChanges");
static_assert(offsetof(W_SoundSettingsMenu_C_CheckingForValuesChanges, Changed) == 0x000000, "Member 'W_SoundSettingsMenu_C_CheckingForValuesChanges::Changed' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_CheckingForValuesChanges, Temp_int_Array_Index_Variable) == 0x000004, "Member 'W_SoundSettingsMenu_C_CheckingForValuesChanges::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_CheckingForValuesChanges, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'W_SoundSettingsMenu_C_CheckingForValuesChanges::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_CheckingForValuesChanges, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'W_SoundSettingsMenu_C_CheckingForValuesChanges::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_CheckingForValuesChanges, CallFunc_Array_Get_Item) == 0x000010, "Member 'W_SoundSettingsMenu_C_CheckingForValuesChanges::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_CheckingForValuesChanges, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'W_SoundSettingsMenu_C_CheckingForValuesChanges::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_CheckingForValuesChanges, K2Node_DynamicCast_AsBPI_Setting_Row) == 0x000020, "Member 'W_SoundSettingsMenu_C_CheckingForValuesChanges::K2Node_DynamicCast_AsBPI_Setting_Row' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_CheckingForValuesChanges, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'W_SoundSettingsMenu_C_CheckingForValuesChanges::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_CheckingForValuesChanges, CallFunc_Less_IntInt_ReturnValue) == 0x000031, "Member 'W_SoundSettingsMenu_C_CheckingForValuesChanges::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_CheckingForValuesChanges, CallFunc_GetIsDefaultValue_Default) == 0x000032, "Member 'W_SoundSettingsMenu_C_CheckingForValuesChanges::CallFunc_GetIsDefaultValue_Default' has a wrong offset!");

// Function W_SoundSettingsMenu.W_SoundSettingsMenu_C.ExecuteUbergraph_W_SoundSettingsMenu
// 0x02C8 (0x02C8 - 0x0000)
struct W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_ComponentBoundEvent_NewValue_2;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_ComponentBoundEvent_NewValue_1;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_ComponentBoundEvent_NewValue;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_Event_RowWidgetRef_3;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_ComponentBoundEvent_NewValue_3;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_ComponentBoundEvent_NewValue_4;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SettingRow_C>     K2Node_DynamicCast_AsBPI_Setting_Row;              // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_SettingRow_C>     K2Node_DynamicCast_AsBPI_Setting_Row_1;            // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_DoubleToInt64_ReturnValue;           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_Int64ToText_ReturnValue;             // 0x0078(0x0018)()
	int64                                         CallFunc_Conv_DoubleToInt64_ReturnValue_1;         // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_Int64ToText_ReturnValue_1;           // 0x0098(0x0018)()
	int64                                         CallFunc_Conv_DoubleToInt64_ReturnValue_2;         // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_Int64ToText_ReturnValue_2;           // 0x00B8(0x0018)()
	int64                                         CallFunc_Conv_DoubleToInt64_ReturnValue_3;         // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_Int64ToText_ReturnValue_3;           // 0x00D8(0x0018)()
	int64                                         CallFunc_Conv_DoubleToInt64_ReturnValue_4;         // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00F8(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_Int64ToText_ReturnValue_4;           // 0x0138(0x0018)()
	class USurvivalGameUserSettings*              CallFunc_GetSurvivalUserSettings_ReturnValue;      // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetVoiceChatVolume_ReturnValue;           // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMusicVolume_ReturnValue;               // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDialogVolume_ReturnValue;              // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEffectsVolume_ReturnValue;             // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMasterVolume_ReturnValue;              // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_Event_RowWidgetRef_2;                       // 0x0198(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_NewIndex;               // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUserWidget*>                    K2Node_MakeArray_Array;                            // 0x01A8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UUserWidget*                            K2Node_Event_RowWidgetRef_1;                       // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SettingRow_C>     K2Node_DynamicCast_AsBPI_Setting_Row_2;            // 0x01C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x3];                                      // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetSettingName_SettingName;               // 0x01D4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_Event_RowWidgetRef;                         // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Array_Get_Item;                           // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_SettingRow_C>     K2Node_DynamicCast_AsBPI_Setting_Row_3;            // 0x0200(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_212[0x6];                                      // 0x0212(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_2;        // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_3;        // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USurvivalGameUserSettings*              CallFunc_GetSurvivalUserSettings_ReturnValue_1;    // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USurvivalGameUserSettings*              CallFunc_GetSurvivalUserSettings_ReturnValue_2;    // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USurvivalGameUserSettings*              CallFunc_GetSurvivalUserSettings_ReturnValue_3;    // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USurvivalGameUserSettings*              CallFunc_GetSurvivalUserSettings_ReturnValue_4;    // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToInt64_InDouble_ImplicitCast; // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToInt64_InDouble_ImplicitCast_1; // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToInt64_InDouble_ImplicitCast_2; // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToInt64_InDouble_ImplicitCast_3; // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToInt64_InDouble_ImplicitCast_4; // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1;   // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2;   // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_3;   // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_4;   // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetMasterVolume_Volume_ImplicitCast;      // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VCASetVolume_Volume_ImplicitCast;         // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetMusicVolume_Volume_ImplicitCast;       // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VCASetVolume_Volume_ImplicitCast_1;       // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetEffectsVolume_Volume_ImplicitCast;     // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VCASetVolume_Volume_ImplicitCast_2;       // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetDialogVolume_Volume_ImplicitCast;      // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VCASetVolume_Volume_ImplicitCast_3;       // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu) == 0x000008, "Wrong alignment on W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu");
static_assert(sizeof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu) == 0x0002C8, "Wrong size on W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, EntryPoint) == 0x000000, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, K2Node_ComponentBoundEvent_NewValue_2) == 0x000008, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::K2Node_ComponentBoundEvent_NewValue_2' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, K2Node_ComponentBoundEvent_NewValue_1) == 0x000010, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::K2Node_ComponentBoundEvent_NewValue_1' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, K2Node_ComponentBoundEvent_NewValue) == 0x000018, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::K2Node_ComponentBoundEvent_NewValue' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, Temp_int_Array_Index_Variable) == 0x000020, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, K2Node_Event_RowWidgetRef_3) == 0x000028, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::K2Node_Event_RowWidgetRef_3' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, K2Node_ComponentBoundEvent_NewValue_3) == 0x000030, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::K2Node_ComponentBoundEvent_NewValue_3' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, K2Node_ComponentBoundEvent_NewValue_4) == 0x000038, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::K2Node_ComponentBoundEvent_NewValue_4' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, K2Node_DynamicCast_AsBPI_Setting_Row) == 0x000040, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::K2Node_DynamicCast_AsBPI_Setting_Row' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000051, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, K2Node_DynamicCast_AsBPI_Setting_Row_1) == 0x000058, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::K2Node_DynamicCast_AsBPI_Setting_Row_1' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, CallFunc_Conv_DoubleToInt64_ReturnValue) == 0x000070, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::CallFunc_Conv_DoubleToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, CallFunc_Conv_Int64ToText_ReturnValue) == 0x000078, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::CallFunc_Conv_Int64ToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, CallFunc_Conv_DoubleToInt64_ReturnValue_1) == 0x000090, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::CallFunc_Conv_DoubleToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, CallFunc_Conv_Int64ToText_ReturnValue_1) == 0x000098, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::CallFunc_Conv_Int64ToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, CallFunc_Conv_DoubleToInt64_ReturnValue_2) == 0x0000B0, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::CallFunc_Conv_DoubleToInt64_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, CallFunc_Conv_Int64ToText_ReturnValue_2) == 0x0000B8, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::CallFunc_Conv_Int64ToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, CallFunc_Conv_DoubleToInt64_ReturnValue_3) == 0x0000D0, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::CallFunc_Conv_DoubleToInt64_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, CallFunc_Conv_Int64ToText_ReturnValue_3) == 0x0000D8, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::CallFunc_Conv_Int64ToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, CallFunc_Conv_DoubleToInt64_ReturnValue_4) == 0x0000F0, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::CallFunc_Conv_DoubleToInt64_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, K2Node_Event_MyGeometry) == 0x0000F8, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, K2Node_Event_InDeltaTime) == 0x000130, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, CallFunc_Conv_Int64ToText_ReturnValue_4) == 0x000138, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::CallFunc_Conv_Int64ToText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, CallFunc_GetSurvivalUserSettings_ReturnValue) == 0x000150, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::CallFunc_GetSurvivalUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, CallFunc_GetVoiceChatVolume_ReturnValue) == 0x000158, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::CallFunc_GetVoiceChatVolume_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, CallFunc_GetMusicVolume_ReturnValue) == 0x00015C, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::CallFunc_GetMusicVolume_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000160, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000168, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, CallFunc_GetDialogVolume_ReturnValue) == 0x000170, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::CallFunc_GetDialogVolume_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, CallFunc_GetEffectsVolume_ReturnValue) == 0x000174, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::CallFunc_GetEffectsVolume_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000178, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x000180, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, CallFunc_GetMasterVolume_ReturnValue) == 0x000188, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::CallFunc_GetMasterVolume_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, CallFunc_Multiply_DoubleDouble_ReturnValue_4) == 0x000190, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::CallFunc_Multiply_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, K2Node_Event_RowWidgetRef_2) == 0x000198, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::K2Node_Event_RowWidgetRef_2' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, K2Node_ComponentBoundEvent_NewIndex) == 0x0001A0, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::K2Node_ComponentBoundEvent_NewIndex' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, K2Node_MakeArray_Array) == 0x0001A8, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, K2Node_Event_RowWidgetRef_1) == 0x0001B8, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::K2Node_Event_RowWidgetRef_1' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, K2Node_DynamicCast_AsBPI_Setting_Row_2) == 0x0001C0, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::K2Node_DynamicCast_AsBPI_Setting_Row_2' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, K2Node_DynamicCast_bSuccess_2) == 0x0001D0, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, CallFunc_GetSettingName_SettingName) == 0x0001D4, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::CallFunc_GetSettingName_SettingName' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, Temp_int_Loop_Counter_Variable) == 0x0001DC, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, CallFunc_Add_IntInt_ReturnValue) == 0x0001E0, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, K2Node_Event_RowWidgetRef) == 0x0001E8, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::K2Node_Event_RowWidgetRef' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, CallFunc_Array_Get_Item) == 0x0001F0, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, CallFunc_Array_Length_ReturnValue) == 0x0001F8, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, K2Node_DynamicCast_AsBPI_Setting_Row_3) == 0x000200, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::K2Node_DynamicCast_AsBPI_Setting_Row_3' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, K2Node_DynamicCast_bSuccess_3) == 0x000210, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, CallFunc_Less_IntInt_ReturnValue) == 0x000211, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000218, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000220, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, CallFunc_Divide_DoubleDouble_ReturnValue_2) == 0x000228, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::CallFunc_Divide_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, CallFunc_Divide_DoubleDouble_ReturnValue_3) == 0x000230, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::CallFunc_Divide_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, CallFunc_GetSurvivalUserSettings_ReturnValue_1) == 0x000238, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::CallFunc_GetSurvivalUserSettings_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, CallFunc_GetSurvivalUserSettings_ReturnValue_2) == 0x000240, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::CallFunc_GetSurvivalUserSettings_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, CallFunc_GetSurvivalUserSettings_ReturnValue_3) == 0x000248, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::CallFunc_GetSurvivalUserSettings_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, CallFunc_GetSurvivalUserSettings_ReturnValue_4) == 0x000250, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::CallFunc_GetSurvivalUserSettings_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, CallFunc_Conv_DoubleToInt64_InDouble_ImplicitCast) == 0x000258, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::CallFunc_Conv_DoubleToInt64_InDouble_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, CallFunc_Conv_DoubleToInt64_InDouble_ImplicitCast_1) == 0x000260, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::CallFunc_Conv_DoubleToInt64_InDouble_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, CallFunc_Conv_DoubleToInt64_InDouble_ImplicitCast_2) == 0x000268, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::CallFunc_Conv_DoubleToInt64_InDouble_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, CallFunc_Conv_DoubleToInt64_InDouble_ImplicitCast_3) == 0x000270, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::CallFunc_Conv_DoubleToInt64_InDouble_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, CallFunc_Conv_DoubleToInt64_InDouble_ImplicitCast_4) == 0x000278, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::CallFunc_Conv_DoubleToInt64_InDouble_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000280, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1) == 0x000288, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2) == 0x000290, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_3) == 0x000298, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_4) == 0x0002A0, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, CallFunc_SetMasterVolume_Volume_ImplicitCast) == 0x0002A8, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::CallFunc_SetMasterVolume_Volume_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, CallFunc_VCASetVolume_Volume_ImplicitCast) == 0x0002AC, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::CallFunc_VCASetVolume_Volume_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, CallFunc_SetMusicVolume_Volume_ImplicitCast) == 0x0002B0, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::CallFunc_SetMusicVolume_Volume_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, CallFunc_VCASetVolume_Volume_ImplicitCast_1) == 0x0002B4, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::CallFunc_VCASetVolume_Volume_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, CallFunc_SetEffectsVolume_Volume_ImplicitCast) == 0x0002B8, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::CallFunc_SetEffectsVolume_Volume_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, CallFunc_VCASetVolume_Volume_ImplicitCast_2) == 0x0002BC, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::CallFunc_VCASetVolume_Volume_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, CallFunc_SetDialogVolume_Volume_ImplicitCast) == 0x0002C0, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::CallFunc_SetDialogVolume_Volume_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu, CallFunc_VCASetVolume_Volume_ImplicitCast_3) == 0x0002C4, "Member 'W_SoundSettingsMenu_C_ExecuteUbergraph_W_SoundSettingsMenu::CallFunc_VCASetVolume_Volume_ImplicitCast_3' has a wrong offset!");

// Function W_SoundSettingsMenu.W_SoundSettingsMenu_C.GetSurvivalPlayer
// 0x0028 (0x0028 - 0x0000)
struct W_SoundSettingsMenu_C_GetSurvivalPlayer final
{
public:
	class ASurvivalPlayer_C*                      AsSurvival_Player;                                 // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SoundSettingsMenu_C_GetSurvivalPlayer) == 0x000008, "Wrong alignment on W_SoundSettingsMenu_C_GetSurvivalPlayer");
static_assert(sizeof(W_SoundSettingsMenu_C_GetSurvivalPlayer) == 0x000028, "Wrong size on W_SoundSettingsMenu_C_GetSurvivalPlayer");
static_assert(offsetof(W_SoundSettingsMenu_C_GetSurvivalPlayer, AsSurvival_Player) == 0x000000, "Member 'W_SoundSettingsMenu_C_GetSurvivalPlayer::AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_GetSurvivalPlayer, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'W_SoundSettingsMenu_C_GetSurvivalPlayer::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_GetSurvivalPlayer, CallFunc_K2_GetPawn_ReturnValue) == 0x000010, "Member 'W_SoundSettingsMenu_C_GetSurvivalPlayer::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_GetSurvivalPlayer, K2Node_DynamicCast_AsSurvival_Player) == 0x000018, "Member 'W_SoundSettingsMenu_C_GetSurvivalPlayer::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_GetSurvivalPlayer, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'W_SoundSettingsMenu_C_GetSurvivalPlayer::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function W_SoundSettingsMenu.W_SoundSettingsMenu_C.OnRowDeselected
// 0x0008 (0x0008 - 0x0000)
struct W_SoundSettingsMenu_C_OnRowDeselected final
{
public:
	class UUserWidget*                            RowWidgetRef;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SoundSettingsMenu_C_OnRowDeselected) == 0x000008, "Wrong alignment on W_SoundSettingsMenu_C_OnRowDeselected");
static_assert(sizeof(W_SoundSettingsMenu_C_OnRowDeselected) == 0x000008, "Wrong size on W_SoundSettingsMenu_C_OnRowDeselected");
static_assert(offsetof(W_SoundSettingsMenu_C_OnRowDeselected, RowWidgetRef) == 0x000000, "Member 'W_SoundSettingsMenu_C_OnRowDeselected::RowWidgetRef' has a wrong offset!");

// Function W_SoundSettingsMenu.W_SoundSettingsMenu_C.OnRowHovered
// 0x0008 (0x0008 - 0x0000)
struct W_SoundSettingsMenu_C_OnRowHovered final
{
public:
	class UUserWidget*                            RowWidgetRef;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SoundSettingsMenu_C_OnRowHovered) == 0x000008, "Wrong alignment on W_SoundSettingsMenu_C_OnRowHovered");
static_assert(sizeof(W_SoundSettingsMenu_C_OnRowHovered) == 0x000008, "Wrong size on W_SoundSettingsMenu_C_OnRowHovered");
static_assert(offsetof(W_SoundSettingsMenu_C_OnRowHovered, RowWidgetRef) == 0x000000, "Member 'W_SoundSettingsMenu_C_OnRowHovered::RowWidgetRef' has a wrong offset!");

// Function W_SoundSettingsMenu.W_SoundSettingsMenu_C.OnRowSelected
// 0x0008 (0x0008 - 0x0000)
struct W_SoundSettingsMenu_C_OnRowSelected final
{
public:
	class UUserWidget*                            RowWidgetRef;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SoundSettingsMenu_C_OnRowSelected) == 0x000008, "Wrong alignment on W_SoundSettingsMenu_C_OnRowSelected");
static_assert(sizeof(W_SoundSettingsMenu_C_OnRowSelected) == 0x000008, "Wrong size on W_SoundSettingsMenu_C_OnRowSelected");
static_assert(offsetof(W_SoundSettingsMenu_C_OnRowSelected, RowWidgetRef) == 0x000000, "Member 'W_SoundSettingsMenu_C_OnRowSelected::RowWidgetRef' has a wrong offset!");

// Function W_SoundSettingsMenu.W_SoundSettingsMenu_C.OnRowUnhovered
// 0x0008 (0x0008 - 0x0000)
struct W_SoundSettingsMenu_C_OnRowUnhovered final
{
public:
	class UUserWidget*                            RowWidgetRef;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SoundSettingsMenu_C_OnRowUnhovered) == 0x000008, "Wrong alignment on W_SoundSettingsMenu_C_OnRowUnhovered");
static_assert(sizeof(W_SoundSettingsMenu_C_OnRowUnhovered) == 0x000008, "Wrong size on W_SoundSettingsMenu_C_OnRowUnhovered");
static_assert(offsetof(W_SoundSettingsMenu_C_OnRowUnhovered, RowWidgetRef) == 0x000000, "Member 'W_SoundSettingsMenu_C_OnRowUnhovered::RowWidgetRef' has a wrong offset!");

// Function W_SoundSettingsMenu.W_SoundSettingsMenu_C.Tick
// 0x003C (0x003C - 0x0000)
struct W_SoundSettingsMenu_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SoundSettingsMenu_C_Tick) == 0x000004, "Wrong alignment on W_SoundSettingsMenu_C_Tick");
static_assert(sizeof(W_SoundSettingsMenu_C_Tick) == 0x00003C, "Wrong size on W_SoundSettingsMenu_C_Tick");
static_assert(offsetof(W_SoundSettingsMenu_C_Tick, MyGeometry) == 0x000000, "Member 'W_SoundSettingsMenu_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_SoundSettingsMenu_C_Tick, InDeltaTime) == 0x000038, "Member 'W_SoundSettingsMenu_C_Tick::InDeltaTime' has a wrong offset!");

}

