#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Statistics

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_TrainStatType_structs.hpp"
#include "Survival_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Statistics.W_Statistics_C
// 0x0178 (0x0400 - 0x0288)
class UW_Statistics_C final : public USettingsWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Show;                                              // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBackgroundBlur*                        BackgroundBlur_17;                                 // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_HintButtonNew_C*                     Button_Close;                                      // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_0;                                     // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_1;                                 // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_Effects;                                 // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_Stats;                                   // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_LabelText_C*                       UMG_EFFECTS;                                       // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_LabelText_C*                       UMG_STATS;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Scroller_C*                        WBP_Scroller_EFFECTS;                              // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Scroller_C*                        WBP_Scroller_STATS;                                // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      Player_Ref;                                        // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBPC_PlayerStatsComponent_C*            Player_Stats_Ref;                                  // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMap<E_TrainStatType, class UWBP_CharStatProgress_C*> StatsWidgets;                                      // 0x02F8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TMap<class APS_TDB_C*, class UWBP_Group_C*>   PSNameMap;                                         // 0x0348(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, ContainsInstancedReference)
	class APS_TDB_C*                              Player_State;                                      // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<class UWBP_Group_C*>                   SquadEntries;                                      // 0x03A0(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	class UWBP_InviteHome_C*                      WidgetInviteHomeRef;                               // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelWidget*                           PanelWidget;                                       // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowInviteHomeWidgetAnim;                          // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class ABP_GameHUD_C*                          HUD_Ref;                                           // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bShow;                                             // 0x03D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D1[0x7];                                      // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnCloseWStats;                                     // 0x03D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                         Current_Offset_Stats;                              // 0x03E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Nickname_Showed;                                   // 0x03EC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3ED[0x3];                                      // 0x03ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Group_C*                           HoveredGroupRef;                                   // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          OptionHide;                                        // 0x03F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Add_Squad_Member_Entry(class UWBP_Group_C* SquadEntryWidget, class APS_TDB_C* PlayerPS);
	void BndEvt__W_Statistics_Button_Close_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature();
	void BndEvt__W_Statistics_ScrollBox_STATS_K2Node_ComponentBoundEvent_1_OnUserScrolledEvent__DelegateSignature(float CurrentOffset);
	void Close();
	void Construct();
	void Create_Invite_Home_Widget();
	void Destruct();
	void ExecuteUbergraph_W_Statistics(int32 EntryPoint);
	void Fill_Empty_Squad_Slots(int32 StartIndex);
	void Hide_Invite_Home_Widget();
	void Hide_Squad_Options(class UWBP_Group_C* SquadGroup);
	void InitEffects();
	void InitStats();
	void On_Make_Leader_Func(class APS_TDB_C* PlayerState);
	void On_Player_Exit(class APS_TDB_C* PlayerState);
	void On_Player_Kick(class APS_TDB_C* PlayerState);
	void On_Unhovered_Group(class UWBP_Group_C* Ref);
	void On_Update_Group_List();
	void OnChangedPlayerRef();
	void OnCloseWStats__DelegateSignature();
	void OnHoveredGroup(class UWBP_Group_C* Ref);
	void OnInitialized();
	void Show_();
	void Update_Stat_Progress(E_TrainStatType Train_Stat_Type);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Statistics_C">();
	}
	static class UW_Statistics_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Statistics_C>();
	}
};
static_assert(alignof(UW_Statistics_C) == 0x000008, "Wrong alignment on UW_Statistics_C");
static_assert(sizeof(UW_Statistics_C) == 0x000400, "Wrong size on UW_Statistics_C");
static_assert(offsetof(UW_Statistics_C, UberGraphFrame) == 0x000288, "Member 'UW_Statistics_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Statistics_C, Show) == 0x000290, "Member 'UW_Statistics_C::Show' has a wrong offset!");
static_assert(offsetof(UW_Statistics_C, BackgroundBlur_17) == 0x000298, "Member 'UW_Statistics_C::BackgroundBlur_17' has a wrong offset!");
static_assert(offsetof(UW_Statistics_C, Button_Close) == 0x0002A0, "Member 'UW_Statistics_C::Button_Close' has a wrong offset!");
static_assert(offsetof(UW_Statistics_C, CanvasPanel_0) == 0x0002A8, "Member 'UW_Statistics_C::CanvasPanel_0' has a wrong offset!");
static_assert(offsetof(UW_Statistics_C, InvalidationBox_1) == 0x0002B0, "Member 'UW_Statistics_C::InvalidationBox_1' has a wrong offset!");
static_assert(offsetof(UW_Statistics_C, ScrollBox_Effects) == 0x0002B8, "Member 'UW_Statistics_C::ScrollBox_Effects' has a wrong offset!");
static_assert(offsetof(UW_Statistics_C, ScrollBox_Stats) == 0x0002C0, "Member 'UW_Statistics_C::ScrollBox_Stats' has a wrong offset!");
static_assert(offsetof(UW_Statistics_C, UMG_EFFECTS) == 0x0002C8, "Member 'UW_Statistics_C::UMG_EFFECTS' has a wrong offset!");
static_assert(offsetof(UW_Statistics_C, UMG_STATS) == 0x0002D0, "Member 'UW_Statistics_C::UMG_STATS' has a wrong offset!");
static_assert(offsetof(UW_Statistics_C, WBP_Scroller_EFFECTS) == 0x0002D8, "Member 'UW_Statistics_C::WBP_Scroller_EFFECTS' has a wrong offset!");
static_assert(offsetof(UW_Statistics_C, WBP_Scroller_STATS) == 0x0002E0, "Member 'UW_Statistics_C::WBP_Scroller_STATS' has a wrong offset!");
static_assert(offsetof(UW_Statistics_C, Player_Ref) == 0x0002E8, "Member 'UW_Statistics_C::Player_Ref' has a wrong offset!");
static_assert(offsetof(UW_Statistics_C, Player_Stats_Ref) == 0x0002F0, "Member 'UW_Statistics_C::Player_Stats_Ref' has a wrong offset!");
static_assert(offsetof(UW_Statistics_C, StatsWidgets) == 0x0002F8, "Member 'UW_Statistics_C::StatsWidgets' has a wrong offset!");
static_assert(offsetof(UW_Statistics_C, PSNameMap) == 0x000348, "Member 'UW_Statistics_C::PSNameMap' has a wrong offset!");
static_assert(offsetof(UW_Statistics_C, Player_State) == 0x000398, "Member 'UW_Statistics_C::Player_State' has a wrong offset!");
static_assert(offsetof(UW_Statistics_C, SquadEntries) == 0x0003A0, "Member 'UW_Statistics_C::SquadEntries' has a wrong offset!");
static_assert(offsetof(UW_Statistics_C, WidgetInviteHomeRef) == 0x0003B0, "Member 'UW_Statistics_C::WidgetInviteHomeRef' has a wrong offset!");
static_assert(offsetof(UW_Statistics_C, PanelWidget) == 0x0003B8, "Member 'UW_Statistics_C::PanelWidget' has a wrong offset!");
static_assert(offsetof(UW_Statistics_C, ShowInviteHomeWidgetAnim) == 0x0003C0, "Member 'UW_Statistics_C::ShowInviteHomeWidgetAnim' has a wrong offset!");
static_assert(offsetof(UW_Statistics_C, HUD_Ref) == 0x0003C8, "Member 'UW_Statistics_C::HUD_Ref' has a wrong offset!");
static_assert(offsetof(UW_Statistics_C, bShow) == 0x0003D0, "Member 'UW_Statistics_C::bShow' has a wrong offset!");
static_assert(offsetof(UW_Statistics_C, OnCloseWStats) == 0x0003D8, "Member 'UW_Statistics_C::OnCloseWStats' has a wrong offset!");
static_assert(offsetof(UW_Statistics_C, Current_Offset_Stats) == 0x0003E8, "Member 'UW_Statistics_C::Current_Offset_Stats' has a wrong offset!");
static_assert(offsetof(UW_Statistics_C, Nickname_Showed) == 0x0003EC, "Member 'UW_Statistics_C::Nickname_Showed' has a wrong offset!");
static_assert(offsetof(UW_Statistics_C, HoveredGroupRef) == 0x0003F0, "Member 'UW_Statistics_C::HoveredGroupRef' has a wrong offset!");
static_assert(offsetof(UW_Statistics_C, OptionHide) == 0x0003F8, "Member 'UW_Statistics_C::OptionHide' has a wrong offset!");

}

