#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Status

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Status.W_Status_C
// 0x0100 (0x0380 - 0x0280)
class UW_Status_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OpacityImageAnim;                                  // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_StatusIcon;                                  // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_158;                                     // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Buff;                                              // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1[0xF];                                      // 0x02A1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            InImage;                                           // 0x02B0(0x00D0)(Edit, BlueprintVisible)

public:
	void Construct();
	void ExecuteUbergraph_W_Status(int32 EntryPoint);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void PreConstruct(bool IsDesignTime);
	void SetTextAdrenalin(int32 InInt, double Time);
	void SetTextFood(double A);
	void SetTextSatiety(double A);
	void SetTextWater(double A);
	void SetTextWeight(bool WeightLowSpeed, double MaxStamina, double DecreaseStamina);
	void StartAnim();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Status_C">();
	}
	static class UW_Status_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Status_C>();
	}
};
static_assert(alignof(UW_Status_C) == 0x000010, "Wrong alignment on UW_Status_C");
static_assert(sizeof(UW_Status_C) == 0x000380, "Wrong size on UW_Status_C");
static_assert(offsetof(UW_Status_C, UberGraphFrame) == 0x000280, "Member 'UW_Status_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Status_C, OpacityImageAnim) == 0x000288, "Member 'UW_Status_C::OpacityImageAnim' has a wrong offset!");
static_assert(offsetof(UW_Status_C, Image_StatusIcon) == 0x000290, "Member 'UW_Status_C::Image_StatusIcon' has a wrong offset!");
static_assert(offsetof(UW_Status_C, TextBlock_158) == 0x000298, "Member 'UW_Status_C::TextBlock_158' has a wrong offset!");
static_assert(offsetof(UW_Status_C, Buff) == 0x0002A0, "Member 'UW_Status_C::Buff' has a wrong offset!");
static_assert(offsetof(UW_Status_C, InImage) == 0x0002B0, "Member 'UW_Status_C::InImage' has a wrong offset!");

}

