#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_StaticInteract

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_StaticInteractType_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_StaticInteract.W_StaticInteract_C
// 0x00B0 (0x0330 - 0x0280)
class UW_StaticInteract_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowOpenMenu;                                      // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Buttons;                             // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Interact_C*                          W_Interact_OpenMenu;                               // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Interact_C*                          W_Interact_StandUp;                                // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          CanUpdateInteractExit;                             // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CurrentHoldTimeExit;                               // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnCloseWStaticInteract;                            // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class ASurvivalPlayer_C*                      As_Survival_Player;                                // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          CanUpdateInteractOpenMenu;                         // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CurrentHoldTimeOpenMenu;                           // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BarIndex;                                          // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnHoldExit;                                        // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnHoldOpenMenu;                                    // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FTimerHandle                           TimerHoldExit;                                     // 0x0308(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TimerHoldOpenMenu;                                 // 0x0310(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          BlockOpenMenu;                                     // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_StaticInteractType                          TypeInteract;                                      // 0x0319(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          CanUpdateExit;                                     // 0x031A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31B[0x5];                                      // 0x031B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           OpenMenuTimer;                                     // 0x0320(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           StandUpTimer;                                      // 0x0328(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void CustomEvent(bool Block_);
	void ExecuteUbergraph_W_StaticInteract(int32 EntryPoint);
	void FinishExit();
	void FinishOpenMenu();
	void Get_Interact(double* Time, class UW_Interact_C** InteractWidget);
	void InitButton_E();
	void InitButton_F();
	void On_Hold_E();
	void On_Hold_F();
	void OnCloseWStaticInteract_();
	void OnCloseWStaticInteract__DelegateSignature();
	void OnHoldExit__DelegateSignature();
	void OnHoldOpenMenu__DelegateSignature();
	void OpenMenu();
	void PreConstruct(bool IsDesignTime);
	void Pressed_E();
	void Pressed_F();
	void Released_E();
	void Released_F();
	void ShowOpenMenu_(bool Show, bool WithAnim);
	void StandUp();
	void StartExit();
	void StartOpenMenu();
	void StopExit();
	void StopOpenMenu();
	void UpdateInteractExit();
	void UpdateInteractOpenMenu();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_StaticInteract_C">();
	}
	static class UW_StaticInteract_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_StaticInteract_C>();
	}
};
static_assert(alignof(UW_StaticInteract_C) == 0x000008, "Wrong alignment on UW_StaticInteract_C");
static_assert(sizeof(UW_StaticInteract_C) == 0x000330, "Wrong size on UW_StaticInteract_C");
static_assert(offsetof(UW_StaticInteract_C, UberGraphFrame) == 0x000280, "Member 'UW_StaticInteract_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_StaticInteract_C, ShowOpenMenu) == 0x000288, "Member 'UW_StaticInteract_C::ShowOpenMenu' has a wrong offset!");
static_assert(offsetof(UW_StaticInteract_C, HorizontalBox_Buttons) == 0x000290, "Member 'UW_StaticInteract_C::HorizontalBox_Buttons' has a wrong offset!");
static_assert(offsetof(UW_StaticInteract_C, W_Interact_OpenMenu) == 0x000298, "Member 'UW_StaticInteract_C::W_Interact_OpenMenu' has a wrong offset!");
static_assert(offsetof(UW_StaticInteract_C, W_Interact_StandUp) == 0x0002A0, "Member 'UW_StaticInteract_C::W_Interact_StandUp' has a wrong offset!");
static_assert(offsetof(UW_StaticInteract_C, CanUpdateInteractExit) == 0x0002A8, "Member 'UW_StaticInteract_C::CanUpdateInteractExit' has a wrong offset!");
static_assert(offsetof(UW_StaticInteract_C, CurrentHoldTimeExit) == 0x0002B0, "Member 'UW_StaticInteract_C::CurrentHoldTimeExit' has a wrong offset!");
static_assert(offsetof(UW_StaticInteract_C, OnCloseWStaticInteract) == 0x0002B8, "Member 'UW_StaticInteract_C::OnCloseWStaticInteract' has a wrong offset!");
static_assert(offsetof(UW_StaticInteract_C, As_Survival_Player) == 0x0002C8, "Member 'UW_StaticInteract_C::As_Survival_Player' has a wrong offset!");
static_assert(offsetof(UW_StaticInteract_C, CanUpdateInteractOpenMenu) == 0x0002D0, "Member 'UW_StaticInteract_C::CanUpdateInteractOpenMenu' has a wrong offset!");
static_assert(offsetof(UW_StaticInteract_C, CurrentHoldTimeOpenMenu) == 0x0002D8, "Member 'UW_StaticInteract_C::CurrentHoldTimeOpenMenu' has a wrong offset!");
static_assert(offsetof(UW_StaticInteract_C, BarIndex) == 0x0002E0, "Member 'UW_StaticInteract_C::BarIndex' has a wrong offset!");
static_assert(offsetof(UW_StaticInteract_C, OnHoldExit) == 0x0002E8, "Member 'UW_StaticInteract_C::OnHoldExit' has a wrong offset!");
static_assert(offsetof(UW_StaticInteract_C, OnHoldOpenMenu) == 0x0002F8, "Member 'UW_StaticInteract_C::OnHoldOpenMenu' has a wrong offset!");
static_assert(offsetof(UW_StaticInteract_C, TimerHoldExit) == 0x000308, "Member 'UW_StaticInteract_C::TimerHoldExit' has a wrong offset!");
static_assert(offsetof(UW_StaticInteract_C, TimerHoldOpenMenu) == 0x000310, "Member 'UW_StaticInteract_C::TimerHoldOpenMenu' has a wrong offset!");
static_assert(offsetof(UW_StaticInteract_C, BlockOpenMenu) == 0x000318, "Member 'UW_StaticInteract_C::BlockOpenMenu' has a wrong offset!");
static_assert(offsetof(UW_StaticInteract_C, TypeInteract) == 0x000319, "Member 'UW_StaticInteract_C::TypeInteract' has a wrong offset!");
static_assert(offsetof(UW_StaticInteract_C, CanUpdateExit) == 0x00031A, "Member 'UW_StaticInteract_C::CanUpdateExit' has a wrong offset!");
static_assert(offsetof(UW_StaticInteract_C, OpenMenuTimer) == 0x000320, "Member 'UW_StaticInteract_C::OpenMenuTimer' has a wrong offset!");
static_assert(offsetof(UW_StaticInteract_C, StandUpTimer) == 0x000328, "Member 'UW_StaticInteract_C::StandUpTimer' has a wrong offset!");

}

