#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_StashTutorial

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function W_StashTutorial.W_StashTutorial_C.CreateStashHighlightedItem
// 0x0078 (0x0078 - 0x0000)
struct W_StashTutorial_C_CreateStashHighlightedItem final
{
public:
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UW_FakeItemSlot_C*                      CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       K2Node_DynamicCast_AsCanvas_Panel_Slot;            // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetItemBySlotIndex_Found;                 // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJSI_Slot_C*                            CallFunc_GetItemBySlotIndex_Item;                  // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X;                          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0064(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_MakeStruct_Top_ImplicitCast;                // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_StashTutorial_C_CreateStashHighlightedItem) == 0x000008, "Wrong alignment on W_StashTutorial_C_CreateStashHighlightedItem");
static_assert(sizeof(W_StashTutorial_C_CreateStashHighlightedItem) == 0x000078, "Wrong size on W_StashTutorial_C_CreateStashHighlightedItem");
static_assert(offsetof(W_StashTutorial_C_CreateStashHighlightedItem, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000000, "Member 'W_StashTutorial_C_CreateStashHighlightedItem::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_CreateStashHighlightedItem, K2Node_MakeStruct_Margin) == 0x000008, "Member 'W_StashTutorial_C_CreateStashHighlightedItem::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_CreateStashHighlightedItem, CallFunc_Create_ReturnValue) == 0x000018, "Member 'W_StashTutorial_C_CreateStashHighlightedItem::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_CreateStashHighlightedItem, CallFunc_AddChild_ReturnValue) == 0x000020, "Member 'W_StashTutorial_C_CreateStashHighlightedItem::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_CreateStashHighlightedItem, K2Node_DynamicCast_AsCanvas_Panel_Slot) == 0x000028, "Member 'W_StashTutorial_C_CreateStashHighlightedItem::K2Node_DynamicCast_AsCanvas_Panel_Slot' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_CreateStashHighlightedItem, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'W_StashTutorial_C_CreateStashHighlightedItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_CreateStashHighlightedItem, CallFunc_GetItemBySlotIndex_Found) == 0x000031, "Member 'W_StashTutorial_C_CreateStashHighlightedItem::CallFunc_GetItemBySlotIndex_Found' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_CreateStashHighlightedItem, CallFunc_GetItemBySlotIndex_Item) == 0x000038, "Member 'W_StashTutorial_C_CreateStashHighlightedItem::CallFunc_GetItemBySlotIndex_Item' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_CreateStashHighlightedItem, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'W_StashTutorial_C_CreateStashHighlightedItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_CreateStashHighlightedItem, CallFunc_BreakVector2D_X) == 0x000048, "Member 'W_StashTutorial_C_CreateStashHighlightedItem::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_CreateStashHighlightedItem, CallFunc_BreakVector2D_Y) == 0x000050, "Member 'W_StashTutorial_C_CreateStashHighlightedItem::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_CreateStashHighlightedItem, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000058, "Member 'W_StashTutorial_C_CreateStashHighlightedItem::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_CreateStashHighlightedItem, CallFunc_IsValid_ReturnValue_1) == 0x000060, "Member 'W_StashTutorial_C_CreateStashHighlightedItem::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_CreateStashHighlightedItem, K2Node_MakeStruct_Margin_1) == 0x000064, "Member 'W_StashTutorial_C_CreateStashHighlightedItem::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_CreateStashHighlightedItem, K2Node_MakeStruct_Top_ImplicitCast) == 0x000074, "Member 'W_StashTutorial_C_CreateStashHighlightedItem::K2Node_MakeStruct_Top_ImplicitCast' has a wrong offset!");

// Function W_StashTutorial.W_StashTutorial_C.ExecuteUbergraph_W_StashTutorial
// 0x00C0 (0x00C0 - 0x0000)
struct W_StashTutorial_C_ExecuteUbergraph_W_StashTutorial final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UW_FakeItemSlot_C*                      K2Node_CustomEvent_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsFadeIn;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue_1;                // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_3;       // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_2;       // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0080(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_4;       // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_5;       // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_GI_Survival_C>      K2Node_DynamicCast_AsI_GI_Survival;                // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_StashTutorial_C_ExecuteUbergraph_W_StashTutorial) == 0x000008, "Wrong alignment on W_StashTutorial_C_ExecuteUbergraph_W_StashTutorial");
static_assert(sizeof(W_StashTutorial_C_ExecuteUbergraph_W_StashTutorial) == 0x0000C0, "Wrong size on W_StashTutorial_C_ExecuteUbergraph_W_StashTutorial");
static_assert(offsetof(W_StashTutorial_C_ExecuteUbergraph_W_StashTutorial, EntryPoint) == 0x000000, "Member 'W_StashTutorial_C_ExecuteUbergraph_W_StashTutorial::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_ExecuteUbergraph_W_StashTutorial, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'W_StashTutorial_C_ExecuteUbergraph_W_StashTutorial::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_ExecuteUbergraph_W_StashTutorial, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'W_StashTutorial_C_ExecuteUbergraph_W_StashTutorial::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_ExecuteUbergraph_W_StashTutorial, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000010, "Member 'W_StashTutorial_C_ExecuteUbergraph_W_StashTutorial::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_ExecuteUbergraph_W_StashTutorial, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'W_StashTutorial_C_ExecuteUbergraph_W_StashTutorial::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_ExecuteUbergraph_W_StashTutorial, K2Node_CustomEvent_Item) == 0x000028, "Member 'W_StashTutorial_C_ExecuteUbergraph_W_StashTutorial::K2Node_CustomEvent_Item' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_ExecuteUbergraph_W_StashTutorial, K2Node_CustomEvent_IsFadeIn) == 0x000030, "Member 'W_StashTutorial_C_ExecuteUbergraph_W_StashTutorial::K2Node_CustomEvent_IsFadeIn' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_ExecuteUbergraph_W_StashTutorial, CallFunc_K2_SetTimer_ReturnValue) == 0x000038, "Member 'W_StashTutorial_C_ExecuteUbergraph_W_StashTutorial::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_ExecuteUbergraph_W_StashTutorial, CallFunc_K2_SetTimer_ReturnValue_1) == 0x000040, "Member 'W_StashTutorial_C_ExecuteUbergraph_W_StashTutorial::CallFunc_K2_SetTimer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_ExecuteUbergraph_W_StashTutorial, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000048, "Member 'W_StashTutorial_C_ExecuteUbergraph_W_StashTutorial::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_ExecuteUbergraph_W_StashTutorial, K2Node_CreateDelegate_OutputDelegate_1) == 0x000050, "Member 'W_StashTutorial_C_ExecuteUbergraph_W_StashTutorial::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_ExecuteUbergraph_W_StashTutorial, CallFunc_PlayAnimationForward_ReturnValue_2) == 0x000060, "Member 'W_StashTutorial_C_ExecuteUbergraph_W_StashTutorial::CallFunc_PlayAnimationForward_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_ExecuteUbergraph_W_StashTutorial, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x000068, "Member 'W_StashTutorial_C_ExecuteUbergraph_W_StashTutorial::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_ExecuteUbergraph_W_StashTutorial, CallFunc_PlayAnimationForward_ReturnValue_3) == 0x000070, "Member 'W_StashTutorial_C_ExecuteUbergraph_W_StashTutorial::CallFunc_PlayAnimationForward_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_ExecuteUbergraph_W_StashTutorial, CallFunc_PlayAnimationReverse_ReturnValue_2) == 0x000078, "Member 'W_StashTutorial_C_ExecuteUbergraph_W_StashTutorial::CallFunc_PlayAnimationReverse_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_ExecuteUbergraph_W_StashTutorial, K2Node_CreateDelegate_OutputDelegate_2) == 0x000080, "Member 'W_StashTutorial_C_ExecuteUbergraph_W_StashTutorial::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_ExecuteUbergraph_W_StashTutorial, CallFunc_PlayAnimationForward_ReturnValue_4) == 0x000090, "Member 'W_StashTutorial_C_ExecuteUbergraph_W_StashTutorial::CallFunc_PlayAnimationForward_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_ExecuteUbergraph_W_StashTutorial, CallFunc_PlayAnimationForward_ReturnValue_5) == 0x000098, "Member 'W_StashTutorial_C_ExecuteUbergraph_W_StashTutorial::CallFunc_PlayAnimationForward_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_ExecuteUbergraph_W_StashTutorial, CallFunc_GetGameInstance_ReturnValue) == 0x0000A0, "Member 'W_StashTutorial_C_ExecuteUbergraph_W_StashTutorial::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_ExecuteUbergraph_W_StashTutorial, K2Node_DynamicCast_AsI_GI_Survival) == 0x0000A8, "Member 'W_StashTutorial_C_ExecuteUbergraph_W_StashTutorial::K2Node_DynamicCast_AsI_GI_Survival' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_ExecuteUbergraph_W_StashTutorial, K2Node_DynamicCast_bSuccess) == 0x0000B8, "Member 'W_StashTutorial_C_ExecuteUbergraph_W_StashTutorial::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function W_StashTutorial.W_StashTutorial_C.FakeItemFadeInTick
// 0x0030 (0x0030 - 0x0000)
struct W_StashTutorial_C_FakeItemFadeInTick final
{
public:
	float                                         CallFunc_GetRenderOpacity_ReturnValue;             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRenderOpacity_ReturnValue_1;           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_StashTutorial_C_FakeItemFadeInTick) == 0x000008, "Wrong alignment on W_StashTutorial_C_FakeItemFadeInTick");
static_assert(sizeof(W_StashTutorial_C_FakeItemFadeInTick) == 0x000030, "Wrong size on W_StashTutorial_C_FakeItemFadeInTick");
static_assert(offsetof(W_StashTutorial_C_FakeItemFadeInTick, CallFunc_GetRenderOpacity_ReturnValue) == 0x000000, "Member 'W_StashTutorial_C_FakeItemFadeInTick::CallFunc_GetRenderOpacity_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_FakeItemFadeInTick, CallFunc_GetRenderOpacity_ReturnValue_1) == 0x000004, "Member 'W_StashTutorial_C_FakeItemFadeInTick::CallFunc_GetRenderOpacity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_FakeItemFadeInTick, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000008, "Member 'W_StashTutorial_C_FakeItemFadeInTick::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_FakeItemFadeInTick, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000010, "Member 'W_StashTutorial_C_FakeItemFadeInTick::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_FakeItemFadeInTick, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000018, "Member 'W_StashTutorial_C_FakeItemFadeInTick::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_FakeItemFadeInTick, CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast) == 0x000020, "Member 'W_StashTutorial_C_FakeItemFadeInTick::CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_FakeItemFadeInTick, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast) == 0x000028, "Member 'W_StashTutorial_C_FakeItemFadeInTick::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast' has a wrong offset!");

// Function W_StashTutorial.W_StashTutorial_C.FakeItemFadeOutTick
// 0x0030 (0x0030 - 0x0000)
struct W_StashTutorial_C_FakeItemFadeOutTick final
{
public:
	float                                         CallFunc_GetRenderOpacity_ReturnValue;             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRenderOpacity_ReturnValue_1;           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_StashTutorial_C_FakeItemFadeOutTick) == 0x000008, "Wrong alignment on W_StashTutorial_C_FakeItemFadeOutTick");
static_assert(sizeof(W_StashTutorial_C_FakeItemFadeOutTick) == 0x000030, "Wrong size on W_StashTutorial_C_FakeItemFadeOutTick");
static_assert(offsetof(W_StashTutorial_C_FakeItemFadeOutTick, CallFunc_GetRenderOpacity_ReturnValue) == 0x000000, "Member 'W_StashTutorial_C_FakeItemFadeOutTick::CallFunc_GetRenderOpacity_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_FakeItemFadeOutTick, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000004, "Member 'W_StashTutorial_C_FakeItemFadeOutTick::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_FakeItemFadeOutTick, CallFunc_GetRenderOpacity_ReturnValue_1) == 0x000008, "Member 'W_StashTutorial_C_FakeItemFadeOutTick::CallFunc_GetRenderOpacity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_FakeItemFadeOutTick, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000010, "Member 'W_StashTutorial_C_FakeItemFadeOutTick::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_FakeItemFadeOutTick, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x000018, "Member 'W_StashTutorial_C_FakeItemFadeOutTick::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_FakeItemFadeOutTick, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000020, "Member 'W_StashTutorial_C_FakeItemFadeOutTick::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_FakeItemFadeOutTick, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast) == 0x000028, "Member 'W_StashTutorial_C_FakeItemFadeOutTick::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast' has a wrong offset!");

// Function W_StashTutorial.W_StashTutorial_C.FakeItemFading
// 0x0010 (0x0010 - 0x0000)
struct W_StashTutorial_C_FakeItemFading final
{
public:
	class UW_FakeItemSlot_C*                      Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFadeIn;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_StashTutorial_C_FakeItemFading) == 0x000008, "Wrong alignment on W_StashTutorial_C_FakeItemFading");
static_assert(sizeof(W_StashTutorial_C_FakeItemFading) == 0x000010, "Wrong size on W_StashTutorial_C_FakeItemFading");
static_assert(offsetof(W_StashTutorial_C_FakeItemFading, Item) == 0x000000, "Member 'W_StashTutorial_C_FakeItemFading::Item' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_FakeItemFading, IsFadeIn) == 0x000008, "Member 'W_StashTutorial_C_FakeItemFading::IsFadeIn' has a wrong offset!");

// Function W_StashTutorial.W_StashTutorial_C.OnAddItemToInventory
// 0x0100 (0x0100 - 0x0000)
struct W_StashTutorial_C_OnAddItemToInventory final
{
public:
	class UJSIContainer_C*                        From;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJSIContainer_C*                        To;                                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJSI_Slot_C*                            FromSlotRef;                                       // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJSI_Slot_C*                            ToSlotRef;                                         // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          ToEmptySlot_;                                      // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MovedAll_;                                         // 0x0021(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_2;           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_2;           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_3;           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_3;           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_4;           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_5;           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UW_FakeItemSlot_C*                      CallFunc_Create_ReturnValue;                       // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       K2Node_DynamicCast_AsCanvas_Panel_Slot;            // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_MakeStruct_Left_ImplicitCast;               // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Top_ImplicitCast;                // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Top_ImplicitCast_1;              // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_StashTutorial_C_OnAddItemToInventory) == 0x000008, "Wrong alignment on W_StashTutorial_C_OnAddItemToInventory");
static_assert(sizeof(W_StashTutorial_C_OnAddItemToInventory) == 0x000100, "Wrong size on W_StashTutorial_C_OnAddItemToInventory");
static_assert(offsetof(W_StashTutorial_C_OnAddItemToInventory, From) == 0x000000, "Member 'W_StashTutorial_C_OnAddItemToInventory::From' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_OnAddItemToInventory, To) == 0x000008, "Member 'W_StashTutorial_C_OnAddItemToInventory::To' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_OnAddItemToInventory, FromSlotRef) == 0x000010, "Member 'W_StashTutorial_C_OnAddItemToInventory::FromSlotRef' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_OnAddItemToInventory, ToSlotRef) == 0x000018, "Member 'W_StashTutorial_C_OnAddItemToInventory::ToSlotRef' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_OnAddItemToInventory, ToEmptySlot_) == 0x000020, "Member 'W_StashTutorial_C_OnAddItemToInventory::ToEmptySlot_' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_OnAddItemToInventory, MovedAll_) == 0x000021, "Member 'W_StashTutorial_C_OnAddItemToInventory::MovedAll_' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_OnAddItemToInventory, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000028, "Member 'W_StashTutorial_C_OnAddItemToInventory::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_OnAddItemToInventory, CallFunc_BreakVector2D_X) == 0x000030, "Member 'W_StashTutorial_C_OnAddItemToInventory::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_OnAddItemToInventory, CallFunc_BreakVector2D_Y) == 0x000038, "Member 'W_StashTutorial_C_OnAddItemToInventory::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_OnAddItemToInventory, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000040, "Member 'W_StashTutorial_C_OnAddItemToInventory::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_OnAddItemToInventory, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000048, "Member 'W_StashTutorial_C_OnAddItemToInventory::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_OnAddItemToInventory, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000050, "Member 'W_StashTutorial_C_OnAddItemToInventory::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_OnAddItemToInventory, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000058, "Member 'W_StashTutorial_C_OnAddItemToInventory::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_OnAddItemToInventory, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000060, "Member 'W_StashTutorial_C_OnAddItemToInventory::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_OnAddItemToInventory, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000068, "Member 'W_StashTutorial_C_OnAddItemToInventory::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_OnAddItemToInventory, CallFunc_Add_DoubleDouble_ReturnValue_2) == 0x000070, "Member 'W_StashTutorial_C_OnAddItemToInventory::CallFunc_Add_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_OnAddItemToInventory, CallFunc_Conv_IntToDouble_ReturnValue_2) == 0x000078, "Member 'W_StashTutorial_C_OnAddItemToInventory::CallFunc_Conv_IntToDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_OnAddItemToInventory, CallFunc_Conv_IntToDouble_ReturnValue_3) == 0x000080, "Member 'W_StashTutorial_C_OnAddItemToInventory::CallFunc_Conv_IntToDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_OnAddItemToInventory, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000088, "Member 'W_StashTutorial_C_OnAddItemToInventory::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_OnAddItemToInventory, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x000090, "Member 'W_StashTutorial_C_OnAddItemToInventory::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_OnAddItemToInventory, CallFunc_Add_DoubleDouble_ReturnValue_3) == 0x000098, "Member 'W_StashTutorial_C_OnAddItemToInventory::CallFunc_Add_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_OnAddItemToInventory, CallFunc_Add_DoubleDouble_ReturnValue_4) == 0x0000A0, "Member 'W_StashTutorial_C_OnAddItemToInventory::CallFunc_Add_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_OnAddItemToInventory, CallFunc_Add_DoubleDouble_ReturnValue_5) == 0x0000A8, "Member 'W_StashTutorial_C_OnAddItemToInventory::CallFunc_Add_DoubleDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_OnAddItemToInventory, K2Node_MakeStruct_Margin) == 0x0000B0, "Member 'W_StashTutorial_C_OnAddItemToInventory::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_OnAddItemToInventory, K2Node_MakeStruct_Margin_1) == 0x0000C0, "Member 'W_StashTutorial_C_OnAddItemToInventory::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_OnAddItemToInventory, CallFunc_Create_ReturnValue) == 0x0000D0, "Member 'W_StashTutorial_C_OnAddItemToInventory::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_OnAddItemToInventory, CallFunc_PlayAnimationForward_ReturnValue) == 0x0000D8, "Member 'W_StashTutorial_C_OnAddItemToInventory::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_OnAddItemToInventory, CallFunc_AddChild_ReturnValue) == 0x0000E0, "Member 'W_StashTutorial_C_OnAddItemToInventory::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_OnAddItemToInventory, K2Node_DynamicCast_AsCanvas_Panel_Slot) == 0x0000E8, "Member 'W_StashTutorial_C_OnAddItemToInventory::K2Node_DynamicCast_AsCanvas_Panel_Slot' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_OnAddItemToInventory, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'W_StashTutorial_C_OnAddItemToInventory::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_OnAddItemToInventory, K2Node_MakeStruct_Left_ImplicitCast) == 0x0000F4, "Member 'W_StashTutorial_C_OnAddItemToInventory::K2Node_MakeStruct_Left_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_OnAddItemToInventory, K2Node_MakeStruct_Top_ImplicitCast) == 0x0000F8, "Member 'W_StashTutorial_C_OnAddItemToInventory::K2Node_MakeStruct_Top_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_OnAddItemToInventory, K2Node_MakeStruct_Top_ImplicitCast_1) == 0x0000FC, "Member 'W_StashTutorial_C_OnAddItemToInventory::K2Node_MakeStruct_Top_ImplicitCast_1' has a wrong offset!");

// Function W_StashTutorial.W_StashTutorial_C.SetInventoryContainer
// 0x0020 (0x0020 - 0x0000)
struct W_StashTutorial_C_SetInventoryContainer final
{
public:
	class UJSIContainer_C*                        Container;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UJSIContainer_C* From, class UJSIContainer_C* To, class UJSI_Slot_C* FromSlotRef, class UJSI_Slot_C* ToSlotRef, bool ToEmptySlot_, bool MovedAll_)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_StashTutorial_C_SetInventoryContainer) == 0x000008, "Wrong alignment on W_StashTutorial_C_SetInventoryContainer");
static_assert(sizeof(W_StashTutorial_C_SetInventoryContainer) == 0x000020, "Wrong size on W_StashTutorial_C_SetInventoryContainer");
static_assert(offsetof(W_StashTutorial_C_SetInventoryContainer, Container) == 0x000000, "Member 'W_StashTutorial_C_SetInventoryContainer::Container' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_SetInventoryContainer, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'W_StashTutorial_C_SetInventoryContainer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_SetInventoryContainer, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'W_StashTutorial_C_SetInventoryContainer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_SetInventoryContainer, CallFunc_IsValid_ReturnValue_1) == 0x000019, "Member 'W_StashTutorial_C_SetInventoryContainer::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function W_StashTutorial.W_StashTutorial_C.SetStashContainer
// 0x0010 (0x0010 - 0x0000)
struct W_StashTutorial_C_SetStashContainer final
{
public:
	class UJSIContainer_C*                        Container;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_StashTutorial_C_SetStashContainer) == 0x000008, "Wrong alignment on W_StashTutorial_C_SetStashContainer");
static_assert(sizeof(W_StashTutorial_C_SetStashContainer) == 0x000010, "Wrong size on W_StashTutorial_C_SetStashContainer");
static_assert(offsetof(W_StashTutorial_C_SetStashContainer, Container) == 0x000000, "Member 'W_StashTutorial_C_SetStashContainer::Container' has a wrong offset!");
static_assert(offsetof(W_StashTutorial_C_SetStashContainer, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'W_StashTutorial_C_SetStashContainer::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function W_StashTutorial.W_StashTutorial_C.SolveZOrder
// 0x0008 (0x0008 - 0x0000)
struct W_StashTutorial_C_SolveZOrder final
{
public:
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_StashTutorial_C_SolveZOrder) == 0x000008, "Wrong alignment on W_StashTutorial_C_SolveZOrder");
static_assert(sizeof(W_StashTutorial_C_SolveZOrder) == 0x000008, "Wrong size on W_StashTutorial_C_SolveZOrder");
static_assert(offsetof(W_StashTutorial_C_SolveZOrder, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000000, "Member 'W_StashTutorial_C_SolveZOrder::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");

}

