#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_StaticInteract

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function W_StaticInteract.W_StaticInteract_C.CustomEvent
// 0x0001 (0x0001 - 0x0000)
struct W_StaticInteract_C_CustomEvent final
{
public:
	bool                                          Block_;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_StaticInteract_C_CustomEvent) == 0x000001, "Wrong alignment on W_StaticInteract_C_CustomEvent");
static_assert(sizeof(W_StaticInteract_C_CustomEvent) == 0x000001, "Wrong size on W_StaticInteract_C_CustomEvent");
static_assert(offsetof(W_StaticInteract_C_CustomEvent, Block_) == 0x000000, "Member 'W_StaticInteract_C_CustomEvent::Block_' has a wrong offset!");

// Function W_StaticInteract.W_StaticInteract_C.ExecuteUbergraph_W_StaticInteract
// 0x0080 (0x0080 - 0x0000)
struct W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool Block_)>                  K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_BarChair_C*                         K2Node_DynamicCast_AsBP_Bar_Chair;                 // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0064(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Block_;                         // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0077(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract) == 0x000008, "Wrong alignment on W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract");
static_assert(sizeof(W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract) == 0x000080, "Wrong size on W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract");
static_assert(offsetof(W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract, EntryPoint) == 0x000000, "Member 'W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract, K2Node_DynamicCast_AsBP_Bar_Chair) == 0x000018, "Member 'W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract::K2Node_DynamicCast_AsBP_Bar_Chair' has a wrong offset!");
static_assert(offsetof(W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract, Temp_bool_Variable) == 0x000021, "Member 'W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract, CallFunc_IsValid_ReturnValue_1) == 0x000022, "Member 'W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract, Temp_byte_Variable) == 0x000023, "Member 'W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract, Temp_byte_Variable_1) == 0x000024, "Member 'W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract, K2Node_Select_Default) == 0x000025, "Member 'W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract, CallFunc_IsValid_ReturnValue_2) == 0x000026, "Member 'W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract, CallFunc_IsValid_ReturnValue_3) == 0x000027, "Member 'W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000028, "Member 'W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000030, "Member 'W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract, K2Node_DynamicCast_AsSurvival_Player) == 0x000038, "Member 'W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000048, "Member 'W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract, CallFunc_IsValid_ReturnValue_4) == 0x000050, "Member 'W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract, K2Node_CreateDelegate_OutputDelegate_1) == 0x000054, "Member 'W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract, K2Node_CreateDelegate_OutputDelegate_2) == 0x000064, "Member 'W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract, K2Node_CustomEvent_Block_) == 0x000074, "Member 'W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract::K2Node_CustomEvent_Block_' has a wrong offset!");
static_assert(offsetof(W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract, CallFunc_Not_PreBool_ReturnValue) == 0x000075, "Member 'W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract, K2Node_Event_IsDesignTime) == 0x000076, "Member 'W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract, CallFunc_BooleanAND_ReturnValue) == 0x000077, "Member 'W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract, K2Node_SwitchEnum_CmpSuccess) == 0x000078, "Member 'W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract, CallFunc_Not_PreBool_ReturnValue_1) == 0x000079, "Member 'W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract, CallFunc_BooleanAND_ReturnValue_1) == 0x00007A, "Member 'W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract, CallFunc_Not_PreBool_ReturnValue_2) == 0x00007B, "Member 'W_StaticInteract_C_ExecuteUbergraph_W_StaticInteract::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");

// Function W_StaticInteract.W_StaticInteract_C.Get Interact
// 0x0038 (0x0038 - 0x0000)
struct W_StaticInteract_C_Get_Interact final
{
public:
	double                                        Time;                                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_Interact_C*                          InteractWidget;                                    // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_Interact_C*                          K2Node_Select_Default;                             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default_1;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_StaticInteract_C_Get_Interact) == 0x000008, "Wrong alignment on W_StaticInteract_C_Get_Interact");
static_assert(sizeof(W_StaticInteract_C_Get_Interact) == 0x000038, "Wrong size on W_StaticInteract_C_Get_Interact");
static_assert(offsetof(W_StaticInteract_C_Get_Interact, Time) == 0x000000, "Member 'W_StaticInteract_C_Get_Interact::Time' has a wrong offset!");
static_assert(offsetof(W_StaticInteract_C_Get_Interact, InteractWidget) == 0x000008, "Member 'W_StaticInteract_C_Get_Interact::InteractWidget' has a wrong offset!");
static_assert(offsetof(W_StaticInteract_C_Get_Interact, Temp_real_Variable) == 0x000010, "Member 'W_StaticInteract_C_Get_Interact::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(W_StaticInteract_C_Get_Interact, Temp_real_Variable_1) == 0x000018, "Member 'W_StaticInteract_C_Get_Interact::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(W_StaticInteract_C_Get_Interact, Temp_int_Variable) == 0x000020, "Member 'W_StaticInteract_C_Get_Interact::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(W_StaticInteract_C_Get_Interact, Temp_int_Variable_1) == 0x000024, "Member 'W_StaticInteract_C_Get_Interact::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(W_StaticInteract_C_Get_Interact, K2Node_Select_Default) == 0x000028, "Member 'W_StaticInteract_C_Get_Interact::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_StaticInteract_C_Get_Interact, K2Node_Select_Default_1) == 0x000030, "Member 'W_StaticInteract_C_Get_Interact::K2Node_Select_Default_1' has a wrong offset!");

// Function W_StaticInteract.W_StaticInteract_C.InitButton_E
// 0x0020 (0x0020 - 0x0000)
struct W_StaticInteract_C_InitButton_E final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_StaticInteract_C_InitButton_E) == 0x000004, "Wrong alignment on W_StaticInteract_C_InitButton_E");
static_assert(sizeof(W_StaticInteract_C_InitButton_E) == 0x000020, "Wrong size on W_StaticInteract_C_InitButton_E");
static_assert(offsetof(W_StaticInteract_C_InitButton_E, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'W_StaticInteract_C_InitButton_E::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_StaticInteract_C_InitButton_E, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'W_StaticInteract_C_InitButton_E::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function W_StaticInteract.W_StaticInteract_C.InitButton_F
// 0x0020 (0x0020 - 0x0000)
struct W_StaticInteract_C_InitButton_F final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_StaticInteract_C_InitButton_F) == 0x000004, "Wrong alignment on W_StaticInteract_C_InitButton_F");
static_assert(sizeof(W_StaticInteract_C_InitButton_F) == 0x000020, "Wrong size on W_StaticInteract_C_InitButton_F");
static_assert(offsetof(W_StaticInteract_C_InitButton_F, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'W_StaticInteract_C_InitButton_F::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_StaticInteract_C_InitButton_F, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'W_StaticInteract_C_InitButton_F::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function W_StaticInteract.W_StaticInteract_C.On Hold_E
// 0x0018 (0x0018 - 0x0000)
struct W_StaticInteract_C_On_Hold_E final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_StaticInteract_C_On_Hold_E) == 0x000008, "Wrong alignment on W_StaticInteract_C_On_Hold_E");
static_assert(sizeof(W_StaticInteract_C_On_Hold_E) == 0x000018, "Wrong size on W_StaticInteract_C_On_Hold_E");
static_assert(offsetof(W_StaticInteract_C_On_Hold_E, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'W_StaticInteract_C_On_Hold_E::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_StaticInteract_C_On_Hold_E, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000010, "Member 'W_StaticInteract_C_On_Hold_E::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function W_StaticInteract.W_StaticInteract_C.On Hold_F
// 0x0018 (0x0018 - 0x0000)
struct W_StaticInteract_C_On_Hold_F final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_StaticInteract_C_On_Hold_F) == 0x000008, "Wrong alignment on W_StaticInteract_C_On_Hold_F");
static_assert(sizeof(W_StaticInteract_C_On_Hold_F) == 0x000018, "Wrong size on W_StaticInteract_C_On_Hold_F");
static_assert(offsetof(W_StaticInteract_C_On_Hold_F, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'W_StaticInteract_C_On_Hold_F::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_StaticInteract_C_On_Hold_F, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000010, "Member 'W_StaticInteract_C_On_Hold_F::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function W_StaticInteract.W_StaticInteract_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_StaticInteract_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_StaticInteract_C_PreConstruct) == 0x000001, "Wrong alignment on W_StaticInteract_C_PreConstruct");
static_assert(sizeof(W_StaticInteract_C_PreConstruct) == 0x000001, "Wrong size on W_StaticInteract_C_PreConstruct");
static_assert(offsetof(W_StaticInteract_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_StaticInteract_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_StaticInteract.W_StaticInteract_C.Pressed_E
// 0x0020 (0x0020 - 0x0000)
struct W_StaticInteract_C_Pressed_E final
{
public:
	bool                                          CallFunc_K2_TimerExistsHandle_ReturnValue;         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_StaticInteract_C_Pressed_E) == 0x000008, "Wrong alignment on W_StaticInteract_C_Pressed_E");
static_assert(sizeof(W_StaticInteract_C_Pressed_E) == 0x000020, "Wrong size on W_StaticInteract_C_Pressed_E");
static_assert(offsetof(W_StaticInteract_C_Pressed_E, CallFunc_K2_TimerExistsHandle_ReturnValue) == 0x000000, "Member 'W_StaticInteract_C_Pressed_E::CallFunc_K2_TimerExistsHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_StaticInteract_C_Pressed_E, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'W_StaticInteract_C_Pressed_E::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_StaticInteract_C_Pressed_E, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'W_StaticInteract_C_Pressed_E::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function W_StaticInteract.W_StaticInteract_C.Pressed_F
// 0x0020 (0x0020 - 0x0000)
struct W_StaticInteract_C_Pressed_F final
{
public:
	bool                                          CallFunc_K2_TimerExistsHandle_ReturnValue;         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_StaticInteract_C_Pressed_F) == 0x000008, "Wrong alignment on W_StaticInteract_C_Pressed_F");
static_assert(sizeof(W_StaticInteract_C_Pressed_F) == 0x000020, "Wrong size on W_StaticInteract_C_Pressed_F");
static_assert(offsetof(W_StaticInteract_C_Pressed_F, CallFunc_K2_TimerExistsHandle_ReturnValue) == 0x000000, "Member 'W_StaticInteract_C_Pressed_F::CallFunc_K2_TimerExistsHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_StaticInteract_C_Pressed_F, CallFunc_BooleanOR_ReturnValue) == 0x000001, "Member 'W_StaticInteract_C_Pressed_F::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_StaticInteract_C_Pressed_F, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'W_StaticInteract_C_Pressed_F::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_StaticInteract_C_Pressed_F, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'W_StaticInteract_C_Pressed_F::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function W_StaticInteract.W_StaticInteract_C.ShowOpenMenu 
// 0x0028 (0x0028 - 0x0000)
struct W_StaticInteract_C_ShowOpenMenu_ final
{
public:
	bool                                          Show;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WithAnim;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default;                             // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_StaticInteract_C_ShowOpenMenu_) == 0x000008, "Wrong alignment on W_StaticInteract_C_ShowOpenMenu_");
static_assert(sizeof(W_StaticInteract_C_ShowOpenMenu_) == 0x000028, "Wrong size on W_StaticInteract_C_ShowOpenMenu_");
static_assert(offsetof(W_StaticInteract_C_ShowOpenMenu_, Show) == 0x000000, "Member 'W_StaticInteract_C_ShowOpenMenu_::Show' has a wrong offset!");
static_assert(offsetof(W_StaticInteract_C_ShowOpenMenu_, WithAnim) == 0x000001, "Member 'W_StaticInteract_C_ShowOpenMenu_::WithAnim' has a wrong offset!");
static_assert(offsetof(W_StaticInteract_C_ShowOpenMenu_, Temp_bool_Variable) == 0x000002, "Member 'W_StaticInteract_C_ShowOpenMenu_::Temp_bool_Variable' has a wrong offset!");
