#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_StatCell

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "E_StatEndGame_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_StatCell.W_StatCell_C
// 0x0068 (0x02E8 - 0x0280)
class UW_StatCell_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_BG;                                          // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Cell;                                      // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_StatCount;                                    // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_StatName;                                     // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	ESlateVisibility                              ImageBG_Toggle;                                    // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   StatName;                                          // 0x02B0(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   StatCount;                                         // 0x02C8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	float                                         In_Width_Override;                                 // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	E_StatEndGame                                 StatType;                                          // 0x02E4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_W_StatCell(int32 EntryPoint);
	void GetStatsType(E_StatEndGame* Param_StatType);
	void PreConstruct(bool IsDesignTime);
	void SetStatCount(int64 Count);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_StatCell_C">();
	}
	static class UW_StatCell_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_StatCell_C>();
	}
};
static_assert(alignof(UW_StatCell_C) == 0x000008, "Wrong alignment on UW_StatCell_C");
static_assert(sizeof(UW_StatCell_C) == 0x0002E8, "Wrong size on UW_StatCell_C");
static_assert(offsetof(UW_StatCell_C, UberGraphFrame) == 0x000280, "Member 'UW_StatCell_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_StatCell_C, Image_BG) == 0x000288, "Member 'UW_StatCell_C::Image_BG' has a wrong offset!");
static_assert(offsetof(UW_StatCell_C, SizeBox_Cell) == 0x000290, "Member 'UW_StatCell_C::SizeBox_Cell' has a wrong offset!");
static_assert(offsetof(UW_StatCell_C, Text_StatCount) == 0x000298, "Member 'UW_StatCell_C::Text_StatCount' has a wrong offset!");
static_assert(offsetof(UW_StatCell_C, Text_StatName) == 0x0002A0, "Member 'UW_StatCell_C::Text_StatName' has a wrong offset!");
static_assert(offsetof(UW_StatCell_C, ImageBG_Toggle) == 0x0002A8, "Member 'UW_StatCell_C::ImageBG_Toggle' has a wrong offset!");
static_assert(offsetof(UW_StatCell_C, StatName) == 0x0002B0, "Member 'UW_StatCell_C::StatName' has a wrong offset!");
static_assert(offsetof(UW_StatCell_C, StatCount) == 0x0002C8, "Member 'UW_StatCell_C::StatCount' has a wrong offset!");
static_assert(offsetof(UW_StatCell_C, In_Width_Override) == 0x0002E0, "Member 'UW_StatCell_C::In_Width_Override' has a wrong offset!");
static_assert(offsetof(UW_StatCell_C, StatType) == 0x0002E4, "Member 'UW_StatCell_C::StatType' has a wrong offset!");

}

