#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_TranzitZoneSlot

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "FMODStudio_structs.hpp"


namespace SDK::Params
{

// Function W_TranzitZoneSlot.W_TranzitZoneSlot_C.ExecuteUbergraph_W_TranzitZoneSlot
// 0x0028 (0x0028 - 0x0000)
struct W_TranzitZoneSlot_C_ExecuteUbergraph_W_TranzitZoneSlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0010(0x0014)()
};
static_assert(alignof(W_TranzitZoneSlot_C_ExecuteUbergraph_W_TranzitZoneSlot) == 0x000008, "Wrong alignment on W_TranzitZoneSlot_C_ExecuteUbergraph_W_TranzitZoneSlot");
static_assert(sizeof(W_TranzitZoneSlot_C_ExecuteUbergraph_W_TranzitZoneSlot) == 0x000028, "Wrong size on W_TranzitZoneSlot_C_ExecuteUbergraph_W_TranzitZoneSlot");
static_assert(offsetof(W_TranzitZoneSlot_C_ExecuteUbergraph_W_TranzitZoneSlot, EntryPoint) == 0x000000, "Member 'W_TranzitZoneSlot_C_ExecuteUbergraph_W_TranzitZoneSlot::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_TranzitZoneSlot_C_ExecuteUbergraph_W_TranzitZoneSlot, K2Node_Event_IsDesignTime) == 0x000004, "Member 'W_TranzitZoneSlot_C_ExecuteUbergraph_W_TranzitZoneSlot::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_TranzitZoneSlot_C_ExecuteUbergraph_W_TranzitZoneSlot, CallFunc_PlayEvent2D_ReturnValue) == 0x000008, "Member 'W_TranzitZoneSlot_C_ExecuteUbergraph_W_TranzitZoneSlot::CallFunc_PlayEvent2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_TranzitZoneSlot_C_ExecuteUbergraph_W_TranzitZoneSlot, K2Node_MakeStruct_SlateColor) == 0x000010, "Member 'W_TranzitZoneSlot_C_ExecuteUbergraph_W_TranzitZoneSlot::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function W_TranzitZoneSlot.W_TranzitZoneSlot_C.Init
// 0x00D0 (0x00D0 - 0x0000)
struct W_TranzitZoneSlot_C_Init final
{
public:
	struct FSlateBrush                            CallFunc_MakeBrushFromSprite_ReturnValue;          // 0x0000(0x00D0)()
};
static_assert(alignof(W_TranzitZoneSlot_C_Init) == 0x000010, "Wrong alignment on W_TranzitZoneSlot_C_Init");
static_assert(sizeof(W_TranzitZoneSlot_C_Init) == 0x0000D0, "Wrong size on W_TranzitZoneSlot_C_Init");
static_assert(offsetof(W_TranzitZoneSlot_C_Init, CallFunc_MakeBrushFromSprite_ReturnValue) == 0x000000, "Member 'W_TranzitZoneSlot_C_Init::CallFunc_MakeBrushFromSprite_ReturnValue' has a wrong offset!");

// Function W_TranzitZoneSlot.W_TranzitZoneSlot_C.OnSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_TranzitZoneSlot_C_OnSelected__DelegateSignature final
{
public:
	class UW_TranzitZoneSlot_C*                   Ref;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_TranzitZoneSlot_C_OnSelected__DelegateSignature) == 0x000008, "Wrong alignment on W_TranzitZoneSlot_C_OnSelected__DelegateSignature");
static_assert(sizeof(W_TranzitZoneSlot_C_OnSelected__DelegateSignature) == 0x000008, "Wrong size on W_TranzitZoneSlot_C_OnSelected__DelegateSignature");
static_assert(offsetof(W_TranzitZoneSlot_C_OnSelected__DelegateSignature, Ref) == 0x000000, "Member 'W_TranzitZoneSlot_C_OnSelected__DelegateSignature::Ref' has a wrong offset!");

// Function W_TranzitZoneSlot.W_TranzitZoneSlot_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_TranzitZoneSlot_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_TranzitZoneSlot_C_PreConstruct) == 0x000001, "Wrong alignment on W_TranzitZoneSlot_C_PreConstruct");
static_assert(sizeof(W_TranzitZoneSlot_C_PreConstruct) == 0x000001, "Wrong size on W_TranzitZoneSlot_C_PreConstruct");
static_assert(offsetof(W_TranzitZoneSlot_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_TranzitZoneSlot_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_TranzitZoneSlot.W_TranzitZoneSlot_C.SetHovered
// 0x0010 (0x0010 - 0x0000)
struct W_TranzitZoneSlot_C_SetHovered final
{
public:
	bool                                          With_Anim;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Hovered;                                           // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_TranzitZoneSlot_C_SetHovered) == 0x000008, "Wrong alignment on W_TranzitZoneSlot_C_SetHovered");
static_assert(sizeof(W_TranzitZoneSlot_C_SetHovered) == 0x000010, "Wrong size on W_TranzitZoneSlot_C_SetHovered");
static_assert(offsetof(W_TranzitZoneSlot_C_SetHovered, With_Anim) == 0x000000, "Member 'W_TranzitZoneSlot_C_SetHovered::With_Anim' has a wrong offset!");
static_assert(offsetof(W_TranzitZoneSlot_C_SetHovered, Hovered) == 0x000001, "Member 'W_TranzitZoneSlot_C_SetHovered::Hovered' has a wrong offset!");
static_assert(offsetof(W_TranzitZoneSlot_C_SetHovered, Temp_bool_Variable) == 0x000002, "Member 'W_TranzitZoneSlot_C_SetHovered::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_TranzitZoneSlot_C_SetHovered, Temp_byte_Variable) == 0x000003, "Member 'W_TranzitZoneSlot_C_SetHovered::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_TranzitZoneSlot_C_SetHovered, Temp_byte_Variable_1) == 0x000004, "Member 'W_TranzitZoneSlot_C_SetHovered::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_TranzitZoneSlot_C_SetHovered, K2Node_Select_Default) == 0x000005, "Member 'W_TranzitZoneSlot_C_SetHovered::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_TranzitZoneSlot_C_SetHovered, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'W_TranzitZoneSlot_C_SetHovered::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function W_TranzitZoneSlot.W_TranzitZoneSlot_C.SetHovered_Current
// 0x0010 (0x0010 - 0x0000)
struct W_TranzitZoneSlot_C_SetHovered_Current final
{
public:
	bool                                          With_Anim;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Hovered;                                           // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_TranzitZoneSlot_C_SetHovered_Current) == 0x000008, "Wrong alignment on W_TranzitZoneSlot_C_SetHovered_Current");
static_assert(sizeof(W_TranzitZoneSlot_C_SetHovered_Current) == 0x000010, "Wrong size on W_TranzitZoneSlot_C_SetHovered_Current");
static_assert(offsetof(W_TranzitZoneSlot_C_SetHovered_Current, With_Anim) == 0x000000, "Member 'W_TranzitZoneSlot_C_SetHovered_Current::With_Anim' has a wrong offset!");
static_assert(offsetof(W_TranzitZoneSlot_C_SetHovered_Current, Hovered) == 0x000001, "Member 'W_TranzitZoneSlot_C_SetHovered_Current::Hovered' has a wrong offset!");
static_assert(offsetof(W_TranzitZoneSlot_C_SetHovered_Current, Temp_bool_Variable) == 0x000002, "Member 'W_TranzitZoneSlot_C_SetHovered_Current::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_TranzitZoneSlot_C_SetHovered_Current, Temp_byte_Variable) == 0x000003, "Member 'W_TranzitZoneSlot_C_SetHovered_Current::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_TranzitZoneSlot_C_SetHovered_Current, Temp_byte_Variable_1) == 0x000004, "Member 'W_TranzitZoneSlot_C_SetHovered_Current::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_TranzitZoneSlot_C_SetHovered_Current, K2Node_Select_Default) == 0x000005, "Member 'W_TranzitZoneSlot_C_SetHovered_Current::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_TranzitZoneSlot_C_SetHovered_Current, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'W_TranzitZoneSlot_C_SetHovered_Current::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

