#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_TutorHint

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_TutorHint.W_TutorHint_C.ExecuteUbergraph_W_TutorHint
// 0x03D8 (0x03D8 - 0x0000)
struct W_TutorHint_C_ExecuteUbergraph_W_TutorHint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_3;       // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_2;       // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Cold_Actor;                     // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Thirst_Actor;                   // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Hunger_Actor;                   // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin_2;                        // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin_3;                        // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_2;           // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_4;       // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_3;       // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_5;       // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameHUD_C>        K2Node_DynamicCast_AsBPI_Game_HUD;                 // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveMark_Success;                       // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_4;       // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_RagActor;                       // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_6;       // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_5;       // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_7;       // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_6;       // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALP_Sportbag_for_start_level_C*         K2Node_DynamicCast_AsLP_Sportbag_For_Start_Level;  // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_8;       // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_7;       // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0150(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_9;       // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_8;       // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin_4;                        // 0x0180(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_3;           // 0x0190(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0198(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_10;      // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_9;       // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_2;            // 0x01C0(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_3;            // 0x01D8(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_4;            // 0x01F0(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_5;            // 0x0208(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_6;            // 0x0220(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_7;            // 0x0238(0x0018)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue_1;                     // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameHUD_C>        K2Node_DynamicCast_AsBPI_Game_HUD_1;               // 0x0260(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_GameHUD_C>        K2Node_DynamicCast_AsBPI_Game_HUD_2;               // 0x0278(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddMark_Success;                          // 0x0289(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28A[0x6];                                      // 0x028A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_Mark_C*                              CallFunc_AddMark_WMark;                            // 0x0290(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddMark_Success_1;                        // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_Mark_C*                              CallFunc_AddMark_WMark_1;                          // 0x02A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameHUD_C>        K2Node_DynamicCast_AsBPI_Game_HUD_3;               // 0x02A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_GameHUD_C>        K2Node_DynamicCast_AsBPI_Game_HUD_4;               // 0x02C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddMark_Success_2;                        // 0x02D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D2[0x6];                                      // 0x02D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_Mark_C*                              CallFunc_AddMark_WMark_2;                          // 0x02D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddMark_Success_3;                        // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_Mark_C*                              CallFunc_AddMark_WMark_3;                          // 0x02E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_8;            // 0x02F0(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_9;            // 0x0308(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_10;           // 0x0320(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_11;      // 0x0338(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_10;      // 0x0340(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_12;      // 0x0348(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_13;      // 0x0350(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_14;      // 0x0358(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_11;      // 0x0360(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_12;      // 0x0368(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_13;      // 0x0370(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_11;           // 0x0378(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_15;      // 0x0390(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin_5;                        // 0x0398(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_4;           // 0x03A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin_6;                        // 0x03B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_5;           // 0x03C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_6;           // 0x03C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_16;      // 0x03D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint) == 0x000008, "Wrong alignment on W_TutorHint_C_ExecuteUbergraph_W_TutorHint");
static_assert(sizeof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint) == 0x0003D8, "Wrong size on W_TutorHint_C_ExecuteUbergraph_W_TutorHint");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, EntryPoint) == 0x000000, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, K2Node_MakeStruct_Margin) == 0x000004, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, K2Node_MakeStruct_Margin_1) == 0x000014, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_IsValid_ReturnValue) == 0x000024, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_PlayAnimationForward_ReturnValue) == 0x000028, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000030, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000038, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_PlayAnimationForward_ReturnValue_2) == 0x000040, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_PlayAnimationForward_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_PlayAnimationForward_ReturnValue_3) == 0x000048, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_PlayAnimationForward_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_IsValid_ReturnValue_1) == 0x000050, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_PlayAnimation_ReturnValue) == 0x000058, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x000060, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000068, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_PlayAnimationReverse_ReturnValue_2) == 0x000070, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_PlayAnimationReverse_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, K2Node_CustomEvent_Cold_Actor) == 0x000078, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::K2Node_CustomEvent_Cold_Actor' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, K2Node_CustomEvent_Thirst_Actor) == 0x000080, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::K2Node_CustomEvent_Thirst_Actor' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, K2Node_CustomEvent_Hunger_Actor) == 0x000088, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::K2Node_CustomEvent_Hunger_Actor' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, K2Node_MakeStruct_Margin_2) == 0x000090, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::K2Node_MakeStruct_Margin_2' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x0000A0, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, K2Node_MakeStruct_Margin_3) == 0x0000A8, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::K2Node_MakeStruct_Margin_3' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_SlotAsCanvasSlot_ReturnValue_2) == 0x0000B8, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_SlotAsCanvasSlot_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_PlayAnimationForward_ReturnValue_4) == 0x0000C0, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_PlayAnimationForward_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_PlayAnimationReverse_ReturnValue_3) == 0x0000C8, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_PlayAnimationReverse_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_GetPlayerController_ReturnValue) == 0x0000D0, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_GetHUD_ReturnValue) == 0x0000D8, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_PlayAnimationForward_ReturnValue_5) == 0x0000E0, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_PlayAnimationForward_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, K2Node_DynamicCast_AsBPI_Game_HUD) == 0x0000E8, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::K2Node_DynamicCast_AsBPI_Game_HUD' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, K2Node_DynamicCast_bSuccess) == 0x0000F8, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_RemoveMark_Success) == 0x0000F9, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_RemoveMark_Success' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_PlayAnimationReverse_ReturnValue_4) == 0x000100, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_PlayAnimationReverse_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, K2Node_CustomEvent_RagActor) == 0x000108, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::K2Node_CustomEvent_RagActor' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_PlayAnimationForward_ReturnValue_6) == 0x000110, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_PlayAnimationForward_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_PlayAnimationReverse_ReturnValue_5) == 0x000118, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_PlayAnimationReverse_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_PlayAnimationForward_ReturnValue_7) == 0x000120, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_PlayAnimationForward_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_PlayAnimationReverse_ReturnValue_6) == 0x000128, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_PlayAnimationReverse_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, K2Node_DynamicCast_AsLP_Sportbag_For_Start_Level) == 0x000130, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::K2Node_DynamicCast_AsLP_Sportbag_For_Start_Level' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, K2Node_DynamicCast_bSuccess_1) == 0x000138, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_PlayAnimationForward_ReturnValue_8) == 0x000140, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_PlayAnimationForward_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_PlayAnimationReverse_ReturnValue_7) == 0x000148, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_PlayAnimationReverse_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_MakeLiteralText_ReturnValue) == 0x000150, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_PlayAnimationForward_ReturnValue_9) == 0x000168, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_PlayAnimationForward_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_IsValid_ReturnValue_2) == 0x000170, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_PlayAnimationReverse_ReturnValue_8) == 0x000178, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_PlayAnimationReverse_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, K2Node_MakeStruct_Margin_4) == 0x000180, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::K2Node_MakeStruct_Margin_4' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_SlotAsCanvasSlot_ReturnValue_3) == 0x000190, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_SlotAsCanvasSlot_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_MakeLiteralText_ReturnValue_1) == 0x000198, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_PlayAnimationForward_ReturnValue_10) == 0x0001B0, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_PlayAnimationForward_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_PlayAnimationReverse_ReturnValue_9) == 0x0001B8, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_PlayAnimationReverse_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_MakeLiteralText_ReturnValue_2) == 0x0001C0, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_MakeLiteralText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_MakeLiteralText_ReturnValue_3) == 0x0001D8, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_MakeLiteralText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_MakeLiteralText_ReturnValue_4) == 0x0001F0, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_MakeLiteralText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_MakeLiteralText_ReturnValue_5) == 0x000208, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_MakeLiteralText_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_MakeLiteralText_ReturnValue_6) == 0x000220, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_MakeLiteralText_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_MakeLiteralText_ReturnValue_7) == 0x000238, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_MakeLiteralText_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_GetPlayerController_ReturnValue_1) == 0x000250, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_GetHUD_ReturnValue_1) == 0x000258, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_GetHUD_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, K2Node_DynamicCast_AsBPI_Game_HUD_1) == 0x000260, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::K2Node_DynamicCast_AsBPI_Game_HUD_1' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, K2Node_DynamicCast_bSuccess_2) == 0x000270, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, K2Node_DynamicCast_AsBPI_Game_HUD_2) == 0x000278, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::K2Node_DynamicCast_AsBPI_Game_HUD_2' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, K2Node_DynamicCast_bSuccess_3) == 0x000288, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_AddMark_Success) == 0x000289, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_AddMark_Success' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_AddMark_WMark) == 0x000290, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_AddMark_WMark' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_AddMark_Success_1) == 0x000298, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_AddMark_Success_1' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_AddMark_WMark_1) == 0x0002A0, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_AddMark_WMark_1' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, K2Node_DynamicCast_AsBPI_Game_HUD_3) == 0x0002A8, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::K2Node_DynamicCast_AsBPI_Game_HUD_3' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, K2Node_DynamicCast_bSuccess_4) == 0x0002B8, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, K2Node_DynamicCast_AsBPI_Game_HUD_4) == 0x0002C0, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::K2Node_DynamicCast_AsBPI_Game_HUD_4' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, K2Node_DynamicCast_bSuccess_5) == 0x0002D0, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_AddMark_Success_2) == 0x0002D1, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_AddMark_Success_2' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_AddMark_WMark_2) == 0x0002D8, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_AddMark_WMark_2' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_AddMark_Success_3) == 0x0002E0, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_AddMark_Success_3' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_AddMark_WMark_3) == 0x0002E8, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_AddMark_WMark_3' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_MakeLiteralText_ReturnValue_8) == 0x0002F0, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_MakeLiteralText_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_MakeLiteralText_ReturnValue_9) == 0x000308, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_MakeLiteralText_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_MakeLiteralText_ReturnValue_10) == 0x000320, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_MakeLiteralText_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_PlayAnimationForward_ReturnValue_11) == 0x000338, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_PlayAnimationForward_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_PlayAnimationReverse_ReturnValue_10) == 0x000340, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_PlayAnimationReverse_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_PlayAnimationForward_ReturnValue_12) == 0x000348, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_PlayAnimationForward_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_PlayAnimationForward_ReturnValue_13) == 0x000350, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_PlayAnimationForward_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_PlayAnimationForward_ReturnValue_14) == 0x000358, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_PlayAnimationForward_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_PlayAnimationReverse_ReturnValue_11) == 0x000360, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_PlayAnimationReverse_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_PlayAnimationReverse_ReturnValue_12) == 0x000368, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_PlayAnimationReverse_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_PlayAnimationReverse_ReturnValue_13) == 0x000370, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_PlayAnimationReverse_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_MakeLiteralText_ReturnValue_11) == 0x000378, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_MakeLiteralText_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_PlayAnimationForward_ReturnValue_15) == 0x000390, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_PlayAnimationForward_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, K2Node_MakeStruct_Margin_5) == 0x000398, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::K2Node_MakeStruct_Margin_5' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_SlotAsCanvasSlot_ReturnValue_4) == 0x0003A8, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_SlotAsCanvasSlot_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, K2Node_MakeStruct_Margin_6) == 0x0003B0, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::K2Node_MakeStruct_Margin_6' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_SlotAsCanvasSlot_ReturnValue_5) == 0x0003C0, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_SlotAsCanvasSlot_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_SlotAsCanvasSlot_ReturnValue_6) == 0x0003C8, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_SlotAsCanvasSlot_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ExecuteUbergraph_W_TutorHint, CallFunc_PlayAnimationForward_ReturnValue_16) == 0x0003D0, "Member 'W_TutorHint_C_ExecuteUbergraph_W_TutorHint::CallFunc_PlayAnimationForward_ReturnValue_16' has a wrong offset!");

// Function W_TutorHint.W_TutorHint_C.ShowBleedingHint
// 0x0008 (0x0008 - 0x0000)
struct W_TutorHint_C_ShowBleedingHint final
{
public:
	class AActor*                                 Param_RagActor;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_TutorHint_C_ShowBleedingHint) == 0x000008, "Wrong alignment on W_TutorHint_C_ShowBleedingHint");
static_assert(sizeof(W_TutorHint_C_ShowBleedingHint) == 0x000008, "Wrong size on W_TutorHint_C_ShowBleedingHint");
static_assert(offsetof(W_TutorHint_C_ShowBleedingHint, Param_RagActor) == 0x000000, "Member 'W_TutorHint_C_ShowBleedingHint::Param_RagActor' has a wrong offset!");

// Function W_TutorHint.W_TutorHint_C.ShowColdHint
// 0x0008 (0x0008 - 0x0000)
struct W_TutorHint_C_ShowColdHint final
{
public:
	class AActor*                                 Cold_Actor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_TutorHint_C_ShowColdHint) == 0x000008, "Wrong alignment on W_TutorHint_C_ShowColdHint");
static_assert(sizeof(W_TutorHint_C_ShowColdHint) == 0x000008, "Wrong size on W_TutorHint_C_ShowColdHint");
static_assert(offsetof(W_TutorHint_C_ShowColdHint, Cold_Actor) == 0x000000, "Member 'W_TutorHint_C_ShowColdHint::Cold_Actor' has a wrong offset!");

// Function W_TutorHint.W_TutorHint_C.ShowHungerAndThirstHint
// 0x0010 (0x0010 - 0x0000)
struct W_TutorHint_C_ShowHungerAndThirstHint final
{
public:
	class AActor*                                 Thirst_Actor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Hunger_Actor;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_TutorHint_C_ShowHungerAndThirstHint) == 0x000008, "Wrong alignment on W_TutorHint_C_ShowHungerAndThirstHint");
static_assert(sizeof(W_TutorHint_C_ShowHungerAndThirstHint) == 0x000010, "Wrong size on W_TutorHint_C_ShowHungerAndThirstHint");
static_assert(offsetof(W_TutorHint_C_ShowHungerAndThirstHint, Thirst_Actor) == 0x000000, "Member 'W_TutorHint_C_ShowHungerAndThirstHint::Thirst_Actor' has a wrong offset!");
static_assert(offsetof(W_TutorHint_C_ShowHungerAndThirstHint, Hunger_Actor) == 0x000008, "Member 'W_TutorHint_C_ShowHungerAndThirstHint::Hunger_Actor' has a wrong offset!");

}

