#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_UsageRequest

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function W_UsageRequest.W_UsageRequest_C.ExecuteUbergraph_W_UsageRequest
// 0x00E0 (0x00E0 - 0x0000)
struct W_UsageRequest_C_ExecuteUbergraph_W_UsageRequest final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ReferenceParm)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0040(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0058(0x0010)(ReferenceParm)
	class UMPContainerWidget_C*                   CallFunc_GetMainContainer_ContainerWidget;         // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0070(0x0018)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvPC_C*                              K2Node_DynamicCast_AsSurv_PC;                      // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_SurvPC_C>         CallFunc_GetInventoryWidget_self_CastInput;        // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMPInGameInventory_C*                   CallFunc_GetInventoryWidget_Widget;                // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDropItemAmountSelector_C*              CallFunc_Create_ReturnValue;                       // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x00C8(0x0018)()
};
static_assert(alignof(W_UsageRequest_C_ExecuteUbergraph_W_UsageRequest) == 0x000008, "Wrong alignment on W_UsageRequest_C_ExecuteUbergraph_W_UsageRequest");
static_assert(sizeof(W_UsageRequest_C_ExecuteUbergraph_W_UsageRequest) == 0x0000E0, "Wrong size on W_UsageRequest_C_ExecuteUbergraph_W_UsageRequest");
static_assert(offsetof(W_UsageRequest_C_ExecuteUbergraph_W_UsageRequest, EntryPoint) == 0x000000, "Member 'W_UsageRequest_C_ExecuteUbergraph_W_UsageRequest::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_UsageRequest_C_ExecuteUbergraph_W_UsageRequest, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'W_UsageRequest_C_ExecuteUbergraph_W_UsageRequest::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_UsageRequest_C_ExecuteUbergraph_W_UsageRequest, Temp_bool_Variable) == 0x000010, "Member 'W_UsageRequest_C_ExecuteUbergraph_W_UsageRequest::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_UsageRequest_C_ExecuteUbergraph_W_UsageRequest, CallFunc_K2_GetPawn_ReturnValue) == 0x000018, "Member 'W_UsageRequest_C_ExecuteUbergraph_W_UsageRequest::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_UsageRequest_C_ExecuteUbergraph_W_UsageRequest, K2Node_MakeArray_Array) == 0x000020, "Member 'W_UsageRequest_C_ExecuteUbergraph_W_UsageRequest::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_UsageRequest_C_ExecuteUbergraph_W_UsageRequest, K2Node_DynamicCast_AsSurvival_Player) == 0x000030, "Member 'W_UsageRequest_C_ExecuteUbergraph_W_UsageRequest::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(W_UsageRequest_C_ExecuteUbergraph_W_UsageRequest, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'W_UsageRequest_C_ExecuteUbergraph_W_UsageRequest::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_UsageRequest_C_ExecuteUbergraph_W_UsageRequest, CallFunc_Format_ReturnValue) == 0x000040, "Member 'W_UsageRequest_C_ExecuteUbergraph_W_UsageRequest::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_UsageRequest_C_ExecuteUbergraph_W_UsageRequest, K2Node_MakeArray_Array_1) == 0x000058, "Member 'W_UsageRequest_C_ExecuteUbergraph_W_UsageRequest::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(W_UsageRequest_C_ExecuteUbergraph_W_UsageRequest, CallFunc_GetMainContainer_ContainerWidget) == 0x000068, "Member 'W_UsageRequest_C_ExecuteUbergraph_W_UsageRequest::CallFunc_GetMainContainer_ContainerWidget' has a wrong offset!");
static_assert(offsetof(W_UsageRequest_C_ExecuteUbergraph_W_UsageRequest, CallFunc_Format_ReturnValue_1) == 0x000070, "Member 'W_UsageRequest_C_ExecuteUbergraph_W_UsageRequest::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_UsageRequest_C_ExecuteUbergraph_W_UsageRequest, CallFunc_GetPlayerController_ReturnValue_1) == 0x000088, "Member 'W_UsageRequest_C_ExecuteUbergraph_W_UsageRequest::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_UsageRequest_C_ExecuteUbergraph_W_UsageRequest, K2Node_DynamicCast_AsSurv_PC) == 0x000090, "Member 'W_UsageRequest_C_ExecuteUbergraph_W_UsageRequest::K2Node_DynamicCast_AsSurv_PC' has a wrong offset!");
static_assert(offsetof(W_UsageRequest_C_ExecuteUbergraph_W_UsageRequest, K2Node_DynamicCast_bSuccess_1) == 0x000098, "Member 'W_UsageRequest_C_ExecuteUbergraph_W_UsageRequest::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_UsageRequest_C_ExecuteUbergraph_W_UsageRequest, CallFunc_GetInventoryWidget_self_CastInput) == 0x0000A0, "Member 'W_UsageRequest_C_ExecuteUbergraph_W_UsageRequest::CallFunc_GetInventoryWidget_self_CastInput' has a wrong offset!");
static_assert(offsetof(W_UsageRequest_C_ExecuteUbergraph_W_UsageRequest, CallFunc_GetInventoryWidget_Widget) == 0x0000B0, "Member 'W_UsageRequest_C_ExecuteUbergraph_W_UsageRequest::CallFunc_GetInventoryWidget_Widget' has a wrong offset!");
static_assert(offsetof(W_UsageRequest_C_ExecuteUbergraph_W_UsageRequest, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x0000B8, "Member 'W_UsageRequest_C_ExecuteUbergraph_W_UsageRequest::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_UsageRequest_C_ExecuteUbergraph_W_UsageRequest, CallFunc_Create_ReturnValue) == 0x0000C0, "Member 'W_UsageRequest_C_ExecuteUbergraph_W_UsageRequest::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_UsageRequest_C_ExecuteUbergraph_W_UsageRequest, K2Node_Select_Default) == 0x0000C8, "Member 'W_UsageRequest_C_ExecuteUbergraph_W_UsageRequest::K2Node_Select_Default' has a wrong offset!");

// Function W_UsageRequest.W_UsageRequest_C.On_Background_MouseButtonDown
// 0x0240 (0x0240 - 0x0000)
struct W_UsageRequest_C_On_Background_MouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0168(0x00B8)()
	struct FKey                                   CallFunc_PointerEvent_GetEffectingButton_ReturnValue; // 0x0220(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_1;          // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x023A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_UsageRequest_C_On_Background_MouseButtonDown) == 0x000008, "Wrong alignment on W_UsageRequest_C_On_Background_MouseButtonDown");
static_assert(sizeof(W_UsageRequest_C_On_Background_MouseButtonDown) == 0x000240, "Wrong size on W_UsageRequest_C_On_Background_MouseButtonDown");
static_assert(offsetof(W_UsageRequest_C_On_Background_MouseButtonDown, MyGeometry) == 0x000000, "Member 'W_UsageRequest_C_On_Background_MouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_UsageRequest_C_On_Background_MouseButtonDown, MouseEvent) == 0x000038, "Member 'W_UsageRequest_C_On_Background_MouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(W_UsageRequest_C_On_Background_MouseButtonDown, ReturnValue) == 0x0000B0, "Member 'W_UsageRequest_C_On_Background_MouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_UsageRequest_C_On_Background_MouseButtonDown, CallFunc_Handled_ReturnValue) == 0x000168, "Member 'W_UsageRequest_C_On_Background_MouseButtonDown::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_UsageRequest_C_On_Background_MouseButtonDown, CallFunc_PointerEvent_GetEffectingButton_ReturnValue) == 0x000220, "Member 'W_UsageRequest_C_On_Background_MouseButtonDown::CallFunc_PointerEvent_GetEffectingButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_UsageRequest_C_On_Background_MouseButtonDown, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000238, "Member 'W_UsageRequest_C_On_Background_MouseButtonDown::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_UsageRequest_C_On_Background_MouseButtonDown, CallFunc_EqualEqual_KeyKey_ReturnValue_1) == 0x000239, "Member 'W_UsageRequest_C_On_Background_MouseButtonDown::CallFunc_EqualEqual_KeyKey_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_UsageRequest_C_On_Background_MouseButtonDown, CallFunc_BooleanOR_ReturnValue) == 0x00023A, "Member 'W_UsageRequest_C_On_Background_MouseButtonDown::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function W_UsageRequest.W_UsageRequest_C.ToggleVisibility
// 0x0001 (0x0001 - 0x0000)
struct W_UsageRequest_C_ToggleVisibility final
{
public:
	bool                                          Param_Visibility;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_UsageRequest_C_ToggleVisibility) == 0x000001, "Wrong alignment on W_UsageRequest_C_ToggleVisibility");
static_assert(sizeof(W_UsageRequest_C_ToggleVisibility) == 0x000001, "Wrong size on W_UsageRequest_C_ToggleVisibility");
static_assert(offsetof(W_UsageRequest_C_ToggleVisibility, Param_Visibility) == 0x000000, "Member 'W_UsageRequest_C_ToggleVisibility::Param_Visibility' has a wrong offset!");

}

