#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_UsageRequest

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_UsageRequest.W_UsageRequest_C
// 0x0068 (0x02E8 - 0x0280)
class UW_UsageRequest_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Background;                                        // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_234;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Options;                                           // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             OptionText;                                        // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ThrewAwayButton;                                   // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                UseButton;                                         // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UJSIContainer_C*                        Container_Rec;                                     // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UJSI_Slot_C*                            SlotRef;                                           // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         To_Slot;                                           // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Position;                                          // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UDropItemBackGwidget_C*                 DropItemBG;                                        // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__ThrewAwayButton_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UseButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_W_UsageRequest(int32 EntryPoint);
	struct FEventReply On_Background_MouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void ToggleVisibility(bool Param_Visibility);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_UsageRequest_C">();
	}
	static class UW_UsageRequest_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_UsageRequest_C>();
	}
};
static_assert(alignof(UW_UsageRequest_C) == 0x000008, "Wrong alignment on UW_UsageRequest_C");
static_assert(sizeof(UW_UsageRequest_C) == 0x0002E8, "Wrong size on UW_UsageRequest_C");
static_assert(offsetof(UW_UsageRequest_C, UberGraphFrame) == 0x000280, "Member 'UW_UsageRequest_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_UsageRequest_C, Background) == 0x000288, "Member 'UW_UsageRequest_C::Background' has a wrong offset!");
static_assert(offsetof(UW_UsageRequest_C, Image_234) == 0x000290, "Member 'UW_UsageRequest_C::Image_234' has a wrong offset!");
static_assert(offsetof(UW_UsageRequest_C, Options) == 0x000298, "Member 'UW_UsageRequest_C::Options' has a wrong offset!");
static_assert(offsetof(UW_UsageRequest_C, OptionText) == 0x0002A0, "Member 'UW_UsageRequest_C::OptionText' has a wrong offset!");
static_assert(offsetof(UW_UsageRequest_C, ThrewAwayButton) == 0x0002A8, "Member 'UW_UsageRequest_C::ThrewAwayButton' has a wrong offset!");
static_assert(offsetof(UW_UsageRequest_C, UseButton) == 0x0002B0, "Member 'UW_UsageRequest_C::UseButton' has a wrong offset!");
static_assert(offsetof(UW_UsageRequest_C, Container_Rec) == 0x0002B8, "Member 'UW_UsageRequest_C::Container_Rec' has a wrong offset!");
static_assert(offsetof(UW_UsageRequest_C, SlotRef) == 0x0002C0, "Member 'UW_UsageRequest_C::SlotRef' has a wrong offset!");
static_assert(offsetof(UW_UsageRequest_C, To_Slot) == 0x0002C8, "Member 'UW_UsageRequest_C::To_Slot' has a wrong offset!");
static_assert(offsetof(UW_UsageRequest_C, Position) == 0x0002D0, "Member 'UW_UsageRequest_C::Position' has a wrong offset!");
static_assert(offsetof(UW_UsageRequest_C, DropItemBG) == 0x0002E0, "Member 'UW_UsageRequest_C::DropItemBG' has a wrong offset!");

}

