#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_VideoMemory

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_VideoMemory.W_VideoMemory_C
// 0x0078 (0x02F8 - 0x0280)
class UW_VideoMemory_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image;                                             // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_935;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BG;                                          // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_OSApp_BG;                                    // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_OSApp_Fill;                                  // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Warning;                                     // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_WeightSeparator;                             // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_GameApp;                               // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USlider*                                Slider_Limit;                                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_CurrentRAM;                                   // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_GameAppMemory;                                // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_OSAppsMemory;                                 // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_TotalRAM;                                     // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_VRAMUsage;                                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_VideoMemory(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_VideoMemory_C">();
	}
	static class UW_VideoMemory_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_VideoMemory_C>();
	}
};
static_assert(alignof(UW_VideoMemory_C) == 0x000008, "Wrong alignment on UW_VideoMemory_C");
static_assert(sizeof(UW_VideoMemory_C) == 0x0002F8, "Wrong size on UW_VideoMemory_C");
static_assert(offsetof(UW_VideoMemory_C, UberGraphFrame) == 0x000280, "Member 'UW_VideoMemory_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_VideoMemory_C, Image) == 0x000288, "Member 'UW_VideoMemory_C::Image' has a wrong offset!");
static_assert(offsetof(UW_VideoMemory_C, Image_935) == 0x000290, "Member 'UW_VideoMemory_C::Image_935' has a wrong offset!");
static_assert(offsetof(UW_VideoMemory_C, Image_BG) == 0x000298, "Member 'UW_VideoMemory_C::Image_BG' has a wrong offset!");
static_assert(offsetof(UW_VideoMemory_C, Image_OSApp_BG) == 0x0002A0, "Member 'UW_VideoMemory_C::Image_OSApp_BG' has a wrong offset!");
static_assert(offsetof(UW_VideoMemory_C, Image_OSApp_Fill) == 0x0002A8, "Member 'UW_VideoMemory_C::Image_OSApp_Fill' has a wrong offset!");
static_assert(offsetof(UW_VideoMemory_C, Image_Warning) == 0x0002B0, "Member 'UW_VideoMemory_C::Image_Warning' has a wrong offset!");
static_assert(offsetof(UW_VideoMemory_C, Image_WeightSeparator) == 0x0002B8, "Member 'UW_VideoMemory_C::Image_WeightSeparator' has a wrong offset!");
static_assert(offsetof(UW_VideoMemory_C, ProgressBar_GameApp) == 0x0002C0, "Member 'UW_VideoMemory_C::ProgressBar_GameApp' has a wrong offset!");
static_assert(offsetof(UW_VideoMemory_C, Slider_Limit) == 0x0002C8, "Member 'UW_VideoMemory_C::Slider_Limit' has a wrong offset!");
static_assert(offsetof(UW_VideoMemory_C, Text_CurrentRAM) == 0x0002D0, "Member 'UW_VideoMemory_C::Text_CurrentRAM' has a wrong offset!");
static_assert(offsetof(UW_VideoMemory_C, Text_GameAppMemory) == 0x0002D8, "Member 'UW_VideoMemory_C::Text_GameAppMemory' has a wrong offset!");
static_assert(offsetof(UW_VideoMemory_C, Text_OSAppsMemory) == 0x0002E0, "Member 'UW_VideoMemory_C::Text_OSAppsMemory' has a wrong offset!");
static_assert(offsetof(UW_VideoMemory_C, Text_TotalRAM) == 0x0002E8, "Member 'UW_VideoMemory_C::Text_TotalRAM' has a wrong offset!");
static_assert(offsetof(UW_VideoMemory_C, Text_VRAMUsage) == 0x0002F0, "Member 'UW_VideoMemory_C::Text_VRAMUsage' has a wrong offset!");

}

