#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WalkingShake

#include "Basic.hpp"


namespace SDK::Params
{

// Function WalkingShake.WalkingShake_C.ExecuteUbergraph_WalkingShake
// 0x0008 (0x0008 - 0x0000)
struct WalkingShake_C_ExecuteUbergraph_WalkingShake final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Scale;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WalkingShake_C_ExecuteUbergraph_WalkingShake) == 0x000004, "Wrong alignment on WalkingShake_C_ExecuteUbergraph_WalkingShake");
static_assert(sizeof(WalkingShake_C_ExecuteUbergraph_WalkingShake) == 0x000008, "Wrong size on WalkingShake_C_ExecuteUbergraph_WalkingShake");
static_assert(offsetof(WalkingShake_C_ExecuteUbergraph_WalkingShake, EntryPoint) == 0x000000, "Member 'WalkingShake_C_ExecuteUbergraph_WalkingShake::EntryPoint' has a wrong offset!");
static_assert(offsetof(WalkingShake_C_ExecuteUbergraph_WalkingShake, K2Node_Event_Scale) == 0x000004, "Member 'WalkingShake_C_ExecuteUbergraph_WalkingShake::K2Node_Event_Scale' has a wrong offset!");

// Function WalkingShake.WalkingShake_C.ReceivePlayShake_2
// 0x0004 (0x0004 - 0x0000)
struct WalkingShake_C_ReceivePlayShake_2 final
{
public:
	float                                         Scale;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WalkingShake_C_ReceivePlayShake_2) == 0x000004, "Wrong alignment on WalkingShake_C_ReceivePlayShake_2");
static_assert(sizeof(WalkingShake_C_ReceivePlayShake_2) == 0x000004, "Wrong size on WalkingShake_C_ReceivePlayShake_2");
static_assert(offsetof(WalkingShake_C_ReceivePlayShake_2, Scale) == 0x000000, "Member 'WalkingShake_C_ReceivePlayShake_2::Scale' has a wrong offset!");

}

