#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_FlareSequenceTutorial

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_FlareSequenceTutorial.WBP_FlareSequenceTutorial_C
// 0x0030 (0x02B0 - 0x0280)
class UWBP_FlareSequenceTutorial_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowLogo_Anim;                                     // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hide_Anim;                                         // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowFlare_Anim;                                    // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Logo;                               // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Showed;                                            // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_FlareSequenceTutorial(int32 EntryPoint);
	void Finished_89CA5B88437C86A4C0E7C28DA037F846();
	void Show(bool Param_Show);
	void ShowLogo_Fntastic(bool bShow);
	void ShowLogo_MyTona(bool bShow);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_FlareSequenceTutorial_C">();
	}
	static class UWBP_FlareSequenceTutorial_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_FlareSequenceTutorial_C>();
	}
};
static_assert(alignof(UWBP_FlareSequenceTutorial_C) == 0x000008, "Wrong alignment on UWBP_FlareSequenceTutorial_C");
static_assert(sizeof(UWBP_FlareSequenceTutorial_C) == 0x0002B0, "Wrong size on UWBP_FlareSequenceTutorial_C");
static_assert(offsetof(UWBP_FlareSequenceTutorial_C, UberGraphFrame) == 0x000280, "Member 'UWBP_FlareSequenceTutorial_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_FlareSequenceTutorial_C, ShowLogo_Anim) == 0x000288, "Member 'UWBP_FlareSequenceTutorial_C::ShowLogo_Anim' has a wrong offset!");
static_assert(offsetof(UWBP_FlareSequenceTutorial_C, Hide_Anim) == 0x000290, "Member 'UWBP_FlareSequenceTutorial_C::Hide_Anim' has a wrong offset!");
static_assert(offsetof(UWBP_FlareSequenceTutorial_C, ShowFlare_Anim) == 0x000298, "Member 'UWBP_FlareSequenceTutorial_C::ShowFlare_Anim' has a wrong offset!");
static_assert(offsetof(UWBP_FlareSequenceTutorial_C, WidgetSwitcher_Logo) == 0x0002A0, "Member 'UWBP_FlareSequenceTutorial_C::WidgetSwitcher_Logo' has a wrong offset!");
static_assert(offsetof(UWBP_FlareSequenceTutorial_C, Showed) == 0x0002A8, "Member 'UWBP_FlareSequenceTutorial_C::Showed' has a wrong offset!");

}

