#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TipsInfo

#include "Basic.hpp"

#include "FMODStudio_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_TipsInfo.WBP_TipsInfo_C.ExecuteUbergraph_WBP_TipsInfo
// 0x02F8 (0x02F8 - 0x0000)
struct WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_TipName_1;                      // 0x0008(0x0018)()
	class FText                                   K2Node_CustomEvent_ActualTip;                      // 0x0020(0x0018)()
	float                                         K2Node_CustomEvent_Duration;                       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_isWarningMessage;               // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_With_WCoin;                     // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_SimpleColor;                    // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F[0x1];                                       // 0x003F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x00D4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x00E4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_2;                        // 0x00F4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_3;                        // 0x0104(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_1;  // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1; // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_NewDuration;                    // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_132[0x2];                                      // 0x0132(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue; // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin_4;                        // 0x0138(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin_5;                        // 0x014C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_6;                        // 0x015C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x016C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_WithAnim;                       // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17D[0x3];                                      // 0x017D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0180(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_2;  // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_2; // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x3];                                      // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin_7;                        // 0x019C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x01AC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x01BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x01BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_WithAniim;                      // 0x01BF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_TipName;                        // 0x01C0(0x0018)()
	ESlateVisibility                              K2Node_Select_Default;                             // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_3;  // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_3; // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x3];                                      // 0x01F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x01F4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin_8;                        // 0x0204(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0215(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_216[0x2];                                      // 0x0216(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue_1;                     // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameHUD_C>        K2Node_DynamicCast_AsBPI_Game_HUD;                 // 0x0238(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_GameHUD_C>        K2Node_DynamicCast_AsBPI_Game_HUD_1;               // 0x0250(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_PlayerMain_C*                      CallFunc_GetGUI_GUI;                               // 0x0268(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUIW_PlayerMain_C*                      CallFunc_GetGUI_GUI_1;                             // 0x0270(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue;        // 0x0278(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue_1;      // 0x0280(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue_2;      // 0x0288(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetInputAction_Input_Action;              // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_2;        // 0x029A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x029B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x029C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x029D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x029E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IgnoreCase_TextText_ReturnValue; // 0x029F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IgnoreCase_TextText_ReturnValue_1; // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IgnoreCase_TextText_ReturnValue_2; // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A2[0x2];                                      // 0x02A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x02A4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x02B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B5[0x3];                                      // 0x02B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x02B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x02D0(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToString_InDouble_ImplicitCast; // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Less_DoubleDouble_B_ImplicitCast;         // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo) == 0x000008, "Wrong alignment on WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo");
static_assert(sizeof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo) == 0x0002F8, "Wrong size on WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, EntryPoint) == 0x000000, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, K2Node_CustomEvent_TipName_1) == 0x000008, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::K2Node_CustomEvent_TipName_1' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, K2Node_CustomEvent_ActualTip) == 0x000020, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::K2Node_CustomEvent_ActualTip' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, K2Node_CustomEvent_Duration) == 0x000038, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::K2Node_CustomEvent_Duration' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, K2Node_CustomEvent_isWarningMessage) == 0x00003C, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::K2Node_CustomEvent_isWarningMessage' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, K2Node_CustomEvent_With_WCoin) == 0x00003D, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::K2Node_CustomEvent_With_WCoin' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, K2Node_CustomEvent_SimpleColor) == 0x00003E, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::K2Node_CustomEvent_SimpleColor' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, CallFunc_SelectInt_ReturnValue) == 0x000040, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, CallFunc_SelectInt_ReturnValue_1) == 0x000044, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::CallFunc_SelectInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, CallFunc_Not_PreBool_ReturnValue) == 0x000048, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, CallFunc_Conv_DoubleToString_ReturnValue) == 0x000050, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::CallFunc_Conv_DoubleToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, CallFunc_Conv_TextToString_ReturnValue) == 0x000060, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000070, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, CallFunc_Concat_StrStr_ReturnValue) == 0x000080, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000090, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, CallFunc_PlayAnimationForward_ReturnValue) == 0x0000A0, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, CallFunc_PlayEvent2D_ReturnValue) == 0x0000A8, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::CallFunc_PlayEvent2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, K2Node_CreateDelegate_OutputDelegate) == 0x0000B0, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x0000C0, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x0000C8, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, CallFunc_IsValid_ReturnValue) == 0x0000D0, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, K2Node_MakeStruct_Margin) == 0x0000D4, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, K2Node_MakeStruct_Margin_1) == 0x0000E4, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, K2Node_MakeStruct_Margin_2) == 0x0000F4, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::K2Node_MakeStruct_Margin_2' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, K2Node_MakeStruct_Margin_3) == 0x000104, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::K2Node_MakeStruct_Margin_3' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, CallFunc_CreatePlayAnimationProxyObject_Result_1) == 0x000118, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::CallFunc_CreatePlayAnimationProxyObject_Result_1' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1) == 0x000120, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, K2Node_CustomEvent_NewDuration) == 0x000128, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::K2Node_CustomEvent_NewDuration' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, CallFunc_IsValid_ReturnValue_1) == 0x000130, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000131, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue) == 0x000134, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, K2Node_MakeStruct_Margin_4) == 0x000138, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::K2Node_MakeStruct_Margin_4' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000148, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, K2Node_MakeStruct_Margin_5) == 0x00014C, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::K2Node_MakeStruct_Margin_5' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, K2Node_MakeStruct_Margin_6) == 0x00015C, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::K2Node_MakeStruct_Margin_6' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, K2Node_CreateDelegate_OutputDelegate_1) == 0x00016C, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, K2Node_CustomEvent_WithAnim) == 0x00017C, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::K2Node_CustomEvent_WithAnim' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000180, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, CallFunc_CreatePlayAnimationProxyObject_Result_2) == 0x000188, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::CallFunc_CreatePlayAnimationProxyObject_Result_2' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, CallFunc_CreatePlayAnimationProxyObject_ReturnValue_2) == 0x000190, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::CallFunc_CreatePlayAnimationProxyObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, CallFunc_IsValid_ReturnValue_2) == 0x000198, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, K2Node_MakeStruct_Margin_7) == 0x00019C, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::K2Node_MakeStruct_Margin_7' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, K2Node_CreateDelegate_OutputDelegate_2) == 0x0001AC, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, Temp_byte_Variable) == 0x0001BC, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, Temp_byte_Variable_1) == 0x0001BD, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, Temp_bool_Variable) == 0x0001BE, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, K2Node_CustomEvent_WithAniim) == 0x0001BF, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::K2Node_CustomEvent_WithAniim' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, K2Node_CustomEvent_TipName) == 0x0001C0, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::K2Node_CustomEvent_TipName' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, K2Node_Select_Default) == 0x0001D8, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, CallFunc_CreatePlayAnimationProxyObject_Result_3) == 0x0001E0, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::CallFunc_CreatePlayAnimationProxyObject_Result_3' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, CallFunc_CreatePlayAnimationProxyObject_ReturnValue_3) == 0x0001E8, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::CallFunc_CreatePlayAnimationProxyObject_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, CallFunc_IsValid_ReturnValue_3) == 0x0001F0, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, K2Node_CreateDelegate_OutputDelegate_3) == 0x0001F4, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, K2Node_MakeStruct_Margin_8) == 0x000204, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::K2Node_MakeStruct_Margin_8' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, CallFunc_EqualEqual_TextText_ReturnValue) == 0x000214, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::CallFunc_EqualEqual_TextText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, CallFunc_BooleanAND_ReturnValue) == 0x000215, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, CallFunc_GetPlayerController_ReturnValue) == 0x000218, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, CallFunc_GetPlayerController_ReturnValue_1) == 0x000220, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, CallFunc_GetHUD_ReturnValue) == 0x000228, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, CallFunc_GetHUD_ReturnValue_1) == 0x000230, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::CallFunc_GetHUD_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, K2Node_DynamicCast_AsBPI_Game_HUD) == 0x000238, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::K2Node_DynamicCast_AsBPI_Game_HUD' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, K2Node_DynamicCast_bSuccess) == 0x000248, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, K2Node_DynamicCast_AsBPI_Game_HUD_1) == 0x000250, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::K2Node_DynamicCast_AsBPI_Game_HUD_1' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, K2Node_DynamicCast_bSuccess_1) == 0x000260, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, CallFunc_GetGUI_GUI) == 0x000268, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::CallFunc_GetGUI_GUI' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, CallFunc_GetGUI_GUI_1) == 0x000270, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::CallFunc_GetGUI_GUI_1' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, CallFunc_SlotAsVerticalBoxSlot_ReturnValue) == 0x000278, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::CallFunc_SlotAsVerticalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, CallFunc_SlotAsVerticalBoxSlot_ReturnValue_1) == 0x000280, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::CallFunc_SlotAsVerticalBoxSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, CallFunc_SlotAsVerticalBoxSlot_ReturnValue_2) == 0x000288, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::CallFunc_SlotAsVerticalBoxSlot_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, CallFunc_GetInputAction_Input_Action) == 0x000290, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::CallFunc_GetInputAction_Input_Action' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000298, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x000299, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, CallFunc_EqualEqual_NameName_ReturnValue_2) == 0x00029A, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::CallFunc_EqualEqual_NameName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, CallFunc_BooleanOR_ReturnValue) == 0x00029B, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, CallFunc_GetVisibility_ReturnValue) == 0x00029C, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, CallFunc_BooleanOR_ReturnValue_1) == 0x00029D, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00029E, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, CallFunc_EqualEqual_IgnoreCase_TextText_ReturnValue) == 0x00029F, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::CallFunc_EqualEqual_IgnoreCase_TextText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, CallFunc_EqualEqual_IgnoreCase_TextText_ReturnValue_1) == 0x0002A0, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::CallFunc_EqualEqual_IgnoreCase_TextText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, CallFunc_EqualEqual_IgnoreCase_TextText_ReturnValue_2) == 0x0002A1, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::CallFunc_EqualEqual_IgnoreCase_TextText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, K2Node_CreateDelegate_OutputDelegate_4) == 0x0002A4, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, Temp_bool_IsClosed_Variable) == 0x0002B4, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, K2Node_CreateDelegate_OutputDelegate_5) == 0x0002B8, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0002C8, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x0002D0, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, CallFunc_Conv_DoubleToString_InDouble_ImplicitCast) == 0x0002D8, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::CallFunc_Conv_DoubleToString_InDouble_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x0002E0, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, CallFunc_Less_DoubleDouble_B_ImplicitCast) == 0x0002E8, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::CallFunc_Less_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x0002F0, "Member 'WBP_TipsInfo_C_ExecuteUbergraph_WBP_TipsInfo::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function WBP_TipsInfo.WBP_TipsInfo_C.HideCurrentTip
// 0x0020 (0x0020 - 0x0000)
struct WBP_TipsInfo_C_HideCurrentTip final
{
public:
	bool                                          WithAniim;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   TipName;                                           // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_TipsInfo_C_HideCurrentTip) == 0x000008, "Wrong alignment on WBP_TipsInfo_C_HideCurrentTip");
static_assert(sizeof(WBP_TipsInfo_C_HideCurrentTip) == 0x000020, "Wrong size on WBP_TipsInfo_C_HideCurrentTip");
static_assert(offsetof(WBP_TipsInfo_C_HideCurrentTip, WithAniim) == 0x000000, "Member 'WBP_TipsInfo_C_HideCurrentTip::WithAniim' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_HideCurrentTip, TipName) == 0x000008, "Member 'WBP_TipsInfo_C_HideCurrentTip::TipName' has a wrong offset!");

// Function WBP_TipsInfo.WBP_TipsInfo_C.HideTip
// 0x0001 (0x0001 - 0x0000)
struct WBP_TipsInfo_C_HideTip final
{
public:
	bool                                          WithAnim;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TipsInfo_C_HideTip) == 0x000001, "Wrong alignment on WBP_TipsInfo_C_HideTip");
static_assert(sizeof(WBP_TipsInfo_C_HideTip) == 0x000001, "Wrong size on WBP_TipsInfo_C_HideTip");
static_assert(offsetof(WBP_TipsInfo_C_HideTip, WithAnim) == 0x000000, "Member 'WBP_TipsInfo_C_HideTip::WithAnim' has a wrong offset!");

// Function WBP_TipsInfo.WBP_TipsInfo_C.ResetTipTimer
// 0x0008 (0x0008 - 0x0000)
struct WBP_TipsInfo_C_ResetTipTimer final
{
public:
	double                                        NewDuration;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TipsInfo_C_ResetTipTimer) == 0x000008, "Wrong alignment on WBP_TipsInfo_C_ResetTipTimer");
static_assert(sizeof(WBP_TipsInfo_C_ResetTipTimer) == 0x000008, "Wrong size on WBP_TipsInfo_C_ResetTipTimer");
static_assert(offsetof(WBP_TipsInfo_C_ResetTipTimer, NewDuration) == 0x000000, "Member 'WBP_TipsInfo_C_ResetTipTimer::NewDuration' has a wrong offset!");

// Function WBP_TipsInfo.WBP_TipsInfo_C.Set Text Actual Tip
// 0x0088 (0x0088 - 0x0000)
struct WBP_TipsInfo_C_Set_Text_Actual_Tip final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          With_WCoin;                                        // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_LeftS;                              // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_RightS;                             // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Split_ReturnValue;                        // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0058(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0070(0x0018)()
};
static_assert(alignof(WBP_TipsInfo_C_Set_Text_Actual_Tip) == 0x000008, "Wrong alignment on WBP_TipsInfo_C_Set_Text_Actual_Tip");
static_assert(sizeof(WBP_TipsInfo_C_Set_Text_Actual_Tip) == 0x000088, "Wrong size on WBP_TipsInfo_C_Set_Text_Actual_Tip");
static_assert(offsetof(WBP_TipsInfo_C_Set_Text_Actual_Tip, InText) == 0x000000, "Member 'WBP_TipsInfo_C_Set_Text_Actual_Tip::InText' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_Set_Text_Actual_Tip, With_WCoin) == 0x000018, "Member 'WBP_TipsInfo_C_Set_Text_Actual_Tip::With_WCoin' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_Set_Text_Actual_Tip, CallFunc_Conv_TextToString_ReturnValue) == 0x000020, "Member 'WBP_TipsInfo_C_Set_Text_Actual_Tip::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_Set_Text_Actual_Tip, CallFunc_Split_LeftS) == 0x000030, "Member 'WBP_TipsInfo_C_Set_Text_Actual_Tip::CallFunc_Split_LeftS' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_Set_Text_Actual_Tip, CallFunc_Split_RightS) == 0x000040, "Member 'WBP_TipsInfo_C_Set_Text_Actual_Tip::CallFunc_Split_RightS' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_Set_Text_Actual_Tip, CallFunc_Split_ReturnValue) == 0x000050, "Member 'WBP_TipsInfo_C_Set_Text_Actual_Tip::CallFunc_Split_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_Set_Text_Actual_Tip, CallFunc_Conv_StringToText_ReturnValue) == 0x000058, "Member 'WBP_TipsInfo_C_Set_Text_Actual_Tip::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_Set_Text_Actual_Tip, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000070, "Member 'WBP_TipsInfo_C_Set_Text_Actual_Tip::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");

// Function WBP_TipsInfo.WBP_TipsInfo_C.TipVisible
// 0x0038 (0x0038 - 0x0000)
struct WBP_TipsInfo_C_TipVisible final
{
public:
	class FText                                   TipName;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   ActualTip;                                         // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	float                                         Param_Duration;                                    // 0x0030(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsWarningMessage;                                  // 0x0034(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          With_WCoin;                                        // 0x0035(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SimpleColor;                                       // 0x0036(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TipsInfo_C_TipVisible) == 0x000008, "Wrong alignment on WBP_TipsInfo_C_TipVisible");
static_assert(sizeof(WBP_TipsInfo_C_TipVisible) == 0x000038, "Wrong size on WBP_TipsInfo_C_TipVisible");
static_assert(offsetof(WBP_TipsInfo_C_TipVisible, TipName) == 0x000000, "Member 'WBP_TipsInfo_C_TipVisible::TipName' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_TipVisible, ActualTip) == 0x000018, "Member 'WBP_TipsInfo_C_TipVisible::ActualTip' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_TipVisible, Param_Duration) == 0x000030, "Member 'WBP_TipsInfo_C_TipVisible::Param_Duration' has a wrong offset!");
static_assert(offsetof(WBP_TipsInfo_C_TipVisible, IsWarningMessage) == 0x000034, "Member 'WBP_TipsInfo_C_TipVisible::IsWarningMessage' has a wrong offset!");
