#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GPSQuestDetails

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GPSQuestDetails.WBP_GPSQuestDetails_C
// 0x00F8 (0x0378 - 0x0280)
class UWBP_GPSQuestDetails_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_Accept;                                     // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Accept_1;                                   // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Cancel;                                     // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Decline;                                    // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_QuestGiver;                                  // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Desription;                              // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Location;                                // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_MoneyReward;                             // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_QuestgiverName;                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_QuestName;                               // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Objectives;                            // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GPSObjective_C*                    WBP_GPSObjective_1;                                // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GPSObjective_C*                    WBP_GPSObjective_2;                                // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GPSObjective_C*                    WBP_GPSObjective_3;                                // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Content;                            // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UQuest*                                 Quest;                                             // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ASurvPC_C*                              As_Surv_PC;                                        // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnDecline;                                         // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class UWBP_GPSObjective_C*>            ObjectiveWidgets;                                  // 0x0320(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	FMulticastInlineDelegateProperty_             OnCancel;                                          // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnAccept;                                          // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bLocked;                                           // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UQuest*>                         TrackedQuests;                                     // 0x0358(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	FMulticastInlineDelegateProperty_             TrackQuest;                                        // 0x0368(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_GPSQuestDetails_Button_Accept_1_K2Node_ComponentBoundEvent_4_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__WBP_GPSQuestDetails_Button_Accept_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__WBP_GPSQuestDetails_Button_Accept_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_GPSQuestDetails_Button_Cancel_K2Node_ComponentBoundEvent_2_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__WBP_GPSQuestDetails_Button_Decline_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__WBP_GPSQuestDetails_Button_Decline_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
	void CheckActiveQuestObjectivesState();
	void CheckCompletedObjectives();
	void ExecuteUbergraph_WBP_GPSQuestDetails(int32 EntryPoint);
	void GetQuest(class UQuest** Param_Quest);
	void InitQuestDetails(class UQuest* Param_Quest);
	void OnAccept__DelegateSignature();
	void OnCancel__DelegateSignature();
	void OnDecline__DelegateSignature(class UQuest* Param_Quest);
	void OnInitialized();
	void SetLocked(bool Param_bLocked);
	void TrackQuest__DelegateSignature(bool Track);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GPSQuestDetails_C">();
	}
	static class UWBP_GPSQuestDetails_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GPSQuestDetails_C>();
	}
};
static_assert(alignof(UWBP_GPSQuestDetails_C) == 0x000008, "Wrong alignment on UWBP_GPSQuestDetails_C");
static_assert(sizeof(UWBP_GPSQuestDetails_C) == 0x000378, "Wrong size on UWBP_GPSQuestDetails_C");
static_assert(offsetof(UWBP_GPSQuestDetails_C, UberGraphFrame) == 0x000280, "Member 'UWBP_GPSQuestDetails_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GPSQuestDetails_C, Button_Accept) == 0x000288, "Member 'UWBP_GPSQuestDetails_C::Button_Accept' has a wrong offset!");
static_assert(offsetof(UWBP_GPSQuestDetails_C, Button_Accept_1) == 0x000290, "Member 'UWBP_GPSQuestDetails_C::Button_Accept_1' has a wrong offset!");
static_assert(offsetof(UWBP_GPSQuestDetails_C, Button_Cancel) == 0x000298, "Member 'UWBP_GPSQuestDetails_C::Button_Cancel' has a wrong offset!");
static_assert(offsetof(UWBP_GPSQuestDetails_C, Button_Decline) == 0x0002A0, "Member 'UWBP_GPSQuestDetails_C::Button_Decline' has a wrong offset!");
static_assert(offsetof(UWBP_GPSQuestDetails_C, Image_QuestGiver) == 0x0002A8, "Member 'UWBP_GPSQuestDetails_C::Image_QuestGiver' has a wrong offset!");
static_assert(offsetof(UWBP_GPSQuestDetails_C, TextBlock_Desription) == 0x0002B0, "Member 'UWBP_GPSQuestDetails_C::TextBlock_Desription' has a wrong offset!");
static_assert(offsetof(UWBP_GPSQuestDetails_C, TextBlock_Location) == 0x0002B8, "Member 'UWBP_GPSQuestDetails_C::TextBlock_Location' has a wrong offset!");
static_assert(offsetof(UWBP_GPSQuestDetails_C, TextBlock_MoneyReward) == 0x0002C0, "Member 'UWBP_GPSQuestDetails_C::TextBlock_MoneyReward' has a wrong offset!");
static_assert(offsetof(UWBP_GPSQuestDetails_C, TextBlock_QuestgiverName) == 0x0002C8, "Member 'UWBP_GPSQuestDetails_C::TextBlock_QuestgiverName' has a wrong offset!");
static_assert(offsetof(UWBP_GPSQuestDetails_C, TextBlock_QuestName) == 0x0002D0, "Member 'UWBP_GPSQuestDetails_C::TextBlock_QuestName' has a wrong offset!");
static_assert(offsetof(UWBP_GPSQuestDetails_C, VerticalBox_Objectives) == 0x0002D8, "Member 'UWBP_GPSQuestDetails_C::VerticalBox_Objectives' has a wrong offset!");
static_assert(offsetof(UWBP_GPSQuestDetails_C, WBP_GPSObjective_1) == 0x0002E0, "Member 'UWBP_GPSQuestDetails_C::WBP_GPSObjective_1' has a wrong offset!");
static_assert(offsetof(UWBP_GPSQuestDetails_C, WBP_GPSObjective_2) == 0x0002E8, "Member 'UWBP_GPSQuestDetails_C::WBP_GPSObjective_2' has a wrong offset!");
static_assert(offsetof(UWBP_GPSQuestDetails_C, WBP_GPSObjective_3) == 0x0002F0, "Member 'UWBP_GPSQuestDetails_C::WBP_GPSObjective_3' has a wrong offset!");
static_assert(offsetof(UWBP_GPSQuestDetails_C, WidgetSwitcher_Content) == 0x0002F8, "Member 'UWBP_GPSQuestDetails_C::WidgetSwitcher_Content' has a wrong offset!");
static_assert(offsetof(UWBP_GPSQuestDetails_C, Quest) == 0x000300, "Member 'UWBP_GPSQuestDetails_C::Quest' has a wrong offset!");
static_assert(offsetof(UWBP_GPSQuestDetails_C, As_Surv_PC) == 0x000308, "Member 'UWBP_GPSQuestDetails_C::As_Surv_PC' has a wrong offset!");
static_assert(offsetof(UWBP_GPSQuestDetails_C, OnDecline) == 0x000310, "Member 'UWBP_GPSQuestDetails_C::OnDecline' has a wrong offset!");
static_assert(offsetof(UWBP_GPSQuestDetails_C, ObjectiveWidgets) == 0x000320, "Member 'UWBP_GPSQuestDetails_C::ObjectiveWidgets' has a wrong offset!");
static_assert(offsetof(UWBP_GPSQuestDetails_C, OnCancel) == 0x000330, "Member 'UWBP_GPSQuestDetails_C::OnCancel' has a wrong offset!");
static_assert(offsetof(UWBP_GPSQuestDetails_C, OnAccept) == 0x000340, "Member 'UWBP_GPSQuestDetails_C::OnAccept' has a wrong offset!");
static_assert(offsetof(UWBP_GPSQuestDetails_C, bLocked) == 0x000350, "Member 'UWBP_GPSQuestDetails_C::bLocked' has a wrong offset!");
static_assert(offsetof(UWBP_GPSQuestDetails_C, TrackedQuests) == 0x000358, "Member 'UWBP_GPSQuestDetails_C::TrackedQuests' has a wrong offset!");
static_assert(offsetof(UWBP_GPSQuestDetails_C, TrackQuest) == 0x000368, "Member 'UWBP_GPSQuestDetails_C::TrackQuest' has a wrong offset!");

}

