#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CarShopSlot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_CarShopSlot_structs.hpp"
#include "F_CarShopItem_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"
#include "E_CarShopSections_structs.hpp"
#include "E_CarStatus_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CarShopSlot.WBP_CarShopSlot_C
// 0x0278 (0x04F8 - 0x0280)
class UWBP_CarShopSlot_C : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hovered;                                           // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Default;                                    // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_DefaultBottom;                              // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_HoveredBottom;                              // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CarImage;                                          // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CarName;                                           // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CarName_1;                                         // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CarPrice_Default;                                  // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CarPrice_Default_1;                                // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CarPrice_Hovered;                                  // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CarPrice_Hovered_1;                                // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CurrentCar_Image;                                  // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Default;                                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Empty;                                             // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                HouseButtonSlot;                                   // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Hovered;                                     // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           InfoVerticalBox;                                   // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Selected;                                          // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_DefaultPrice;                              // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_HoveredPrice;                              // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                SlotButton;                                        // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock;                                         // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_149;                                     // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Button;                             // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnSelectedSlot;                                    // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FF_CarShopItem                         InfoSlot;                                          // 0x0358(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	E_CarShopSlot                                 SlotStatus;                                        // 0x03B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B1[0x3];                                      // 0x03B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            PriceColor;                                        // 0x03B4(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            BlackColor;                                        // 0x03C8(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            RedColor;                                          // 0x03DC(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UWBP_CarShopAcceptBuyWindow_C*          AcceptWidget;                                      // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_CarShopAcceptBuyWindow_C*          ConfirmWidget;                                     // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnConfirm;                                         // 0x0400(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnUpdateMoney;                                     // 0x0410(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	E_CarShopSections                             ShopSection;                                       // 0x0420(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_421[0x7];                                      // 0x0421(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnSellConfirm;                                     // 0x0428(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bIsEnoughMoneyForBuy;                              // 0x0438(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_439[0x7];                                      // 0x0439(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnShowErrorMessage;                                // 0x0440(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnBuy;                                             // 0x0450(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bIsBuyStatusFound;                                 // 0x0460(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsConstructStatusFound;                           // 0x0461(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_462[0x6];                                      // 0x0462(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CarStatus;                                         // 0x0468(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   CarStatus_Available;                               // 0x0480(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	FMulticastInlineDelegateProperty_             OnChangeCurrentCar;                                // 0x0498(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   CarStatus_Current;                                 // 0x04A8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	FMulticastInlineDelegateProperty_             OnHovered;                                         // 0x04C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnUnhovered;                                       // 0x04D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   CarStatus_Missing;                                 // 0x04E0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BndEvt__WBP_CarShopSlot_SlotButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_CarShopSlot_SlotButton_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_CarSlot_SlotButton_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void Confirm();
	void Construct();
	void ExecuteUbergraph_WBP_CarShopSlot(int32 EntryPoint);
	void GetSlotInfo(struct FF_CarShopItem* NewParam);
	void GetSlotStatus(E_CarShopSlot* Param_SlotStatus);
	void OnBuy__DelegateSignature();
	void OnChangeCurrentCar__DelegateSignature(class UWBP_CarShopSlot_C* CurrentCar);
	void OnConfirm__DelegateSignature();
	void OnConfirmBuyCar();
	void OnConfirmSellCar();
	void OnHovered__DelegateSignature(class UWBP_CarShopSlot_C* HoveredSlot);
	void OnPressedSlot();
	void OnSelectedSlot__DelegateSignature(class UWBP_CarShopSlot_C* PressedCarSlot);
	void OnSellConfirm__DelegateSignature();
	void OnShowErrorMessage__DelegateSignature(const class FText& Error_message);
	void OnUnhovered__DelegateSignature(class UWBP_CarShopSlot_C* UnhoveredSlot);
	void OnUpdateAfterSale();
	void OnUpdateMoney__DelegateSignature();
	void PreConstruct(bool IsDesignTime);
	void RemoveMoney(class ASurvivalPlayer_C* Controller, int32 Count);
	void SetSlotBuyInfo(const struct FF_CarShopItem& Param_InfoSlot, int32 AmountOfCurrentMoney);
	void SetSlotDefault();
	void SetSlotEmpty();
	void SetSlotHovered(bool With_Anim, bool Param_Hovered);
	void SetSlotSelected();
	void SetSlotSellInfo(const struct FF_CarShopItem& Param_InfoSlot);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CarShopSlot_C">();
	}
	static class UWBP_CarShopSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CarShopSlot_C>();
	}
};
static_assert(alignof(UWBP_CarShopSlot_C) == 0x000008, "Wrong alignment on UWBP_CarShopSlot_C");
static_assert(sizeof(UWBP_CarShopSlot_C) == 0x0004F8, "Wrong size on UWBP_CarShopSlot_C");
static_assert(offsetof(UWBP_CarShopSlot_C, UberGraphFrame) == 0x000280, "Member 'UWBP_CarShopSlot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopSlot_C, Hovered) == 0x000288, "Member 'UWBP_CarShopSlot_C::Hovered' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopSlot_C, Border_Default) == 0x000290, "Member 'UWBP_CarShopSlot_C::Border_Default' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopSlot_C, Border_DefaultBottom) == 0x000298, "Member 'UWBP_CarShopSlot_C::Border_DefaultBottom' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopSlot_C, Border_HoveredBottom) == 0x0002A0, "Member 'UWBP_CarShopSlot_C::Border_HoveredBottom' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopSlot_C, CarImage) == 0x0002A8, "Member 'UWBP_CarShopSlot_C::CarImage' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopSlot_C, CarName) == 0x0002B0, "Member 'UWBP_CarShopSlot_C::CarName' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopSlot_C, CarName_1) == 0x0002B8, "Member 'UWBP_CarShopSlot_C::CarName_1' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopSlot_C, CarPrice_Default) == 0x0002C0, "Member 'UWBP_CarShopSlot_C::CarPrice_Default' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopSlot_C, CarPrice_Default_1) == 0x0002C8, "Member 'UWBP_CarShopSlot_C::CarPrice_Default_1' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopSlot_C, CarPrice_Hovered) == 0x0002D0, "Member 'UWBP_CarShopSlot_C::CarPrice_Hovered' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopSlot_C, CarPrice_Hovered_1) == 0x0002D8, "Member 'UWBP_CarShopSlot_C::CarPrice_Hovered_1' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopSlot_C, CurrentCar_Image) == 0x0002E0, "Member 'UWBP_CarShopSlot_C::CurrentCar_Image' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopSlot_C, Default) == 0x0002E8, "Member 'UWBP_CarShopSlot_C::Default' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopSlot_C, Empty) == 0x0002F0, "Member 'UWBP_CarShopSlot_C::Empty' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopSlot_C, HouseButtonSlot) == 0x0002F8, "Member 'UWBP_CarShopSlot_C::HouseButtonSlot' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopSlot_C, Image_Hovered) == 0x000300, "Member 'UWBP_CarShopSlot_C::Image_Hovered' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopSlot_C, InfoVerticalBox) == 0x000308, "Member 'UWBP_CarShopSlot_C::InfoVerticalBox' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopSlot_C, Selected) == 0x000310, "Member 'UWBP_CarShopSlot_C::Selected' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopSlot_C, SizeBox_DefaultPrice) == 0x000318, "Member 'UWBP_CarShopSlot_C::SizeBox_DefaultPrice' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopSlot_C, SizeBox_HoveredPrice) == 0x000320, "Member 'UWBP_CarShopSlot_C::SizeBox_HoveredPrice' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopSlot_C, SlotButton) == 0x000328, "Member 'UWBP_CarShopSlot_C::SlotButton' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopSlot_C, TextBlock) == 0x000330, "Member 'UWBP_CarShopSlot_C::TextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopSlot_C, TextBlock_149) == 0x000338, "Member 'UWBP_CarShopSlot_C::TextBlock_149' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopSlot_C, WidgetSwitcher_Button) == 0x000340, "Member 'UWBP_CarShopSlot_C::WidgetSwitcher_Button' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopSlot_C, OnSelectedSlot) == 0x000348, "Member 'UWBP_CarShopSlot_C::OnSelectedSlot' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopSlot_C, InfoSlot) == 0x000358, "Member 'UWBP_CarShopSlot_C::InfoSlot' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopSlot_C, SlotStatus) == 0x0003B0, "Member 'UWBP_CarShopSlot_C::SlotStatus' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopSlot_C, PriceColor) == 0x0003B4, "Member 'UWBP_CarShopSlot_C::PriceColor' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopSlot_C, BlackColor) == 0x0003C8, "Member 'UWBP_CarShopSlot_C::BlackColor' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopSlot_C, RedColor) == 0x0003DC, "Member 'UWBP_CarShopSlot_C::RedColor' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopSlot_C, AcceptWidget) == 0x0003F0, "Member 'UWBP_CarShopSlot_C::AcceptWidget' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopSlot_C, ConfirmWidget) == 0x0003F8, "Member 'UWBP_CarShopSlot_C::ConfirmWidget' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopSlot_C, OnConfirm) == 0x000400, "Member 'UWBP_CarShopSlot_C::OnConfirm' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopSlot_C, OnUpdateMoney) == 0x000410, "Member 'UWBP_CarShopSlot_C::OnUpdateMoney' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopSlot_C, ShopSection) == 0x000420, "Member 'UWBP_CarShopSlot_C::ShopSection' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopSlot_C, OnSellConfirm) == 0x000428, "Member 'UWBP_CarShopSlot_C::OnSellConfirm' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopSlot_C, bIsEnoughMoneyForBuy) == 0x000438, "Member 'UWBP_CarShopSlot_C::bIsEnoughMoneyForBuy' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopSlot_C, OnShowErrorMessage) == 0x000440, "Member 'UWBP_CarShopSlot_C::OnShowErrorMessage' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopSlot_C, OnBuy) == 0x000450, "Member 'UWBP_CarShopSlot_C::OnBuy' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopSlot_C, bIsBuyStatusFound) == 0x000460, "Member 'UWBP_CarShopSlot_C::bIsBuyStatusFound' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopSlot_C, bIsConstructStatusFound) == 0x000461, "Member 'UWBP_CarShopSlot_C::bIsConstructStatusFound' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopSlot_C, CarStatus) == 0x000468, "Member 'UWBP_CarShopSlot_C::CarStatus' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopSlot_C, CarStatus_Available) == 0x000480, "Member 'UWBP_CarShopSlot_C::CarStatus_Available' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopSlot_C, OnChangeCurrentCar) == 0x000498, "Member 'UWBP_CarShopSlot_C::OnChangeCurrentCar' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopSlot_C, CarStatus_Current) == 0x0004A8, "Member 'UWBP_CarShopSlot_C::CarStatus_Current' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopSlot_C, OnHovered) == 0x0004C0, "Member 'UWBP_CarShopSlot_C::OnHovered' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopSlot_C, OnUnhovered) == 0x0004D0, "Member 'UWBP_CarShopSlot_C::OnUnhovered' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopSlot_C, CarStatus_Missing) == 0x0004E0, "Member 'UWBP_CarShopSlot_C::CarStatus_Missing' has a wrong offset!");

}

