#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PrivacyPolicy

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PrivacyPolicy.WBP_PrivacyPolicy_C
// 0x0068 (0x02E8 - 0x0280)
class UWBP_PrivacyPolicy_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hide;                                              // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Show;                                              // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_ControlButtons;                             // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ModalWindowButton_C*                 Button_LimitedData;                                // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_URL_link;                                   // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_ButtonURL;                                    // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_UnderlineKostyl;                              // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_HintButtonNew_C*                     W_HintButton_Apply;                                // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Scroller_C*                        WBP_Scroller;                                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGI_Survival_C*                         As_GI_Survival;                                    // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnClose;                                           // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void AcceptPolicy(bool bFullData);
	void AcceptPolicy_FullData();
	void AcceptPolicy_LimitedData();
	void BndEvt__WBP_PrivacyPolicy_Button_CreateDecline_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature();
	void BndEvt__WBP_PrivacyPolicy_Button_URL_link_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_PrivacyPolicy_Button_URL_link_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_PrivacyPolicy_Button_URL_link_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_PrivacyPolicy_W_HintButton_Apply_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WBP_PrivacyPolicy(int32 EntryPoint);
	void Finished_84A37F4A4829DF217EAF65AA6A732886();
	void Finished_A7DEFBC8436C68BF57F9A98FFAEF3602();
	void OnClose__DelegateSignature();
	void OnInitialized();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PrivacyPolicy_C">();
	}
	static class UWBP_PrivacyPolicy_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PrivacyPolicy_C>();
	}
};
static_assert(alignof(UWBP_PrivacyPolicy_C) == 0x000008, "Wrong alignment on UWBP_PrivacyPolicy_C");
static_assert(sizeof(UWBP_PrivacyPolicy_C) == 0x0002E8, "Wrong size on UWBP_PrivacyPolicy_C");
static_assert(offsetof(UWBP_PrivacyPolicy_C, UberGraphFrame) == 0x000280, "Member 'UWBP_PrivacyPolicy_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PrivacyPolicy_C, Hide) == 0x000288, "Member 'UWBP_PrivacyPolicy_C::Hide' has a wrong offset!");
static_assert(offsetof(UWBP_PrivacyPolicy_C, Show) == 0x000290, "Member 'UWBP_PrivacyPolicy_C::Show' has a wrong offset!");
static_assert(offsetof(UWBP_PrivacyPolicy_C, Border_ControlButtons) == 0x000298, "Member 'UWBP_PrivacyPolicy_C::Border_ControlButtons' has a wrong offset!");
static_assert(offsetof(UWBP_PrivacyPolicy_C, Button_LimitedData) == 0x0002A0, "Member 'UWBP_PrivacyPolicy_C::Button_LimitedData' has a wrong offset!");
static_assert(offsetof(UWBP_PrivacyPolicy_C, Button_URL_link) == 0x0002A8, "Member 'UWBP_PrivacyPolicy_C::Button_URL_link' has a wrong offset!");
static_assert(offsetof(UWBP_PrivacyPolicy_C, Text_ButtonURL) == 0x0002B0, "Member 'UWBP_PrivacyPolicy_C::Text_ButtonURL' has a wrong offset!");
static_assert(offsetof(UWBP_PrivacyPolicy_C, Text_UnderlineKostyl) == 0x0002B8, "Member 'UWBP_PrivacyPolicy_C::Text_UnderlineKostyl' has a wrong offset!");
static_assert(offsetof(UWBP_PrivacyPolicy_C, W_HintButton_Apply) == 0x0002C0, "Member 'UWBP_PrivacyPolicy_C::W_HintButton_Apply' has a wrong offset!");
static_assert(offsetof(UWBP_PrivacyPolicy_C, WBP_Scroller) == 0x0002C8, "Member 'UWBP_PrivacyPolicy_C::WBP_Scroller' has a wrong offset!");
static_assert(offsetof(UWBP_PrivacyPolicy_C, As_GI_Survival) == 0x0002D0, "Member 'UWBP_PrivacyPolicy_C::As_GI_Survival' has a wrong offset!");
static_assert(offsetof(UWBP_PrivacyPolicy_C, OnClose) == 0x0002D8, "Member 'UWBP_PrivacyPolicy_C::OnClose' has a wrong offset!");

}

