#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MainWeaponTab

#include "Basic.hpp"

#include "AttachmentInfo_structs.hpp"
#include "E_TypesOfModes_structs.hpp"
#include "E_DependenciesRule_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FItemInfo_structs.hpp"
#include "Slate_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "E_AttachmentDependencyTypes_structs.hpp"
#include "ContainerPickupsInfo_structs.hpp"
#include "WE_WorkbenchCategoryType_structs.hpp"
#include "BPS_CustomizationData_structs.hpp"
#include "BPS_WeaponData_structs.hpp"
#include "WE_MessageTypes_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_MainWeaponTab.WBP_MainWeaponTab_C.ActivateWeaponRow
// 0x0318 (0x0318 - 0x0000)
struct WBP_MainWeaponTab_C_ActivateWeaponRow final
{
public:
	class UWBP_WeaponRow_C*                       ActiveWeapon;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        Weight;                                            // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0010(0x0018)()
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0048(0x0018)()
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0070(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X;                          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_1;          // 0x00B0(0x0018)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAttachmentInfo                        CallFunc_Array_Get_Item;                           // 0x00D4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             CallFunc_GetDataTableRowFromName_OutRow;           // 0x00E8(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainWeaponTab_C_ActivateWeaponRow) == 0x000008, "Wrong alignment on WBP_MainWeaponTab_C_ActivateWeaponRow");
static_assert(sizeof(WBP_MainWeaponTab_C_ActivateWeaponRow) == 0x000318, "Wrong size on WBP_MainWeaponTab_C_ActivateWeaponRow");
static_assert(offsetof(WBP_MainWeaponTab_C_ActivateWeaponRow, ActiveWeapon) == 0x000000, "Member 'WBP_MainWeaponTab_C_ActivateWeaponRow::ActiveWeapon' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ActivateWeaponRow, Weight) == 0x000008, "Member 'WBP_MainWeaponTab_C_ActivateWeaponRow::Weight' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ActivateWeaponRow, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000010, "Member 'WBP_MainWeaponTab_C_ActivateWeaponRow::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ActivateWeaponRow, CallFunc_FTrunc_ReturnValue) == 0x000028, "Member 'WBP_MainWeaponTab_C_ActivateWeaponRow::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ActivateWeaponRow, CallFunc_Conv_IntToString_ReturnValue) == 0x000030, "Member 'WBP_MainWeaponTab_C_ActivateWeaponRow::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ActivateWeaponRow, CallFunc_FTrunc_ReturnValue_1) == 0x000040, "Member 'WBP_MainWeaponTab_C_ActivateWeaponRow::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ActivateWeaponRow, CallFunc_Conv_StringToText_ReturnValue) == 0x000048, "Member 'WBP_MainWeaponTab_C_ActivateWeaponRow::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ActivateWeaponRow, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000060, "Member 'WBP_MainWeaponTab_C_ActivateWeaponRow::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ActivateWeaponRow, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000070, "Member 'WBP_MainWeaponTab_C_ActivateWeaponRow::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ActivateWeaponRow, CallFunc_Array_Length_ReturnValue) == 0x000088, "Member 'WBP_MainWeaponTab_C_ActivateWeaponRow::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ActivateWeaponRow, CallFunc_BreakVector2D_X) == 0x000090, "Member 'WBP_MainWeaponTab_C_ActivateWeaponRow::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ActivateWeaponRow, CallFunc_BreakVector2D_Y) == 0x000098, "Member 'WBP_MainWeaponTab_C_ActivateWeaponRow::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ActivateWeaponRow, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000A0, "Member 'WBP_MainWeaponTab_C_ActivateWeaponRow::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ActivateWeaponRow, Temp_int_Loop_Counter_Variable) == 0x0000A8, "Member 'WBP_MainWeaponTab_C_ActivateWeaponRow::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ActivateWeaponRow, CallFunc_Conv_DoubleToText_ReturnValue_1) == 0x0000B0, "Member 'WBP_MainWeaponTab_C_ActivateWeaponRow::CallFunc_Conv_DoubleToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ActivateWeaponRow, CallFunc_Less_IntInt_ReturnValue) == 0x0000C8, "Member 'WBP_MainWeaponTab_C_ActivateWeaponRow::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ActivateWeaponRow, CallFunc_Add_IntInt_ReturnValue) == 0x0000CC, "Member 'WBP_MainWeaponTab_C_ActivateWeaponRow::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ActivateWeaponRow, Temp_int_Array_Index_Variable) == 0x0000D0, "Member 'WBP_MainWeaponTab_C_ActivateWeaponRow::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ActivateWeaponRow, CallFunc_Array_Get_Item) == 0x0000D4, "Member 'WBP_MainWeaponTab_C_ActivateWeaponRow::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ActivateWeaponRow, CallFunc_GetDataTableRowFromName_OutRow) == 0x0000E8, "Member 'WBP_MainWeaponTab_C_ActivateWeaponRow::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ActivateWeaponRow, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000308, "Member 'WBP_MainWeaponTab_C_ActivateWeaponRow::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ActivateWeaponRow, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000310, "Member 'WBP_MainWeaponTab_C_ActivateWeaponRow::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");

// Function WBP_MainWeaponTab.WBP_MainWeaponTab_C.BindInventoryUpdate
// 0x0040 (0x0040 - 0x0000)
struct WBP_MainWeaponTab_C_BindInventoryUpdate final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC;                  // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      CallFunc_GetPlayerRef_SurvivalPlayer;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainWeaponTab_C_BindInventoryUpdate) == 0x000008, "Wrong alignment on WBP_MainWeaponTab_C_BindInventoryUpdate");
static_assert(sizeof(WBP_MainWeaponTab_C_BindInventoryUpdate) == 0x000040, "Wrong size on WBP_MainWeaponTab_C_BindInventoryUpdate");
static_assert(offsetof(WBP_MainWeaponTab_C_BindInventoryUpdate, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_MainWeaponTab_C_BindInventoryUpdate::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_BindInventoryUpdate, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'WBP_MainWeaponTab_C_BindInventoryUpdate::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_BindInventoryUpdate, K2Node_DynamicCast_AsBPI_Surv_PC) == 0x000018, "Member 'WBP_MainWeaponTab_C_BindInventoryUpdate::K2Node_DynamicCast_AsBPI_Surv_PC' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_BindInventoryUpdate, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_MainWeaponTab_C_BindInventoryUpdate::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_BindInventoryUpdate, CallFunc_GetPlayerRef_SurvivalPlayer) == 0x000030, "Member 'WBP_MainWeaponTab_C_BindInventoryUpdate::CallFunc_GetPlayerRef_SurvivalPlayer' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_BindInventoryUpdate, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'WBP_MainWeaponTab_C_BindInventoryUpdate::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_MainWeaponTab.WBP_MainWeaponTab_C.BndEvt__WBP_MainWeaponTab_W_CategorySelector_K2Node_ComponentBoundEvent_1_OnCategoryChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_MainWeaponTab_C_BndEvt__WBP_MainWeaponTab_W_CategorySelector_K2Node_ComponentBoundEvent_1_OnCategoryChanged__DelegateSignature final
{
public:
	int32                                         CategoryIndex;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainWeaponTab_C_BndEvt__WBP_MainWeaponTab_W_CategorySelector_K2Node_ComponentBoundEvent_1_OnCategoryChanged__DelegateSignature) == 0x000004, "Wrong alignment on WBP_MainWeaponTab_C_BndEvt__WBP_MainWeaponTab_W_CategorySelector_K2Node_ComponentBoundEvent_1_OnCategoryChanged__DelegateSignature");
static_assert(sizeof(WBP_MainWeaponTab_C_BndEvt__WBP_MainWeaponTab_W_CategorySelector_K2Node_ComponentBoundEvent_1_OnCategoryChanged__DelegateSignature) == 0x000004, "Wrong size on WBP_MainWeaponTab_C_BndEvt__WBP_MainWeaponTab_W_CategorySelector_K2Node_ComponentBoundEvent_1_OnCategoryChanged__DelegateSignature");
static_assert(offsetof(WBP_MainWeaponTab_C_BndEvt__WBP_MainWeaponTab_W_CategorySelector_K2Node_ComponentBoundEvent_1_OnCategoryChanged__DelegateSignature, CategoryIndex) == 0x000000, "Member 'WBP_MainWeaponTab_C_BndEvt__WBP_MainWeaponTab_W_CategorySelector_K2Node_ComponentBoundEvent_1_OnCategoryChanged__DelegateSignature::CategoryIndex' has a wrong offset!");

// Function WBP_MainWeaponTab.WBP_MainWeaponTab_C.CheckContainsWeapon
// 0x0018 (0x0018 - 0x0000)
struct WBP_MainWeaponTab_C_CheckContainsWeapon final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindItems__Valid__Result;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFItemInfo>                     CallFunc_FindItems__Valid__ValidItems;             // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_MainWeaponTab_C_CheckContainsWeapon) == 0x000008, "Wrong alignment on WBP_MainWeaponTab_C_CheckContainsWeapon");
static_assert(sizeof(WBP_MainWeaponTab_C_CheckContainsWeapon) == 0x000018, "Wrong size on WBP_MainWeaponTab_C_CheckContainsWeapon");
static_assert(offsetof(WBP_MainWeaponTab_C_CheckContainsWeapon, Result) == 0x000000, "Member 'WBP_MainWeaponTab_C_CheckContainsWeapon::Result' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_CheckContainsWeapon, CallFunc_FindItems__Valid__Result) == 0x000001, "Member 'WBP_MainWeaponTab_C_CheckContainsWeapon::CallFunc_FindItems__Valid__Result' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_CheckContainsWeapon, CallFunc_FindItems__Valid__ValidItems) == 0x000008, "Member 'WBP_MainWeaponTab_C_CheckContainsWeapon::CallFunc_FindItems__Valid__ValidItems' has a wrong offset!");

// Function WBP_MainWeaponTab.WBP_MainWeaponTab_C.CheckWeaponOnTagsPosition
// 0x0028 (0x0028 - 0x0000)
struct WBP_MainWeaponTab_C_CheckWeaponOnTagsPosition final
{
public:
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_2;           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_3;           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainWeaponTab_C_CheckWeaponOnTagsPosition) == 0x000008, "Wrong alignment on WBP_MainWeaponTab_C_CheckWeaponOnTagsPosition");
static_assert(sizeof(WBP_MainWeaponTab_C_CheckWeaponOnTagsPosition) == 0x000028, "Wrong size on WBP_MainWeaponTab_C_CheckWeaponOnTagsPosition");
static_assert(offsetof(WBP_MainWeaponTab_C_CheckWeaponOnTagsPosition, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000000, "Member 'WBP_MainWeaponTab_C_CheckWeaponOnTagsPosition::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_CheckWeaponOnTagsPosition, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x000008, "Member 'WBP_MainWeaponTab_C_CheckWeaponOnTagsPosition::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_CheckWeaponOnTagsPosition, CallFunc_SlotAsCanvasSlot_ReturnValue_2) == 0x000010, "Member 'WBP_MainWeaponTab_C_CheckWeaponOnTagsPosition::CallFunc_SlotAsCanvasSlot_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_CheckWeaponOnTagsPosition, CallFunc_SlotAsCanvasSlot_ReturnValue_3) == 0x000018, "Member 'WBP_MainWeaponTab_C_CheckWeaponOnTagsPosition::CallFunc_SlotAsCanvasSlot_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_CheckWeaponOnTagsPosition, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000020, "Member 'WBP_MainWeaponTab_C_CheckWeaponOnTagsPosition::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_CheckWeaponOnTagsPosition, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000021, "Member 'WBP_MainWeaponTab_C_CheckWeaponOnTagsPosition::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WBP_MainWeaponTab.WBP_MainWeaponTab_C.ExecuteUbergraph_WBP_MainWeaponTab
// 0x07E0 (0x07E0 - 0x0000)
struct WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_NewPosition;                          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_CategoryIndex;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_WeaponCategory_C*                  CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_WeaponRow_C*                       K2Node_CustomEvent_Active_weapon;                  // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFItemInfo                             K2Node_CustomEvent_Weapon_Info;                    // 0x0028(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             K2Node_Event_NewItem;                              // 0x0250(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0470(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0474(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_479[0x7];                                      // 0x0479(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0480(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0488(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0490(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0499(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UpdateWeaponStructure_bResult;            // 0x049A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x049B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x049C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWE_MessageTypes                              K2Node_Event_Type;                                 // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A1[0x7];                                      // 0x04A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_Text;                                 // 0x04A8(0x0018)()
	double                                        K2Node_Event_Duration_1;                           // 0x04C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_Duration;                             // 0x04C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Lock;                                 // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D1[0x3];                                      // 0x04D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x04D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x04D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x04E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x04EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_WeaponCategory_C*                  CallFunc_Array_Get_Item_1;                         // 0x04F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_WeaponRow_C*                       CallFunc_Array_Get_Item_2;                         // 0x04F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0500(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0504(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsSelected_IsSelected;                 // 0x0505(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0506(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_NewState;                       // 0x0507(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0508(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50C[0x4];                                      // 0x050C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_ModeCategoryTag_C*>         K2Node_MakeArray_Array;                            // 0x0510(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0520(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_521[0x3];                                      // 0x0521(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0524(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPlayerItems_Result;                    // 0x0528(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_529[0x7];                                      // 0x0529(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFItemInfo>                     CallFunc_GetPlayerItems_Items;                     // 0x0530(0x0010)(ReferenceParm, ContainsInstancedReference)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0540(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0550(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 CallFunc_Set_ToArray_Result;                       // 0x0558(0x0010)(ReferenceParm)
	TScriptInterface<class IWI_Workbench_C>       K2Node_DynamicCast_AsWI_Workbench;                 // 0x0568(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0578(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0579(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x057A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bPressed;                       // 0x057B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bPlayAnim;                      // 0x057C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x057D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x057E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAttachments_Empty;                     // 0x057F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFItemInfo>                     CallFunc_GetAttachments_Attachments;               // 0x0580(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FFItemInfo                             CallFunc_Array_Get_Item_3;                         // 0x0590(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x07B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x07B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x07B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x07B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B7[0x1];                                      // 0x07B7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x07B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x07C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x07C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C9[0x3];                                      // 0x07C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFocusEvent                            K2Node_Event_InFocusEvent_1;                       // 0x07CC(0x0008)(NoDestructor)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x07D4(0x0008)(NoDestructor)
};
static_assert(alignof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab) == 0x000008, "Wrong alignment on WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab");
static_assert(sizeof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab) == 0x0007E0, "Wrong size on WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, EntryPoint) == 0x000000, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, K2Node_Event_NewPosition) == 0x000008, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::K2Node_Event_NewPosition' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, K2Node_Event_IsDesignTime) == 0x00000C, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, K2Node_ComponentBoundEvent_CategoryIndex) == 0x000010, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::K2Node_ComponentBoundEvent_CategoryIndex' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, CallFunc_Array_Get_Item) == 0x000018, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, K2Node_CustomEvent_Active_weapon) == 0x000020, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::K2Node_CustomEvent_Active_weapon' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, K2Node_CustomEvent_Weapon_Info) == 0x000028, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::K2Node_CustomEvent_Weapon_Info' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, CallFunc_Array_Length_ReturnValue) == 0x000248, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, K2Node_Event_NewItem) == 0x000250, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::K2Node_Event_NewItem' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, Temp_int_Loop_Counter_Variable) == 0x000470, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, CallFunc_Add_IntInt_ReturnValue) == 0x000474, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, K2Node_SwitchEnum_CmpSuccess) == 0x000478, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, CallFunc_GetOwningPlayer_ReturnValue) == 0x000480, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, CallFunc_K2_GetPawn_ReturnValue) == 0x000488, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, K2Node_DynamicCast_AsSurvival_Player) == 0x000490, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, K2Node_DynamicCast_bSuccess) == 0x000498, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, CallFunc_IsValid_ReturnValue) == 0x000499, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, CallFunc_UpdateWeaponStructure_bResult) == 0x00049A, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::CallFunc_UpdateWeaponStructure_bResult' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, CallFunc_IsValid_ReturnValue_1) == 0x00049B, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, Temp_int_Array_Index_Variable_1) == 0x00049C, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, K2Node_Event_Type) == 0x0004A0, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::K2Node_Event_Type' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, K2Node_Event_Text) == 0x0004A8, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::K2Node_Event_Text' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, K2Node_Event_Duration_1) == 0x0004C0, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::K2Node_Event_Duration_1' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, K2Node_Event_Duration) == 0x0004C8, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::K2Node_Event_Duration' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, K2Node_Event_Lock) == 0x0004D0, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::K2Node_Event_Lock' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, Temp_int_Loop_Counter_Variable_1) == 0x0004D4, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, K2Node_CreateDelegate_OutputDelegate) == 0x0004D8, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, CallFunc_Add_IntInt_ReturnValue_1) == 0x0004E8, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, Temp_int_Array_Index_Variable_2) == 0x0004EC, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, CallFunc_Array_Get_Item_1) == 0x0004F0, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, CallFunc_Array_Get_Item_2) == 0x0004F8, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, CallFunc_Array_Length_ReturnValue_1) == 0x000500, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, CallFunc_Less_IntInt_ReturnValue) == 0x000504, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, CallFunc_GetIsSelected_IsSelected) == 0x000505, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::CallFunc_GetIsSelected_IsSelected' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, CallFunc_IsValid_ReturnValue_2) == 0x000506, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, K2Node_CustomEvent_NewState) == 0x000507, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::K2Node_CustomEvent_NewState' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, Temp_int_Loop_Counter_Variable_2) == 0x000508, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, K2Node_MakeArray_Array) == 0x000510, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, CallFunc_Less_IntInt_ReturnValue_1) == 0x000520, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, CallFunc_Add_IntInt_ReturnValue_2) == 0x000524, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, CallFunc_GetPlayerItems_Result) == 0x000528, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::CallFunc_GetPlayerItems_Result' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, CallFunc_GetPlayerItems_Items) == 0x000530, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::CallFunc_GetPlayerItems_Items' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, K2Node_CreateDelegate_OutputDelegate_1) == 0x000540, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000550, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, CallFunc_Set_ToArray_Result) == 0x000558, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::CallFunc_Set_ToArray_Result' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, K2Node_DynamicCast_AsWI_Workbench) == 0x000568, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::K2Node_DynamicCast_AsWI_Workbench' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, K2Node_DynamicCast_bSuccess_1) == 0x000578, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000579, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, CallFunc_BooleanAND_ReturnValue) == 0x00057A, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, K2Node_CustomEvent_bPressed) == 0x00057B, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::K2Node_CustomEvent_bPressed' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, K2Node_CustomEvent_bPlayAnim) == 0x00057C, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::K2Node_CustomEvent_bPlayAnim' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x00057D, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, CallFunc_IsValid_ReturnValue_3) == 0x00057E, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, CallFunc_GetAttachments_Empty) == 0x00057F, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::CallFunc_GetAttachments_Empty' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, CallFunc_GetAttachments_Attachments) == 0x000580, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::CallFunc_GetAttachments_Attachments' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, CallFunc_Array_Get_Item_3) == 0x000590, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, CallFunc_Array_Length_ReturnValue_2) == 0x0007B0, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, CallFunc_Less_IntInt_ReturnValue_2) == 0x0007B4, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, CallFunc_Array_Contains_ReturnValue) == 0x0007B5, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, CallFunc_Not_PreBool_ReturnValue) == 0x0007B6, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x0007B8, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x0007C0, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, CallFunc_IsValid_ReturnValue_4) == 0x0007C8, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, K2Node_Event_InFocusEvent_1) == 0x0007CC, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::K2Node_Event_InFocusEvent_1' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab, K2Node_Event_InFocusEvent) == 0x0007D4, "Member 'WBP_MainWeaponTab_C_ExecuteUbergraph_WBP_MainWeaponTab::K2Node_Event_InFocusEvent' has a wrong offset!");

// Function WBP_MainWeaponTab.WBP_MainWeaponTab_C.FindItems (Valid)
// 0x0370 (0x0370 - 0x0000)
struct WBP_MainWeaponTab_C_FindItems__Valid_ final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFItemInfo>                     ValidItems;                                        // 0x0008(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TSet<class UJSIContainer_C*>                  Containers;                                        // 0x0018(0x0050)(Edit, BlueprintVisible, ContainsInstancedReference)
	TArray<struct FFItemInfo>                     Items;                                             // 0x0068(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	bool                                          Dublicate;                                         // 0x0078(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FContainerPickupsInfo>          CallFunc_getItemsInventory_ContainerItems;         // 0x00B0(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<struct FContainerPickupsInfo>          CallFunc_getItemsInventory_ContainersData;         // 0x00C0(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FContainerPickupsInfo                  CallFunc_Array_Get_Item;                           // 0x00D0(0x0068)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             CallFunc_ConvertPickupItemToItemInfoFunc_ItemInfo; // 0x0140(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_361[0x3];                                      // 0x0361(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0369(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x036A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainWeaponTab_C_FindItems__Valid_) == 0x000008, "Wrong alignment on WBP_MainWeaponTab_C_FindItems__Valid_");
static_assert(sizeof(WBP_MainWeaponTab_C_FindItems__Valid_) == 0x000370, "Wrong size on WBP_MainWeaponTab_C_FindItems__Valid_");
static_assert(offsetof(WBP_MainWeaponTab_C_FindItems__Valid_, Result) == 0x000000, "Member 'WBP_MainWeaponTab_C_FindItems__Valid_::Result' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_FindItems__Valid_, ValidItems) == 0x000008, "Member 'WBP_MainWeaponTab_C_FindItems__Valid_::ValidItems' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_FindItems__Valid_, Containers) == 0x000018, "Member 'WBP_MainWeaponTab_C_FindItems__Valid_::Containers' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_FindItems__Valid_, Items) == 0x000068, "Member 'WBP_MainWeaponTab_C_FindItems__Valid_::Items' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_FindItems__Valid_, Dublicate) == 0x000078, "Member 'WBP_MainWeaponTab_C_FindItems__Valid_::Dublicate' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_FindItems__Valid_, Temp_int_Loop_Counter_Variable) == 0x00007C, "Member 'WBP_MainWeaponTab_C_FindItems__Valid_::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_FindItems__Valid_, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000080, "Member 'WBP_MainWeaponTab_C_FindItems__Valid_::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_FindItems__Valid_, CallFunc_Add_IntInt_ReturnValue) == 0x000084, "Member 'WBP_MainWeaponTab_C_FindItems__Valid_::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_FindItems__Valid_, CallFunc_GetOwningPlayer_ReturnValue) == 0x000088, "Member 'WBP_MainWeaponTab_C_FindItems__Valid_::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_FindItems__Valid_, CallFunc_K2_GetPawn_ReturnValue) == 0x000090, "Member 'WBP_MainWeaponTab_C_FindItems__Valid_::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_FindItems__Valid_, Temp_int_Array_Index_Variable) == 0x000098, "Member 'WBP_MainWeaponTab_C_FindItems__Valid_::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_FindItems__Valid_, K2Node_DynamicCast_AsSurvival_Player) == 0x0000A0, "Member 'WBP_MainWeaponTab_C_FindItems__Valid_::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_FindItems__Valid_, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'WBP_MainWeaponTab_C_FindItems__Valid_::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_FindItems__Valid_, CallFunc_getItemsInventory_ContainerItems) == 0x0000B0, "Member 'WBP_MainWeaponTab_C_FindItems__Valid_::CallFunc_getItemsInventory_ContainerItems' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_FindItems__Valid_, CallFunc_getItemsInventory_ContainersData) == 0x0000C0, "Member 'WBP_MainWeaponTab_C_FindItems__Valid_::CallFunc_getItemsInventory_ContainersData' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_FindItems__Valid_, CallFunc_Array_Get_Item) == 0x0000D0, "Member 'WBP_MainWeaponTab_C_FindItems__Valid_::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_FindItems__Valid_, CallFunc_Array_Length_ReturnValue) == 0x000138, "Member 'WBP_MainWeaponTab_C_FindItems__Valid_::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_FindItems__Valid_, CallFunc_ConvertPickupItemToItemInfoFunc_ItemInfo) == 0x000140, "Member 'WBP_MainWeaponTab_C_FindItems__Valid_::CallFunc_ConvertPickupItemToItemInfoFunc_ItemInfo' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_FindItems__Valid_, CallFunc_Less_IntInt_ReturnValue) == 0x000360, "Member 'WBP_MainWeaponTab_C_FindItems__Valid_::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWeaponTab_C_FindItems__Valid_, CallFunc_Array_Add_ReturnValue) == 0x000364, "Member 'WBP_MainWeaponTab_C_FindItems__Valid_::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
