#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CharacterSelector

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "FMODStudio_structs.hpp"


namespace SDK::Params
{

// Function WBP_CharacterSelector.WBP_CharacterSelector_C.ExecuteUbergraph_WBP_CharacterSelector
// 0x0078 (0x0078 - 0x0000)
struct WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CharacterRow_C*                    K2Node_DynamicCast_AsWBP_Character_Row;            // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_1;                // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector) == 0x000008, "Wrong alignment on WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector");
static_assert(sizeof(WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector) == 0x000078, "Wrong size on WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector");
static_assert(offsetof(WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector, EntryPoint) == 0x000000, "Member 'WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector, K2Node_Event_IsDesignTime) == 0x000010, "Member 'WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector, CallFunc_GetAllChildren_ReturnValue) == 0x000028, "Member 'WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector, CallFunc_Array_Get_Item) == 0x000038, "Member 'WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector, K2Node_DynamicCast_AsWBP_Character_Row) == 0x000048, "Member 'WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector::K2Node_DynamicCast_AsWBP_Character_Row' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector, CallFunc_Less_IntInt_ReturnValue) == 0x000051, "Member 'WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector, CallFunc_PlayAnimation_ReturnValue) == 0x000058, "Member 'WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector, CallFunc_PlayAnimation_ReturnValue_1) == 0x000060, "Member 'WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector, CallFunc_PlayEvent2D_ReturnValue) == 0x000068, "Member 'WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector::CallFunc_PlayEvent2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector, CallFunc_PlayEvent2D_ReturnValue_1) == 0x000070, "Member 'WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector::CallFunc_PlayEvent2D_ReturnValue_1' has a wrong offset!");

// Function WBP_CharacterSelector.WBP_CharacterSelector_C.IsValidCharacter
// 0x0028 (0x0028 - 0x0000)
struct WBP_CharacterSelector_C_IsValidCharacter final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FunctionResult;                                    // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival;                  // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelector_C_IsValidCharacter) == 0x000008, "Wrong alignment on WBP_CharacterSelector_C_IsValidCharacter");
static_assert(sizeof(WBP_CharacterSelector_C_IsValidCharacter) == 0x000028, "Wrong size on WBP_CharacterSelector_C_IsValidCharacter");
static_assert(offsetof(WBP_CharacterSelector_C_IsValidCharacter, Result) == 0x000000, "Member 'WBP_CharacterSelector_C_IsValidCharacter::Result' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_IsValidCharacter, FunctionResult) == 0x000001, "Member 'WBP_CharacterSelector_C_IsValidCharacter::FunctionResult' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_IsValidCharacter, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'WBP_CharacterSelector_C_IsValidCharacter::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_IsValidCharacter, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_CharacterSelector_C_IsValidCharacter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_IsValidCharacter, K2Node_DynamicCast_AsGI_Survival) == 0x000018, "Member 'WBP_CharacterSelector_C_IsValidCharacter::K2Node_DynamicCast_AsGI_Survival' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_IsValidCharacter, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_CharacterSelector_C_IsValidCharacter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_IsValidCharacter, CallFunc_BooleanAND_ReturnValue) == 0x000021, "Member 'WBP_CharacterSelector_C_IsValidCharacter::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_CharacterSelector.WBP_CharacterSelector_C.OnClickedDeleteCharacter
// 0x0028 (0x0028 - 0x0000)
struct WBP_CharacterSelector_C_OnClickedDeleteCharacter final
{
public:
	bool                                          CallFunc_DeleteGameInSlot_ReturnValue;             // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DeleteGameInSlot_ReturnValue_1;           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival;                  // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DeleteGameInSlot_ReturnValue_2;           // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelector_C_OnClickedDeleteCharacter) == 0x000008, "Wrong alignment on WBP_CharacterSelector_C_OnClickedDeleteCharacter");
static_assert(sizeof(WBP_CharacterSelector_C_OnClickedDeleteCharacter) == 0x000028, "Wrong size on WBP_CharacterSelector_C_OnClickedDeleteCharacter");
static_assert(offsetof(WBP_CharacterSelector_C_OnClickedDeleteCharacter, CallFunc_DeleteGameInSlot_ReturnValue) == 0x000000, "Member 'WBP_CharacterSelector_C_OnClickedDeleteCharacter::CallFunc_DeleteGameInSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_OnClickedDeleteCharacter, CallFunc_DeleteGameInSlot_ReturnValue_1) == 0x000001, "Member 'WBP_CharacterSelector_C_OnClickedDeleteCharacter::CallFunc_DeleteGameInSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_OnClickedDeleteCharacter, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'WBP_CharacterSelector_C_OnClickedDeleteCharacter::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_OnClickedDeleteCharacter, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_CharacterSelector_C_OnClickedDeleteCharacter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_OnClickedDeleteCharacter, K2Node_DynamicCast_AsGI_Survival) == 0x000018, "Member 'WBP_CharacterSelector_C_OnClickedDeleteCharacter::K2Node_DynamicCast_AsGI_Survival' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_OnClickedDeleteCharacter, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_CharacterSelector_C_OnClickedDeleteCharacter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_OnClickedDeleteCharacter, CallFunc_BooleanAND_ReturnValue) == 0x000021, "Member 'WBP_CharacterSelector_C_OnClickedDeleteCharacter::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_OnClickedDeleteCharacter, CallFunc_DeleteGameInSlot_ReturnValue_2) == 0x000022, "Member 'WBP_CharacterSelector_C_OnClickedDeleteCharacter::CallFunc_DeleteGameInSlot_ReturnValue_2' has a wrong offset!");

// Function WBP_CharacterSelector.WBP_CharacterSelector_C.OnUpdateStateWidget
// 0x0009 (0x0009 - 0x0000)
struct WBP_CharacterSelector_C_OnUpdateStateWidget final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidCharacter_Result;                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelector_C_OnUpdateStateWidget) == 0x000001, "Wrong alignment on WBP_CharacterSelector_C_OnUpdateStateWidget");
static_assert(sizeof(WBP_CharacterSelector_C_OnUpdateStateWidget) == 0x000009, "Wrong size on WBP_CharacterSelector_C_OnUpdateStateWidget");
static_assert(offsetof(WBP_CharacterSelector_C_OnUpdateStateWidget, Temp_byte_Variable) == 0x000000, "Member 'WBP_CharacterSelector_C_OnUpdateStateWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_OnUpdateStateWidget, Temp_byte_Variable_1) == 0x000001, "Member 'WBP_CharacterSelector_C_OnUpdateStateWidget::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_OnUpdateStateWidget, Temp_bool_Variable) == 0x000002, "Member 'WBP_CharacterSelector_C_OnUpdateStateWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_OnUpdateStateWidget, Temp_byte_Variable_2) == 0x000003, "Member 'WBP_CharacterSelector_C_OnUpdateStateWidget::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_OnUpdateStateWidget, Temp_byte_Variable_3) == 0x000004, "Member 'WBP_CharacterSelector_C_OnUpdateStateWidget::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_OnUpdateStateWidget, Temp_bool_Variable_1) == 0x000005, "Member 'WBP_CharacterSelector_C_OnUpdateStateWidget::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_OnUpdateStateWidget, CallFunc_IsValidCharacter_Result) == 0x000006, "Member 'WBP_CharacterSelector_C_OnUpdateStateWidget::CallFunc_IsValidCharacter_Result' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_OnUpdateStateWidget, K2Node_Select_Default) == 0x000007, "Member 'WBP_CharacterSelector_C_OnUpdateStateWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_OnUpdateStateWidget, K2Node_Select_Default_1) == 0x000008, "Member 'WBP_CharacterSelector_C_OnUpdateStateWidget::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_CharacterSelector.WBP_CharacterSelector_C.OnUpdateVisibilityWidget
// 0x0001 (0x0001 - 0x0000)
struct WBP_CharacterSelector_C_OnUpdateVisibilityWidget final
{
public:
	ESlateVisibility                              NewVisibility;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelector_C_OnUpdateVisibilityWidget) == 0x000001, "Wrong alignment on WBP_CharacterSelector_C_OnUpdateVisibilityWidget");
static_assert(sizeof(WBP_CharacterSelector_C_OnUpdateVisibilityWidget) == 0x000001, "Wrong size on WBP_CharacterSelector_C_OnUpdateVisibilityWidget");
static_assert(offsetof(WBP_CharacterSelector_C_OnUpdateVisibilityWidget, NewVisibility) == 0x000000, "Member 'WBP_CharacterSelector_C_OnUpdateVisibilityWidget::NewVisibility' has a wrong offset!");

// Function WBP_CharacterSelector.WBP_CharacterSelector_C.OnValidate
// 0x0010 (0x0010 - 0x0000)
struct WBP_CharacterSelector_C_OnValidate final
{
public:
	TDelegate<void(ESlateVisibility InVisibility)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelector_C_OnValidate) == 0x000004, "Wrong alignment on WBP_CharacterSelector_C_OnValidate");
static_assert(sizeof(WBP_CharacterSelector_C_OnValidate) == 0x000010, "Wrong size on WBP_CharacterSelector_C_OnValidate");
static_assert(offsetof(WBP_CharacterSelector_C_OnValidate, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_CharacterSelector_C_OnValidate::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WBP_CharacterSelector.WBP_CharacterSelector_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CharacterSelector_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelector_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_CharacterSelector_C_PreConstruct");
static_assert(sizeof(WBP_CharacterSelector_C_PreConstruct) == 0x000001, "Wrong size on WBP_CharacterSelector_C_PreConstruct");
static_assert(offsetof(WBP_CharacterSelector_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_CharacterSelector_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_CharacterSelector.WBP_CharacterSelector_C.SetServerName
// 0x0018 (0x0018 - 0x0000)
struct WBP_CharacterSelector_C_SetServerName final
{
public:
	class FText                                   ServerName;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_CharacterSelector_C_SetServerName) == 0x000008, "Wrong alignment on WBP_CharacterSelector_C_SetServerName");
static_assert(sizeof(WBP_CharacterSelector_C_SetServerName) == 0x000018, "Wrong size on WBP_CharacterSelector_C_SetServerName");
static_assert(offsetof(WBP_CharacterSelector_C_SetServerName, ServerName) == 0x000000, "Member 'WBP_CharacterSelector_C_SetServerName::ServerName' has a wrong offset!");

}

