#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ItemInteractionContainerEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FItemInfo_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ItemInteractionContainerEntry.WBP_ItemInteractionContainerEntry_C
// 0x02F0 (0x0570 - 0x0280)
class UWBP_ItemInteractionContainerEntry_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoverBGItemIcon;                                   // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ProgressFill_anim;                                 // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Deselect_Anim;                                     // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Select_Anim;                                       // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover_Anim;                                        // 0x02A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_CraftItem;                                  // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BG;                                          // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BGItemIcon;                                  // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Hovered;                                     // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ItemIcon;                                    // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Selected;                                    // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar;                                       // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Counter;                                      // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_ItemName;                                     // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_NotEnoughResources;                           // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FFItemInfo                             ItemInfo;                                          // 0x0300(0x0220)(Edit, BlueprintVisible, ContainsInstancedReference, ExposeOnSpawn, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnSelected;                                        // 0x0520(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          No_enough_resources;                               // 0x0530(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowCounter;                                       // 0x0531(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_532[0x6];                                      // 0x0532(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnInstantCraft;                                    // 0x0538(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bCustomLock;                                       // 0x0548(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Selected;                                          // 0x0549(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Hovered;                                           // 0x054A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54B[0x5];                                      // 0x054B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnUnhovered;                                       // 0x0550(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnHovered;                                         // 0x0560(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_CraftItem_Button_CraftItem_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__WBP_ItemInteractionContainerEntry_Button_CraftItem_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_ItemInteractionContainerEntry_Button_CraftItem_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature();
	void ButtonHover(bool bHovered, bool bWithAnim);
	void ExecuteUbergraph_WBP_ItemInteractionContainerEntry(int32 EntryPoint);
	void GetCustomLock(bool* Param_bCustomLock);
	void GetItemInfo(struct FFItemInfo* Param_ItemInfo);
	void GetItemName(class FName* CraftItemName);
	void Init(const struct FFItemInfo& Item);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnHovered__DelegateSignature(class UWBP_ItemInteractionContainerEntry_C* Ref);
	void OnInstantCraft__DelegateSignature(class UWBP_ItemInteractionContainerEntry_C* Entry);
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnSelected__DelegateSignature(class UWBP_ItemInteractionContainerEntry_C* ItemWidgetRef);
	void OnUnhovered__DelegateSignature(class UWBP_ItemInteractionContainerEntry_C* Ref);
	void PreConstruct(bool IsDesignTime);
	void SelectEntry();
	void SetBGItemIcon(class UWBP_ItemInteractionContainerEntry_C* Ref);
	void SetCanUseAction(bool CanCraft);
	void SetCustomLock(bool Lock);
	void SetItemIconSize();
	void SetSelected(bool Param_Selected);
	void StartProgress();
	void StopProgress();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ItemInteractionContainerEntry_C">();
	}
	static class UWBP_ItemInteractionContainerEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ItemInteractionContainerEntry_C>();
	}
};
static_assert(alignof(UWBP_ItemInteractionContainerEntry_C) == 0x000008, "Wrong alignment on UWBP_ItemInteractionContainerEntry_C");
static_assert(sizeof(UWBP_ItemInteractionContainerEntry_C) == 0x000570, "Wrong size on UWBP_ItemInteractionContainerEntry_C");
static_assert(offsetof(UWBP_ItemInteractionContainerEntry_C, UberGraphFrame) == 0x000280, "Member 'UWBP_ItemInteractionContainerEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ItemInteractionContainerEntry_C, HoverBGItemIcon) == 0x000288, "Member 'UWBP_ItemInteractionContainerEntry_C::HoverBGItemIcon' has a wrong offset!");
static_assert(offsetof(UWBP_ItemInteractionContainerEntry_C, ProgressFill_anim) == 0x000290, "Member 'UWBP_ItemInteractionContainerEntry_C::ProgressFill_anim' has a wrong offset!");
static_assert(offsetof(UWBP_ItemInteractionContainerEntry_C, Deselect_Anim) == 0x000298, "Member 'UWBP_ItemInteractionContainerEntry_C::Deselect_Anim' has a wrong offset!");
static_assert(offsetof(UWBP_ItemInteractionContainerEntry_C, Select_Anim) == 0x0002A0, "Member 'UWBP_ItemInteractionContainerEntry_C::Select_Anim' has a wrong offset!");
static_assert(offsetof(UWBP_ItemInteractionContainerEntry_C, Hover_Anim) == 0x0002A8, "Member 'UWBP_ItemInteractionContainerEntry_C::Hover_Anim' has a wrong offset!");
static_assert(offsetof(UWBP_ItemInteractionContainerEntry_C, Button_CraftItem) == 0x0002B0, "Member 'UWBP_ItemInteractionContainerEntry_C::Button_CraftItem' has a wrong offset!");
static_assert(offsetof(UWBP_ItemInteractionContainerEntry_C, Image_BG) == 0x0002B8, "Member 'UWBP_ItemInteractionContainerEntry_C::Image_BG' has a wrong offset!");
static_assert(offsetof(UWBP_ItemInteractionContainerEntry_C, Image_BGItemIcon) == 0x0002C0, "Member 'UWBP_ItemInteractionContainerEntry_C::Image_BGItemIcon' has a wrong offset!");
static_assert(offsetof(UWBP_ItemInteractionContainerEntry_C, Image_Hovered) == 0x0002C8, "Member 'UWBP_ItemInteractionContainerEntry_C::Image_Hovered' has a wrong offset!");
static_assert(offsetof(UWBP_ItemInteractionContainerEntry_C, Image_ItemIcon) == 0x0002D0, "Member 'UWBP_ItemInteractionContainerEntry_C::Image_ItemIcon' has a wrong offset!");
static_assert(offsetof(UWBP_ItemInteractionContainerEntry_C, Image_Selected) == 0x0002D8, "Member 'UWBP_ItemInteractionContainerEntry_C::Image_Selected' has a wrong offset!");
static_assert(offsetof(UWBP_ItemInteractionContainerEntry_C, ProgressBar) == 0x0002E0, "Member 'UWBP_ItemInteractionContainerEntry_C::ProgressBar' has a wrong offset!");
static_assert(offsetof(UWBP_ItemInteractionContainerEntry_C, Text_Counter) == 0x0002E8, "Member 'UWBP_ItemInteractionContainerEntry_C::Text_Counter' has a wrong offset!");
static_assert(offsetof(UWBP_ItemInteractionContainerEntry_C, Text_ItemName) == 0x0002F0, "Member 'UWBP_ItemInteractionContainerEntry_C::Text_ItemName' has a wrong offset!");
static_assert(offsetof(UWBP_ItemInteractionContainerEntry_C, Text_NotEnoughResources) == 0x0002F8, "Member 'UWBP_ItemInteractionContainerEntry_C::Text_NotEnoughResources' has a wrong offset!");
static_assert(offsetof(UWBP_ItemInteractionContainerEntry_C, ItemInfo) == 0x000300, "Member 'UWBP_ItemInteractionContainerEntry_C::ItemInfo' has a wrong offset!");
static_assert(offsetof(UWBP_ItemInteractionContainerEntry_C, OnSelected) == 0x000520, "Member 'UWBP_ItemInteractionContainerEntry_C::OnSelected' has a wrong offset!");
static_assert(offsetof(UWBP_ItemInteractionContainerEntry_C, No_enough_resources) == 0x000530, "Member 'UWBP_ItemInteractionContainerEntry_C::No_enough_resources' has a wrong offset!");
static_assert(offsetof(UWBP_ItemInteractionContainerEntry_C, ShowCounter) == 0x000531, "Member 'UWBP_ItemInteractionContainerEntry_C::ShowCounter' has a wrong offset!");
static_assert(offsetof(UWBP_ItemInteractionContainerEntry_C, OnInstantCraft) == 0x000538, "Member 'UWBP_ItemInteractionContainerEntry_C::OnInstantCraft' has a wrong offset!");
static_assert(offsetof(UWBP_ItemInteractionContainerEntry_C, bCustomLock) == 0x000548, "Member 'UWBP_ItemInteractionContainerEntry_C::bCustomLock' has a wrong offset!");
static_assert(offsetof(UWBP_ItemInteractionContainerEntry_C, Selected) == 0x000549, "Member 'UWBP_ItemInteractionContainerEntry_C::Selected' has a wrong offset!");
static_assert(offsetof(UWBP_ItemInteractionContainerEntry_C, Hovered) == 0x00054A, "Member 'UWBP_ItemInteractionContainerEntry_C::Hovered' has a wrong offset!");
static_assert(offsetof(UWBP_ItemInteractionContainerEntry_C, OnUnhovered) == 0x000550, "Member 'UWBP_ItemInteractionContainerEntry_C::OnUnhovered' has a wrong offset!");
static_assert(offsetof(UWBP_ItemInteractionContainerEntry_C, OnHovered) == 0x000560, "Member 'UWBP_ItemInteractionContainerEntry_C::OnHovered' has a wrong offset!");

}

