#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Workbench

#include "Basic.hpp"

#include "EDismantleType_structs.hpp"
#include "E_WorkbenchTabTypes_structs.hpp"
#include "Engine_structs.hpp"
#include "FItemInfo_structs.hpp"
#include "FMODStudio_structs.hpp"
#include "ContainerPickupsInfo_structs.hpp"
#include "UMG_structs.hpp"
#include "S_ItemsToCraft_structs.hpp"
#include "S_NeedItems_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Workbench.WBP_Workbench_C.BndEvt__WBP_Workbench_WBP_CraftWindow_K2Node_ComponentBoundEvent_20_OnCreateCountChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_CraftWindow_K2Node_ComponentBoundEvent_20_OnCreateCountChanged__DelegateSignature final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_CraftWindow_K2Node_ComponentBoundEvent_20_OnCreateCountChanged__DelegateSignature) == 0x000004, "Wrong alignment on WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_CraftWindow_K2Node_ComponentBoundEvent_20_OnCreateCountChanged__DelegateSignature");
static_assert(sizeof(WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_CraftWindow_K2Node_ComponentBoundEvent_20_OnCreateCountChanged__DelegateSignature) == 0x000004, "Wrong size on WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_CraftWindow_K2Node_ComponentBoundEvent_20_OnCreateCountChanged__DelegateSignature");
static_assert(offsetof(WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_CraftWindow_K2Node_ComponentBoundEvent_20_OnCreateCountChanged__DelegateSignature, Count) == 0x000000, "Member 'WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_CraftWindow_K2Node_ComponentBoundEvent_20_OnCreateCountChanged__DelegateSignature::Count' has a wrong offset!");

// Function WBP_Workbench.WBP_Workbench_C.BndEvt__WBP_Workbench_WBP_CraftWindow_K2Node_ComponentBoundEvent_24_OnProcessStarted__DelegateSignature
// 0x0220 (0x0220 - 0x0000)
struct WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_CraftWindow_K2Node_ComponentBoundEvent_24_OnProcessStarted__DelegateSignature final
{
public:
	struct FFItemInfo                             Info;                                              // 0x0000(0x0220)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_CraftWindow_K2Node_ComponentBoundEvent_24_OnProcessStarted__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_CraftWindow_K2Node_ComponentBoundEvent_24_OnProcessStarted__DelegateSignature");
static_assert(sizeof(WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_CraftWindow_K2Node_ComponentBoundEvent_24_OnProcessStarted__DelegateSignature) == 0x000220, "Wrong size on WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_CraftWindow_K2Node_ComponentBoundEvent_24_OnProcessStarted__DelegateSignature");
static_assert(offsetof(WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_CraftWindow_K2Node_ComponentBoundEvent_24_OnProcessStarted__DelegateSignature, Info) == 0x000000, "Member 'WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_CraftWindow_K2Node_ComponentBoundEvent_24_OnProcessStarted__DelegateSignature::Info' has a wrong offset!");

// Function WBP_Workbench.WBP_Workbench_C.BndEvt__WBP_Workbench_WBP_DismantleWindow2_K2Node_ComponentBoundEvent_27_ProcessFinished__DelegateSignature
// 0x0220 (0x0220 - 0x0000)
struct WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_DismantleWindow2_K2Node_ComponentBoundEvent_27_ProcessFinished__DelegateSignature final
{
public:
	struct FFItemInfo                             ItemInfo;                                          // 0x0000(0x0220)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_DismantleWindow2_K2Node_ComponentBoundEvent_27_ProcessFinished__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_DismantleWindow2_K2Node_ComponentBoundEvent_27_ProcessFinished__DelegateSignature");
static_assert(sizeof(WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_DismantleWindow2_K2Node_ComponentBoundEvent_27_ProcessFinished__DelegateSignature) == 0x000220, "Wrong size on WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_DismantleWindow2_K2Node_ComponentBoundEvent_27_ProcessFinished__DelegateSignature");
static_assert(offsetof(WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_DismantleWindow2_K2Node_ComponentBoundEvent_27_ProcessFinished__DelegateSignature, ItemInfo) == 0x000000, "Member 'WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_DismantleWindow2_K2Node_ComponentBoundEvent_27_ProcessFinished__DelegateSignature::ItemInfo' has a wrong offset!");

// Function WBP_Workbench.WBP_Workbench_C.BndEvt__WBP_Workbench_WBP_DismantleWindow2_K2Node_ComponentBoundEvent_30_OnCreateCountChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_DismantleWindow2_K2Node_ComponentBoundEvent_30_OnCreateCountChanged__DelegateSignature final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_DismantleWindow2_K2Node_ComponentBoundEvent_30_OnCreateCountChanged__DelegateSignature) == 0x000004, "Wrong alignment on WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_DismantleWindow2_K2Node_ComponentBoundEvent_30_OnCreateCountChanged__DelegateSignature");
static_assert(sizeof(WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_DismantleWindow2_K2Node_ComponentBoundEvent_30_OnCreateCountChanged__DelegateSignature) == 0x000004, "Wrong size on WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_DismantleWindow2_K2Node_ComponentBoundEvent_30_OnCreateCountChanged__DelegateSignature");
static_assert(offsetof(WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_DismantleWindow2_K2Node_ComponentBoundEvent_30_OnCreateCountChanged__DelegateSignature, Count) == 0x000000, "Member 'WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_DismantleWindow2_K2Node_ComponentBoundEvent_30_OnCreateCountChanged__DelegateSignature::Count' has a wrong offset!");

// Function WBP_Workbench.WBP_Workbench_C.BndEvt__WBP_Workbench_WBP_DismantleWindow2_K2Node_ComponentBoundEvent_31_OnProcessStarted__DelegateSignature
// 0x0220 (0x0220 - 0x0000)
struct WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_DismantleWindow2_K2Node_ComponentBoundEvent_31_OnProcessStarted__DelegateSignature final
{
public:
	struct FFItemInfo                             Info;                                              // 0x0000(0x0220)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_DismantleWindow2_K2Node_ComponentBoundEvent_31_OnProcessStarted__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_DismantleWindow2_K2Node_ComponentBoundEvent_31_OnProcessStarted__DelegateSignature");
static_assert(sizeof(WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_DismantleWindow2_K2Node_ComponentBoundEvent_31_OnProcessStarted__DelegateSignature) == 0x000220, "Wrong size on WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_DismantleWindow2_K2Node_ComponentBoundEvent_31_OnProcessStarted__DelegateSignature");
static_assert(offsetof(WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_DismantleWindow2_K2Node_ComponentBoundEvent_31_OnProcessStarted__DelegateSignature, Info) == 0x000000, "Member 'WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_DismantleWindow2_K2Node_ComponentBoundEvent_31_OnProcessStarted__DelegateSignature::Info' has a wrong offset!");

// Function WBP_Workbench.WBP_Workbench_C.BndEvt__WBP_Workbench_WBP_ItemToInventory_K2Node_ComponentBoundEvent_14_ProcessFinished__DelegateSignature
// 0x0220 (0x0220 - 0x0000)
struct WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_ItemToInventory_K2Node_ComponentBoundEvent_14_ProcessFinished__DelegateSignature final
{
public:
	struct FFItemInfo                             ItemInfo;                                          // 0x0000(0x0220)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_ItemToInventory_K2Node_ComponentBoundEvent_14_ProcessFinished__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_ItemToInventory_K2Node_ComponentBoundEvent_14_ProcessFinished__DelegateSignature");
static_assert(sizeof(WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_ItemToInventory_K2Node_ComponentBoundEvent_14_ProcessFinished__DelegateSignature) == 0x000220, "Wrong size on WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_ItemToInventory_K2Node_ComponentBoundEvent_14_ProcessFinished__DelegateSignature");
static_assert(offsetof(WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_ItemToInventory_K2Node_ComponentBoundEvent_14_ProcessFinished__DelegateSignature, ItemInfo) == 0x000000, "Member 'WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_ItemToInventory_K2Node_ComponentBoundEvent_14_ProcessFinished__DelegateSignature::ItemInfo' has a wrong offset!");

// Function WBP_Workbench.WBP_Workbench_C.BndEvt__WBP_Workbench_WBP_MainCategorySelector_K2Node_ComponentBoundEvent_26_OnCategoryChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_MainCategorySelector_K2Node_ComponentBoundEvent_26_OnCategoryChanged__DelegateSignature final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_MainCategorySelector_K2Node_ComponentBoundEvent_26_OnCategoryChanged__DelegateSignature) == 0x000004, "Wrong alignment on WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_MainCategorySelector_K2Node_ComponentBoundEvent_26_OnCategoryChanged__DelegateSignature");
static_assert(sizeof(WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_MainCategorySelector_K2Node_ComponentBoundEvent_26_OnCategoryChanged__DelegateSignature) == 0x000004, "Wrong size on WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_MainCategorySelector_K2Node_ComponentBoundEvent_26_OnCategoryChanged__DelegateSignature");
static_assert(offsetof(WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_MainCategorySelector_K2Node_ComponentBoundEvent_26_OnCategoryChanged__DelegateSignature, Param_Index) == 0x000000, "Member 'WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_MainCategorySelector_K2Node_ComponentBoundEvent_26_OnCategoryChanged__DelegateSignature::Param_Index' has a wrong offset!");

// Function WBP_Workbench.WBP_Workbench_C.BndEvt__WBP_Workbench_WBP_WeaponTab_K2Node_ComponentBoundEvent_19_OnAddedInFocusPath__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_WeaponTab_K2Node_ComponentBoundEvent_19_OnAddedInFocusPath__DelegateSignature final
{
public:
	bool                                          bAdded;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_WeaponTab_K2Node_ComponentBoundEvent_19_OnAddedInFocusPath__DelegateSignature) == 0x000001, "Wrong alignment on WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_WeaponTab_K2Node_ComponentBoundEvent_19_OnAddedInFocusPath__DelegateSignature");
static_assert(sizeof(WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_WeaponTab_K2Node_ComponentBoundEvent_19_OnAddedInFocusPath__DelegateSignature) == 0x000001, "Wrong size on WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_WeaponTab_K2Node_ComponentBoundEvent_19_OnAddedInFocusPath__DelegateSignature");
static_assert(offsetof(WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_WeaponTab_K2Node_ComponentBoundEvent_19_OnAddedInFocusPath__DelegateSignature, bAdded) == 0x000000, "Member 'WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_WeaponTab_K2Node_ComponentBoundEvent_19_OnAddedInFocusPath__DelegateSignature::bAdded' has a wrong offset!");

// Function WBP_Workbench.WBP_Workbench_C.BndEvt__WBP_Workbench_WBP_WeaponTab_K2Node_ComponentBoundEvent_22_OnAttachmentVisibilityChange__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_WeaponTab_K2Node_ComponentBoundEvent_22_OnAttachmentVisibilityChange__DelegateSignature final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_WeaponTab_K2Node_ComponentBoundEvent_22_OnAttachmentVisibilityChange__DelegateSignature) == 0x000001, "Wrong alignment on WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_WeaponTab_K2Node_ComponentBoundEvent_22_OnAttachmentVisibilityChange__DelegateSignature");
static_assert(sizeof(WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_WeaponTab_K2Node_ComponentBoundEvent_22_OnAttachmentVisibilityChange__DelegateSignature) == 0x000001, "Wrong size on WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_WeaponTab_K2Node_ComponentBoundEvent_22_OnAttachmentVisibilityChange__DelegateSignature");
static_assert(offsetof(WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_WeaponTab_K2Node_ComponentBoundEvent_22_OnAttachmentVisibilityChange__DelegateSignature, Visible) == 0x000000, "Member 'WBP_Workbench_C_BndEvt__WBP_Workbench_WBP_WeaponTab_K2Node_ComponentBoundEvent_22_OnAttachmentVisibilityChange__DelegateSignature::Visible' has a wrong offset!");

// Function WBP_Workbench.WBP_Workbench_C.CanCraftItem
// 0x0330 (0x0330 - 0x0000)
struct WBP_Workbench_C_CanCraftItem final
{
public:
	class FName                                   RowName;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanCraft;                                          // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EDismantleType, int32>                   CurrentResurces;                                   // 0x0010(0x0050)(Parm, OutParm)
	TMap<EDismantleType, int32>                   RequiredResources;                                 // 0x0060(0x0050)(Parm, OutParm)
	bool                                          bCanCraft;                                         // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EDismantleType, int32>                   ItemCraftResourcesResurces;                        // 0x00B8(0x0050)(Edit, BlueprintVisible)
	TMap<EDismantleType, int32>                   PlayerResurces;                                    // 0x0108(0x0050)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_ItemsToCraft                        CallFunc_GetDataTableRowFromName_OutRow;           // 0x0160(0x0150)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x3];                                      // 0x02B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EDismantleType>                        CallFunc_Map_Keys_Keys;                            // 0x02B8(0x0010)(ReferenceParm)
	EDismantleType                                CallFunc_Array_Get_Item;                           // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x3];                                      // 0x02C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x02D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E1[0x3];                                      // 0x02E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Map_Find_Value;                           // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E9[0x3];                                      // 0x02E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x02F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC;                  // 0x0300(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      CallFunc_GetPlayerRef_SurvivalPlayer;              // 0x0318(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemCountByName_ReturnedCount;         // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0324(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Workbench_C_CanCraftItem) == 0x000010, "Wrong alignment on WBP_Workbench_C_CanCraftItem");
static_assert(sizeof(WBP_Workbench_C_CanCraftItem) == 0x000330, "Wrong size on WBP_Workbench_C_CanCraftItem");
static_assert(offsetof(WBP_Workbench_C_CanCraftItem, RowName) == 0x000000, "Member 'WBP_Workbench_C_CanCraftItem::RowName' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CanCraftItem, Count) == 0x000008, "Member 'WBP_Workbench_C_CanCraftItem::Count' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CanCraftItem, CanCraft) == 0x00000C, "Member 'WBP_Workbench_C_CanCraftItem::CanCraft' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CanCraftItem, CurrentResurces) == 0x000010, "Member 'WBP_Workbench_C_CanCraftItem::CurrentResurces' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CanCraftItem, RequiredResources) == 0x000060, "Member 'WBP_Workbench_C_CanCraftItem::RequiredResources' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CanCraftItem, bCanCraft) == 0x0000B0, "Member 'WBP_Workbench_C_CanCraftItem::bCanCraft' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CanCraftItem, ItemCraftResourcesResurces) == 0x0000B8, "Member 'WBP_Workbench_C_CanCraftItem::ItemCraftResourcesResurces' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CanCraftItem, PlayerResurces) == 0x000108, "Member 'WBP_Workbench_C_CanCraftItem::PlayerResurces' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CanCraftItem, Temp_int_Array_Index_Variable) == 0x000158, "Member 'WBP_Workbench_C_CanCraftItem::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CanCraftItem, CallFunc_GetDataTableRowFromName_OutRow) == 0x000160, "Member 'WBP_Workbench_C_CanCraftItem::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CanCraftItem, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0002B0, "Member 'WBP_Workbench_C_CanCraftItem::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CanCraftItem, Temp_int_Loop_Counter_Variable) == 0x0002B4, "Member 'WBP_Workbench_C_CanCraftItem::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CanCraftItem, CallFunc_Map_Keys_Keys) == 0x0002B8, "Member 'WBP_Workbench_C_CanCraftItem::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CanCraftItem, CallFunc_Array_Get_Item) == 0x0002C8, "Member 'WBP_Workbench_C_CanCraftItem::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CanCraftItem, CallFunc_Array_Length_ReturnValue) == 0x0002CC, "Member 'WBP_Workbench_C_CanCraftItem::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CanCraftItem, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x0002D0, "Member 'WBP_Workbench_C_CanCraftItem::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CanCraftItem, CallFunc_Less_IntInt_ReturnValue) == 0x0002E0, "Member 'WBP_Workbench_C_CanCraftItem::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CanCraftItem, CallFunc_Map_Find_Value) == 0x0002E4, "Member 'WBP_Workbench_C_CanCraftItem::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CanCraftItem, CallFunc_Map_Find_ReturnValue) == 0x0002E8, "Member 'WBP_Workbench_C_CanCraftItem::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CanCraftItem, CallFunc_Add_IntInt_ReturnValue) == 0x0002EC, "Member 'WBP_Workbench_C_CanCraftItem::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CanCraftItem, CallFunc_Multiply_IntInt_ReturnValue) == 0x0002F0, "Member 'WBP_Workbench_C_CanCraftItem::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CanCraftItem, CallFunc_GetPlayerController_ReturnValue) == 0x0002F8, "Member 'WBP_Workbench_C_CanCraftItem::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CanCraftItem, K2Node_DynamicCast_AsBPI_Surv_PC) == 0x000300, "Member 'WBP_Workbench_C_CanCraftItem::K2Node_DynamicCast_AsBPI_Surv_PC' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CanCraftItem, K2Node_DynamicCast_bSuccess) == 0x000310, "Member 'WBP_Workbench_C_CanCraftItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CanCraftItem, CallFunc_GetPlayerRef_SurvivalPlayer) == 0x000318, "Member 'WBP_Workbench_C_CanCraftItem::CallFunc_GetPlayerRef_SurvivalPlayer' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CanCraftItem, CallFunc_GetItemCountByName_ReturnedCount) == 0x000320, "Member 'WBP_Workbench_C_CanCraftItem::CallFunc_GetItemCountByName_ReturnedCount' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CanCraftItem, CallFunc_Less_IntInt_ReturnValue_1) == 0x000324, "Member 'WBP_Workbench_C_CanCraftItem::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function WBP_Workbench.WBP_Workbench_C.CheckDismantleItems
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_Workbench_C_CheckDismantleItems final
{
public:
	TSet<int32>                                   K2Node_MakeSet_Set;                                // 0x0000(0x0050)()
	TSet<int32>                                   K2Node_MakeSet_Set_1;                              // 0x0050(0x0050)()
	bool                                          CallFunc_HaveDismantleItems_HasItems;              // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Workbench_C_CheckDismantleItems) == 0x000008, "Wrong alignment on WBP_Workbench_C_CheckDismantleItems");
static_assert(sizeof(WBP_Workbench_C_CheckDismantleItems) == 0x0000A8, "Wrong size on WBP_Workbench_C_CheckDismantleItems");
static_assert(offsetof(WBP_Workbench_C_CheckDismantleItems, K2Node_MakeSet_Set) == 0x000000, "Member 'WBP_Workbench_C_CheckDismantleItems::K2Node_MakeSet_Set' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CheckDismantleItems, K2Node_MakeSet_Set_1) == 0x000050, "Member 'WBP_Workbench_C_CheckDismantleItems::K2Node_MakeSet_Set_1' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CheckDismantleItems, CallFunc_HaveDismantleItems_HasItems) == 0x0000A0, "Member 'WBP_Workbench_C_CheckDismantleItems::CallFunc_HaveDismantleItems_HasItems' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CheckDismantleItems, CallFunc_Not_PreBool_ReturnValue) == 0x0000A1, "Member 'WBP_Workbench_C_CheckDismantleItems::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_Workbench.WBP_Workbench_C.CraftEntriesChecking
// 0x0308 (0x0308 - 0x0000)
struct WBP_Workbench_C_CraftEntriesChecking final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_ItemInteractionContainerEntry_C*> CallFunc_GetListOfItems_EntryList;                 // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ItemInteractionContainerEntry_C*   CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             CallFunc_GetItemInfo_ItemInfo;                     // 0x0038(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	class FName                                   CallFunc_GetItemName_CraftItemName;                // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanCraftItem_CanCraft;                    // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EDismantleType, int32>                   CallFunc_CanCraftItem_CurrentResurces;             // 0x0268(0x0050)()
	TMap<EDismantleType, int32>                   CallFunc_CanCraftItem_RequiredResources;           // 0x02B8(0x0050)()
};
static_assert(alignof(WBP_Workbench_C_CraftEntriesChecking) == 0x000008, "Wrong alignment on WBP_Workbench_C_CraftEntriesChecking");
static_assert(sizeof(WBP_Workbench_C_CraftEntriesChecking) == 0x000308, "Wrong size on WBP_Workbench_C_CraftEntriesChecking");
static_assert(offsetof(WBP_Workbench_C_CraftEntriesChecking, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_Workbench_C_CraftEntriesChecking::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CraftEntriesChecking, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_Workbench_C_CraftEntriesChecking::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CraftEntriesChecking, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_Workbench_C_CraftEntriesChecking::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CraftEntriesChecking, CallFunc_GetListOfItems_EntryList) == 0x000010, "Member 'WBP_Workbench_C_CraftEntriesChecking::CallFunc_GetListOfItems_EntryList' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CraftEntriesChecking, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WBP_Workbench_C_CraftEntriesChecking::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CraftEntriesChecking, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_Workbench_C_CraftEntriesChecking::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CraftEntriesChecking, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'WBP_Workbench_C_CraftEntriesChecking::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CraftEntriesChecking, CallFunc_GetItemInfo_ItemInfo) == 0x000038, "Member 'WBP_Workbench_C_CraftEntriesChecking::CallFunc_GetItemInfo_ItemInfo' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CraftEntriesChecking, CallFunc_GetItemName_CraftItemName) == 0x000258, "Member 'WBP_Workbench_C_CraftEntriesChecking::CallFunc_GetItemName_CraftItemName' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CraftEntriesChecking, CallFunc_CanCraftItem_CanCraft) == 0x000260, "Member 'WBP_Workbench_C_CraftEntriesChecking::CallFunc_CanCraftItem_CanCraft' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CraftEntriesChecking, CallFunc_CanCraftItem_CurrentResurces) == 0x000268, "Member 'WBP_Workbench_C_CraftEntriesChecking::CallFunc_CanCraftItem_CurrentResurces' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CraftEntriesChecking, CallFunc_CanCraftItem_RequiredResources) == 0x0002B8, "Member 'WBP_Workbench_C_CraftEntriesChecking::CallFunc_CanCraftItem_RequiredResources' has a wrong offset!");

// Function WBP_Workbench.WBP_Workbench_C.CraftItem
// 0x0660 (0x0660 - 0x0000)
struct WBP_Workbench_C_CraftItem final
{
public:
	struct FFItemInfo                             ItemInfo;                                          // 0x0000(0x0220)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	struct FS_ItemsToCraft                        CallFunc_GetDataTableRowFromName_OutRow;           // 0x0220(0x0150)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EventInstanceIsValid_ReturnValue;         // 0x0371(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_372[0x6];                                      // 0x0372(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0378(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0598(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_599[0x7];                                      // 0x0599(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EDismantleType>                        CallFunc_Map_Keys_Keys;                            // 0x05A0(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x05B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x05B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x05B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B9[0x3];                                      // 0x05B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x05BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x05C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C4[0x4];                                      // 0x05C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x05C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EDismantleType                                CallFunc_Array_Get_Item;                           // 0x05D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D1[0x7];                                      // 0x05D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC;                  // 0x05D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x05E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E9[0x7];                                      // 0x05E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x05F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      CallFunc_GetPlayerRef_SurvivalPlayer;              // 0x0600(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0608(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_NeedItems                           CallFunc_GetDataTableRowFromName_OutRow_2;         // 0x0610(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_2;    // 0x0630(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Can_Add_or_Equip_Item_Return;             // 0x0631(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_632[0x2];                                      // 0x0632(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Map_Find_Value;                           // 0x0634(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0638(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_639[0x3];                                      // 0x0639(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x063C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemByName_ReturnedCount;              // 0x0640(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_644[0x4];                                      // 0x0644(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FContainerPickupsInfo>          K2Node_MakeArray_Array;                            // 0x0648(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_JSAddItem_Ad;                             // 0x0658(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Workbench_C_CraftItem) == 0x000010, "Wrong alignment on WBP_Workbench_C_CraftItem");
static_assert(sizeof(WBP_Workbench_C_CraftItem) == 0x000660, "Wrong size on WBP_Workbench_C_CraftItem");
static_assert(offsetof(WBP_Workbench_C_CraftItem, ItemInfo) == 0x000000, "Member 'WBP_Workbench_C_CraftItem::ItemInfo' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CraftItem, CallFunc_GetDataTableRowFromName_OutRow) == 0x000220, "Member 'WBP_Workbench_C_CraftItem::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CraftItem, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000370, "Member 'WBP_Workbench_C_CraftItem::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CraftItem, CallFunc_EventInstanceIsValid_ReturnValue) == 0x000371, "Member 'WBP_Workbench_C_CraftItem::CallFunc_EventInstanceIsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CraftItem, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000378, "Member 'WBP_Workbench_C_CraftItem::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CraftItem, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000598, "Member 'WBP_Workbench_C_CraftItem::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CraftItem, CallFunc_Map_Keys_Keys) == 0x0005A0, "Member 'WBP_Workbench_C_CraftItem::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CraftItem, CallFunc_Array_Length_ReturnValue) == 0x0005B0, "Member 'WBP_Workbench_C_CraftItem::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CraftItem, Temp_int_Loop_Counter_Variable) == 0x0005B4, "Member 'WBP_Workbench_C_CraftItem::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CraftItem, CallFunc_Less_IntInt_ReturnValue) == 0x0005B8, "Member 'WBP_Workbench_C_CraftItem::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CraftItem, CallFunc_Add_IntInt_ReturnValue) == 0x0005BC, "Member 'WBP_Workbench_C_CraftItem::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CraftItem, Temp_int_Array_Index_Variable) == 0x0005C0, "Member 'WBP_Workbench_C_CraftItem::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CraftItem, CallFunc_GetPlayerController_ReturnValue) == 0x0005C8, "Member 'WBP_Workbench_C_CraftItem::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CraftItem, CallFunc_Array_Get_Item) == 0x0005D0, "Member 'WBP_Workbench_C_CraftItem::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CraftItem, K2Node_DynamicCast_AsBPI_Surv_PC) == 0x0005D8, "Member 'WBP_Workbench_C_CraftItem::K2Node_DynamicCast_AsBPI_Surv_PC' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CraftItem, K2Node_DynamicCast_bSuccess) == 0x0005E8, "Member 'WBP_Workbench_C_CraftItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CraftItem, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x0005F0, "Member 'WBP_Workbench_C_CraftItem::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CraftItem, CallFunc_GetPlayerRef_SurvivalPlayer) == 0x000600, "Member 'WBP_Workbench_C_CraftItem::CallFunc_GetPlayerRef_SurvivalPlayer' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CraftItem, CallFunc_Conv_StringToName_ReturnValue) == 0x000608, "Member 'WBP_Workbench_C_CraftItem::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CraftItem, CallFunc_GetDataTableRowFromName_OutRow_2) == 0x000610, "Member 'WBP_Workbench_C_CraftItem::CallFunc_GetDataTableRowFromName_OutRow_2' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CraftItem, CallFunc_GetDataTableRowFromName_ReturnValue_2) == 0x000630, "Member 'WBP_Workbench_C_CraftItem::CallFunc_GetDataTableRowFromName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CraftItem, CallFunc_Can_Add_or_Equip_Item_Return) == 0x000631, "Member 'WBP_Workbench_C_CraftItem::CallFunc_Can_Add_or_Equip_Item_Return' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CraftItem, CallFunc_Map_Find_Value) == 0x000634, "Member 'WBP_Workbench_C_CraftItem::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CraftItem, CallFunc_Map_Find_ReturnValue) == 0x000638, "Member 'WBP_Workbench_C_CraftItem::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CraftItem, CallFunc_Multiply_IntInt_ReturnValue) == 0x00063C, "Member 'WBP_Workbench_C_CraftItem::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CraftItem, CallFunc_GetItemByName_ReturnedCount) == 0x000640, "Member 'WBP_Workbench_C_CraftItem::CallFunc_GetItemByName_ReturnedCount' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CraftItem, K2Node_MakeArray_Array) == 0x000648, "Member 'WBP_Workbench_C_CraftItem::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CraftItem, CallFunc_JSAddItem_Ad) == 0x000658, "Member 'WBP_Workbench_C_CraftItem::CallFunc_JSAddItem_Ad' has a wrong offset!");

// Function WBP_Workbench.WBP_Workbench_C.CreateItemRequest
// 0x0008 (0x0008 - 0x0000)
struct WBP_Workbench_C_CreateItemRequest final
{
public:
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Workbench_C_CreateItemRequest) == 0x000004, "Wrong alignment on WBP_Workbench_C_CreateItemRequest");
static_assert(sizeof(WBP_Workbench_C_CreateItemRequest) == 0x000008, "Wrong size on WBP_Workbench_C_CreateItemRequest");
static_assert(offsetof(WBP_Workbench_C_CreateItemRequest, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000000, "Member 'WBP_Workbench_C_CreateItemRequest::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_CreateItemRequest, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WBP_Workbench_C_CreateItemRequest::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function WBP_Workbench.WBP_Workbench_C.Dismantle
// 0x0228 (0x0228 - 0x0000)
struct WBP_Workbench_C_Dismantle final
{
public:
	struct FFItemInfo                             ItemInfo;                                          // 0x0000(0x0220)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      SurvivalPlayer;                                    // 0x0220(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Workbench_C_Dismantle) == 0x000008, "Wrong alignment on WBP_Workbench_C_Dismantle");
static_assert(sizeof(WBP_Workbench_C_Dismantle) == 0x000228, "Wrong size on WBP_Workbench_C_Dismantle");
static_assert(offsetof(WBP_Workbench_C_Dismantle, ItemInfo) == 0x000000, "Member 'WBP_Workbench_C_Dismantle::ItemInfo' has a wrong offset!");
static_assert(offsetof(WBP_Workbench_C_Dismantle, SurvivalPlayer) == 0x000220, "Member 'WBP_Workbench_C_Dismantle::SurvivalPlayer' has a wrong offset!");

// Function WBP_Workbench.WBP_Workbench_C.ExecuteUbergraph_WBP_Workbench
// 0x1328 (0x1328 - 0x0000)
struct WBP_Workbench_C_ExecuteUbergraph_WBP_Workbench final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_WorkbenchTabTypes                           Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_WorkbenchTabTypes                           Temp_byte_Variable_1;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDismantleType                                Temp_byte_Variable_2;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFMODEvent*                             Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                             Temp_object_Variable_1;                            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                             Temp_object_Variable_2;                            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                             Temp_object_Variable_3;                            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                             Temp_object_Variable_4;                            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	E_WorkbenchTabTypes                           Temp_byte_Variable_3;                              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_WorkbenchTabTypes                           Temp_byte_Variable_9;                              // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F[0x1];                                       // 0x004F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0050(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0068(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0080(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0098(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x00B0(0x0018)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckContainsWeapon_Result;               // 0x00CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_5;                              // 0x00D0(0x0018)()
	E_WorkbenchTabTypes                           Temp_byte_Variable_10;                             // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	E_WorkbenchTabTypes                           K2Node_CustomEvent_NewTab_1;                       // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bWithAnimation;                 // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsNextPage_1;                  // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x00FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FE[0x2];                                       // 0x00FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0100(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable_6;                              // 0x0110(0x0018)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0128(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FFItemInfo& ItemInfo)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0138(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0148(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0158(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable_7;                              // 0x0168(0x0018)()
	bool                                          CallFunc_GetIsSupportedAttachments_bHasWeapon;     // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_182[0x6];                                      // 0x0182(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_8;                              // 0x0188(0x0018)()
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvPC_C*                              K2Node_DynamicCast_AsSurv_PC;                      // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x01B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_StatsInterface_C>   K2Node_DynamicCast_AsI_Stats_Interface;            // 0x01C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPC_PlayerStatsComponent_C*            CallFunc_GetStatsComponent_PlayerStats;            // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x01E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x01F0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_TimerExistsHandle_ReturnValue;         // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_9;                              // 0x0200(0x0018)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameHUD_C>        K2Node_DynamicCast_AsBPI_Game_HUD;                 // 0x0228(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
