#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_QuestPoint3D

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_QuestPoint3D.WBP_QuestPoint3D_C
// 0x0048 (0x02C8 - 0x0280)
class UWBP_QuestPoint3D_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Show;                                              // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             Text_Distance;                                     // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FText                                   Var;                                               // 0x02A0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UWidgetComponent*                       WidgetComponent;                                   // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FTimerHandle                           Timer;                                             // 0x02C0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_QuestPoint3D(int32 EntryPoint);
	int32 GetDistance();
	void Init();
	void SetVisibilityW(bool Param_Index);
	void Toggle(bool Param_Toggle);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_QuestPoint3D_C">();
	}
	static class UWBP_QuestPoint3D_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_QuestPoint3D_C>();
	}
};
static_assert(alignof(UWBP_QuestPoint3D_C) == 0x000008, "Wrong alignment on UWBP_QuestPoint3D_C");
static_assert(sizeof(UWBP_QuestPoint3D_C) == 0x0002C8, "Wrong size on UWBP_QuestPoint3D_C");
static_assert(offsetof(UWBP_QuestPoint3D_C, UberGraphFrame) == 0x000280, "Member 'UWBP_QuestPoint3D_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_QuestPoint3D_C, Show) == 0x000288, "Member 'UWBP_QuestPoint3D_C::Show' has a wrong offset!");
static_assert(offsetof(UWBP_QuestPoint3D_C, Text_Distance) == 0x000290, "Member 'UWBP_QuestPoint3D_C::Text_Distance' has a wrong offset!");
static_assert(offsetof(UWBP_QuestPoint3D_C, Actor) == 0x000298, "Member 'UWBP_QuestPoint3D_C::Actor' has a wrong offset!");
static_assert(offsetof(UWBP_QuestPoint3D_C, Var) == 0x0002A0, "Member 'UWBP_QuestPoint3D_C::Var' has a wrong offset!");
static_assert(offsetof(UWBP_QuestPoint3D_C, WidgetComponent) == 0x0002B8, "Member 'UWBP_QuestPoint3D_C::WidgetComponent' has a wrong offset!");
static_assert(offsetof(UWBP_QuestPoint3D_C, Timer) == 0x0002C0, "Member 'UWBP_QuestPoint3D_C::Timer' has a wrong offset!");

}

