#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ServerSelector

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "ENUM_ServerRegions_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ServerSelector.WBP_ServerSelector_C
// 0x0120 (0x03A0 - 0x0280)
class UWBP_ServerSelector_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       WidgetSwitcherAnim;                                // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_RealmList;                               // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_RealmList;                                 // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_LabelText_C*                       UMG_LabelText;                                     // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_LabelText_C*                       UMG_LabelText_1;                                   // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_LabelText_C*                       UMG_LabelText_2;                                   // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_CommunityServersContainer;             // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_OfficialServersContainer;              // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Searching;                             // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Scroller_C*                        WBP_Scroller;                                      // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Servers;                            // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWBP_MainCategorySelectorEntry_C*> ServerCategories;                                  // 0x02E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UWBP_MainCategorySelectorEntry_C*       SelectedCategory;                                  // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         ActiveEntryIndex;                                  // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_ServerCell_C*>              OfficialServersList;                               // 0x0300(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	FMulticastInlineDelegateProperty_             OnServerSelected;                                  // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UWBP_ServerCell_C*                      SelectedServer;                                    // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         ServerIndex;                                       // 0x0328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnFocusedSelected;                                 // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UObject*                                Object;                                            // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<class FString, int32>                    SortableMap;                                       // 0x0348(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Sort_by_End;                                       // 0x0398(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ChangeSelectedWidget(class UWBP_ServerCell_C* Widget);
	bool Check_Server_Have_Empty_Slots(class UWBP_ServerCell_C* ServerCell);
	void ClearOfficialServersList();
	void Construct();
	void ExecuteUbergraph_WBP_ServerSelector(int32 EntryPoint);
	void GetSelectedServer(class UWBP_ServerCell_C** Param_SelectedServer);
	void GetServerIndex(int32* Param_ServerIndex);
	void InitOfficialServerByRegion(ENUM_ServerRegions InputPin);
	void InitScrollCount(int32 Current);
	void OnFocusedSelected__DelegateSignature();
	void OnPlayAnimation(class UWidgetAnimation* Animation, bool NewState);
	void OnServerSelected__DelegateSignature(const struct FS_ServerInfo& ServerInfo);
	void PreConstruct(bool IsDesignTime);
	void SelectCurrentServer();
	void SelectDoubleClickedServer(class UWBP_ServerCell_C* Target);
	void SelectFirstServer();
	void ServerSelectd(const struct FS_ServerInfo& ServerInfo, class UWBP_ServerCell_C* Widget);
	void SetActiveIndexSwitcher(int32 Param_Index);
	void Sort_By(class UGI_Survival_C* GI_Survival, TArray<class FString>* SortedMapKeys, TMap<class FString, class FString>* Servers);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ServerSelector_C">();
	}
	static class UWBP_ServerSelector_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ServerSelector_C>();
	}
};
static_assert(alignof(UWBP_ServerSelector_C) == 0x000008, "Wrong alignment on UWBP_ServerSelector_C");
static_assert(sizeof(UWBP_ServerSelector_C) == 0x0003A0, "Wrong size on UWBP_ServerSelector_C");
static_assert(offsetof(UWBP_ServerSelector_C, UberGraphFrame) == 0x000280, "Member 'UWBP_ServerSelector_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ServerSelector_C, WidgetSwitcherAnim) == 0x000288, "Member 'UWBP_ServerSelector_C::WidgetSwitcherAnim' has a wrong offset!");
static_assert(offsetof(UWBP_ServerSelector_C, ScrollBox_RealmList) == 0x000290, "Member 'UWBP_ServerSelector_C::ScrollBox_RealmList' has a wrong offset!");
static_assert(offsetof(UWBP_ServerSelector_C, SizeBox_RealmList) == 0x000298, "Member 'UWBP_ServerSelector_C::SizeBox_RealmList' has a wrong offset!");
static_assert(offsetof(UWBP_ServerSelector_C, UMG_LabelText) == 0x0002A0, "Member 'UWBP_ServerSelector_C::UMG_LabelText' has a wrong offset!");
static_assert(offsetof(UWBP_ServerSelector_C, UMG_LabelText_1) == 0x0002A8, "Member 'UWBP_ServerSelector_C::UMG_LabelText_1' has a wrong offset!");
static_assert(offsetof(UWBP_ServerSelector_C, UMG_LabelText_2) == 0x0002B0, "Member 'UWBP_ServerSelector_C::UMG_LabelText_2' has a wrong offset!");
static_assert(offsetof(UWBP_ServerSelector_C, VerticalBox_CommunityServersContainer) == 0x0002B8, "Member 'UWBP_ServerSelector_C::VerticalBox_CommunityServersContainer' has a wrong offset!");
static_assert(offsetof(UWBP_ServerSelector_C, VerticalBox_OfficialServersContainer) == 0x0002C0, "Member 'UWBP_ServerSelector_C::VerticalBox_OfficialServersContainer' has a wrong offset!");
static_assert(offsetof(UWBP_ServerSelector_C, VerticalBox_Searching) == 0x0002C8, "Member 'UWBP_ServerSelector_C::VerticalBox_Searching' has a wrong offset!");
static_assert(offsetof(UWBP_ServerSelector_C, WBP_Scroller) == 0x0002D0, "Member 'UWBP_ServerSelector_C::WBP_Scroller' has a wrong offset!");
static_assert(offsetof(UWBP_ServerSelector_C, WidgetSwitcher_Servers) == 0x0002D8, "Member 'UWBP_ServerSelector_C::WidgetSwitcher_Servers' has a wrong offset!");
static_assert(offsetof(UWBP_ServerSelector_C, ServerCategories) == 0x0002E0, "Member 'UWBP_ServerSelector_C::ServerCategories' has a wrong offset!");
static_assert(offsetof(UWBP_ServerSelector_C, SelectedCategory) == 0x0002F0, "Member 'UWBP_ServerSelector_C::SelectedCategory' has a wrong offset!");
static_assert(offsetof(UWBP_ServerSelector_C, ActiveEntryIndex) == 0x0002F8, "Member 'UWBP_ServerSelector_C::ActiveEntryIndex' has a wrong offset!");
static_assert(offsetof(UWBP_ServerSelector_C, OfficialServersList) == 0x000300, "Member 'UWBP_ServerSelector_C::OfficialServersList' has a wrong offset!");
static_assert(offsetof(UWBP_ServerSelector_C, OnServerSelected) == 0x000310, "Member 'UWBP_ServerSelector_C::OnServerSelected' has a wrong offset!");
static_assert(offsetof(UWBP_ServerSelector_C, SelectedServer) == 0x000320, "Member 'UWBP_ServerSelector_C::SelectedServer' has a wrong offset!");
static_assert(offsetof(UWBP_ServerSelector_C, ServerIndex) == 0x000328, "Member 'UWBP_ServerSelector_C::ServerIndex' has a wrong offset!");
static_assert(offsetof(UWBP_ServerSelector_C, OnFocusedSelected) == 0x000330, "Member 'UWBP_ServerSelector_C::OnFocusedSelected' has a wrong offset!");
static_assert(offsetof(UWBP_ServerSelector_C, Object) == 0x000340, "Member 'UWBP_ServerSelector_C::Object' has a wrong offset!");
static_assert(offsetof(UWBP_ServerSelector_C, SortableMap) == 0x000348, "Member 'UWBP_ServerSelector_C::SortableMap' has a wrong offset!");
static_assert(offsetof(UWBP_ServerSelector_C, Sort_by_End) == 0x000398, "Member 'UWBP_ServerSelector_C::Sort_by_End' has a wrong offset!");

}

