#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CraftItem

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "ContainerPickupsInfo_structs.hpp"
#include "S_ItemsToCraft_structs.hpp"
#include "FItemInfo_structs.hpp"
#include "FMODStudio_structs.hpp"


namespace SDK::Params
{

// Function WBP_CraftItem.WBP_CraftItem_C.CanCraft
// 0x0028 (0x0028 - 0x0000)
struct WBP_CraftItem_C_CanCraft final
{
public:
	bool                                          Param_CanCraft;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<bool>                                  Resources;                                         // 0x0008(0x0010)(Parm, OutParm)
	TArray<bool>                                  HasCountOfItems;                                   // 0x0018(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(WBP_CraftItem_C_CanCraft) == 0x000008, "Wrong alignment on WBP_CraftItem_C_CanCraft");
static_assert(sizeof(WBP_CraftItem_C_CanCraft) == 0x000028, "Wrong size on WBP_CraftItem_C_CanCraft");
static_assert(offsetof(WBP_CraftItem_C_CanCraft, Param_CanCraft) == 0x000000, "Member 'WBP_CraftItem_C_CanCraft::Param_CanCraft' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_CanCraft, Resources) == 0x000008, "Member 'WBP_CraftItem_C_CanCraft::Resources' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_CanCraft, HasCountOfItems) == 0x000018, "Member 'WBP_CraftItem_C_CanCraft::HasCountOfItems' has a wrong offset!");

// Function WBP_CraftItem.WBP_CraftItem_C.Craft
// 0x0018 (0x0018 - 0x0000)
struct WBP_CraftItem_C_Craft final
{
public:
	class FName                                   ItemName;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<bool>                                  HasCountOfItems;                                   // 0x0008(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(WBP_CraftItem_C_Craft) == 0x000008, "Wrong alignment on WBP_CraftItem_C_Craft");
static_assert(sizeof(WBP_CraftItem_C_Craft) == 0x000018, "Wrong size on WBP_CraftItem_C_Craft");
static_assert(offsetof(WBP_CraftItem_C_Craft, ItemName) == 0x000000, "Member 'WBP_CraftItem_C_Craft::ItemName' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_Craft, HasCountOfItems) == 0x000008, "Member 'WBP_CraftItem_C_Craft::HasCountOfItems' has a wrong offset!");

// Function WBP_CraftItem.WBP_CraftItem_C.ExecuteUbergraph_WBP_CraftItem
// 0x04E0 (0x04E0 - 0x0000)
struct WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0010(0x0078)(ConstParm)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0090(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00C8(0x0078)(ConstParm)
	TScriptInterface<class II_StatsInterface_C>   K2Node_DynamicCast_AsI_Stats_Interface;            // 0x0140(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPC_PlayerStatsComponent_C*            CallFunc_GetStatsComponent_PlayerStats;            // 0x0158(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMap<class FString, class UW_CraftIngredient_C*> K2Node_MakeMap_Map;                                // 0x0160(0x0050)(ContainsInstancedReference)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_1;                // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             CallFunc_GetDataTableRowFromName_OutRow;           // 0x01E8(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_409[0x7];                                      // 0x0409(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_2;                // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetRenderOpacity_ReturnValue;             // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41C[0x4];                                      // 0x041C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0420(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0429(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x042A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42B[0x5];                                      // 0x042B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0430(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0438(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_441[0x3];                                      // 0x0441(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0444(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0454(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0455(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_456[0x2];                                      // 0x0456(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CraftStation_C*                     K2Node_CustomEvent_WorkbenchRef_3;                 // 0x0458(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_CraftStation_C*                     K2Node_CustomEvent_WorkbenchRef_2;                 // 0x0460(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x0468(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_471[0x7];                                      // 0x0471(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CraftStation_C*                     K2Node_CustomEvent_WorkbenchRef_1;                 // 0x0478(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0480(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0491(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0492(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x0493(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_494[0x4];                                      // 0x0494(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_3;       // 0x0498(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_CraftStation_C*                     K2Node_CustomEvent_WorkbenchRef;                   // 0x04A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanCraft_CanCraft;                        // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A9[0x7];                                      // 0x04A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<bool>                                  CallFunc_CanCraft_Resources;                       // 0x04B0(0x0010)(ReferenceParm)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C1[0x3];                                      // 0x04C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_ItemName;                       // 0x04C4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimationForward_PlaybackSpeed_ImplicitCast; // 0x04CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast;    // 0x04D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x04D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem) == 0x000008, "Wrong alignment on WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem");
static_assert(sizeof(WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem) == 0x0004E0, "Wrong size on WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem");
static_assert(offsetof(WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem, EntryPoint) == 0x000000, "Member 'WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem, K2Node_Event_MouseEvent_1) == 0x000010, "Member 'WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem, CallFunc_K2_GetPawn_ReturnValue) == 0x000088, "Member 'WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem, K2Node_Event_MyGeometry) == 0x000090, "Member 'WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem, K2Node_Event_MouseEvent) == 0x0000C8, "Member 'WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem, K2Node_DynamicCast_AsI_Stats_Interface) == 0x000140, "Member 'WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem::K2Node_DynamicCast_AsI_Stats_Interface' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem, K2Node_DynamicCast_bSuccess) == 0x000150, "Member 'WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem, CallFunc_GetStatsComponent_PlayerStats) == 0x000158, "Member 'WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem::CallFunc_GetStatsComponent_PlayerStats' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem, K2Node_MakeMap_Map) == 0x000160, "Member 'WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem::K2Node_MakeMap_Map' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem, CallFunc_PlayEvent2D_ReturnValue) == 0x0001B0, "Member 'WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem::CallFunc_PlayEvent2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem, CallFunc_PlayEvent2D_ReturnValue_1) == 0x0001B8, "Member 'WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem::CallFunc_PlayEvent2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x0001C0, "Member 'WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem, CallFunc_PlayAnimationForward_ReturnValue) == 0x0001C8, "Member 'WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem, CallFunc_GetPlayerCharacter_ReturnValue) == 0x0001D0, "Member 'WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem, K2Node_DynamicCast_AsSurvival_Player) == 0x0001D8, "Member 'WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem, K2Node_DynamicCast_bSuccess_1) == 0x0001E0, "Member 'WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem, CallFunc_GetDataTableRowFromName_OutRow) == 0x0001E8, "Member 'WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000408, "Member 'WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem, CallFunc_PlayEvent2D_ReturnValue_2) == 0x000410, "Member 'WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem::CallFunc_PlayEvent2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem, CallFunc_GetRenderOpacity_ReturnValue) == 0x000418, "Member 'WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem::CallFunc_GetRenderOpacity_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000420, "Member 'WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000428, "Member 'WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000429, "Member 'WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem, CallFunc_BooleanAND_ReturnValue) == 0x00042A, "Member 'WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000430, "Member 'WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000438, "Member 'WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem, CallFunc_IsValid_ReturnValue) == 0x000440, "Member 'WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem, K2Node_CreateDelegate_OutputDelegate) == 0x000444, "Member 'WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem, CallFunc_Not_PreBool_ReturnValue) == 0x000454, "Member 'WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem, CallFunc_Not_PreBool_ReturnValue_1) == 0x000455, "Member 'WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem, K2Node_CustomEvent_WorkbenchRef_3) == 0x000458, "Member 'WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem::K2Node_CustomEvent_WorkbenchRef_3' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem, K2Node_CustomEvent_WorkbenchRef_2) == 0x000460, "Member 'WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem::K2Node_CustomEvent_WorkbenchRef_2' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem, CallFunc_PlayAnimationForward_ReturnValue_2) == 0x000468, "Member 'WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem::CallFunc_PlayAnimationForward_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem, Temp_bool_Has_Been_Initd_Variable) == 0x000470, "Member 'WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem, K2Node_CustomEvent_WorkbenchRef_1) == 0x000478, "Member 'WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem::K2Node_CustomEvent_WorkbenchRef_1' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem, K2Node_CreateDelegate_OutputDelegate_1) == 0x000480, "Member 'WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem, CallFunc_Not_PreBool_ReturnValue_2) == 0x000490, "Member 'WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem, CallFunc_Not_PreBool_ReturnValue_3) == 0x000491, "Member 'WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem, CallFunc_BooleanAND_ReturnValue_1) == 0x000492, "Member 'WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem, CallFunc_Not_PreBool_ReturnValue_4) == 0x000493, "Member 'WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem, CallFunc_PlayAnimationForward_ReturnValue_3) == 0x000498, "Member 'WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem::CallFunc_PlayAnimationForward_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem, K2Node_CustomEvent_WorkbenchRef) == 0x0004A0, "Member 'WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem::K2Node_CustomEvent_WorkbenchRef' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem, CallFunc_CanCraft_CanCraft) == 0x0004A8, "Member 'WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem::CallFunc_CanCraft_CanCraft' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem, CallFunc_CanCraft_Resources) == 0x0004B0, "Member 'WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem::CallFunc_CanCraft_Resources' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem, Temp_bool_IsClosed_Variable) == 0x0004C0, "Member 'WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem, K2Node_CustomEvent_ItemName) == 0x0004C4, "Member 'WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem::K2Node_CustomEvent_ItemName' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem, CallFunc_PlayAnimationForward_PlaybackSpeed_ImplicitCast) == 0x0004CC, "Member 'WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem::CallFunc_PlayAnimationForward_PlaybackSpeed_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem, CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast) == 0x0004D0, "Member 'WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem::CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x0004D8, "Member 'WBP_CraftItem_C_ExecuteUbergraph_WBP_CraftItem::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function WBP_CraftItem.WBP_CraftItem_C.FindData
// 0x0390 (0x0390 - 0x0000)
struct WBP_CraftItem_C_FindData final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_ItemsToCraft                        CallFunc_GetDataTableRowFromName_OutRow;           // 0x0010(0x0150)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0168(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CraftItem_C_FindData) == 0x000010, "Wrong alignment on WBP_CraftItem_C_FindData");
static_assert(sizeof(WBP_CraftItem_C_FindData) == 0x000390, "Wrong size on WBP_CraftItem_C_FindData");
static_assert(offsetof(WBP_CraftItem_C_FindData, Result) == 0x000000, "Member 'WBP_CraftItem_C_FindData::Result' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_FindData, CallFunc_GetDataTableRowFromName_OutRow) == 0x000010, "Member 'WBP_CraftItem_C_FindData::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_FindData, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000160, "Member 'WBP_CraftItem_C_FindData::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_FindData, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000168, "Member 'WBP_CraftItem_C_FindData::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_FindData, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000388, "Member 'WBP_CraftItem_C_FindData::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");

// Function WBP_CraftItem.WBP_CraftItem_C.GetContainerPickupsInfo
// 0x0200 (0x0200 - 0x0000)
struct WBP_CraftItem_C_GetContainerPickupsInfo final
{
public:
	class FName                                   ItemName;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FContainerPickupsInfo                  PickupsInfo;                                       // 0x0008(0x0068)(Parm, OutParm, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FContainerPickupsInfo                  K2Node_MakeStruct_ContainerPickupsInfo;            // 0x0078(0x0068)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FContainerPickupsInfo>          CallFunc_getItemsInventory_ContainerItems;         // 0x00F0(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<struct FContainerPickupsInfo>          CallFunc_getItemsInventory_ContainersData;         // 0x0100(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FContainerPickupsInfo                  CallFunc_Array_Get_Item;                           // 0x0118(0x0068)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x018A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x018B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FContainerPickupsInfo                  CallFunc_Array_Get_Item_1;                         // 0x0190(0x0068)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x01FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CraftItem_C_GetContainerPickupsInfo) == 0x000008, "Wrong alignment on WBP_CraftItem_C_GetContainerPickupsInfo");
static_assert(sizeof(WBP_CraftItem_C_GetContainerPickupsInfo) == 0x000200, "Wrong size on WBP_CraftItem_C_GetContainerPickupsInfo");
static_assert(offsetof(WBP_CraftItem_C_GetContainerPickupsInfo, ItemName) == 0x000000, "Member 'WBP_CraftItem_C_GetContainerPickupsInfo::ItemName' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_GetContainerPickupsInfo, PickupsInfo) == 0x000008, "Member 'WBP_CraftItem_C_GetContainerPickupsInfo::PickupsInfo' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_GetContainerPickupsInfo, Temp_int_Array_Index_Variable) == 0x000070, "Member 'WBP_CraftItem_C_GetContainerPickupsInfo::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_GetContainerPickupsInfo, K2Node_MakeStruct_ContainerPickupsInfo) == 0x000078, "Member 'WBP_CraftItem_C_GetContainerPickupsInfo::K2Node_MakeStruct_ContainerPickupsInfo' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_GetContainerPickupsInfo, Temp_int_Loop_Counter_Variable) == 0x0000E0, "Member 'WBP_CraftItem_C_GetContainerPickupsInfo::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_GetContainerPickupsInfo, CallFunc_Add_IntInt_ReturnValue) == 0x0000E4, "Member 'WBP_CraftItem_C_GetContainerPickupsInfo::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_GetContainerPickupsInfo, Temp_int_Loop_Counter_Variable_1) == 0x0000E8, "Member 'WBP_CraftItem_C_GetContainerPickupsInfo::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_GetContainerPickupsInfo, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000EC, "Member 'WBP_CraftItem_C_GetContainerPickupsInfo::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_GetContainerPickupsInfo, CallFunc_getItemsInventory_ContainerItems) == 0x0000F0, "Member 'WBP_CraftItem_C_GetContainerPickupsInfo::CallFunc_getItemsInventory_ContainerItems' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_GetContainerPickupsInfo, CallFunc_getItemsInventory_ContainersData) == 0x000100, "Member 'WBP_CraftItem_C_GetContainerPickupsInfo::CallFunc_getItemsInventory_ContainersData' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_GetContainerPickupsInfo, CallFunc_Array_Length_ReturnValue) == 0x000110, "Member 'WBP_CraftItem_C_GetContainerPickupsInfo::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_GetContainerPickupsInfo, CallFunc_Array_Get_Item) == 0x000118, "Member 'WBP_CraftItem_C_GetContainerPickupsInfo::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_GetContainerPickupsInfo, CallFunc_Less_IntInt_ReturnValue) == 0x000180, "Member 'WBP_CraftItem_C_GetContainerPickupsInfo::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_GetContainerPickupsInfo, CallFunc_Array_Length_ReturnValue_1) == 0x000184, "Member 'WBP_CraftItem_C_GetContainerPickupsInfo::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_GetContainerPickupsInfo, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000188, "Member 'WBP_CraftItem_C_GetContainerPickupsInfo::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_GetContainerPickupsInfo, CallFunc_Less_IntInt_ReturnValue_1) == 0x000189, "Member 'WBP_CraftItem_C_GetContainerPickupsInfo::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_GetContainerPickupsInfo, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00018A, "Member 'WBP_CraftItem_C_GetContainerPickupsInfo::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_GetContainerPickupsInfo, CallFunc_BooleanAND_ReturnValue) == 0x00018B, "Member 'WBP_CraftItem_C_GetContainerPickupsInfo::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_GetContainerPickupsInfo, Temp_int_Array_Index_Variable_1) == 0x00018C, "Member 'WBP_CraftItem_C_GetContainerPickupsInfo::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_GetContainerPickupsInfo, CallFunc_Array_Get_Item_1) == 0x000190, "Member 'WBP_CraftItem_C_GetContainerPickupsInfo::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_GetContainerPickupsInfo, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x0001F8, "Member 'WBP_CraftItem_C_GetContainerPickupsInfo::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_GetContainerPickupsInfo, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x0001F9, "Member 'WBP_CraftItem_C_GetContainerPickupsInfo::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_GetContainerPickupsInfo, CallFunc_BooleanAND_ReturnValue_1) == 0x0001FA, "Member 'WBP_CraftItem_C_GetContainerPickupsInfo::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function WBP_CraftItem.WBP_CraftItem_C.GetItemsCount
// 0x0168 (0x0168 - 0x0000)
struct WBP_CraftItem_C_GetItemsCount final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FContainerPickupsInfo>          CallFunc_getItemsInventory_ContainerItems;         // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<struct FContainerPickupsInfo>          CallFunc_getItemsInventory_ContainersData;         // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FContainerPickupsInfo>          CallFunc_getItemsInventory_ContainerItems_1;       // 0x0040(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<struct FContainerPickupsInfo>          CallFunc_getItemsInventory_ContainersData_1;       // 0x0050(0x0010)(ReferenceParm, ContainsInstancedReference)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0060(0x0018)()
	struct FContainerPickupsInfo                  CallFunc_Array_Get_Item;                           // 0x0078(0x0068)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x00E6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00E7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FContainerPickupsInfo                  CallFunc_Array_Get_Item_1;                         // 0x00F0(0x0068)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15A[0x2];                                      // 0x015A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CraftItem_C_GetItemsCount) == 0x000008, "Wrong alignment on WBP_CraftItem_C_GetItemsCount");
static_assert(sizeof(WBP_CraftItem_C_GetItemsCount) == 0x000168, "Wrong size on WBP_CraftItem_C_GetItemsCount");
static_assert(offsetof(WBP_CraftItem_C_GetItemsCount, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'WBP_CraftItem_C_GetItemsCount::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_GetItemsCount, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'WBP_CraftItem_C_GetItemsCount::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_GetItemsCount, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WBP_CraftItem_C_GetItemsCount::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_GetItemsCount, Temp_int_Loop_Counter_Variable_1) == 0x00000C, "Member 'WBP_CraftItem_C_GetItemsCount::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_GetItemsCount, CallFunc_Add_IntInt_ReturnValue_1) == 0x000010, "Member 'WBP_CraftItem_C_GetItemsCount::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_GetItemsCount, CallFunc_getItemsInventory_ContainerItems) == 0x000018, "Member 'WBP_CraftItem_C_GetItemsCount::CallFunc_getItemsInventory_ContainerItems' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_GetItemsCount, CallFunc_getItemsInventory_ContainersData) == 0x000028, "Member 'WBP_CraftItem_C_GetItemsCount::CallFunc_getItemsInventory_ContainersData' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_GetItemsCount, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'WBP_CraftItem_C_GetItemsCount::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_GetItemsCount, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'WBP_CraftItem_C_GetItemsCount::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_GetItemsCount, CallFunc_getItemsInventory_ContainerItems_1) == 0x000040, "Member 'WBP_CraftItem_C_GetItemsCount::CallFunc_getItemsInventory_ContainerItems_1' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_GetItemsCount, CallFunc_getItemsInventory_ContainersData_1) == 0x000050, "Member 'WBP_CraftItem_C_GetItemsCount::CallFunc_getItemsInventory_ContainersData_1' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_GetItemsCount, CallFunc_Conv_IntToText_ReturnValue) == 0x000060, "Member 'WBP_CraftItem_C_GetItemsCount::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_GetItemsCount, CallFunc_Array_Get_Item) == 0x000078, "Member 'WBP_CraftItem_C_GetItemsCount::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_GetItemsCount, CallFunc_Array_Length_ReturnValue_1) == 0x0000E0, "Member 'WBP_CraftItem_C_GetItemsCount::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_GetItemsCount, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0000E4, "Member 'WBP_CraftItem_C_GetItemsCount::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_GetItemsCount, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000E5, "Member 'WBP_CraftItem_C_GetItemsCount::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_GetItemsCount, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0000E6, "Member 'WBP_CraftItem_C_GetItemsCount::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_GetItemsCount, CallFunc_BooleanAND_ReturnValue) == 0x0000E7, "Member 'WBP_CraftItem_C_GetItemsCount::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_GetItemsCount, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000E8, "Member 'WBP_CraftItem_C_GetItemsCount::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_GetItemsCount, Temp_int_Array_Index_Variable_1) == 0x0000EC, "Member 'WBP_CraftItem_C_GetItemsCount::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_GetItemsCount, CallFunc_Array_Get_Item_1) == 0x0000F0, "Member 'WBP_CraftItem_C_GetItemsCount::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_GetItemsCount, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x000158, "Member 'WBP_CraftItem_C_GetItemsCount::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_GetItemsCount, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x000159, "Member 'WBP_CraftItem_C_GetItemsCount::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_GetItemsCount, CallFunc_Add_IntInt_ReturnValue_3) == 0x00015C, "Member 'WBP_CraftItem_C_GetItemsCount::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_GetItemsCount, CallFunc_BooleanAND_ReturnValue_1) == 0x000160, "Member 'WBP_CraftItem_C_GetItemsCount::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function WBP_CraftItem.WBP_CraftItem_C.OnCraftingFinished__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CraftItem_C_OnCraftingFinished__DelegateSignature final
{
public:
	class UWBP_CraftItem_C*                       Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CraftItem_C_OnCraftingFinished__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CraftItem_C_OnCraftingFinished__DelegateSignature");
static_assert(sizeof(WBP_CraftItem_C_OnCraftingFinished__DelegateSignature) == 0x000008, "Wrong size on WBP_CraftItem_C_OnCraftingFinished__DelegateSignature");
static_assert(offsetof(WBP_CraftItem_C_OnCraftingFinished__DelegateSignature, Item) == 0x000000, "Member 'WBP_CraftItem_C_OnCraftingFinished__DelegateSignature::Item' has a wrong offset!");

// Function WBP_CraftItem.WBP_CraftItem_C.OnDismantlingFinished__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CraftItem_C_OnDismantlingFinished__DelegateSignature final
{
public:
	class UWBP_CraftItem_C*                       Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CraftItem_C_OnDismantlingFinished__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CraftItem_C_OnDismantlingFinished__DelegateSignature");
static_assert(sizeof(WBP_CraftItem_C_OnDismantlingFinished__DelegateSignature) == 0x000008, "Wrong size on WBP_CraftItem_C_OnDismantlingFinished__DelegateSignature");
static_assert(offsetof(WBP_CraftItem_C_OnDismantlingFinished__DelegateSignature, Item) == 0x000000, "Member 'WBP_CraftItem_C_OnDismantlingFinished__DelegateSignature::Item' has a wrong offset!");

// Function WBP_CraftItem.WBP_CraftItem_C.OnMouseButtonDown
// 0x0228 (0x0228 - 0x0000)
struct WBP_CraftItem_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_PointerEvent_IsMouseButtonDown_ReturnValue; // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x0170(0x00B8)()
};
static_assert(alignof(WBP_CraftItem_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on WBP_CraftItem_C_OnMouseButtonDown");
static_assert(sizeof(WBP_CraftItem_C_OnMouseButtonDown) == 0x000228, "Wrong size on WBP_CraftItem_C_OnMouseButtonDown");
static_assert(offsetof(WBP_CraftItem_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'WBP_CraftItem_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'WBP_CraftItem_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_OnMouseButtonDown, ReturnValue) == 0x0000B0, "Member 'WBP_CraftItem_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_OnMouseButtonDown, CallFunc_PointerEvent_IsMouseButtonDown_ReturnValue) == 0x000168, "Member 'WBP_CraftItem_C_OnMouseButtonDown::CallFunc_PointerEvent_IsMouseButtonDown_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_OnMouseButtonDown, K2Node_MakeStruct_EventReply) == 0x000170, "Member 'WBP_CraftItem_C_OnMouseButtonDown::K2Node_MakeStruct_EventReply' has a wrong offset!");

// Function WBP_CraftItem.WBP_CraftItem_C.OnMouseEnter
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_CraftItem_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_CraftItem_C_OnMouseEnter) == 0x000008, "Wrong alignment on WBP_CraftItem_C_OnMouseEnter");
static_assert(sizeof(WBP_CraftItem_C_OnMouseEnter) == 0x0000B0, "Wrong size on WBP_CraftItem_C_OnMouseEnter");
static_assert(offsetof(WBP_CraftItem_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'WBP_CraftItem_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'WBP_CraftItem_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function WBP_CraftItem.WBP_CraftItem_C.OnMouseLeave
// 0x0078 (0x0078 - 0x0000)
struct WBP_CraftItem_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_CraftItem_C_OnMouseLeave) == 0x000008, "Wrong alignment on WBP_CraftItem_C_OnMouseLeave");
static_assert(sizeof(WBP_CraftItem_C_OnMouseLeave) == 0x000078, "Wrong size on WBP_CraftItem_C_OnMouseLeave");
static_assert(offsetof(WBP_CraftItem_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'WBP_CraftItem_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function WBP_CraftItem.WBP_CraftItem_C.OnNeedUpdateModel__DelegateSignature
// 0x0228 (0x0228 - 0x0000)
struct WBP_CraftItem_C_OnNeedUpdateModel__DelegateSignature final
{
public:
	struct FFItemInfo                             Param_ItemData;                                    // 0x0000(0x0220)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          bIsSketch;                                         // 0x0220(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CraftItem_C_OnNeedUpdateModel__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CraftItem_C_OnNeedUpdateModel__DelegateSignature");
static_assert(sizeof(WBP_CraftItem_C_OnNeedUpdateModel__DelegateSignature) == 0x000228, "Wrong size on WBP_CraftItem_C_OnNeedUpdateModel__DelegateSignature");
static_assert(offsetof(WBP_CraftItem_C_OnNeedUpdateModel__DelegateSignature, Param_ItemData) == 0x000000, "Member 'WBP_CraftItem_C_OnNeedUpdateModel__DelegateSignature::Param_ItemData' has a wrong offset!");
static_assert(offsetof(WBP_CraftItem_C_OnNeedUpdateModel__DelegateSignature, bIsSketch) == 0x000220, "Member 'WBP_CraftItem_C_OnNeedUpdateModel__DelegateSignature::bIsSketch' has a wrong offset!");

// Function WBP_CraftItem.WBP_CraftItem_C.OnNotEnoughtInventorySpace__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CraftItem_C_OnNotEnoughtInventorySpace__DelegateSignature final
{
public:
	class UWBP_CraftItem_C*                       Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CraftItem_C_OnNotEnoughtInventorySpace__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CraftItem_C_OnNotEnoughtInventorySpace__DelegateSignature");
static_assert(sizeof(WBP_CraftItem_C_OnNotEnoughtInventorySpace__DelegateSignature) == 0x000008, "Wrong size on WBP_CraftItem_C_OnNotEnoughtInventorySpace__DelegateSignature");
static_assert(offsetof(WBP_CraftItem_C_OnNotEnoughtInventorySpace__DelegateSignature, Item) == 0x000000, "Member 'WBP_CraftItem_C_OnNotEnoughtInventorySpace__DelegateSignature::Item' has a wrong offset!");

// Function WBP_CraftItem.WBP_CraftItem_C.OnNotEnoughtResources__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CraftItem_C_OnNotEnoughtResources__DelegateSignature final
{
public:
	class UWBP_CraftItem_C*                       Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CraftItem_C_OnNotEnoughtResources__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CraftItem_C_OnNotEnoughtResources__DelegateSignature");
static_assert(sizeof(WBP_CraftItem_C_OnNotEnoughtResources__DelegateSignature) == 0x000008, "Wrong size on WBP_CraftItem_C_OnNotEnoughtResources__DelegateSignature");
static_assert(offsetof(WBP_CraftItem_C_OnNotEnoughtResources__DelegateSignature, Item) == 0x000000, "Member 'WBP_CraftItem_C_OnNotEnoughtResources__DelegateSignature::Item' has a wrong offset!");

// Function WBP_CraftItem.WBP_CraftItem_C.OnSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CraftItem_C_OnSelected__DelegateSignature final
{
public:
	class UWBP_CraftItem_C*                       Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CraftItem_C_OnSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CraftItem_C_OnSelected__DelegateSignature");
static_assert(sizeof(WBP_CraftItem_C_OnSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_CraftItem_C_OnSelected__DelegateSignature");
static_assert(offsetof(WBP_CraftItem_C_OnSelected__DelegateSignature, Item) == 0x000000, "Member 'WBP_CraftItem_C_OnSelected__DelegateSignature::Item' has a wrong offset!");

// Function WBP_CraftItem.WBP_CraftItem_C.SetCustomDescription
// 0x0018 (0x0018 - 0x0000)
struct WBP_CraftItem_C_SetCustomDescription final
{
public:
	class FText                                   ItemDescription;                                   // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_CraftItem_C_SetCustomDescription) == 0x000008, "Wrong alignment on WBP_CraftItem_C_SetCustomDescription");
static_assert(sizeof(WBP_CraftItem_C_SetCustomDescription) == 0x000018, "Wrong size on WBP_CraftItem_C_SetCustomDescription");
static_assert(offsetof(WBP_CraftItem_C_SetCustomDescription, ItemDescription) == 0x000000, "Member 'WBP_CraftItem_C_SetCustomDescription::ItemDescription' has a wrong offset!");

// Function WBP_CraftItem.WBP_CraftItem_C.SetCustomItemName
// 0x0018 (0x0018 - 0x0000)
struct WBP_CraftItem_C_SetCustomItemName final
{
public:
