#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BaseBuilding

#include "Basic.hpp"

#include "BuildingInfo_Struct_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_BaseBuilding.WBP_BaseBuilding_C.Confirm Item
// 0x0038 (0x0038 - 0x0000)
struct WBP_BaseBuilding_C_Confirm_Item final
{
public:
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   CallFunc_Conv_ClassToSoftClassReference_ReturnValue; // 0x0008(0x0030)(UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BaseBuilding_C_Confirm_Item) == 0x000008, "Wrong alignment on WBP_BaseBuilding_C_Confirm_Item");
static_assert(sizeof(WBP_BaseBuilding_C_Confirm_Item) == 0x000038, "Wrong size on WBP_BaseBuilding_C_Confirm_Item");
static_assert(offsetof(WBP_BaseBuilding_C_Confirm_Item, CallFunc_GetObjectClass_ReturnValue) == 0x000000, "Member 'WBP_BaseBuilding_C_Confirm_Item::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_Confirm_Item, CallFunc_Conv_ClassToSoftClassReference_ReturnValue) == 0x000008, "Member 'WBP_BaseBuilding_C_Confirm_Item::CallFunc_Conv_ClassToSoftClassReference_ReturnValue' has a wrong offset!");

// Function WBP_BaseBuilding.WBP_BaseBuilding_C.CreateCamera
// 0x0028 (0x0028 - 0x0000)
struct WBP_BaseBuilding_C_CreateCamera final
{
public:
	bool                                          Bool;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_V2_C*                   K2Node_DynamicCast_AsSurvival_Player_V2;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BaseBuilding_C_CreateCamera) == 0x000008, "Wrong alignment on WBP_BaseBuilding_C_CreateCamera");
static_assert(sizeof(WBP_BaseBuilding_C_CreateCamera) == 0x000028, "Wrong size on WBP_BaseBuilding_C_CreateCamera");
static_assert(offsetof(WBP_BaseBuilding_C_CreateCamera, Bool) == 0x000000, "Member 'WBP_BaseBuilding_C_CreateCamera::Bool' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_CreateCamera, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000008, "Member 'WBP_BaseBuilding_C_CreateCamera::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_CreateCamera, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'WBP_BaseBuilding_C_CreateCamera::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_CreateCamera, K2Node_DynamicCast_AsSurvival_Player_V2) == 0x000018, "Member 'WBP_BaseBuilding_C_CreateCamera::K2Node_DynamicCast_AsSurvival_Player_V2' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_CreateCamera, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_BaseBuilding_C_CreateCamera::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_BaseBuilding.WBP_BaseBuilding_C.DestroyPreviewItem
// 0x0001 (0x0001 - 0x0000)
struct WBP_BaseBuilding_C_DestroyPreviewItem final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BaseBuilding_C_DestroyPreviewItem) == 0x000001, "Wrong alignment on WBP_BaseBuilding_C_DestroyPreviewItem");
static_assert(sizeof(WBP_BaseBuilding_C_DestroyPreviewItem) == 0x000001, "Wrong size on WBP_BaseBuilding_C_DestroyPreviewItem");
static_assert(offsetof(WBP_BaseBuilding_C_DestroyPreviewItem, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WBP_BaseBuilding_C_DestroyPreviewItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_BaseBuilding.WBP_BaseBuilding_C.EditMode
// 0x0002 (0x0002 - 0x0000)
struct WBP_BaseBuilding_C_EditMode final
{
public:
	bool                                          Param_EditMode;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEditing_bool;                           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BaseBuilding_C_EditMode) == 0x000001, "Wrong alignment on WBP_BaseBuilding_C_EditMode");
static_assert(sizeof(WBP_BaseBuilding_C_EditMode) == 0x000002, "Wrong size on WBP_BaseBuilding_C_EditMode");
static_assert(offsetof(WBP_BaseBuilding_C_EditMode, Param_EditMode) == 0x000000, "Member 'WBP_BaseBuilding_C_EditMode::Param_EditMode' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_EditMode, CallFunc_IsEditing_bool) == 0x000001, "Member 'WBP_BaseBuilding_C_EditMode::CallFunc_IsEditing_bool' has a wrong offset!");

// Function WBP_BaseBuilding.WBP_BaseBuilding_C.ExecuteUbergraph_WBP_BaseBuilding
// 0x00D0 (0x00D0 - 0x0000)
struct WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEditing_bool;                           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEditing_bool_1;                         // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue_1;                     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_GameHUD_C*                          K2Node_DynamicCast_AsBP_Game_HUD;                  // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_GameHUD_C*                          K2Node_DynamicCast_AsBP_Game_HUD_1;                // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_idx;                            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_1;         // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player_1;            // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0098(0x0008)(NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvPC_C*                              K2Node_DynamicCast_AsSurv_PC;                      // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_StatsInterface_C>   CallFunc_GetStatsComponent_self_CastInput;         // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBPC_PlayerStatsComponent_C*            CallFunc_GetStatsComponent_PlayerStats;            // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding) == 0x000008, "Wrong alignment on WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding");
static_assert(sizeof(WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding) == 0x0000D0, "Wrong size on WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding");
static_assert(offsetof(WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding, EntryPoint) == 0x000000, "Member 'WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding, CallFunc_Greater_IntInt_ReturnValue) == 0x000004, "Member 'WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding, CallFunc_IsEditing_bool) == 0x000005, "Member 'WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding::CallFunc_IsEditing_bool' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding, CallFunc_IsEditing_bool_1) == 0x000006, "Member 'WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding::CallFunc_IsEditing_bool_1' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding, CallFunc_GetPlayerController_ReturnValue_1) == 0x000010, "Member 'WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding, CallFunc_GetHUD_ReturnValue) == 0x000018, "Member 'WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding, CallFunc_GetHUD_ReturnValue_1) == 0x000020, "Member 'WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding::CallFunc_GetHUD_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding, K2Node_DynamicCast_AsBP_Game_HUD) == 0x000028, "Member 'WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding::K2Node_DynamicCast_AsBP_Game_HUD' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding, K2Node_DynamicCast_AsBP_Game_HUD_1) == 0x000038, "Member 'WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding::K2Node_DynamicCast_AsBP_Game_HUD_1' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding, CallFunc_IsValid_ReturnValue) == 0x000041, "Member 'WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding, CallFunc_IsValid_ReturnValue_1) == 0x000042, "Member 'WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000048, "Member 'WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000050, "Member 'WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding, K2Node_CustomEvent_idx) == 0x000054, "Member 'WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding::K2Node_CustomEvent_idx' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding, K2Node_SwitchInteger_CmpSuccess) == 0x000058, "Member 'WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000060, "Member 'WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding, CallFunc_GetPlayerController_ReturnValue_2) == 0x000068, "Member 'WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding, K2Node_DynamicCast_AsSurvival_Player) == 0x000070, "Member 'WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding, K2Node_DynamicCast_bSuccess_2) == 0x000078, "Member 'WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding, CallFunc_GetPlayerCharacter_ReturnValue_1) == 0x000080, "Member 'WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding::CallFunc_GetPlayerCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding, K2Node_DynamicCast_AsSurvival_Player_1) == 0x000088, "Member 'WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding::K2Node_DynamicCast_AsSurvival_Player_1' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding, K2Node_DynamicCast_bSuccess_3) == 0x000090, "Member 'WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding, CallFunc_K2_SetTimer_ReturnValue) == 0x000098, "Member 'WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding, CallFunc_GetOwningPlayer_ReturnValue) == 0x0000A0, "Member 'WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding, K2Node_DynamicCast_AsSurv_PC) == 0x0000A8, "Member 'WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding::K2Node_DynamicCast_AsSurv_PC' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding, K2Node_DynamicCast_bSuccess_4) == 0x0000B0, "Member 'WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding, CallFunc_GetStatsComponent_self_CastInput) == 0x0000B8, "Member 'WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding::CallFunc_GetStatsComponent_self_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding, CallFunc_GetStatsComponent_PlayerStats) == 0x0000C8, "Member 'WBP_BaseBuilding_C_ExecuteUbergraph_WBP_BaseBuilding::CallFunc_GetStatsComponent_PlayerStats' has a wrong offset!");

// Function WBP_BaseBuilding.WBP_BaseBuilding_C.Get_CurrCell
// 0x0060 (0x0060 - 0x0000)
struct WBP_BaseBuilding_C_Get_CurrCell final
{
public:
	class UWidget*                                WidgetRef;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue_1;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_1;                 // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue_2;            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_2;                 // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BaseBuilding_C_Get_CurrCell) == 0x000008, "Wrong alignment on WBP_BaseBuilding_C_Get_CurrCell");
static_assert(sizeof(WBP_BaseBuilding_C_Get_CurrCell) == 0x000060, "Wrong size on WBP_BaseBuilding_C_Get_CurrCell");
static_assert(offsetof(WBP_BaseBuilding_C_Get_CurrCell, WidgetRef) == 0x000000, "Member 'WBP_BaseBuilding_C_Get_CurrCell::WidgetRef' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_Get_CurrCell, CallFunc_Multiply_IntInt_ReturnValue) == 0x000008, "Member 'WBP_BaseBuilding_C_Get_CurrCell::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_Get_CurrCell, Temp_int_Variable) == 0x00000C, "Member 'WBP_BaseBuilding_C_Get_CurrCell::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_Get_CurrCell, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_BaseBuilding_C_Get_CurrCell::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_Get_CurrCell, CallFunc_GetChildAt_ReturnValue) == 0x000018, "Member 'WBP_BaseBuilding_C_Get_CurrCell::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_Get_CurrCell, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'WBP_BaseBuilding_C_Get_CurrCell::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_Get_CurrCell, CallFunc_Subtract_IntInt_ReturnValue) == 0x000024, "Member 'WBP_BaseBuilding_C_Get_CurrCell::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_Get_CurrCell, CallFunc_Multiply_IntInt_ReturnValue_1) == 0x000028, "Member 'WBP_BaseBuilding_C_Get_CurrCell::CallFunc_Multiply_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_Get_CurrCell, CallFunc_Add_IntInt_ReturnValue_1) == 0x00002C, "Member 'WBP_BaseBuilding_C_Get_CurrCell::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_Get_CurrCell, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000030, "Member 'WBP_BaseBuilding_C_Get_CurrCell::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_Get_CurrCell, CallFunc_GetChildAt_ReturnValue_1) == 0x000038, "Member 'WBP_BaseBuilding_C_Get_CurrCell::CallFunc_GetChildAt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_Get_CurrCell, CallFunc_IsValid_ReturnValue_1) == 0x000040, "Member 'WBP_BaseBuilding_C_Get_CurrCell::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_Get_CurrCell, Temp_int_Variable_1) == 0x000044, "Member 'WBP_BaseBuilding_C_Get_CurrCell::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_Get_CurrCell, CallFunc_Multiply_IntInt_ReturnValue_2) == 0x000048, "Member 'WBP_BaseBuilding_C_Get_CurrCell::CallFunc_Multiply_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_Get_CurrCell, CallFunc_Add_IntInt_ReturnValue_2) == 0x00004C, "Member 'WBP_BaseBuilding_C_Get_CurrCell::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_Get_CurrCell, CallFunc_GetChildAt_ReturnValue_2) == 0x000050, "Member 'WBP_BaseBuilding_C_Get_CurrCell::CallFunc_GetChildAt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_Get_CurrCell, CallFunc_IsValid_ReturnValue_2) == 0x000058, "Member 'WBP_BaseBuilding_C_Get_CurrCell::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function WBP_BaseBuilding.WBP_BaseBuilding_C.Init_BuildMenu
// 0x0180 (0x0180 - 0x0000)
struct WBP_BaseBuilding_C_Init_BuildMenu final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FBuildingInfo_Struct& Info)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_BuildingCell_C*                      K2Node_DynamicCast_AsW_Building_Cell;              // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UW_BuildingCell_C*                      CallFunc_Create_ReturnValue;                       // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue;        // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0080(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0094(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBuildingInfo_Struct                   CallFunc_GetDataTableRowFromName_OutRow;           // 0x00A0(0x00D8)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BaseBuilding_C_Init_BuildMenu) == 0x000008, "Wrong alignment on WBP_BaseBuilding_C_Init_BuildMenu");
static_assert(sizeof(WBP_BaseBuilding_C_Init_BuildMenu) == 0x000180, "Wrong size on WBP_BaseBuilding_C_Init_BuildMenu");
static_assert(offsetof(WBP_BaseBuilding_C_Init_BuildMenu, Temp_int_Variable) == 0x000000, "Member 'WBP_BaseBuilding_C_Init_BuildMenu::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_Init_BuildMenu, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_BaseBuilding_C_Init_BuildMenu::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_Init_BuildMenu, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000008, "Member 'WBP_BaseBuilding_C_Init_BuildMenu::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_Init_BuildMenu, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_BaseBuilding_C_Init_BuildMenu::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_Init_BuildMenu, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_BaseBuilding_C_Init_BuildMenu::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_Init_BuildMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'WBP_BaseBuilding_C_Init_BuildMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_Init_BuildMenu, K2Node_CreateDelegate_OutputDelegate_1) == 0x000024, "Member 'WBP_BaseBuilding_C_Init_BuildMenu::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_Init_BuildMenu, Temp_int_Variable_1) == 0x000034, "Member 'WBP_BaseBuilding_C_Init_BuildMenu::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_Init_BuildMenu, CallFunc_GetChildrenCount_ReturnValue) == 0x000038, "Member 'WBP_BaseBuilding_C_Init_BuildMenu::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_Init_BuildMenu, CallFunc_GetChildAt_ReturnValue) == 0x000040, "Member 'WBP_BaseBuilding_C_Init_BuildMenu::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_Init_BuildMenu, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x000048, "Member 'WBP_BaseBuilding_C_Init_BuildMenu::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_Init_BuildMenu, K2Node_DynamicCast_AsW_Building_Cell) == 0x000050, "Member 'WBP_BaseBuilding_C_Init_BuildMenu::K2Node_DynamicCast_AsW_Building_Cell' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_Init_BuildMenu, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'WBP_BaseBuilding_C_Init_BuildMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_Init_BuildMenu, CallFunc_SelectInt_ReturnValue) == 0x00005C, "Member 'WBP_BaseBuilding_C_Init_BuildMenu::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_Init_BuildMenu, CallFunc_GetPlayerController_ReturnValue) == 0x000060, "Member 'WBP_BaseBuilding_C_Init_BuildMenu::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_Init_BuildMenu, CallFunc_Create_ReturnValue) == 0x000068, "Member 'WBP_BaseBuilding_C_Init_BuildMenu::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_Init_BuildMenu, CallFunc_Add_IntInt_ReturnValue_1) == 0x000070, "Member 'WBP_BaseBuilding_C_Init_BuildMenu::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_Init_BuildMenu, CallFunc_Add_IntInt_ReturnValue_2) == 0x000074, "Member 'WBP_BaseBuilding_C_Init_BuildMenu::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_Init_BuildMenu, CallFunc_AddChildToUniformGrid_ReturnValue) == 0x000078, "Member 'WBP_BaseBuilding_C_Init_BuildMenu::CallFunc_AddChildToUniformGrid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_Init_BuildMenu, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000080, "Member 'WBP_BaseBuilding_C_Init_BuildMenu::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_Init_BuildMenu, CallFunc_Array_Length_ReturnValue) == 0x000090, "Member 'WBP_BaseBuilding_C_Init_BuildMenu::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_Init_BuildMenu, CallFunc_Array_Get_Item) == 0x000094, "Member 'WBP_BaseBuilding_C_Init_BuildMenu::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_Init_BuildMenu, CallFunc_Less_IntInt_ReturnValue) == 0x00009C, "Member 'WBP_BaseBuilding_C_Init_BuildMenu::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_Init_BuildMenu, CallFunc_GetDataTableRowFromName_OutRow) == 0x0000A0, "Member 'WBP_BaseBuilding_C_Init_BuildMenu::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_Init_BuildMenu, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000178, "Member 'WBP_BaseBuilding_C_Init_BuildMenu::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_Init_BuildMenu, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000179, "Member 'WBP_BaseBuilding_C_Init_BuildMenu::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WBP_BaseBuilding.WBP_BaseBuilding_C.MoveDown
// 0x000C (0x000C - 0x0000)
struct WBP_BaseBuilding_C_MoveDown final
{
public:
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BaseBuilding_C_MoveDown) == 0x000004, "Wrong alignment on WBP_BaseBuilding_C_MoveDown");
static_assert(sizeof(WBP_BaseBuilding_C_MoveDown) == 0x00000C, "Wrong size on WBP_BaseBuilding_C_MoveDown");
static_assert(offsetof(WBP_BaseBuilding_C_MoveDown, CallFunc_Add_IntInt_ReturnValue) == 0x000000, "Member 'WBP_BaseBuilding_C_MoveDown::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_MoveDown, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000004, "Member 'WBP_BaseBuilding_C_MoveDown::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_MoveDown, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000005, "Member 'WBP_BaseBuilding_C_MoveDown::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_MoveDown, CallFunc_SelectInt_ReturnValue) == 0x000008, "Member 'WBP_BaseBuilding_C_MoveDown::CallFunc_SelectInt_ReturnValue' has a wrong offset!");

// Function WBP_BaseBuilding.WBP_BaseBuilding_C.MoveLeft
// 0x0014 (0x0014 - 0x0000)
struct WBP_BaseBuilding_C_MoveLeft final
{
public:
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BaseBuilding_C_MoveLeft) == 0x000004, "Wrong alignment on WBP_BaseBuilding_C_MoveLeft");
static_assert(sizeof(WBP_BaseBuilding_C_MoveLeft) == 0x000014, "Wrong size on WBP_BaseBuilding_C_MoveLeft");
static_assert(offsetof(WBP_BaseBuilding_C_MoveLeft, CallFunc_Subtract_IntInt_ReturnValue) == 0x000000, "Member 'WBP_BaseBuilding_C_MoveLeft::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_MoveLeft, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000004, "Member 'WBP_BaseBuilding_C_MoveLeft::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_MoveLeft, CallFunc_Less_IntInt_ReturnValue) == 0x000008, "Member 'WBP_BaseBuilding_C_MoveLeft::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_MoveLeft, CallFunc_SelectInt_ReturnValue) == 0x00000C, "Member 'WBP_BaseBuilding_C_MoveLeft::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_MoveLeft, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000010, "Member 'WBP_BaseBuilding_C_MoveLeft::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_BaseBuilding.WBP_BaseBuilding_C.MoveRight
// 0x000C (0x000C - 0x0000)
struct WBP_BaseBuilding_C_MoveRight final
{
public:
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BaseBuilding_C_MoveRight) == 0x000004, "Wrong alignment on WBP_BaseBuilding_C_MoveRight");
static_assert(sizeof(WBP_BaseBuilding_C_MoveRight) == 0x00000C, "Wrong size on WBP_BaseBuilding_C_MoveRight");
static_assert(offsetof(WBP_BaseBuilding_C_MoveRight, CallFunc_Add_IntInt_ReturnValue) == 0x000000, "Member 'WBP_BaseBuilding_C_MoveRight::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_MoveRight, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000004, "Member 'WBP_BaseBuilding_C_MoveRight::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_MoveRight, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000005, "Member 'WBP_BaseBuilding_C_MoveRight::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_MoveRight, CallFunc_SelectInt_ReturnValue) == 0x000008, "Member 'WBP_BaseBuilding_C_MoveRight::CallFunc_SelectInt_ReturnValue' has a wrong offset!");

// Function WBP_BaseBuilding.WBP_BaseBuilding_C.MoveUp
// 0x000C (0x000C - 0x0000)
struct WBP_BaseBuilding_C_MoveUp final
{
public:
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BaseBuilding_C_MoveUp) == 0x000004, "Wrong alignment on WBP_BaseBuilding_C_MoveUp");
static_assert(sizeof(WBP_BaseBuilding_C_MoveUp) == 0x00000C, "Wrong size on WBP_BaseBuilding_C_MoveUp");
static_assert(offsetof(WBP_BaseBuilding_C_MoveUp, CallFunc_Subtract_IntInt_ReturnValue) == 0x000000, "Member 'WBP_BaseBuilding_C_MoveUp::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_MoveUp, CallFunc_Less_IntInt_ReturnValue) == 0x000004, "Member 'WBP_BaseBuilding_C_MoveUp::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_MoveUp, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000005, "Member 'WBP_BaseBuilding_C_MoveUp::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_MoveUp, CallFunc_SelectInt_ReturnValue) == 0x000008, "Member 'WBP_BaseBuilding_C_MoveUp::CallFunc_SelectInt_ReturnValue' has a wrong offset!");

// Function WBP_BaseBuilding.WBP_BaseBuilding_C.Next_Category
// 0x0002 (0x0002 - 0x0000)
struct WBP_BaseBuilding_C_Next_Category final
{
public:
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BaseBuilding_C_Next_Category) == 0x000001, "Wrong alignment on WBP_BaseBuilding_C_Next_Category");
static_assert(sizeof(WBP_BaseBuilding_C_Next_Category) == 0x000002, "Wrong size on WBP_BaseBuilding_C_Next_Category");
static_assert(offsetof(WBP_BaseBuilding_C_Next_Category, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000000, "Member 'WBP_BaseBuilding_C_Next_Category::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_Next_Category, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'WBP_BaseBuilding_C_Next_Category::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_BaseBuilding.WBP_BaseBuilding_C.Prev_Category
// 0x0002 (0x0002 - 0x0000)
struct WBP_BaseBuilding_C_Prev_Category final
{
public:
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BaseBuilding_C_Prev_Category) == 0x000001, "Wrong alignment on WBP_BaseBuilding_C_Prev_Category");
static_assert(sizeof(WBP_BaseBuilding_C_Prev_Category) == 0x000002, "Wrong size on WBP_BaseBuilding_C_Prev_Category");
static_assert(offsetof(WBP_BaseBuilding_C_Prev_Category, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000000, "Member 'WBP_BaseBuilding_C_Prev_Category::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_Prev_Category, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'WBP_BaseBuilding_C_Prev_Category::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_BaseBuilding.WBP_BaseBuilding_C.RemoveVisibility_1stScreen
// 0x0008 (0x0008 - 0x0000)
struct WBP_BaseBuilding_C_RemoveVisibility_1stScreen final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BaseBuilding_C_RemoveVisibility_1stScreen) == 0x000008, "Wrong alignment on WBP_BaseBuilding_C_RemoveVisibility_1stScreen");
static_assert(sizeof(WBP_BaseBuilding_C_RemoveVisibility_1stScreen) == 0x000008, "Wrong size on WBP_BaseBuilding_C_RemoveVisibility_1stScreen");
static_assert(offsetof(WBP_BaseBuilding_C_RemoveVisibility_1stScreen, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_BaseBuilding_C_RemoveVisibility_1stScreen::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_BaseBuilding.WBP_BaseBuilding_C.SelectCell
// 0x0200 (0x0200 - 0x0000)
struct WBP_BaseBuilding_C_SelectCell final
{
public:
	struct FBuildingInfo_Struct                   Param_Info;                                        // 0x0000(0x00D8)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00E0(0x0018)()
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0100(0x0018)()
	class UPaperSprite*                           K2Node_DynamicCast_AsPaper_Sprite;                 // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0xF];                                      // 0x0121(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_MakeBrushFromSprite_ReturnValue;          // 0x0130(0x00D0)()
};
static_assert(alignof(WBP_BaseBuilding_C_SelectCell) == 0x000010, "Wrong alignment on WBP_BaseBuilding_C_SelectCell");
static_assert(sizeof(WBP_BaseBuilding_C_SelectCell) == 0x000200, "Wrong size on WBP_BaseBuilding_C_SelectCell");
static_assert(offsetof(WBP_BaseBuilding_C_SelectCell, Param_Info) == 0x000000, "Member 'WBP_BaseBuilding_C_SelectCell::Param_Info' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_SelectCell, CallFunc_IsValid_ReturnValue) == 0x0000D8, "Member 'WBP_BaseBuilding_C_SelectCell::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_SelectCell, CallFunc_Conv_IntToText_ReturnValue) == 0x0000E0, "Member 'WBP_BaseBuilding_C_SelectCell::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_SelectCell, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x0000F8, "Member 'WBP_BaseBuilding_C_SelectCell::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_SelectCell, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000100, "Member 'WBP_BaseBuilding_C_SelectCell::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_SelectCell, K2Node_DynamicCast_AsPaper_Sprite) == 0x000118, "Member 'WBP_BaseBuilding_C_SelectCell::K2Node_DynamicCast_AsPaper_Sprite' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_SelectCell, K2Node_DynamicCast_bSuccess) == 0x000120, "Member 'WBP_BaseBuilding_C_SelectCell::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_SelectCell, CallFunc_MakeBrushFromSprite_ReturnValue) == 0x000130, "Member 'WBP_BaseBuilding_C_SelectCell::CallFunc_MakeBrushFromSprite_ReturnValue' has a wrong offset!");

// Function WBP_BaseBuilding.WBP_BaseBuilding_C.SetVisiblity_0stScreen
// 0x0008 (0x0008 - 0x0000)
struct WBP_BaseBuilding_C_SetVisiblity_0stScreen final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BaseBuilding_C_SetVisiblity_0stScreen) == 0x000008, "Wrong alignment on WBP_BaseBuilding_C_SetVisiblity_0stScreen");
static_assert(sizeof(WBP_BaseBuilding_C_SetVisiblity_0stScreen) == 0x000008, "Wrong size on WBP_BaseBuilding_C_SetVisiblity_0stScreen");
static_assert(offsetof(WBP_BaseBuilding_C_SetVisiblity_0stScreen, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_BaseBuilding_C_SetVisiblity_0stScreen::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_BaseBuilding.WBP_BaseBuilding_C.SetVisiblity_1stScreen
// 0x0028 (0x0028 - 0x0000)
struct WBP_BaseBuilding_C_SetVisiblity_1stScreen final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BaseBuilding_C_SetVisiblity_1stScreen) == 0x000008, "Wrong alignment on WBP_BaseBuilding_C_SetVisiblity_1stScreen");
static_assert(sizeof(WBP_BaseBuilding_C_SetVisiblity_1stScreen) == 0x000028, "Wrong size on WBP_BaseBuilding_C_SetVisiblity_1stScreen");
static_assert(offsetof(WBP_BaseBuilding_C_SetVisiblity_1stScreen, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000000, "Member 'WBP_BaseBuilding_C_SetVisiblity_1stScreen::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_SetVisiblity_1stScreen, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_BaseBuilding_C_SetVisiblity_1stScreen::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_SetVisiblity_1stScreen, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'WBP_BaseBuilding_C_SetVisiblity_1stScreen::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_SetVisiblity_1stScreen, CallFunc_PlayAnimation_ReturnValue_2) == 0x000018, "Member 'WBP_BaseBuilding_C_SetVisiblity_1stScreen::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_BaseBuilding_C_SetVisiblity_1stScreen, K2Node_SwitchInteger_CmpSuccess) == 0x000020, "Member 'WBP_BaseBuilding_C_SetVisiblity_1stScreen::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function WBP_BaseBuilding.WBP_BaseBuilding_C.SetVisiblity_2ndScreen
// 0x00C8 (0x00C8 - 0x0000)
struct WBP_BaseBuilding_C_SetVisiblity_2ndScreen final
{
public:
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_V2_C*                   K2Node_DynamicCast_AsSurvival_Player_V2;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
