#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HouseShop

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_CarShop_classes.hpp"
#include "E_CarShopSections_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HouseShop.WBP_HouseShop_C
// 0x00B0 (0x04C0 - 0x0410)
class UWBP_HouseShop_C final : public UWBP_CarShop_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_HouseShop_C;                    // 0x0410(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class FText>                           Entries_List;                                      // 0x0418(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UW_HouseShopCategory_C*                 HouseCategory;                                     // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UW_HouseShopCategory_C*>         HouseCategories;                                   // 0x0430(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TMap<int32, class FName>                      CategoryMap;                                       // 0x0440(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UW_HouseShopSlot_C*>             HouseSlots;                                        // 0x0490(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UW_HouseShopSlot_C*                     SelectedHouseSlot;                                 // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UW_EmptyShopCategory_C*>         CategoryArray;                                     // 0x04A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UW_EmptyShopCategory_C*                 SelectedCategoryActual;                            // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void BindedCategory();
	void ChangeCategory(const class FText& NewParam, class UW_HouseShopCategory_C* NewParam1);
	void ChangeSelectedButtonCategory(const class FText& NewCategoryText, class UWBP_CarShopCategory_C* NewSelectedCategory);
	void Construct();
	void CreateCategoryWidget();
	void CreateEmptySlots();
	void CreateSlot();
	void CreateSlotApartaments();
	void CreateSlotHouse();
	void CreateSlotSell();
	void ExecuteUbergraph_WBP_HouseShop(int32 EntryPoint);
	void FilterItems();
	void On_Change_Category(const class FText& NewSelectedCategoryName, class UW_HouseShopCategory_C* ShopCategory);
	void OnChangeCategoryActual(class UW_EmptyShopCategory_C* Ref);
	void OnEntrySelected(int32 Param_Index);
	void OnUpdateBuy();
	void OnUpdateMoney_();
	void OnUpdateSell();
	void SelectedSlot(class UW_HouseShopSlot_C* Slot_Ref);
	void SetShopSectionToHomeSlot(E_CarShopSections ShopSection);
	void OnDisableSelectSlots();
	void OnSwitchToNextSection();
	void OnSwitchToPrevSection();
	void PreConstruct(bool IsDesignTime);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HouseShop_C">();
	}
	static class UWBP_HouseShop_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HouseShop_C>();
	}
};
static_assert(alignof(UWBP_HouseShop_C) == 0x000008, "Wrong alignment on UWBP_HouseShop_C");
static_assert(sizeof(UWBP_HouseShop_C) == 0x0004C0, "Wrong size on UWBP_HouseShop_C");
static_assert(offsetof(UWBP_HouseShop_C, UberGraphFrame_WBP_HouseShop_C) == 0x000410, "Member 'UWBP_HouseShop_C::UberGraphFrame_WBP_HouseShop_C' has a wrong offset!");
static_assert(offsetof(UWBP_HouseShop_C, Entries_List) == 0x000418, "Member 'UWBP_HouseShop_C::Entries_List' has a wrong offset!");
static_assert(offsetof(UWBP_HouseShop_C, HouseCategory) == 0x000428, "Member 'UWBP_HouseShop_C::HouseCategory' has a wrong offset!");
static_assert(offsetof(UWBP_HouseShop_C, HouseCategories) == 0x000430, "Member 'UWBP_HouseShop_C::HouseCategories' has a wrong offset!");
static_assert(offsetof(UWBP_HouseShop_C, CategoryMap) == 0x000440, "Member 'UWBP_HouseShop_C::CategoryMap' has a wrong offset!");
static_assert(offsetof(UWBP_HouseShop_C, HouseSlots) == 0x000490, "Member 'UWBP_HouseShop_C::HouseSlots' has a wrong offset!");
static_assert(offsetof(UWBP_HouseShop_C, SelectedHouseSlot) == 0x0004A0, "Member 'UWBP_HouseShop_C::SelectedHouseSlot' has a wrong offset!");
static_assert(offsetof(UWBP_HouseShop_C, CategoryArray) == 0x0004A8, "Member 'UWBP_HouseShop_C::CategoryArray' has a wrong offset!");
static_assert(offsetof(UWBP_HouseShop_C, SelectedCategoryActual) == 0x0004B8, "Member 'UWBP_HouseShop_C::SelectedCategoryActual' has a wrong offset!");

}

