#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_QuestCompleate

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_QuestCompleate.WBP_QuestCompleate_C
// 0x00B0 (0x0330 - 0x0280)
class UWBP_QuestCompleate_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HideAnim_1;                                        // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowAnim_0;                                        // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HideAnim;                                          // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowAnim;                                          // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBackgroundBlur*                        BackgroundBlur_224;                                // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_HintButtonNew_C*                     Button_Shop;                                       // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             QuestNameText;                                     // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichTextBlock_Objective;                           // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox;                                           // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_QUestRewardResorce_C*              WBP_QUestRewardResorce_Money;                      // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_QUestRewardResorce_C*              WBP_QUestRewardResorce_RP;                         // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Showed;                                            // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           Messages;                                          // 0x02E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         Message_Index;                                     // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvPC_C*                              As_Surv_PC;                                        // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UQuestContext*                          Context;                                           // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         Node_Index;                                        // 0x0310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WidgetLifetime;                                    // 0x0314(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnHide;                                            // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          Auto_Fade;                                         // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_QuestCompleate(int32 EntryPoint);
	void Finished_26694AC349B4242A8D2DFCAA8E72176A();
	void Finished_BF40ADAA45F12F223E243189C95A1C2F();
	void HideCompleteQuest();
	void InstantHide();
	void OnHide__DelegateSignature();
	void PreConstruct(bool IsDesignTime);
	void SetRewards(const TMap<class FString, int32>& Items, int32 RP);
	void Show(bool Param_Show, const class FText& QuestName, const class FText& QuestText, const TMap<class FString, int32>& Reward_Items, int32 Reward_Rp, bool ShowByTime, bool AutoFade);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_QuestCompleate_C">();
	}
	static class UWBP_QuestCompleate_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_QuestCompleate_C>();
	}
};
static_assert(alignof(UWBP_QuestCompleate_C) == 0x000008, "Wrong alignment on UWBP_QuestCompleate_C");
static_assert(sizeof(UWBP_QuestCompleate_C) == 0x000330, "Wrong size on UWBP_QuestCompleate_C");
static_assert(offsetof(UWBP_QuestCompleate_C, UberGraphFrame) == 0x000280, "Member 'UWBP_QuestCompleate_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_QuestCompleate_C, HideAnim_1) == 0x000288, "Member 'UWBP_QuestCompleate_C::HideAnim_1' has a wrong offset!");
static_assert(offsetof(UWBP_QuestCompleate_C, ShowAnim_0) == 0x000290, "Member 'UWBP_QuestCompleate_C::ShowAnim_0' has a wrong offset!");
static_assert(offsetof(UWBP_QuestCompleate_C, HideAnim) == 0x000298, "Member 'UWBP_QuestCompleate_C::HideAnim' has a wrong offset!");
static_assert(offsetof(UWBP_QuestCompleate_C, ShowAnim) == 0x0002A0, "Member 'UWBP_QuestCompleate_C::ShowAnim' has a wrong offset!");
static_assert(offsetof(UWBP_QuestCompleate_C, BackgroundBlur_224) == 0x0002A8, "Member 'UWBP_QuestCompleate_C::BackgroundBlur_224' has a wrong offset!");
static_assert(offsetof(UWBP_QuestCompleate_C, Button_Shop) == 0x0002B0, "Member 'UWBP_QuestCompleate_C::Button_Shop' has a wrong offset!");
static_assert(offsetof(UWBP_QuestCompleate_C, QuestNameText) == 0x0002B8, "Member 'UWBP_QuestCompleate_C::QuestNameText' has a wrong offset!");
static_assert(offsetof(UWBP_QuestCompleate_C, RichTextBlock_Objective) == 0x0002C0, "Member 'UWBP_QuestCompleate_C::RichTextBlock_Objective' has a wrong offset!");
static_assert(offsetof(UWBP_QuestCompleate_C, SizeBox) == 0x0002C8, "Member 'UWBP_QuestCompleate_C::SizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_QuestCompleate_C, WBP_QUestRewardResorce_Money) == 0x0002D0, "Member 'UWBP_QuestCompleate_C::WBP_QUestRewardResorce_Money' has a wrong offset!");
static_assert(offsetof(UWBP_QuestCompleate_C, WBP_QUestRewardResorce_RP) == 0x0002D8, "Member 'UWBP_QuestCompleate_C::WBP_QUestRewardResorce_RP' has a wrong offset!");
static_assert(offsetof(UWBP_QuestCompleate_C, Showed) == 0x0002E0, "Member 'UWBP_QuestCompleate_C::Showed' has a wrong offset!");
static_assert(offsetof(UWBP_QuestCompleate_C, Messages) == 0x0002E8, "Member 'UWBP_QuestCompleate_C::Messages' has a wrong offset!");
static_assert(offsetof(UWBP_QuestCompleate_C, Message_Index) == 0x0002F8, "Member 'UWBP_QuestCompleate_C::Message_Index' has a wrong offset!");
static_assert(offsetof(UWBP_QuestCompleate_C, As_Surv_PC) == 0x000300, "Member 'UWBP_QuestCompleate_C::As_Surv_PC' has a wrong offset!");
static_assert(offsetof(UWBP_QuestCompleate_C, Context) == 0x000308, "Member 'UWBP_QuestCompleate_C::Context' has a wrong offset!");
static_assert(offsetof(UWBP_QuestCompleate_C, Node_Index) == 0x000310, "Member 'UWBP_QuestCompleate_C::Node_Index' has a wrong offset!");
static_assert(offsetof(UWBP_QuestCompleate_C, WidgetLifetime) == 0x000314, "Member 'UWBP_QuestCompleate_C::WidgetLifetime' has a wrong offset!");
static_assert(offsetof(UWBP_QuestCompleate_C, OnHide) == 0x000318, "Member 'UWBP_QuestCompleate_C::OnHide' has a wrong offset!");
static_assert(offsetof(UWBP_QuestCompleate_C, Auto_Fade) == 0x000328, "Member 'UWBP_QuestCompleate_C::Auto_Fade' has a wrong offset!");

}

