#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RepairCategoryNew

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_RepairCategoryNew.WBP_RepairCategoryNew_C.DeselectAll
// 0x0048 (0x0048 - 0x0000)
struct WBP_RepairCategoryNew_C_DeselectAll final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_RepairRow_C*                       K2Node_DynamicCast_AsWBP_Repair_Row;               // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RepairCategoryNew_C_DeselectAll) == 0x000008, "Wrong alignment on WBP_RepairCategoryNew_C_DeselectAll");
static_assert(sizeof(WBP_RepairCategoryNew_C_DeselectAll) == 0x000048, "Wrong size on WBP_RepairCategoryNew_C_DeselectAll");
static_assert(offsetof(WBP_RepairCategoryNew_C_DeselectAll, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_RepairCategoryNew_C_DeselectAll::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_RepairCategoryNew_C_DeselectAll, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_RepairCategoryNew_C_DeselectAll::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_RepairCategoryNew_C_DeselectAll, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_RepairCategoryNew_C_DeselectAll::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairCategoryNew_C_DeselectAll, CallFunc_GetAllChildren_ReturnValue) == 0x000010, "Member 'WBP_RepairCategoryNew_C_DeselectAll::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairCategoryNew_C_DeselectAll, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WBP_RepairCategoryNew_C_DeselectAll::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairCategoryNew_C_DeselectAll, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_RepairCategoryNew_C_DeselectAll::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_RepairCategoryNew_C_DeselectAll, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'WBP_RepairCategoryNew_C_DeselectAll::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairCategoryNew_C_DeselectAll, K2Node_DynamicCast_AsWBP_Repair_Row) == 0x000038, "Member 'WBP_RepairCategoryNew_C_DeselectAll::K2Node_DynamicCast_AsWBP_Repair_Row' has a wrong offset!");
static_assert(offsetof(WBP_RepairCategoryNew_C_DeselectAll, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WBP_RepairCategoryNew_C_DeselectAll::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_RepairCategoryNew.WBP_RepairCategoryNew_C.ExecuteUbergraph_WBP_RepairCategoryNew
// 0x0068 (0x0068 - 0x0000)
struct WBP_RepairCategoryNew_C_ExecuteUbergraph_WBP_RepairCategoryNew final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChild_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_InText;                         // 0x0008(0x0018)()
	class UPaperSprite*                           K2Node_CustomEvent_Sprite;                         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_RepairRow_C*                       CallFunc_Create_ReturnValue;                       // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasChild_ReturnValue;                     // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RepairCategoryNew_C_ExecuteUbergraph_WBP_RepairCategoryNew) == 0x000008, "Wrong alignment on WBP_RepairCategoryNew_C_ExecuteUbergraph_WBP_RepairCategoryNew");
static_assert(sizeof(WBP_RepairCategoryNew_C_ExecuteUbergraph_WBP_RepairCategoryNew) == 0x000068, "Wrong size on WBP_RepairCategoryNew_C_ExecuteUbergraph_WBP_RepairCategoryNew");
static_assert(offsetof(WBP_RepairCategoryNew_C_ExecuteUbergraph_WBP_RepairCategoryNew, EntryPoint) == 0x000000, "Member 'WBP_RepairCategoryNew_C_ExecuteUbergraph_WBP_RepairCategoryNew::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_RepairCategoryNew_C_ExecuteUbergraph_WBP_RepairCategoryNew, CallFunc_RemoveChild_ReturnValue) == 0x000004, "Member 'WBP_RepairCategoryNew_C_ExecuteUbergraph_WBP_RepairCategoryNew::CallFunc_RemoveChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairCategoryNew_C_ExecuteUbergraph_WBP_RepairCategoryNew, K2Node_CustomEvent_InText) == 0x000008, "Member 'WBP_RepairCategoryNew_C_ExecuteUbergraph_WBP_RepairCategoryNew::K2Node_CustomEvent_InText' has a wrong offset!");
static_assert(offsetof(WBP_RepairCategoryNew_C_ExecuteUbergraph_WBP_RepairCategoryNew, K2Node_CustomEvent_Sprite) == 0x000020, "Member 'WBP_RepairCategoryNew_C_ExecuteUbergraph_WBP_RepairCategoryNew::K2Node_CustomEvent_Sprite' has a wrong offset!");
static_assert(offsetof(WBP_RepairCategoryNew_C_ExecuteUbergraph_WBP_RepairCategoryNew, CallFunc_Conv_TextToString_ReturnValue) == 0x000028, "Member 'WBP_RepairCategoryNew_C_ExecuteUbergraph_WBP_RepairCategoryNew::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairCategoryNew_C_ExecuteUbergraph_WBP_RepairCategoryNew, CallFunc_Conv_StringToName_ReturnValue) == 0x000038, "Member 'WBP_RepairCategoryNew_C_ExecuteUbergraph_WBP_RepairCategoryNew::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairCategoryNew_C_ExecuteUbergraph_WBP_RepairCategoryNew, K2Node_CreateDelegate_OutputDelegate) == 0x000040, "Member 'WBP_RepairCategoryNew_C_ExecuteUbergraph_WBP_RepairCategoryNew::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_RepairCategoryNew_C_ExecuteUbergraph_WBP_RepairCategoryNew, CallFunc_Create_ReturnValue) == 0x000050, "Member 'WBP_RepairCategoryNew_C_ExecuteUbergraph_WBP_RepairCategoryNew::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairCategoryNew_C_ExecuteUbergraph_WBP_RepairCategoryNew, CallFunc_AddChild_ReturnValue) == 0x000058, "Member 'WBP_RepairCategoryNew_C_ExecuteUbergraph_WBP_RepairCategoryNew::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairCategoryNew_C_ExecuteUbergraph_WBP_RepairCategoryNew, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'WBP_RepairCategoryNew_C_ExecuteUbergraph_WBP_RepairCategoryNew::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairCategoryNew_C_ExecuteUbergraph_WBP_RepairCategoryNew, CallFunc_HasChild_ReturnValue) == 0x000064, "Member 'WBP_RepairCategoryNew_C_ExecuteUbergraph_WBP_RepairCategoryNew::CallFunc_HasChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairCategoryNew_C_ExecuteUbergraph_WBP_RepairCategoryNew, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000065, "Member 'WBP_RepairCategoryNew_C_ExecuteUbergraph_WBP_RepairCategoryNew::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_RepairCategoryNew.WBP_RepairCategoryNew_C.Init
// 0x0020 (0x0020 - 0x0000)
struct WBP_RepairCategoryNew_C_Init final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UPaperSprite*                           Sprite;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RepairCategoryNew_C_Init) == 0x000008, "Wrong alignment on WBP_RepairCategoryNew_C_Init");
static_assert(sizeof(WBP_RepairCategoryNew_C_Init) == 0x000020, "Wrong size on WBP_RepairCategoryNew_C_Init");
static_assert(offsetof(WBP_RepairCategoryNew_C_Init, InText) == 0x000000, "Member 'WBP_RepairCategoryNew_C_Init::InText' has a wrong offset!");
static_assert(offsetof(WBP_RepairCategoryNew_C_Init, Sprite) == 0x000018, "Member 'WBP_RepairCategoryNew_C_Init::Sprite' has a wrong offset!");

// Function WBP_RepairCategoryNew.WBP_RepairCategoryNew_C.SelectFirst
// 0x0020 (0x0020 - 0x0000)
struct WBP_RepairCategoryNew_C_SelectFirst final
{
public:
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_RepairRow_C*                       K2Node_DynamicCast_AsWBP_Repair_Row;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_RepairWeapon_C*                    CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RepairCategoryNew_C_SelectFirst) == 0x000008, "Wrong alignment on WBP_RepairCategoryNew_C_SelectFirst");
static_assert(sizeof(WBP_RepairCategoryNew_C_SelectFirst) == 0x000020, "Wrong size on WBP_RepairCategoryNew_C_SelectFirst");
static_assert(offsetof(WBP_RepairCategoryNew_C_SelectFirst, CallFunc_GetChildAt_ReturnValue) == 0x000000, "Member 'WBP_RepairCategoryNew_C_SelectFirst::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairCategoryNew_C_SelectFirst, K2Node_DynamicCast_AsWBP_Repair_Row) == 0x000008, "Member 'WBP_RepairCategoryNew_C_SelectFirst::K2Node_DynamicCast_AsWBP_Repair_Row' has a wrong offset!");
static_assert(offsetof(WBP_RepairCategoryNew_C_SelectFirst, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WBP_RepairCategoryNew_C_SelectFirst::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_RepairCategoryNew_C_SelectFirst, CallFunc_Array_Get_Item) == 0x000018, "Member 'WBP_RepairCategoryNew_C_SelectFirst::CallFunc_Array_Get_Item' has a wrong offset!");

}

