#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_FurnitureBuyItemHint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_FurnitureBuyItemHint.WBP_FurnitureBuyItemHint_C
// 0x0058 (0x02D8 - 0x0280)
class UWBP_FurnitureBuyItemHint_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowNotification_Anim;                             // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hide_Anim;                                         // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_MoneyIcon;                                   // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             NameItem;                                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             NameItem_1;                                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PriceItem;                                         // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox;                                           // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_0;                                         // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_276;                                // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Showed;                                            // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowedNotification;                                // 0x02D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_FurnitureBuyItemHint(int32 EntryPoint);
	void Finished_C28FBBB14DF3169EC50C25B6BCAD088F();
	void SetInfo(double Price, const class FText& Param_Name, bool bEnoughMoney);
	void Show(bool Param_Show);
	void ShowNotification();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_FurnitureBuyItemHint_C">();
	}
	static class UWBP_FurnitureBuyItemHint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_FurnitureBuyItemHint_C>();
	}
};
static_assert(alignof(UWBP_FurnitureBuyItemHint_C) == 0x000008, "Wrong alignment on UWBP_FurnitureBuyItemHint_C");
static_assert(sizeof(UWBP_FurnitureBuyItemHint_C) == 0x0002D8, "Wrong size on UWBP_FurnitureBuyItemHint_C");
static_assert(offsetof(UWBP_FurnitureBuyItemHint_C, UberGraphFrame) == 0x000280, "Member 'UWBP_FurnitureBuyItemHint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureBuyItemHint_C, ShowNotification_Anim) == 0x000288, "Member 'UWBP_FurnitureBuyItemHint_C::ShowNotification_Anim' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureBuyItemHint_C, Hide_Anim) == 0x000290, "Member 'UWBP_FurnitureBuyItemHint_C::Hide_Anim' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureBuyItemHint_C, Image_MoneyIcon) == 0x000298, "Member 'UWBP_FurnitureBuyItemHint_C::Image_MoneyIcon' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureBuyItemHint_C, NameItem) == 0x0002A0, "Member 'UWBP_FurnitureBuyItemHint_C::NameItem' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureBuyItemHint_C, NameItem_1) == 0x0002A8, "Member 'UWBP_FurnitureBuyItemHint_C::NameItem_1' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureBuyItemHint_C, PriceItem) == 0x0002B0, "Member 'UWBP_FurnitureBuyItemHint_C::PriceItem' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureBuyItemHint_C, SizeBox) == 0x0002B8, "Member 'UWBP_FurnitureBuyItemHint_C::SizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureBuyItemHint_C, SizeBox_0) == 0x0002C0, "Member 'UWBP_FurnitureBuyItemHint_C::SizeBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureBuyItemHint_C, WidgetSwitcher_276) == 0x0002C8, "Member 'UWBP_FurnitureBuyItemHint_C::WidgetSwitcher_276' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureBuyItemHint_C, Showed) == 0x0002D0, "Member 'UWBP_FurnitureBuyItemHint_C::Showed' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureBuyItemHint_C, ShowedNotification) == 0x0002D1, "Member 'UWBP_FurnitureBuyItemHint_C::ShowedNotification' has a wrong offset!");

}

