#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_WorkbenchRepairTab

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "S_NeedItems_structs.hpp"
#include "ContainerPickupsInfo_structs.hpp"
#include "FItemInfo_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_WorkbenchRepairTab.WBP_WorkbenchRepairTab_C
// 0x0450 (0x06D0 - 0x0280)
class UWBP_WorkbenchRepairTab_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Deselect_item;                                     // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Select_item;                                       // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ProcessDone_Anim;                                  // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Proccess_Anim;                                     // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RepairAnim;                                        // 0x02A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Close_Anim;                                        // 0x02B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NoResourceAnim;                                    // 0x02B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Chemical;                                    // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_MEtal;                                       // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Rag;                                         // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_195;                                   // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_DismantleProccess;                     // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_Items;                                   // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Description;                                  // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Name;                                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_76;                                      // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Chemical;                                // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Metal;                                   // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Rag;                                     // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Info;                                  // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CategorySelector_C*                  W_CategorySelector;                                // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_HintButtonNew_C*                     W_HintButtonNew_Close;                             // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_HintButtonNew_C*                     W_HintButtonNew_Repair;                            // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_StaticWeapons_C*                   WBP_StaticWeapons_158;                             // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Workbench_C*                       ParentRef;                                         // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnChangeResource;                                  // 0x0358(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnClose;                                           // 0x0368(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMap<class FName, class UPaperSprite*>        RepairCategory;                                    // 0x0378(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UWBP_RepairCategoryNew_C*>       AllCategory;                                       // 0x03C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<struct FS_NeedItems>                   Array;                                             // 0x03D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	FMulticastInlineDelegateProperty_             OnRepair;                                          // 0x03E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnFailRepair;                                      // 0x03F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          CanRepair;                                         // 0x0408(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_409[0x3];                                      // 0x0409(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RepairValue;                                       // 0x040C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_RepairWeapon_C*                    SelectWeaponRepair;                                // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      As_Survival_Player;                                // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x0420(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasRepairItem;                                     // 0x0424(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_425[0x3];                                      // 0x0425(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_RepairCategoryNew_C*>       DeleteCategory;                                    // 0x0428(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          NotRepairItems;                                    // 0x0438(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_439[0x7];                                      // 0x0439(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnChangeRepairItem;                                // 0x0440(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FFItemInfo                             Item_Info;                                         // 0x0450(0x0220)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FContainerPickupsInfo>          Container_Items;                                   // 0x0670(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	double                                        PercentRepair;                                     // 0x0680(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnAcceptRepeir;                                    // 0x0688(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         Player_Rag;                                        // 0x0698(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Player_Chemical;                                   // 0x069C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Player_Metal;                                      // 0x06A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A4[0x4];                                      // 0x06A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnNoResource;                                      // 0x06A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnAnimRepairFinish;                                // 0x06B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bIsRepairingStarted;                               // 0x06C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C9[0x3];                                      // 0x06C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NeedsIngredients;                                  // 0x06CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_WorkbenchRepairTab_W_CategorySelector_K2Node_ComponentBoundEvent_3_OnCategoryChanged__DelegateSignature(int32 CategoryIndex);
	void BndEvt__WBP_WorkbenchRepairTab_W_HintButtonNew_Repair_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature();
	void BndEvt__WBP_WorkbenchRepairTab_W_HintButtonNew_Repair_K2Node_ComponentBoundEvent_2_OnReleased__DelegateSignature();
	void BndEvt__WBP_WorkbenchWeaponTab_W_HintButtonNew_Close_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();
	void CheckRepairItems(bool* HasRepairItems);
	void Close();
	void Construct();
	void DeselectRepairItems();
	void ExecuteUbergraph_WBP_WorkbenchRepairTab(int32 EntryPoint);
	void FindItemSelect(int32* RepairItemIndex, class UWBP_RepairCategoryNew_C** Category, class UWBP_RepairWeapon_C** Row, TArray<class UWBP_RepairWeapon_C*>* AllRows);
	void Finished_A10F40DF49FEB1E0352701BB5FE7A82C();
	void Finished_B5A08E164C761531AD2CF88DF7CB4E2B();
	void HiddenItemrepair();
	void NextPage();
	void NoResource();
	void OnAcceptRepair();
	void OnAcceptRepeir__DelegateSignature();
	void OnAnimRepairFinish__DelegateSignature(const struct FFItemInfo& WeaponInfo);
	void OnChangeRepairItem__DelegateSignature(const struct FFItemInfo& ItemInfo);
	void OnChangeResource__DelegateSignature();
	void OnClose__DelegateSignature();
	void OnFailRepair__DelegateSignature();
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	struct FEventReply OnKeyUp(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void OnNoResource__DelegateSignature();
	void OnRepair__DelegateSignature(bool Cant);
	void OnRepairingDone();
	void OnRepairingStarted();
	void OnSelectItemInfo(const struct FFItemInfo& ItemInfo, int32 PlayerRag, int32 PlayerChemical, int32 PlayerMetal, int32 Param_NeedsIngredients);
	void PreConstruct(bool IsDesignTime);
	void PrevPage();
	void RepairPressed();
	void ScrollBox_0_Event_0(class UScrollBox* ScrollBox_0);
	void SequenceEvent__ENTRYPOINTWBP_WorkbenchRepairTab(class UScrollBox* ScrollBox_0);
	void SequenceEvent__ENTRYPOINTWBP_WorkbenchRepairTab_0(class UTextBlock* Param_TextBlock_76);
	void SetCategoryByIndex(int32 Param_Index);
	void SetDefaultStaticWeapon(const struct FFItemInfo& FItemInfo);
	void SetParentRef(class UWBP_Workbench_C* Param_ParentRef);
	void TextBlock_76_Event_0(class UTextBlock* Param_TextBlock_76);
	void UpdateInfoContainerItems(class ASurvivalPlayer_C* Param_As_Survival_Player);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_WorkbenchRepairTab_C">();
	}
	static class UWBP_WorkbenchRepairTab_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_WorkbenchRepairTab_C>();
	}
};
static_assert(alignof(UWBP_WorkbenchRepairTab_C) == 0x000008, "Wrong alignment on UWBP_WorkbenchRepairTab_C");
static_assert(sizeof(UWBP_WorkbenchRepairTab_C) == 0x0006D0, "Wrong size on UWBP_WorkbenchRepairTab_C");
static_assert(offsetof(UWBP_WorkbenchRepairTab_C, UberGraphFrame) == 0x000280, "Member 'UWBP_WorkbenchRepairTab_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchRepairTab_C, Deselect_item) == 0x000288, "Member 'UWBP_WorkbenchRepairTab_C::Deselect_item' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchRepairTab_C, Select_item) == 0x000290, "Member 'UWBP_WorkbenchRepairTab_C::Select_item' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchRepairTab_C, ProcessDone_Anim) == 0x000298, "Member 'UWBP_WorkbenchRepairTab_C::ProcessDone_Anim' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchRepairTab_C, Proccess_Anim) == 0x0002A0, "Member 'UWBP_WorkbenchRepairTab_C::Proccess_Anim' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchRepairTab_C, RepairAnim) == 0x0002A8, "Member 'UWBP_WorkbenchRepairTab_C::RepairAnim' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchRepairTab_C, Close_Anim) == 0x0002B0, "Member 'UWBP_WorkbenchRepairTab_C::Close_Anim' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchRepairTab_C, NoResourceAnim) == 0x0002B8, "Member 'UWBP_WorkbenchRepairTab_C::NoResourceAnim' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchRepairTab_C, Image_0) == 0x0002C0, "Member 'UWBP_WorkbenchRepairTab_C::Image_0' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchRepairTab_C, Image_Chemical) == 0x0002C8, "Member 'UWBP_WorkbenchRepairTab_C::Image_Chemical' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchRepairTab_C, Image_MEtal) == 0x0002D0, "Member 'UWBP_WorkbenchRepairTab_C::Image_MEtal' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchRepairTab_C, Image_Rag) == 0x0002D8, "Member 'UWBP_WorkbenchRepairTab_C::Image_Rag' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchRepairTab_C, ProgressBar_195) == 0x0002E0, "Member 'UWBP_WorkbenchRepairTab_C::ProgressBar_195' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchRepairTab_C, ProgressBar_DismantleProccess) == 0x0002E8, "Member 'UWBP_WorkbenchRepairTab_C::ProgressBar_DismantleProccess' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchRepairTab_C, ScrollBox_Items) == 0x0002F0, "Member 'UWBP_WorkbenchRepairTab_C::ScrollBox_Items' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchRepairTab_C, Text_Description) == 0x0002F8, "Member 'UWBP_WorkbenchRepairTab_C::Text_Description' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchRepairTab_C, Text_Name) == 0x000300, "Member 'UWBP_WorkbenchRepairTab_C::Text_Name' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchRepairTab_C, TextBlock_76) == 0x000308, "Member 'UWBP_WorkbenchRepairTab_C::TextBlock_76' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchRepairTab_C, TextBlock_Chemical) == 0x000310, "Member 'UWBP_WorkbenchRepairTab_C::TextBlock_Chemical' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchRepairTab_C, TextBlock_Metal) == 0x000318, "Member 'UWBP_WorkbenchRepairTab_C::TextBlock_Metal' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchRepairTab_C, TextBlock_Rag) == 0x000320, "Member 'UWBP_WorkbenchRepairTab_C::TextBlock_Rag' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchRepairTab_C, VerticalBox_Info) == 0x000328, "Member 'UWBP_WorkbenchRepairTab_C::VerticalBox_Info' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchRepairTab_C, W_CategorySelector) == 0x000330, "Member 'UWBP_WorkbenchRepairTab_C::W_CategorySelector' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchRepairTab_C, W_HintButtonNew_Close) == 0x000338, "Member 'UWBP_WorkbenchRepairTab_C::W_HintButtonNew_Close' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchRepairTab_C, W_HintButtonNew_Repair) == 0x000340, "Member 'UWBP_WorkbenchRepairTab_C::W_HintButtonNew_Repair' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchRepairTab_C, WBP_StaticWeapons_158) == 0x000348, "Member 'UWBP_WorkbenchRepairTab_C::WBP_StaticWeapons_158' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchRepairTab_C, ParentRef) == 0x000350, "Member 'UWBP_WorkbenchRepairTab_C::ParentRef' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchRepairTab_C, OnChangeResource) == 0x000358, "Member 'UWBP_WorkbenchRepairTab_C::OnChangeResource' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchRepairTab_C, OnClose) == 0x000368, "Member 'UWBP_WorkbenchRepairTab_C::OnClose' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchRepairTab_C, RepairCategory) == 0x000378, "Member 'UWBP_WorkbenchRepairTab_C::RepairCategory' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchRepairTab_C, AllCategory) == 0x0003C8, "Member 'UWBP_WorkbenchRepairTab_C::AllCategory' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchRepairTab_C, Array) == 0x0003D8, "Member 'UWBP_WorkbenchRepairTab_C::Array' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchRepairTab_C, OnRepair) == 0x0003E8, "Member 'UWBP_WorkbenchRepairTab_C::OnRepair' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchRepairTab_C, OnFailRepair) == 0x0003F8, "Member 'UWBP_WorkbenchRepairTab_C::OnFailRepair' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchRepairTab_C, CanRepair) == 0x000408, "Member 'UWBP_WorkbenchRepairTab_C::CanRepair' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchRepairTab_C, RepairValue) == 0x00040C, "Member 'UWBP_WorkbenchRepairTab_C::RepairValue' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchRepairTab_C, SelectWeaponRepair) == 0x000410, "Member 'UWBP_WorkbenchRepairTab_C::SelectWeaponRepair' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchRepairTab_C, As_Survival_Player) == 0x000418, "Member 'UWBP_WorkbenchRepairTab_C::As_Survival_Player' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchRepairTab_C, Count) == 0x000420, "Member 'UWBP_WorkbenchRepairTab_C::Count' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchRepairTab_C, HasRepairItem) == 0x000424, "Member 'UWBP_WorkbenchRepairTab_C::HasRepairItem' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchRepairTab_C, DeleteCategory) == 0x000428, "Member 'UWBP_WorkbenchRepairTab_C::DeleteCategory' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchRepairTab_C, NotRepairItems) == 0x000438, "Member 'UWBP_WorkbenchRepairTab_C::NotRepairItems' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchRepairTab_C, OnChangeRepairItem) == 0x000440, "Member 'UWBP_WorkbenchRepairTab_C::OnChangeRepairItem' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchRepairTab_C, Item_Info) == 0x000450, "Member 'UWBP_WorkbenchRepairTab_C::Item_Info' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchRepairTab_C, Container_Items) == 0x000670, "Member 'UWBP_WorkbenchRepairTab_C::Container_Items' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchRepairTab_C, PercentRepair) == 0x000680, "Member 'UWBP_WorkbenchRepairTab_C::PercentRepair' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchRepairTab_C, OnAcceptRepeir) == 0x000688, "Member 'UWBP_WorkbenchRepairTab_C::OnAcceptRepeir' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchRepairTab_C, Player_Rag) == 0x000698, "Member 'UWBP_WorkbenchRepairTab_C::Player_Rag' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchRepairTab_C, Player_Chemical) == 0x00069C, "Member 'UWBP_WorkbenchRepairTab_C::Player_Chemical' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchRepairTab_C, Player_Metal) == 0x0006A0, "Member 'UWBP_WorkbenchRepairTab_C::Player_Metal' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchRepairTab_C, OnNoResource) == 0x0006A8, "Member 'UWBP_WorkbenchRepairTab_C::OnNoResource' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchRepairTab_C, OnAnimRepairFinish) == 0x0006B8, "Member 'UWBP_WorkbenchRepairTab_C::OnAnimRepairFinish' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchRepairTab_C, bIsRepairingStarted) == 0x0006C8, "Member 'UWBP_WorkbenchRepairTab_C::bIsRepairingStarted' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchRepairTab_C, NeedsIngredients) == 0x0006CC, "Member 'UWBP_WorkbenchRepairTab_C::NeedsIngredients' has a wrong offset!");

}

