#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RadialInteraction

#include "Basic.hpp"

#include "E_CarStatus_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_RadialInteraction.WBP_RadialInteraction_C.CalculateRefillMoneyRequiered
// 0x0048 (0x0048 - 0x0000)
struct WBP_RadialInteraction_C_CalculateRefillMoneyRequiered final
{
public:
	class UObject*                                VehicleReference;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAVS_VehicleMaster_C*                   K2Node_DynamicCast_AsAVS_Vehicle_Master;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetStat_Value;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetStat_Value_1;                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RadialInteraction_C_CalculateRefillMoneyRequiered) == 0x000008, "Wrong alignment on WBP_RadialInteraction_C_CalculateRefillMoneyRequiered");
static_assert(sizeof(WBP_RadialInteraction_C_CalculateRefillMoneyRequiered) == 0x000048, "Wrong size on WBP_RadialInteraction_C_CalculateRefillMoneyRequiered");
static_assert(offsetof(WBP_RadialInteraction_C_CalculateRefillMoneyRequiered, VehicleReference) == 0x000000, "Member 'WBP_RadialInteraction_C_CalculateRefillMoneyRequiered::VehicleReference' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_CalculateRefillMoneyRequiered, ReturnValue) == 0x000008, "Member 'WBP_RadialInteraction_C_CalculateRefillMoneyRequiered::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_CalculateRefillMoneyRequiered, K2Node_DynamicCast_AsAVS_Vehicle_Master) == 0x000010, "Member 'WBP_RadialInteraction_C_CalculateRefillMoneyRequiered::K2Node_DynamicCast_AsAVS_Vehicle_Master' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_CalculateRefillMoneyRequiered, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_RadialInteraction_C_CalculateRefillMoneyRequiered::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_CalculateRefillMoneyRequiered, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000020, "Member 'WBP_RadialInteraction_C_CalculateRefillMoneyRequiered::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_CalculateRefillMoneyRequiered, CallFunc_GetStat_Value) == 0x000028, "Member 'WBP_RadialInteraction_C_CalculateRefillMoneyRequiered::CallFunc_GetStat_Value' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_CalculateRefillMoneyRequiered, CallFunc_GetStat_Value_1) == 0x000030, "Member 'WBP_RadialInteraction_C_CalculateRefillMoneyRequiered::CallFunc_GetStat_Value_1' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_CalculateRefillMoneyRequiered, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000038, "Member 'WBP_RadialInteraction_C_CalculateRefillMoneyRequiered::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_CalculateRefillMoneyRequiered, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000040, "Member 'WBP_RadialInteraction_C_CalculateRefillMoneyRequiered::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");

// Function WBP_RadialInteraction.WBP_RadialInteraction_C.CalculateRepairMoneyRequiered
// 0x0048 (0x0048 - 0x0000)
struct WBP_RadialInteraction_C_CalculateRepairMoneyRequiered final
{
public:
	class UObject*                                VehicleReference;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAVS_VehicleMaster_C*                   K2Node_DynamicCast_AsAVS_Vehicle_Master;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetStat_Value;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetStat_Value_1;                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RadialInteraction_C_CalculateRepairMoneyRequiered) == 0x000008, "Wrong alignment on WBP_RadialInteraction_C_CalculateRepairMoneyRequiered");
static_assert(sizeof(WBP_RadialInteraction_C_CalculateRepairMoneyRequiered) == 0x000048, "Wrong size on WBP_RadialInteraction_C_CalculateRepairMoneyRequiered");
static_assert(offsetof(WBP_RadialInteraction_C_CalculateRepairMoneyRequiered, VehicleReference) == 0x000000, "Member 'WBP_RadialInteraction_C_CalculateRepairMoneyRequiered::VehicleReference' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_CalculateRepairMoneyRequiered, ReturnValue) == 0x000008, "Member 'WBP_RadialInteraction_C_CalculateRepairMoneyRequiered::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_CalculateRepairMoneyRequiered, K2Node_DynamicCast_AsAVS_Vehicle_Master) == 0x000010, "Member 'WBP_RadialInteraction_C_CalculateRepairMoneyRequiered::K2Node_DynamicCast_AsAVS_Vehicle_Master' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_CalculateRepairMoneyRequiered, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_RadialInteraction_C_CalculateRepairMoneyRequiered::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_CalculateRepairMoneyRequiered, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000020, "Member 'WBP_RadialInteraction_C_CalculateRepairMoneyRequiered::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_CalculateRepairMoneyRequiered, CallFunc_GetStat_Value) == 0x000028, "Member 'WBP_RadialInteraction_C_CalculateRepairMoneyRequiered::CallFunc_GetStat_Value' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_CalculateRepairMoneyRequiered, CallFunc_GetStat_Value_1) == 0x000030, "Member 'WBP_RadialInteraction_C_CalculateRepairMoneyRequiered::CallFunc_GetStat_Value_1' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_CalculateRepairMoneyRequiered, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000038, "Member 'WBP_RadialInteraction_C_CalculateRepairMoneyRequiered::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_CalculateRepairMoneyRequiered, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000040, "Member 'WBP_RadialInteraction_C_CalculateRepairMoneyRequiered::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");

// Function WBP_RadialInteraction.WBP_RadialInteraction_C.CanTakeSeat
// 0x0030 (0x0030 - 0x0000)
struct WBP_RadialInteraction_C_CanTakeSeat final
{
public:
	bool                                          Can;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SeatIndex;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsListeningForInputAction_ReturnValue;    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RadialInteraction_C_CanTakeSeat) == 0x000004, "Wrong alignment on WBP_RadialInteraction_C_CanTakeSeat");
static_assert(sizeof(WBP_RadialInteraction_C_CanTakeSeat) == 0x000030, "Wrong size on WBP_RadialInteraction_C_CanTakeSeat");
static_assert(offsetof(WBP_RadialInteraction_C_CanTakeSeat, Can) == 0x000000, "Member 'WBP_RadialInteraction_C_CanTakeSeat::Can' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_CanTakeSeat, SeatIndex) == 0x000004, "Member 'WBP_RadialInteraction_C_CanTakeSeat::SeatIndex' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_CanTakeSeat, Temp_byte_Variable) == 0x000008, "Member 'WBP_RadialInteraction_C_CanTakeSeat::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_CanTakeSeat, CallFunc_IsListeningForInputAction_ReturnValue) == 0x000009, "Member 'WBP_RadialInteraction_C_CanTakeSeat::CallFunc_IsListeningForInputAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_CanTakeSeat, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'WBP_RadialInteraction_C_CanTakeSeat::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_CanTakeSeat, K2Node_CreateDelegate_OutputDelegate_1) == 0x00001C, "Member 'WBP_RadialInteraction_C_CanTakeSeat::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_CanTakeSeat, Temp_byte_Variable_1) == 0x00002C, "Member 'WBP_RadialInteraction_C_CanTakeSeat::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_CanTakeSeat, Temp_bool_Variable) == 0x00002D, "Member 'WBP_RadialInteraction_C_CanTakeSeat::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_CanTakeSeat, K2Node_Select_Default) == 0x00002E, "Member 'WBP_RadialInteraction_C_CanTakeSeat::K2Node_Select_Default' has a wrong offset!");

// Function WBP_RadialInteraction.WBP_RadialInteraction_C.CheckPlayerCar
// 0x0020 (0x0020 - 0x0000)
struct WBP_RadialInteraction_C_CheckPlayerCar final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ActorHasTag_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ActorHasTag_ReturnValue_1;                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetHaveActiveCar_Return;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RadialInteraction_C_CheckPlayerCar) == 0x000008, "Wrong alignment on WBP_RadialInteraction_C_CheckPlayerCar");
static_assert(sizeof(WBP_RadialInteraction_C_CheckPlayerCar) == 0x000020, "Wrong size on WBP_RadialInteraction_C_CheckPlayerCar");
static_assert(offsetof(WBP_RadialInteraction_C_CheckPlayerCar, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WBP_RadialInteraction_C_CheckPlayerCar::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_CheckPlayerCar, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'WBP_RadialInteraction_C_CheckPlayerCar::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_CheckPlayerCar, CallFunc_ActorHasTag_ReturnValue) == 0x000002, "Member 'WBP_RadialInteraction_C_CheckPlayerCar::CallFunc_ActorHasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_CheckPlayerCar, CallFunc_ActorHasTag_ReturnValue_1) == 0x000003, "Member 'WBP_RadialInteraction_C_CheckPlayerCar::CallFunc_ActorHasTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_CheckPlayerCar, CallFunc_SelectInt_ReturnValue) == 0x000004, "Member 'WBP_RadialInteraction_C_CheckPlayerCar::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_CheckPlayerCar, CallFunc_GetHaveActiveCar_Return) == 0x000008, "Member 'WBP_RadialInteraction_C_CheckPlayerCar::CallFunc_GetHaveActiveCar_Return' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_CheckPlayerCar, CallFunc_Not_PreBool_ReturnValue) == 0x000009, "Member 'WBP_RadialInteraction_C_CheckPlayerCar::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_CheckPlayerCar, CallFunc_SelectInt_ReturnValue_1) == 0x00000C, "Member 'WBP_RadialInteraction_C_CheckPlayerCar::CallFunc_SelectInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_CheckPlayerCar, CallFunc_SelectFloat_ReturnValue) == 0x000010, "Member 'WBP_RadialInteraction_C_CheckPlayerCar::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_CheckPlayerCar, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast) == 0x000018, "Member 'WBP_RadialInteraction_C_CheckPlayerCar::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast' has a wrong offset!");

// Function WBP_RadialInteraction.WBP_RadialInteraction_C.ExecuteUbergraph_WBP_RadialInteraction
// 0x0380 (0x0380 - 0x0000)
struct WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameHUD_C>        K2Node_DynamicCast_AsBPI_Game_HUD;                 // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNotInRaid_bSuccess;                     // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNotInRaid_bSuccess_1;                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SelectString_ReturnValue_1;               // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_ActionIndex_2;                  // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetInteractTimeVehicleByActiveIndex_Time; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_Interact_C*                          CallFunc_GetInteractTimeVehicleByActiveIndex_InteractWidget; // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetInteractTimeVehicleByActiveIndex_Time_1; // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_Interact_C*                          CallFunc_GetInteractTimeVehicleByActiveIndex_InteractWidget_1; // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAVS_VehicleMaster_C*                   K2Node_DynamicCast_AsAVS_Vehicle_Master;           // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bShow_1;                        // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_InteractiveActor_1;             // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Show_NewState;                            // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_ActionIndex_1;                  // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_1;                 // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetInteractTimeBarByActiveIndex_Time;     // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_Interact_C*                          CallFunc_GetInteractTimeBarByActiveIndex_InteractWidget; // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_2;                 // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ISurvAnimInterface_C>  K2Node_DynamicCast_AsSurv_Anim_Interface;          // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bShow;                          // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_112[0x6];                                      // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_InteractiveActor;               // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsJumpPrepare_Return;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_TeleporterDoorMaster_C*             K2Node_DynamicCast_AsBP_Teleporter_Door_Master;    // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Show_NewState_1;                          // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bShow_2;                        // 0x0133(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_InteractiveActor_2;             // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Show_NewState_2;                          // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_ActionIndex;                    // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetInteractTimeDoorByActiveIndex_Time;    // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_Interact_C*                          CallFunc_GetInteractTimeDoorByActiveIndex_InteractWidget; // 0x0150(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_3;                 // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_Test_C*                 K2Node_DynamicCast_AsSurvival_Player_Test;         // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16A[0x2];                                      // 0x016A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x016C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_CalculateRepairMoneyRequiered_ReturnValue; // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemByName_ReturnedCount;              // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x018D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x018E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x018F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_192[0x6];                                      // 0x0192(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_HouseGateTeleport_C*                K2Node_DynamicCast_AsBP_House_Gate_Teleport;       // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x01A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A3[0x5];                                      // 0x01A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_CalculateRefillMoneyRequiered_ReturnValue; // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_HouseGateTeleport_C*                K2Node_DynamicCast_AsBP_House_Gate_Teleport_1;     // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x3];                                      // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_Interactable_C>     K2Node_DynamicCast_AsI_Interactable;               // 0x01C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetItemByName_ReturnedCount_1;            // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_DoorTeleport_C*                     K2Node_DynamicCast_AsBP_Door_Teleport;             // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsBeginner_IsBeginner;                 // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x01EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsBeginner_IsBeginner_1;               // 0x01EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x01ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_Contains_ReturnValue;                 // 0x01EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EF[0x1];                                      // 0x01EF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x01F0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ActorHasTag_ReturnValue;                  // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0202(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_203[0x5];                                      // 0x0203(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue_1;                     // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_GameHUD_C>        K2Node_DynamicCast_AsBPI_Game_HUD_1;               // 0x0220(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_PlayerMain_C*                      CallFunc_GetGUI_GUI;                               // 0x0238(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_HouseGateTeleport_C*                K2Node_DynamicCast_AsBP_House_Gate_Teleport_2;     // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24A[0x6];                                      // 0x024A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_DoorTeleport_C*                     K2Node_DynamicCast_AsBP_Door_Teleport_1;           // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_13;                    // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue_2;                     // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameHUD_C>        K2Node_DynamicCast_AsBPI_Game_HUD_2;               // 0x0270(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_14;                    // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_PlayerMain_C*                      CallFunc_GetGUI_GUI_1;                             // 0x0288(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_13;                   // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_292[0x2];                                      // 0x0292(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0294(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_14;                   // 0x02A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_15;                   // 0x02A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A6[0x2];                                      // 0x02A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayerCutsceneComponent_C*             CallFunc_GetComponentByClass_ReturnValue;          // 0x02A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPlayerCutsceneComponent_C*             CallFunc_GetComponentByClass_ReturnValue_1;        // 0x02B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_16;                   // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_17;                   // 0x02B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_18;                   // 0x02BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BB[0x1];                                      // 0x02BB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x02BC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x02CC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_19;                   // 0x02DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DD[0x3];                                      // 0x02DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC;                  // 0x02E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_15;                    // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      CallFunc_GetPlayerRef_SurvivalPlayer;              // 0x0300(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0308(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0358(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0368(0x0018)()
};
static_assert(alignof(WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction) == 0x000008, "Wrong alignment on WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction");
static_assert(sizeof(WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction) == 0x000380, "Wrong size on WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction");
static_assert(offsetof(WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction, EntryPoint) == 0x000000, "Member 'WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction, CallFunc_GetHUD_ReturnValue) == 0x000010, "Member 'WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction, K2Node_DynamicCast_AsBPI_Game_HUD) == 0x000018, "Member 'WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction::K2Node_DynamicCast_AsBPI_Game_HUD' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction, CallFunc_IsNotInRaid_bSuccess) == 0x000029, "Member 'WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction::CallFunc_IsNotInRaid_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction, CallFunc_SelectString_ReturnValue) == 0x000030, "Member 'WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction, CallFunc_IsNotInRaid_bSuccess_1) == 0x000040, "Member 'WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction::CallFunc_IsNotInRaid_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction, CallFunc_SelectString_ReturnValue_1) == 0x000048, "Member 'WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction::CallFunc_SelectString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000058, "Member 'WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction, K2Node_DynamicCast_AsSurvival_Player) == 0x000060, "Member 'WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction, K2Node_CustomEvent_ActionIndex_2) == 0x00006C, "Member 'WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction::K2Node_CustomEvent_ActionIndex_2' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction, K2Node_SwitchInteger_CmpSuccess) == 0x000070, "Member 'WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction, CallFunc_GetInteractTimeVehicleByActiveIndex_Time) == 0x000078, "Member 'WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction::CallFunc_GetInteractTimeVehicleByActiveIndex_Time' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction, CallFunc_GetInteractTimeVehicleByActiveIndex_InteractWidget) == 0x000080, "Member 'WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction::CallFunc_GetInteractTimeVehicleByActiveIndex_InteractWidget' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction, CallFunc_GetInteractTimeVehicleByActiveIndex_Time_1) == 0x000088, "Member 'WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction::CallFunc_GetInteractTimeVehicleByActiveIndex_Time_1' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction, CallFunc_GetInteractTimeVehicleByActiveIndex_InteractWidget_1) == 0x000090, "Member 'WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction::CallFunc_GetInteractTimeVehicleByActiveIndex_InteractWidget_1' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction, CallFunc_IsValid_ReturnValue) == 0x000098, "Member 'WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction, K2Node_DynamicCast_AsAVS_Vehicle_Master) == 0x0000A0, "Member 'WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction::K2Node_DynamicCast_AsAVS_Vehicle_Master' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction, K2Node_DynamicCast_bSuccess_2) == 0x0000A8, "Member 'WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction, CallFunc_IsValid_ReturnValue_1) == 0x0000A9, "Member 'WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction, K2Node_DynamicCast_AsActor) == 0x0000B0, "Member 'WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction, K2Node_DynamicCast_bSuccess_3) == 0x0000B8, "Member 'WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction, K2Node_CustomEvent_bShow_1) == 0x0000B9, "Member 'WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction::K2Node_CustomEvent_bShow_1' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction, K2Node_CustomEvent_InteractiveActor_1) == 0x0000C0, "Member 'WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction::K2Node_CustomEvent_InteractiveActor_1' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction, CallFunc_Show_NewState) == 0x0000C8, "Member 'WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction::CallFunc_Show_NewState' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction, K2Node_CustomEvent_ActionIndex_1) == 0x0000CC, "Member 'WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction::K2Node_CustomEvent_ActionIndex_1' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction, K2Node_SwitchInteger_CmpSuccess_1) == 0x0000D0, "Member 'WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction::K2Node_SwitchInteger_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction, CallFunc_GetInteractTimeBarByActiveIndex_Time) == 0x0000D8, "Member 'WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction::CallFunc_GetInteractTimeBarByActiveIndex_Time' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction, CallFunc_GetInteractTimeBarByActiveIndex_InteractWidget) == 0x0000E0, "Member 'WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction::CallFunc_GetInteractTimeBarByActiveIndex_InteractWidget' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction, CallFunc_IsValid_ReturnValue_2) == 0x0000E8, "Member 'WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction, CallFunc_IsValid_ReturnValue_3) == 0x0000E9, "Member 'WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction, CallFunc_GetAnimInstance_ReturnValue) == 0x0000F0, "Member 'WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction, K2Node_SwitchInteger_CmpSuccess_2) == 0x0000F8, "Member 'WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction::K2Node_SwitchInteger_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction, K2Node_DynamicCast_AsSurv_Anim_Interface) == 0x000100, "Member 'WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction::K2Node_DynamicCast_AsSurv_Anim_Interface' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction, K2Node_DynamicCast_bSuccess_4) == 0x000110, "Member 'WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction, K2Node_CustomEvent_bShow) == 0x000111, "Member 'WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction::K2Node_CustomEvent_bShow' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction, K2Node_CustomEvent_InteractiveActor) == 0x000118, "Member 'WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction::K2Node_CustomEvent_InteractiveActor' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction, CallFunc_IsJumpPrepare_Return) == 0x000120, "Member 'WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction::CallFunc_IsJumpPrepare_Return' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction, K2Node_DynamicCast_AsBP_Teleporter_Door_Master) == 0x000128, "Member 'WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction::K2Node_DynamicCast_AsBP_Teleporter_Door_Master' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction, K2Node_DynamicCast_bSuccess_5) == 0x000130, "Member 'WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction, CallFunc_Not_PreBool_ReturnValue) == 0x000131, "Member 'WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction, CallFunc_Show_NewState_1) == 0x000132, "Member 'WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction::CallFunc_Show_NewState_1' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction, K2Node_CustomEvent_bShow_2) == 0x000133, "Member 'WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction::K2Node_CustomEvent_bShow_2' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction, K2Node_CustomEvent_InteractiveActor_2) == 0x000138, "Member 'WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction::K2Node_CustomEvent_InteractiveActor_2' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction, CallFunc_Show_NewState_2) == 0x000140, "Member 'WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction::CallFunc_Show_NewState_2' has a wrong offset!");
static_assert(offsetof(WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction, K2Node_CustomEvent_ActionIndex) == 0x000144, "Member 'WBP_RadialInteraction_C_ExecuteUbergraph_WBP_RadialInteraction::K2Node_CustomEvent_ActionIndex' has a wrong offset!");
