#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ShopVendorInfo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ShopVendorInfo.WBP_ShopVendorInfo_C
// 0x0048 (0x02C8 - 0x0280)
class UWBP_ShopVendorInfo_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Show;                                              // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Expand;                                            // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_33;                                  // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Icon;                                        // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_VandorName;                                   // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_VendorType;                                   // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TutorialQuest3DTracker_C*          WBP_TutorialQuest3DTracker;                        // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Expanded;                                          // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Showed;                                            // 0x02C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_ShopVendorInfo(int32 EntryPoint);
	void ExpandName(bool Param_Expand);
	void GetExpand(bool* Param_Expanded);
	void GetShow(bool* Param_Showed);
	void Init(class UPaperSprite* Icon, const class FText& Type, const class FText& Param_Name);
	void PreConstruct(bool IsDesignTime);
	void ShowContent(bool Param_Show);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ShopVendorInfo_C">();
	}
	static class UWBP_ShopVendorInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ShopVendorInfo_C>();
	}
};
static_assert(alignof(UWBP_ShopVendorInfo_C) == 0x000008, "Wrong alignment on UWBP_ShopVendorInfo_C");
static_assert(sizeof(UWBP_ShopVendorInfo_C) == 0x0002C8, "Wrong size on UWBP_ShopVendorInfo_C");
static_assert(offsetof(UWBP_ShopVendorInfo_C, UberGraphFrame) == 0x000280, "Member 'UWBP_ShopVendorInfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ShopVendorInfo_C, Show) == 0x000288, "Member 'UWBP_ShopVendorInfo_C::Show' has a wrong offset!");
static_assert(offsetof(UWBP_ShopVendorInfo_C, Expand) == 0x000290, "Member 'UWBP_ShopVendorInfo_C::Expand' has a wrong offset!");
static_assert(offsetof(UWBP_ShopVendorInfo_C, HorizontalBox_33) == 0x000298, "Member 'UWBP_ShopVendorInfo_C::HorizontalBox_33' has a wrong offset!");
static_assert(offsetof(UWBP_ShopVendorInfo_C, Image_Icon) == 0x0002A0, "Member 'UWBP_ShopVendorInfo_C::Image_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_ShopVendorInfo_C, Text_VandorName) == 0x0002A8, "Member 'UWBP_ShopVendorInfo_C::Text_VandorName' has a wrong offset!");
static_assert(offsetof(UWBP_ShopVendorInfo_C, Text_VendorType) == 0x0002B0, "Member 'UWBP_ShopVendorInfo_C::Text_VendorType' has a wrong offset!");
static_assert(offsetof(UWBP_ShopVendorInfo_C, WBP_TutorialQuest3DTracker) == 0x0002B8, "Member 'UWBP_ShopVendorInfo_C::WBP_TutorialQuest3DTracker' has a wrong offset!");
static_assert(offsetof(UWBP_ShopVendorInfo_C, Expanded) == 0x0002C0, "Member 'UWBP_ShopVendorInfo_C::Expanded' has a wrong offset!");
static_assert(offsetof(UWBP_ShopVendorInfo_C, Showed) == 0x0002C1, "Member 'UWBP_ShopVendorInfo_C::Showed' has a wrong offset!");

}

