#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ServerCell

#include "Basic.hpp"

#include "S_ServerInfo_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "FMODStudio_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_ServerCell.WBP_ServerCell_C.ExecuteUbergraph_WBP_ServerCell
// 0x0240 (0x0240 - 0x0000)
struct WBP_ServerCell_C_ExecuteUbergraph_WBP_ServerCell final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UW_DialoguePerks_C*                     CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x00C0(0x0008)(NoDestructor)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x00C8(0x0018)()
	class FText                                   CallFunc_GetText_ReturnValue_1;                    // 0x00E0(0x0018)()
	class FText                                   CallFunc_GetText_ReturnValue_2;                    // 0x00F8(0x0018)()
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_1;                // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0118(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0150(0x0078)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x01C8(0x0078)(ConstParm)
};
static_assert(alignof(WBP_ServerCell_C_ExecuteUbergraph_WBP_ServerCell) == 0x000008, "Wrong alignment on WBP_ServerCell_C_ExecuteUbergraph_WBP_ServerCell");
static_assert(sizeof(WBP_ServerCell_C_ExecuteUbergraph_WBP_ServerCell) == 0x000240, "Wrong size on WBP_ServerCell_C_ExecuteUbergraph_WBP_ServerCell");
static_assert(offsetof(WBP_ServerCell_C_ExecuteUbergraph_WBP_ServerCell, EntryPoint) == 0x000000, "Member 'WBP_ServerCell_C_ExecuteUbergraph_WBP_ServerCell::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_ExecuteUbergraph_WBP_ServerCell, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'WBP_ServerCell_C_ExecuteUbergraph_WBP_ServerCell::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_ExecuteUbergraph_WBP_ServerCell, CallFunc_Create_ReturnValue) == 0x000010, "Member 'WBP_ServerCell_C_ExecuteUbergraph_WBP_ServerCell::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_ExecuteUbergraph_WBP_ServerCell, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WBP_ServerCell_C_ExecuteUbergraph_WBP_ServerCell::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_ExecuteUbergraph_WBP_ServerCell, CallFunc_IsInViewport_ReturnValue) == 0x000019, "Member 'WBP_ServerCell_C_ExecuteUbergraph_WBP_ServerCell::CallFunc_IsInViewport_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_ExecuteUbergraph_WBP_ServerCell, CallFunc_PlayEvent2D_ReturnValue) == 0x000020, "Member 'WBP_ServerCell_C_ExecuteUbergraph_WBP_ServerCell::CallFunc_PlayEvent2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_ExecuteUbergraph_WBP_ServerCell, K2Node_Event_IsDesignTime) == 0x000028, "Member 'WBP_ServerCell_C_ExecuteUbergraph_WBP_ServerCell::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_ExecuteUbergraph_WBP_ServerCell, CallFunc_Not_PreBool_ReturnValue) == 0x000029, "Member 'WBP_ServerCell_C_ExecuteUbergraph_WBP_ServerCell::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_ExecuteUbergraph_WBP_ServerCell, CallFunc_Concat_StrStr_ReturnValue) == 0x000030, "Member 'WBP_ServerCell_C_ExecuteUbergraph_WBP_ServerCell::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_ExecuteUbergraph_WBP_ServerCell, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000040, "Member 'WBP_ServerCell_C_ExecuteUbergraph_WBP_ServerCell::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_ExecuteUbergraph_WBP_ServerCell, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000050, "Member 'WBP_ServerCell_C_ExecuteUbergraph_WBP_ServerCell::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_ExecuteUbergraph_WBP_ServerCell, CallFunc_Conv_TextToString_ReturnValue) == 0x000060, "Member 'WBP_ServerCell_C_ExecuteUbergraph_WBP_ServerCell::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_ExecuteUbergraph_WBP_ServerCell, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000070, "Member 'WBP_ServerCell_C_ExecuteUbergraph_WBP_ServerCell::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_ExecuteUbergraph_WBP_ServerCell, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000080, "Member 'WBP_ServerCell_C_ExecuteUbergraph_WBP_ServerCell::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_ExecuteUbergraph_WBP_ServerCell, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000090, "Member 'WBP_ServerCell_C_ExecuteUbergraph_WBP_ServerCell::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_ExecuteUbergraph_WBP_ServerCell, CallFunc_Concat_StrStr_ReturnValue_5) == 0x0000A0, "Member 'WBP_ServerCell_C_ExecuteUbergraph_WBP_ServerCell::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_ExecuteUbergraph_WBP_ServerCell, CallFunc_Concat_StrStr_ReturnValue_6) == 0x0000B0, "Member 'WBP_ServerCell_C_ExecuteUbergraph_WBP_ServerCell::CallFunc_Concat_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_ExecuteUbergraph_WBP_ServerCell, K2Node_Event_InFocusEvent) == 0x0000C0, "Member 'WBP_ServerCell_C_ExecuteUbergraph_WBP_ServerCell::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_ExecuteUbergraph_WBP_ServerCell, CallFunc_GetText_ReturnValue) == 0x0000C8, "Member 'WBP_ServerCell_C_ExecuteUbergraph_WBP_ServerCell::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_ExecuteUbergraph_WBP_ServerCell, CallFunc_GetText_ReturnValue_1) == 0x0000E0, "Member 'WBP_ServerCell_C_ExecuteUbergraph_WBP_ServerCell::CallFunc_GetText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_ExecuteUbergraph_WBP_ServerCell, CallFunc_GetText_ReturnValue_2) == 0x0000F8, "Member 'WBP_ServerCell_C_ExecuteUbergraph_WBP_ServerCell::CallFunc_GetText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_ExecuteUbergraph_WBP_ServerCell, CallFunc_PlayEvent2D_ReturnValue_1) == 0x000110, "Member 'WBP_ServerCell_C_ExecuteUbergraph_WBP_ServerCell::CallFunc_PlayEvent2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_ExecuteUbergraph_WBP_ServerCell, K2Node_Event_MyGeometry) == 0x000118, "Member 'WBP_ServerCell_C_ExecuteUbergraph_WBP_ServerCell::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_ExecuteUbergraph_WBP_ServerCell, K2Node_Event_MouseEvent_1) == 0x000150, "Member 'WBP_ServerCell_C_ExecuteUbergraph_WBP_ServerCell::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_ExecuteUbergraph_WBP_ServerCell, K2Node_Event_MouseEvent) == 0x0001C8, "Member 'WBP_ServerCell_C_ExecuteUbergraph_WBP_ServerCell::K2Node_Event_MouseEvent' has a wrong offset!");

// Function WBP_ServerCell.WBP_ServerCell_C.GetSelected
// 0x0001 (0x0001 - 0x0000)
struct WBP_ServerCell_C_GetSelected final
{
public:
	bool                                          Param_bSelected;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ServerCell_C_GetSelected) == 0x000001, "Wrong alignment on WBP_ServerCell_C_GetSelected");
static_assert(sizeof(WBP_ServerCell_C_GetSelected) == 0x000001, "Wrong size on WBP_ServerCell_C_GetSelected");
static_assert(offsetof(WBP_ServerCell_C_GetSelected, Param_bSelected) == 0x000000, "Member 'WBP_ServerCell_C_GetSelected::Param_bSelected' has a wrong offset!");

// Function WBP_ServerCell.WBP_ServerCell_C.GetServerName
// 0x0010 (0x0010 - 0x0000)
struct WBP_ServerCell_C_GetServerName final
{
public:
	class FString                                 Param_ServerName;                                  // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ServerCell_C_GetServerName) == 0x000008, "Wrong alignment on WBP_ServerCell_C_GetServerName");
static_assert(sizeof(WBP_ServerCell_C_GetServerName) == 0x000010, "Wrong size on WBP_ServerCell_C_GetServerName");
static_assert(offsetof(WBP_ServerCell_C_GetServerName, Param_ServerName) == 0x000000, "Member 'WBP_ServerCell_C_GetServerName::Param_ServerName' has a wrong offset!");

// Function WBP_ServerCell.WBP_ServerCell_C.HoverButton
// 0x0010 (0x0010 - 0x0000)
struct WBP_ServerCell_C_HoverButton final
{
public:
	bool                                          Param_Hover;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ServerCell_C_HoverButton) == 0x000008, "Wrong alignment on WBP_ServerCell_C_HoverButton");
static_assert(sizeof(WBP_ServerCell_C_HoverButton) == 0x000010, "Wrong size on WBP_ServerCell_C_HoverButton");
static_assert(offsetof(WBP_ServerCell_C_HoverButton, Param_Hover) == 0x000000, "Member 'WBP_ServerCell_C_HoverButton::Param_Hover' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_HoverButton, Temp_bool_Variable) == 0x000001, "Member 'WBP_ServerCell_C_HoverButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_HoverButton, Temp_byte_Variable) == 0x000002, "Member 'WBP_ServerCell_C_HoverButton::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_HoverButton, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_ServerCell_C_HoverButton::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_HoverButton, K2Node_Select_Default) == 0x000004, "Member 'WBP_ServerCell_C_HoverButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_HoverButton, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_ServerCell_C_HoverButton::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_ServerCell.WBP_ServerCell_C.Init
// 0x0004 (0x0004 - 0x0000)
struct WBP_ServerCell_C_Init final
{
public:
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ServerCell_C_Init) == 0x000004, "Wrong alignment on WBP_ServerCell_C_Init");
static_assert(sizeof(WBP_ServerCell_C_Init) == 0x000004, "Wrong size on WBP_ServerCell_C_Init");
static_assert(offsetof(WBP_ServerCell_C_Init, CallFunc_SelectInt_ReturnValue) == 0x000000, "Member 'WBP_ServerCell_C_Init::CallFunc_SelectInt_ReturnValue' has a wrong offset!");

// Function WBP_ServerCell.WBP_ServerCell_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct WBP_ServerCell_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_ServerCell_C_OnAddedToFocusPath) == 0x000004, "Wrong alignment on WBP_ServerCell_C_OnAddedToFocusPath");
static_assert(sizeof(WBP_ServerCell_C_OnAddedToFocusPath) == 0x000008, "Wrong size on WBP_ServerCell_C_OnAddedToFocusPath");
static_assert(offsetof(WBP_ServerCell_C_OnAddedToFocusPath, InFocusEvent) == 0x000000, "Member 'WBP_ServerCell_C_OnAddedToFocusPath::InFocusEvent' has a wrong offset!");

// Function WBP_ServerCell.WBP_ServerCell_C.OnDoubleClick__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ServerCell_C_OnDoubleClick__DelegateSignature final
{
public:
	class UWBP_ServerCell_C*                      ServerCell;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ServerCell_C_OnDoubleClick__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ServerCell_C_OnDoubleClick__DelegateSignature");
static_assert(sizeof(WBP_ServerCell_C_OnDoubleClick__DelegateSignature) == 0x000008, "Wrong size on WBP_ServerCell_C_OnDoubleClick__DelegateSignature");
static_assert(offsetof(WBP_ServerCell_C_OnDoubleClick__DelegateSignature, ServerCell) == 0x000000, "Member 'WBP_ServerCell_C_OnDoubleClick__DelegateSignature::ServerCell' has a wrong offset!");

// Function WBP_ServerCell.WBP_ServerCell_C.OnFocused__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ServerCell_C_OnFocused__DelegateSignature final
{
public:
	class UWBP_ServerCell_C*                      Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ServerCell_C_OnFocused__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ServerCell_C_OnFocused__DelegateSignature");
static_assert(sizeof(WBP_ServerCell_C_OnFocused__DelegateSignature) == 0x000008, "Wrong size on WBP_ServerCell_C_OnFocused__DelegateSignature");
static_assert(offsetof(WBP_ServerCell_C_OnFocused__DelegateSignature, Widget) == 0x000000, "Member 'WBP_ServerCell_C_OnFocused__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_ServerCell.WBP_ServerCell_C.OnMouseButtonDoubleClick
// 0x0240 (0x0240 - 0x0000)
struct WBP_ServerCell_C_OnMouseButtonDoubleClick final
{
public:
	struct FGeometry                              InMyGeometry;                                      // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          InMouseEvent;                                      // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x0168(0x00B8)()
	struct FKey                                   CallFunc_PointerEvent_GetEffectingButton_ReturnValue; // 0x0220(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ServerCell_C_OnMouseButtonDoubleClick) == 0x000008, "Wrong alignment on WBP_ServerCell_C_OnMouseButtonDoubleClick");
static_assert(sizeof(WBP_ServerCell_C_OnMouseButtonDoubleClick) == 0x000240, "Wrong size on WBP_ServerCell_C_OnMouseButtonDoubleClick");
static_assert(offsetof(WBP_ServerCell_C_OnMouseButtonDoubleClick, InMyGeometry) == 0x000000, "Member 'WBP_ServerCell_C_OnMouseButtonDoubleClick::InMyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_OnMouseButtonDoubleClick, InMouseEvent) == 0x000038, "Member 'WBP_ServerCell_C_OnMouseButtonDoubleClick::InMouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_OnMouseButtonDoubleClick, ReturnValue) == 0x0000B0, "Member 'WBP_ServerCell_C_OnMouseButtonDoubleClick::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_OnMouseButtonDoubleClick, K2Node_MakeStruct_EventReply) == 0x000168, "Member 'WBP_ServerCell_C_OnMouseButtonDoubleClick::K2Node_MakeStruct_EventReply' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_OnMouseButtonDoubleClick, CallFunc_PointerEvent_GetEffectingButton_ReturnValue) == 0x000220, "Member 'WBP_ServerCell_C_OnMouseButtonDoubleClick::CallFunc_PointerEvent_GetEffectingButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_OnMouseButtonDoubleClick, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000238, "Member 'WBP_ServerCell_C_OnMouseButtonDoubleClick::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");

// Function WBP_ServerCell.WBP_ServerCell_C.OnMouseButtonDown_0
// 0x0230 (0x0230 - 0x0000)
struct WBP_ServerCell_C_OnMouseButtonDown_0 final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PointerEvent_IsMouseButtonDown_ReturnValue; // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x0178(0x00B8)()
};
static_assert(alignof(WBP_ServerCell_C_OnMouseButtonDown_0) == 0x000008, "Wrong alignment on WBP_ServerCell_C_OnMouseButtonDown_0");
static_assert(sizeof(WBP_ServerCell_C_OnMouseButtonDown_0) == 0x000230, "Wrong size on WBP_ServerCell_C_OnMouseButtonDown_0");
static_assert(offsetof(WBP_ServerCell_C_OnMouseButtonDown_0, MyGeometry) == 0x000000, "Member 'WBP_ServerCell_C_OnMouseButtonDown_0::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_OnMouseButtonDown_0, MouseEvent) == 0x000038, "Member 'WBP_ServerCell_C_OnMouseButtonDown_0::MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_OnMouseButtonDown_0, ReturnValue) == 0x0000B0, "Member 'WBP_ServerCell_C_OnMouseButtonDown_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_OnMouseButtonDown_0, CallFunc_PlayEvent2D_ReturnValue) == 0x000168, "Member 'WBP_ServerCell_C_OnMouseButtonDown_0::CallFunc_PlayEvent2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_OnMouseButtonDown_0, CallFunc_PointerEvent_IsMouseButtonDown_ReturnValue) == 0x000170, "Member 'WBP_ServerCell_C_OnMouseButtonDown_0::CallFunc_PointerEvent_IsMouseButtonDown_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_OnMouseButtonDown_0, K2Node_MakeStruct_EventReply) == 0x000178, "Member 'WBP_ServerCell_C_OnMouseButtonDown_0::K2Node_MakeStruct_EventReply' has a wrong offset!");

// Function WBP_ServerCell.WBP_ServerCell_C.OnMouseDoubleClick
// 0x0240 (0x0240 - 0x0000)
struct WBP_ServerCell_C_OnMouseDoubleClick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x0168(0x00B8)()
	struct FKey                                   CallFunc_PointerEvent_GetEffectingButton_ReturnValue; // 0x0220(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ServerCell_C_OnMouseDoubleClick) == 0x000008, "Wrong alignment on WBP_ServerCell_C_OnMouseDoubleClick");
static_assert(sizeof(WBP_ServerCell_C_OnMouseDoubleClick) == 0x000240, "Wrong size on WBP_ServerCell_C_OnMouseDoubleClick");
static_assert(offsetof(WBP_ServerCell_C_OnMouseDoubleClick, MyGeometry) == 0x000000, "Member 'WBP_ServerCell_C_OnMouseDoubleClick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_OnMouseDoubleClick, MouseEvent) == 0x000038, "Member 'WBP_ServerCell_C_OnMouseDoubleClick::MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_OnMouseDoubleClick, ReturnValue) == 0x0000B0, "Member 'WBP_ServerCell_C_OnMouseDoubleClick::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_OnMouseDoubleClick, K2Node_MakeStruct_EventReply) == 0x000168, "Member 'WBP_ServerCell_C_OnMouseDoubleClick::K2Node_MakeStruct_EventReply' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_OnMouseDoubleClick, CallFunc_PointerEvent_GetEffectingButton_ReturnValue) == 0x000220, "Member 'WBP_ServerCell_C_OnMouseDoubleClick::CallFunc_PointerEvent_GetEffectingButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_OnMouseDoubleClick, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000238, "Member 'WBP_ServerCell_C_OnMouseDoubleClick::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");

// Function WBP_ServerCell.WBP_ServerCell_C.OnMouseEnter
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_ServerCell_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_ServerCell_C_OnMouseEnter) == 0x000008, "Wrong alignment on WBP_ServerCell_C_OnMouseEnter");
static_assert(sizeof(WBP_ServerCell_C_OnMouseEnter) == 0x0000B0, "Wrong size on WBP_ServerCell_C_OnMouseEnter");
static_assert(offsetof(WBP_ServerCell_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'WBP_ServerCell_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'WBP_ServerCell_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function WBP_ServerCell.WBP_ServerCell_C.OnMouseLeave
// 0x0078 (0x0078 - 0x0000)
struct WBP_ServerCell_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_ServerCell_C_OnMouseLeave) == 0x000008, "Wrong alignment on WBP_ServerCell_C_OnMouseLeave");
static_assert(sizeof(WBP_ServerCell_C_OnMouseLeave) == 0x000078, "Wrong size on WBP_ServerCell_C_OnMouseLeave");
static_assert(offsetof(WBP_ServerCell_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'WBP_ServerCell_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function WBP_ServerCell.WBP_ServerCell_C.OnServerSelected__DelegateSignature
// 0x0048 (0x0048 - 0x0000)
struct WBP_ServerCell_C_OnServerSelected__DelegateSignature final
{
public:
	struct FS_ServerInfo                          Param_ServerInfo;                                  // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UWBP_ServerCell_C*                      Widget;                                            // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ServerCell_C_OnServerSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ServerCell_C_OnServerSelected__DelegateSignature");
static_assert(sizeof(WBP_ServerCell_C_OnServerSelected__DelegateSignature) == 0x000048, "Wrong size on WBP_ServerCell_C_OnServerSelected__DelegateSignature");
static_assert(offsetof(WBP_ServerCell_C_OnServerSelected__DelegateSignature, Param_ServerInfo) == 0x000000, "Member 'WBP_ServerCell_C_OnServerSelected__DelegateSignature::Param_ServerInfo' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_OnServerSelected__DelegateSignature, Widget) == 0x000040, "Member 'WBP_ServerCell_C_OnServerSelected__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_ServerCell.WBP_ServerCell_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ServerCell_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ServerCell_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_ServerCell_C_PreConstruct");
static_assert(sizeof(WBP_ServerCell_C_PreConstruct) == 0x000001, "Wrong size on WBP_ServerCell_C_PreConstruct");
static_assert(offsetof(WBP_ServerCell_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_ServerCell_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_ServerCell.WBP_ServerCell_C.ReportConnect
// 0x0100 (0x0100 - 0x0000)
struct WBP_ServerCell_C_ReportConnect final
{
public:
	class FText                                   Region;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Ping;                                              // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Status;                                            // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	TMap<class FString, class FString>            ReportProperties;                                  // 0x0048(0x0050)(Edit, BlueprintVisible)
	class FString                                 Temp_string_Variable;                              // 0x0098(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_1;                            // 0x00D8(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_2;                            // 0x00E8(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	class USurvivalStatSystem*                    CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ServerCell_C_ReportConnect) == 0x000008, "Wrong alignment on WBP_ServerCell_C_ReportConnect");
static_assert(sizeof(WBP_ServerCell_C_ReportConnect) == 0x000100, "Wrong size on WBP_ServerCell_C_ReportConnect");
static_assert(offsetof(WBP_ServerCell_C_ReportConnect, Region) == 0x000000, "Member 'WBP_ServerCell_C_ReportConnect::Region' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_ReportConnect, Ping) == 0x000018, "Member 'WBP_ServerCell_C_ReportConnect::Ping' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_ReportConnect, Status) == 0x000030, "Member 'WBP_ServerCell_C_ReportConnect::Status' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_ReportConnect, ReportProperties) == 0x000048, "Member 'WBP_ServerCell_C_ReportConnect::ReportProperties' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_ReportConnect, Temp_string_Variable) == 0x000098, "Member 'WBP_ServerCell_C_ReportConnect::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_ReportConnect, CallFunc_Conv_TextToString_ReturnValue) == 0x0000A8, "Member 'WBP_ServerCell_C_ReportConnect::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_ReportConnect, CallFunc_Conv_TextToString_ReturnValue_1) == 0x0000B8, "Member 'WBP_ServerCell_C_ReportConnect::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_ReportConnect, CallFunc_Conv_TextToString_ReturnValue_2) == 0x0000C8, "Member 'WBP_ServerCell_C_ReportConnect::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_ReportConnect, Temp_string_Variable_1) == 0x0000D8, "Member 'WBP_ServerCell_C_ReportConnect::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_ReportConnect, Temp_string_Variable_2) == 0x0000E8, "Member 'WBP_ServerCell_C_ReportConnect::Temp_string_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_ReportConnect, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x0000F8, "Member 'WBP_ServerCell_C_ReportConnect::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");

// Function WBP_ServerCell.WBP_ServerCell_C.Set Population Range
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_ServerCell_C_Set_Population_Range final
{
public:
	int32                                         NumberOfPlayers;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x0008(0x0018)(Parm, OutParm)
	class FText                                   Temp_text_Variable;                                // 0x0020(0x0018)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_IntInt_ReturnValue;               // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_IntInt_ReturnValue_1;             // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_IntInt_ReturnValue_2;             // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F[0x1];                                       // 0x003F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_1;                              // 0x0040(0x0018)()
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_2;                              // 0x0060(0x0018)()
	bool                                          Temp_bool_Variable_1;                              // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B[0x5];                                       // 0x007B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0080(0x0018)()
	class FText                                   K2Node_Select_Default_1;                           // 0x0098(0x0018)()
	class FText                                   K2Node_Select_Default_2;                           // 0x00B0(0x0018)()
	class FText                                   K2Node_Select_Default_3;                           // 0x00C8(0x0018)()
};
static_assert(alignof(WBP_ServerCell_C_Set_Population_Range) == 0x000008, "Wrong alignment on WBP_ServerCell_C_Set_Population_Range");
static_assert(sizeof(WBP_ServerCell_C_Set_Population_Range) == 0x0000E0, "Wrong size on WBP_ServerCell_C_Set_Population_Range");
static_assert(offsetof(WBP_ServerCell_C_Set_Population_Range, NumberOfPlayers) == 0x000000, "Member 'WBP_ServerCell_C_Set_Population_Range::NumberOfPlayers' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_Set_Population_Range, Text) == 0x000008, "Member 'WBP_ServerCell_C_Set_Population_Range::Text' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_Set_Population_Range, Temp_text_Variable) == 0x000020, "Member 'WBP_ServerCell_C_Set_Population_Range::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_Set_Population_Range, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000038, "Member 'WBP_ServerCell_C_Set_Population_Range::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_Set_Population_Range, CallFunc_Not_PreBool_ReturnValue) == 0x000039, "Member 'WBP_ServerCell_C_Set_Population_Range::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_Set_Population_Range, CallFunc_InRange_IntInt_ReturnValue) == 0x00003A, "Member 'WBP_ServerCell_C_Set_Population_Range::CallFunc_InRange_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_Set_Population_Range, CallFunc_InRange_IntInt_ReturnValue_1) == 0x00003B, "Member 'WBP_ServerCell_C_Set_Population_Range::CallFunc_InRange_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_Set_Population_Range, CallFunc_Not_PreBool_ReturnValue_1) == 0x00003C, "Member 'WBP_ServerCell_C_Set_Population_Range::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_Set_Population_Range, CallFunc_Not_PreBool_ReturnValue_2) == 0x00003D, "Member 'WBP_ServerCell_C_Set_Population_Range::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_Set_Population_Range, CallFunc_InRange_IntInt_ReturnValue_2) == 0x00003E, "Member 'WBP_ServerCell_C_Set_Population_Range::CallFunc_InRange_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_Set_Population_Range, Temp_text_Variable_1) == 0x000040, "Member 'WBP_ServerCell_C_Set_Population_Range::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_Set_Population_Range, CallFunc_Not_PreBool_ReturnValue_3) == 0x000058, "Member 'WBP_ServerCell_C_Set_Population_Range::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_Set_Population_Range, CallFunc_BooleanAND_ReturnValue) == 0x000059, "Member 'WBP_ServerCell_C_Set_Population_Range::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_Set_Population_Range, Temp_bool_Variable) == 0x00005A, "Member 'WBP_ServerCell_C_Set_Population_Range::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_Set_Population_Range, CallFunc_BooleanAND_ReturnValue_1) == 0x00005B, "Member 'WBP_ServerCell_C_Set_Population_Range::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_Set_Population_Range, CallFunc_BooleanAND_ReturnValue_2) == 0x00005C, "Member 'WBP_ServerCell_C_Set_Population_Range::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_Set_Population_Range, Temp_text_Variable_2) == 0x000060, "Member 'WBP_ServerCell_C_Set_Population_Range::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_Set_Population_Range, Temp_bool_Variable_1) == 0x000078, "Member 'WBP_ServerCell_C_Set_Population_Range::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_Set_Population_Range, Temp_bool_Variable_2) == 0x000079, "Member 'WBP_ServerCell_C_Set_Population_Range::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_Set_Population_Range, Temp_bool_Variable_3) == 0x00007A, "Member 'WBP_ServerCell_C_Set_Population_Range::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_Set_Population_Range, K2Node_Select_Default) == 0x000080, "Member 'WBP_ServerCell_C_Set_Population_Range::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_Set_Population_Range, K2Node_Select_Default_1) == 0x000098, "Member 'WBP_ServerCell_C_Set_Population_Range::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_Set_Population_Range, K2Node_Select_Default_2) == 0x0000B0, "Member 'WBP_ServerCell_C_Set_Population_Range::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_Set_Population_Range, K2Node_Select_Default_3) == 0x0000C8, "Member 'WBP_ServerCell_C_Set_Population_Range::K2Node_Select_Default_3' has a wrong offset!");

// Function WBP_ServerCell.WBP_ServerCell_C.SetFavorite
// 0x000C (0x000C - 0x0000)
struct WBP_ServerCell_C_SetFavorite final
{
public:
	bool                                          Favorite;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ServerCell_C_SetFavorite) == 0x000004, "Wrong alignment on WBP_ServerCell_C_SetFavorite");
static_assert(sizeof(WBP_ServerCell_C_SetFavorite) == 0x00000C, "Wrong size on WBP_ServerCell_C_SetFavorite");
static_assert(offsetof(WBP_ServerCell_C_SetFavorite, Favorite) == 0x000000, "Member 'WBP_ServerCell_C_SetFavorite::Favorite' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_SetFavorite, CallFunc_SelectInt_ReturnValue) == 0x000004, "Member 'WBP_ServerCell_C_SetFavorite::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_SetFavorite, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000008, "Member 'WBP_ServerCell_C_SetFavorite::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function WBP_ServerCell.WBP_ServerCell_C.SetSelected
// 0x0020 (0x0020 - 0x0000)
struct WBP_ServerCell_C_SetSelected final
{
public:
	bool                                          Param_bSelected;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ServerCell_C_SetSelected) == 0x000008, "Wrong alignment on WBP_ServerCell_C_SetSelected");
static_assert(sizeof(WBP_ServerCell_C_SetSelected) == 0x000020, "Wrong size on WBP_ServerCell_C_SetSelected");
static_assert(offsetof(WBP_ServerCell_C_SetSelected, Param_bSelected) == 0x000000, "Member 'WBP_ServerCell_C_SetSelected::Param_bSelected' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_SetSelected, Temp_bool_Variable) == 0x000001, "Member 'WBP_ServerCell_C_SetSelected::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_SetSelected, CallFunc_IsHovered_ReturnValue) == 0x000002, "Member 'WBP_ServerCell_C_SetSelected::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerCell_C_SetSelected, K2Node_Select_Default) == 0x000008, "Member 'WBP_ServerCell_C_SetSelected::K2Node_Select_Default' has a wrong offset!");
