#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CraftItem

#include "Basic.hpp"

#include "S_ItemsToCraft_structs.hpp"
#include "Engine_structs.hpp"
#include "ContainerPickupsInfo_structs.hpp"
#include "FItemInfo_structs.hpp"
#include "E_EntryMode_structs.hpp"
#include "FMODStudio_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CraftItem.WBP_CraftItem_C
// 0x0650 (0x08D0 - 0x0280)
class UWBP_CraftItem_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       AcceptCraft;                                       // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowCount_Anim;                                    // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HideProgress_Anim;                                 // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Deselect_Anim;                                     // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Select_Anim;                                       // 0x02A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover_Anim;                                        // 0x02B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FillAnim;                                          // 0x02B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button__Minus;                                     // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_CraftItem;                                  // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Plus;                                       // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Components;                          // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_D;                                           // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Equipped;                                    // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_H;                                           // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_H2;                                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ItemBG_Default;                              // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ItemBG_Hovered;                              // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ItemIcon;                                    // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_121;                                   // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_Progress;                              // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_CounterCraft;                              // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_NotEnoughResources;                        // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Count;                                        // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_ItemName;                                     // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ValueCounterCraft;                       // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CraftIngredient_C*                   W_CraftIngredient_Chemicals;                       // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CraftIngredient_C*                   W_CraftIngredient_Metal;                           // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CraftIngredient_C*                   W_CraftIngredient_Rag;                             // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_ItemsToCraft                        CraftItemData;                                     // 0x0370(0x0150)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	struct FFItemInfo                             ItemData;                                          // 0x04C0(0x0220)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         Counter;                                           // 0x06E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CraftItemName;                                     // 0x06E4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_6EC[0x4];                                      // 0x06EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      PlayerRef;                                         // 0x06F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnSelected;                                        // 0x06F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          CannotBeCrafted;                                   // 0x0708(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_709[0x7];                                      // 0x0709(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FContainerPickupsInfo                  Pickups_Info;                                      // 0x0710(0x0068)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CraftStarted;                                      // 0x0778(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CraftEnded;                                        // 0x0779(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CraftFinished;                                     // 0x077A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DismantlingStarted;                                // 0x077B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DismantlingEnded;                                  // 0x077C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DismantlingFinished;                               // 0x077D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_EntryMode                                   EntryMode;                                         // 0x077E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_77F[0x1];                                      // 0x077F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnCraftingFinished;                                // 0x0780(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnDismantlingFinished;                             // 0x0790(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnNotEnoughtResources;                             // 0x07A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnNotEnoughtInventorySpace;                        // 0x07B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         TempCounter;                                       // 0x07C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C4[0x4];                                      // 0x07C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Custom_Item_Name;                                  // 0x07C8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Custom_Item_Description;                           // 0x07E0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	FMulticastInlineDelegateProperty_             OnNeedUpdateModel;                                 // 0x07F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UWBP_CraftCategory_C*                   CraftCategoryRef;                                  // 0x0808(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UWBP_WorkbenchCraft_C*                  WorkBenchCraftRef;                                 // 0x0810(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          FirstAnim;                                         // 0x0818(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x0819(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81A[0x6];                                      // 0x081A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnCratingStarted;                                  // 0x0820(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnCraftingStopped;                                 // 0x0830(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FFMODEventInstance                     Craft_sound;                                       // 0x0840(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	TMap<class FString, class UW_CraftIngredient_C*> ComponentMap;                                      // 0x0848(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         ValueCounter;                                      // 0x0898(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89C[0x4];                                      // 0x089C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MaxValue;                                          // 0x08A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Default_Name;                                      // 0x08A8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          No_enough_resources;                               // 0x08C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_CraftItem_Button__Minus_K2Node_ComponentBoundEvent_17_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__WBP_CraftItem_Button_CraftItem_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__WBP_CraftItem_Button_CraftItem_K2Node_ComponentBoundEvent_3_OnButtonReleasedEvent__DelegateSignature();
	void BndEvt__WBP_CraftItem_Button_Plus_K2Node_ComponentBoundEvent_16_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__WBP_WorkbenchCraftItem_Button_CraftItem_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_WorkbenchCraftItem_Button_CraftItem_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void CanCraft(bool* Param_CanCraft, TArray<bool>* Resources);
	void CheckCanCraftOpacity();
	void Construct();
	void Craft(class FName ItemName);
	void CraftRingFilled();
	void Deselect();
	void ExecuteUbergraph_WBP_CraftItem(int32 EntryPoint);
	void FindData(bool* Result);
	void Finished_359EC0CB483061D72D3E39BE345CCC90();
	void GetContainerPickupsInfo(class FName ItemName, struct FContainerPickupsInfo* PickupsInfo);
	void GetItemsCount();
	void OnCraftingFinished__DelegateSignature(class UWBP_CraftItem_C* Item);
	void OnCraftingStopped__DelegateSignature();
	void OnCratingStarted__DelegateSignature();
	void OnDismantlingFinished__DelegateSignature(class UWBP_CraftItem_C* Item);
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnNeedUpdateModel__DelegateSignature(const struct FFItemInfo& Param_ItemData, bool bIsSketch);
	void OnNotEnoughtInventorySpace__DelegateSignature(class UWBP_CraftItem_C* Item);
	void OnNotEnoughtResources__DelegateSignature(class UWBP_CraftItem_C* Item);
	void OnSelected__DelegateSignature(class UWBP_CraftItem_C* Item);
	void ResetCraft();
	void ResetDismantling();
	void SelectCraftItem();
	void SetCustomDescription(const class FText& ItemDescription);
	void SetCustomItemName(const class FText& ItemName);
	void SetEquipped(bool Equipped);
	void StartCraftItem(class ABP_CraftStation_C* WorkbenchRef);
	void StartDismantleItem(class ABP_CraftStation_C* WorkbenchRef);
	void StopCraftItem(class ABP_CraftStation_C* WorkbenchRef);
	void StopDismantleItem(class ABP_CraftStation_C* WorkbenchRef);
	void UpdateComponents();
	void UpdateCount();
	void UpdateItemData(class FName ItemName);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CraftItem_C">();
	}
	static class UWBP_CraftItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CraftItem_C>();
	}
};
static_assert(alignof(UWBP_CraftItem_C) == 0x000010, "Wrong alignment on UWBP_CraftItem_C");
static_assert(sizeof(UWBP_CraftItem_C) == 0x0008D0, "Wrong size on UWBP_CraftItem_C");
static_assert(offsetof(UWBP_CraftItem_C, UberGraphFrame) == 0x000280, "Member 'UWBP_CraftItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, AcceptCraft) == 0x000288, "Member 'UWBP_CraftItem_C::AcceptCraft' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, ShowCount_Anim) == 0x000290, "Member 'UWBP_CraftItem_C::ShowCount_Anim' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, HideProgress_Anim) == 0x000298, "Member 'UWBP_CraftItem_C::HideProgress_Anim' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, Deselect_Anim) == 0x0002A0, "Member 'UWBP_CraftItem_C::Deselect_Anim' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, Select_Anim) == 0x0002A8, "Member 'UWBP_CraftItem_C::Select_Anim' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, Hover_Anim) == 0x0002B0, "Member 'UWBP_CraftItem_C::Hover_Anim' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, FillAnim) == 0x0002B8, "Member 'UWBP_CraftItem_C::FillAnim' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, Button__Minus) == 0x0002C0, "Member 'UWBP_CraftItem_C::Button__Minus' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, Button_CraftItem) == 0x0002C8, "Member 'UWBP_CraftItem_C::Button_CraftItem' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, Button_Plus) == 0x0002D0, "Member 'UWBP_CraftItem_C::Button_Plus' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, HorizontalBox_Components) == 0x0002D8, "Member 'UWBP_CraftItem_C::HorizontalBox_Components' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, Image_D) == 0x0002E0, "Member 'UWBP_CraftItem_C::Image_D' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, Image_Equipped) == 0x0002E8, "Member 'UWBP_CraftItem_C::Image_Equipped' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, Image_H) == 0x0002F0, "Member 'UWBP_CraftItem_C::Image_H' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, Image_H2) == 0x0002F8, "Member 'UWBP_CraftItem_C::Image_H2' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, Image_ItemBG_Default) == 0x000300, "Member 'UWBP_CraftItem_C::Image_ItemBG_Default' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, Image_ItemBG_Hovered) == 0x000308, "Member 'UWBP_CraftItem_C::Image_ItemBG_Hovered' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, Image_ItemIcon) == 0x000310, "Member 'UWBP_CraftItem_C::Image_ItemIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, ProgressBar_121) == 0x000318, "Member 'UWBP_CraftItem_C::ProgressBar_121' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, ProgressBar_Progress) == 0x000320, "Member 'UWBP_CraftItem_C::ProgressBar_Progress' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, SizeBox_CounterCraft) == 0x000328, "Member 'UWBP_CraftItem_C::SizeBox_CounterCraft' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, SizeBox_NotEnoughResources) == 0x000330, "Member 'UWBP_CraftItem_C::SizeBox_NotEnoughResources' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, Text_Count) == 0x000338, "Member 'UWBP_CraftItem_C::Text_Count' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, Text_ItemName) == 0x000340, "Member 'UWBP_CraftItem_C::Text_ItemName' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, TextBlock_ValueCounterCraft) == 0x000348, "Member 'UWBP_CraftItem_C::TextBlock_ValueCounterCraft' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, W_CraftIngredient_Chemicals) == 0x000350, "Member 'UWBP_CraftItem_C::W_CraftIngredient_Chemicals' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, W_CraftIngredient_Metal) == 0x000358, "Member 'UWBP_CraftItem_C::W_CraftIngredient_Metal' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, W_CraftIngredient_Rag) == 0x000360, "Member 'UWBP_CraftItem_C::W_CraftIngredient_Rag' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, CraftItemData) == 0x000370, "Member 'UWBP_CraftItem_C::CraftItemData' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, ItemData) == 0x0004C0, "Member 'UWBP_CraftItem_C::ItemData' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, Counter) == 0x0006E0, "Member 'UWBP_CraftItem_C::Counter' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, CraftItemName) == 0x0006E4, "Member 'UWBP_CraftItem_C::CraftItemName' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, PlayerRef) == 0x0006F0, "Member 'UWBP_CraftItem_C::PlayerRef' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, OnSelected) == 0x0006F8, "Member 'UWBP_CraftItem_C::OnSelected' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, CannotBeCrafted) == 0x000708, "Member 'UWBP_CraftItem_C::CannotBeCrafted' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, Pickups_Info) == 0x000710, "Member 'UWBP_CraftItem_C::Pickups_Info' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, CraftStarted) == 0x000778, "Member 'UWBP_CraftItem_C::CraftStarted' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, CraftEnded) == 0x000779, "Member 'UWBP_CraftItem_C::CraftEnded' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, CraftFinished) == 0x00077A, "Member 'UWBP_CraftItem_C::CraftFinished' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, DismantlingStarted) == 0x00077B, "Member 'UWBP_CraftItem_C::DismantlingStarted' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, DismantlingEnded) == 0x00077C, "Member 'UWBP_CraftItem_C::DismantlingEnded' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, DismantlingFinished) == 0x00077D, "Member 'UWBP_CraftItem_C::DismantlingFinished' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, EntryMode) == 0x00077E, "Member 'UWBP_CraftItem_C::EntryMode' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, OnCraftingFinished) == 0x000780, "Member 'UWBP_CraftItem_C::OnCraftingFinished' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, OnDismantlingFinished) == 0x000790, "Member 'UWBP_CraftItem_C::OnDismantlingFinished' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, OnNotEnoughtResources) == 0x0007A0, "Member 'UWBP_CraftItem_C::OnNotEnoughtResources' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, OnNotEnoughtInventorySpace) == 0x0007B0, "Member 'UWBP_CraftItem_C::OnNotEnoughtInventorySpace' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, TempCounter) == 0x0007C0, "Member 'UWBP_CraftItem_C::TempCounter' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, Custom_Item_Name) == 0x0007C8, "Member 'UWBP_CraftItem_C::Custom_Item_Name' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, Custom_Item_Description) == 0x0007E0, "Member 'UWBP_CraftItem_C::Custom_Item_Description' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, OnNeedUpdateModel) == 0x0007F8, "Member 'UWBP_CraftItem_C::OnNeedUpdateModel' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, CraftCategoryRef) == 0x000808, "Member 'UWBP_CraftItem_C::CraftCategoryRef' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, WorkBenchCraftRef) == 0x000810, "Member 'UWBP_CraftItem_C::WorkBenchCraftRef' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, FirstAnim) == 0x000818, "Member 'UWBP_CraftItem_C::FirstAnim' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, bIsSelected) == 0x000819, "Member 'UWBP_CraftItem_C::bIsSelected' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, OnCratingStarted) == 0x000820, "Member 'UWBP_CraftItem_C::OnCratingStarted' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, OnCraftingStopped) == 0x000830, "Member 'UWBP_CraftItem_C::OnCraftingStopped' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, Craft_sound) == 0x000840, "Member 'UWBP_CraftItem_C::Craft_sound' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, ComponentMap) == 0x000848, "Member 'UWBP_CraftItem_C::ComponentMap' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, ValueCounter) == 0x000898, "Member 'UWBP_CraftItem_C::ValueCounter' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, MaxValue) == 0x0008A0, "Member 'UWBP_CraftItem_C::MaxValue' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, Default_Name) == 0x0008A8, "Member 'UWBP_CraftItem_C::Default_Name' has a wrong offset!");
static_assert(offsetof(UWBP_CraftItem_C, No_enough_resources) == 0x0008C0, "Member 'UWBP_CraftItem_C::No_enough_resources' has a wrong offset!");

}

