#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_StatWithRedLine

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_StatWithRedLine.WBP_StatWithRedLine_C.Decrise
// 0x0008 (0x0008 - 0x0000)
struct WBP_StatWithRedLine_C_Decrise final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StatWithRedLine_C_Decrise) == 0x000008, "Wrong alignment on WBP_StatWithRedLine_C_Decrise");
static_assert(sizeof(WBP_StatWithRedLine_C_Decrise) == 0x000008, "Wrong size on WBP_StatWithRedLine_C_Decrise");
static_assert(offsetof(WBP_StatWithRedLine_C_Decrise, Value) == 0x000000, "Member 'WBP_StatWithRedLine_C_Decrise::Value' has a wrong offset!");

// Function WBP_StatWithRedLine.WBP_StatWithRedLine_C.ExecuteUbergraph_WBP_StatWithRedLine
// 0x01C0 (0x01C0 - 0x0000)
struct WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_CurrentValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            CallFunc_MakeBrushFromSprite_ReturnValue;          // 0x0010(0x00D0)()
	double                                        CallFunc_BreakVector2D_X;                          // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Value;                          // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBPC_PlayerStatsComponent_C*            K2Node_CustomEvent_NewParam;                       // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0130(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0140(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0150(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0158(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FCeil_ReturnValue;                        // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0170(0x0018)()
	float                                         CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast; // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast; // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast_1;      // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_OLDHP_ImplicitCast;             // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_B_ImplicitCast;         // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast_2;      // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1;  // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast_3;      // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine) == 0x000010, "Wrong alignment on WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine");
static_assert(sizeof(WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine) == 0x0001C0, "Wrong size on WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine");
static_assert(offsetof(WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine, EntryPoint) == 0x000000, "Member 'WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine, K2Node_CustomEvent_CurrentValue) == 0x000008, "Member 'WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine::K2Node_CustomEvent_CurrentValue' has a wrong offset!");
static_assert(offsetof(WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine, CallFunc_MakeBrushFromSprite_ReturnValue) == 0x000010, "Member 'WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine::CallFunc_MakeBrushFromSprite_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine, CallFunc_BreakVector2D_X) == 0x0000E0, "Member 'WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine, CallFunc_BreakVector2D_Y) == 0x0000E8, "Member 'WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine, K2Node_CustomEvent_Value) == 0x0000F0, "Member 'WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine::K2Node_CustomEvent_Value' has a wrong offset!");
static_assert(offsetof(WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0000F8, "Member 'WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine, K2Node_CustomEvent_NewParam) == 0x000100, "Member 'WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine::K2Node_CustomEvent_NewParam' has a wrong offset!");
static_assert(offsetof(WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000108, "Member 'WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000110, "Member 'WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000118, "Member 'WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000120, "Member 'WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000128, "Member 'WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine, K2Node_CreateDelegate_OutputDelegate) == 0x000130, "Member 'WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine, K2Node_CreateDelegate_OutputDelegate_1) == 0x000140, "Member 'WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000150, "Member 'WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000158, "Member 'WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000160, "Member 'WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine, CallFunc_FCeil_ReturnValue) == 0x000168, "Member 'WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine::CallFunc_FCeil_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine, CallFunc_Conv_IntToText_ReturnValue) == 0x000170, "Member 'WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine, CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast) == 0x000188, "Member 'WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine::CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine, CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast) == 0x00018C, "Member 'WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine::CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x000190, "Member 'WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine, CallFunc_SetPercent_InPercent_ImplicitCast_1) == 0x000194, "Member 'WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine::CallFunc_SetPercent_InPercent_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000198, "Member 'WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine, K2Node_VariableSet_OLDHP_ImplicitCast) == 0x0001A0, "Member 'WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine::K2Node_VariableSet_OLDHP_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine, CallFunc_Less_DoubleDouble_B_ImplicitCast) == 0x0001A8, "Member 'WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine::CallFunc_Less_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine, CallFunc_SetPercent_InPercent_ImplicitCast_2) == 0x0001B0, "Member 'WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine::CallFunc_SetPercent_InPercent_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x0001B4, "Member 'WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1) == 0x0001B8, "Member 'WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine, CallFunc_SetPercent_InPercent_ImplicitCast_3) == 0x0001BC, "Member 'WBP_StatWithRedLine_C_ExecuteUbergraph_WBP_StatWithRedLine::CallFunc_SetPercent_InPercent_ImplicitCast_3' has a wrong offset!");

// Function WBP_StatWithRedLine.WBP_StatWithRedLine_C.Init
// 0x0008 (0x0008 - 0x0000)
struct WBP_StatWithRedLine_C_Init final
{
public:
	class UBPC_PlayerStatsComponent_C*            NewParam;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StatWithRedLine_C_Init) == 0x000008, "Wrong alignment on WBP_StatWithRedLine_C_Init");
static_assert(sizeof(WBP_StatWithRedLine_C_Init) == 0x000008, "Wrong size on WBP_StatWithRedLine_C_Init");
static_assert(offsetof(WBP_StatWithRedLine_C_Init, NewParam) == 0x000000, "Member 'WBP_StatWithRedLine_C_Init::NewParam' has a wrong offset!");

// Function WBP_StatWithRedLine.WBP_StatWithRedLine_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_StatWithRedLine_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StatWithRedLine_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_StatWithRedLine_C_PreConstruct");
static_assert(sizeof(WBP_StatWithRedLine_C_PreConstruct) == 0x000001, "Wrong size on WBP_StatWithRedLine_C_PreConstruct");
static_assert(offsetof(WBP_StatWithRedLine_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_StatWithRedLine_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_StatWithRedLine.WBP_StatWithRedLine_C.SetIsCritical
// 0x0001 (0x0001 - 0x0000)
struct WBP_StatWithRedLine_C_SetIsCritical final
{
public:
	bool                                          IsCritical;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StatWithRedLine_C_SetIsCritical) == 0x000001, "Wrong alignment on WBP_StatWithRedLine_C_SetIsCritical");
static_assert(sizeof(WBP_StatWithRedLine_C_SetIsCritical) == 0x000001, "Wrong size on WBP_StatWithRedLine_C_SetIsCritical");
static_assert(offsetof(WBP_StatWithRedLine_C_SetIsCritical, IsCritical) == 0x000000, "Member 'WBP_StatWithRedLine_C_SetIsCritical::IsCritical' has a wrong offset!");

// Function WBP_StatWithRedLine.WBP_StatWithRedLine_C.SetProgressBarSize
// 0x0028 (0x0028 - 0x0000)
struct WBP_StatWithRedLine_C_SetProgressBarSize final
{
public:
	struct FVector2D                              Size;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StatWithRedLine_C_SetProgressBarSize) == 0x000008, "Wrong alignment on WBP_StatWithRedLine_C_SetProgressBarSize");
static_assert(sizeof(WBP_StatWithRedLine_C_SetProgressBarSize) == 0x000028, "Wrong size on WBP_StatWithRedLine_C_SetProgressBarSize");
static_assert(offsetof(WBP_StatWithRedLine_C_SetProgressBarSize, Size) == 0x000000, "Member 'WBP_StatWithRedLine_C_SetProgressBarSize::Size' has a wrong offset!");
static_assert(offsetof(WBP_StatWithRedLine_C_SetProgressBarSize, CallFunc_BreakVector2D_X) == 0x000010, "Member 'WBP_StatWithRedLine_C_SetProgressBarSize::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_StatWithRedLine_C_SetProgressBarSize, CallFunc_BreakVector2D_Y) == 0x000018, "Member 'WBP_StatWithRedLine_C_SetProgressBarSize::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_StatWithRedLine_C_SetProgressBarSize, CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast) == 0x000020, "Member 'WBP_StatWithRedLine_C_SetProgressBarSize::CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_StatWithRedLine_C_SetProgressBarSize, CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast) == 0x000024, "Member 'WBP_StatWithRedLine_C_SetProgressBarSize::CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast' has a wrong offset!");

// Function WBP_StatWithRedLine.WBP_StatWithRedLine_C.SetValue
// 0x0008 (0x0008 - 0x0000)
struct WBP_StatWithRedLine_C_SetValue final
{
public:
	double                                        Param_CurrentValue;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StatWithRedLine_C_SetValue) == 0x000008, "Wrong alignment on WBP_StatWithRedLine_C_SetValue");
static_assert(sizeof(WBP_StatWithRedLine_C_SetValue) == 0x000008, "Wrong size on WBP_StatWithRedLine_C_SetValue");
static_assert(offsetof(WBP_StatWithRedLine_C_SetValue, Param_CurrentValue) == 0x000000, "Member 'WBP_StatWithRedLine_C_SetValue::Param_CurrentValue' has a wrong offset!");

}

