#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MenuBarShopCategory

#include "Basic.hpp"

#include "E_MenuBarShopCategory_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MenuBarShopCategory.WBP_MenuBarShopCategory_C
// 0x0078 (0x02F8 - 0x0280)
class UWBP_MenuBarShopCategory_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_BG;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_Selected;                                   // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_CraftItem;                                  // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BG;                                          // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Hovered;                                     // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ItemIcon;                                    // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Selected;                                    // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_ItemName;                                     // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	E_MenuBarShopCategory                         Category;                                          // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPaperSprite*                           Image;                                             // 0x02D8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bIsButtonEnabled;                                  // 0x02E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2E2[0x6];                                      // 0x02E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnCategorySelected;                                // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_MenuBarShopCategory_Button_CraftItem_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__WBP_MenuBarShopCategory_Button_CraftItem_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_MenuBarShopCategory_Button_CraftItem_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void ButtonHover(bool bHovered, bool bWithAnim);
	void ExecuteUbergraph_WBP_MenuBarShopCategory(int32 EntryPoint);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnCategorySelected__DelegateSignature(const class FText& NewSelectedCategoryName, class UWBP_MenuBarShopCategory_C* MenuBarShopCategory);
	void PreConstruct(bool IsDesignTime);
	void SetButtonEnabled(bool IsEnabled);
	void SetButtonSelected(bool Param_bIsSelected);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MenuBarShopCategory_C">();
	}
	static class UWBP_MenuBarShopCategory_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MenuBarShopCategory_C>();
	}
};
static_assert(alignof(UWBP_MenuBarShopCategory_C) == 0x000008, "Wrong alignment on UWBP_MenuBarShopCategory_C");
static_assert(sizeof(UWBP_MenuBarShopCategory_C) == 0x0002F8, "Wrong size on UWBP_MenuBarShopCategory_C");
static_assert(offsetof(UWBP_MenuBarShopCategory_C, UberGraphFrame) == 0x000280, "Member 'UWBP_MenuBarShopCategory_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MenuBarShopCategory_C, Hover) == 0x000288, "Member 'UWBP_MenuBarShopCategory_C::Hover' has a wrong offset!");
static_assert(offsetof(UWBP_MenuBarShopCategory_C, Border_BG) == 0x000290, "Member 'UWBP_MenuBarShopCategory_C::Border_BG' has a wrong offset!");
static_assert(offsetof(UWBP_MenuBarShopCategory_C, Border_Selected) == 0x000298, "Member 'UWBP_MenuBarShopCategory_C::Border_Selected' has a wrong offset!");
static_assert(offsetof(UWBP_MenuBarShopCategory_C, Button_CraftItem) == 0x0002A0, "Member 'UWBP_MenuBarShopCategory_C::Button_CraftItem' has a wrong offset!");
static_assert(offsetof(UWBP_MenuBarShopCategory_C, Image_BG) == 0x0002A8, "Member 'UWBP_MenuBarShopCategory_C::Image_BG' has a wrong offset!");
static_assert(offsetof(UWBP_MenuBarShopCategory_C, Image_Hovered) == 0x0002B0, "Member 'UWBP_MenuBarShopCategory_C::Image_Hovered' has a wrong offset!");
static_assert(offsetof(UWBP_MenuBarShopCategory_C, Image_ItemIcon) == 0x0002B8, "Member 'UWBP_MenuBarShopCategory_C::Image_ItemIcon' has a wrong offset!");
static_assert(offsetof(UWBP_MenuBarShopCategory_C, Image_Selected) == 0x0002C0, "Member 'UWBP_MenuBarShopCategory_C::Image_Selected' has a wrong offset!");
static_assert(offsetof(UWBP_MenuBarShopCategory_C, Text_ItemName) == 0x0002C8, "Member 'UWBP_MenuBarShopCategory_C::Text_ItemName' has a wrong offset!");
static_assert(offsetof(UWBP_MenuBarShopCategory_C, Category) == 0x0002D0, "Member 'UWBP_MenuBarShopCategory_C::Category' has a wrong offset!");
static_assert(offsetof(UWBP_MenuBarShopCategory_C, Image) == 0x0002D8, "Member 'UWBP_MenuBarShopCategory_C::Image' has a wrong offset!");
static_assert(offsetof(UWBP_MenuBarShopCategory_C, bIsSelected) == 0x0002E0, "Member 'UWBP_MenuBarShopCategory_C::bIsSelected' has a wrong offset!");
static_assert(offsetof(UWBP_MenuBarShopCategory_C, bIsButtonEnabled) == 0x0002E1, "Member 'UWBP_MenuBarShopCategory_C::bIsButtonEnabled' has a wrong offset!");
static_assert(offsetof(UWBP_MenuBarShopCategory_C, OnCategorySelected) == 0x0002E8, "Member 'UWBP_MenuBarShopCategory_C::OnCategorySelected' has a wrong offset!");

}

