#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ShopModalWindow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DropItemAmountSelector_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ShopModalWindow.WBP_ShopModalWindow_C
// 0x0010 (0x0700 - 0x06F0)
class UWBP_ShopModalWindow_C final : public UDropItemAmountSelector_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_ShopModalWindow_C;              // 0x06F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          IsSell;                                            // 0x06F8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsBuyback;                                         // 0x06F9(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_ShopModalWindow(int32 EntryPoint);
	void GetMaxCount_0();
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ShopModalWindow_C">();
	}
	static class UWBP_ShopModalWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ShopModalWindow_C>();
	}
};
static_assert(alignof(UWBP_ShopModalWindow_C) == 0x000008, "Wrong alignment on UWBP_ShopModalWindow_C");
static_assert(sizeof(UWBP_ShopModalWindow_C) == 0x000700, "Wrong size on UWBP_ShopModalWindow_C");
static_assert(offsetof(UWBP_ShopModalWindow_C, UberGraphFrame_WBP_ShopModalWindow_C) == 0x0006F0, "Member 'UWBP_ShopModalWindow_C::UberGraphFrame_WBP_ShopModalWindow_C' has a wrong offset!");
static_assert(offsetof(UWBP_ShopModalWindow_C, IsSell) == 0x0006F8, "Member 'UWBP_ShopModalWindow_C::IsSell' has a wrong offset!");
static_assert(offsetof(UWBP_ShopModalWindow_C, IsBuyback) == 0x0006F9, "Member 'UWBP_ShopModalWindow_C::IsBuyback' has a wrong offset!");

}

