#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MainCategorySelectorEntryV2

#include "Basic.hpp"

#include "FMODStudio_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_MainCategorySelectorEntryV2.WBP_MainCategorySelectorEntryV2_C.ExecuteUbergraph_WBP_MainCategorySelectorEntryV2
// 0x0060 (0x0060 - 0x0000)
struct WBP_MainCategorySelectorEntryV2_C_ExecuteUbergraph_WBP_MainCategorySelectorEntryV2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_1;                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x003C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetOpacity_InOpacity_ImplicitCast;        // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainCategorySelectorEntryV2_C_ExecuteUbergraph_WBP_MainCategorySelectorEntryV2) == 0x000008, "Wrong alignment on WBP_MainCategorySelectorEntryV2_C_ExecuteUbergraph_WBP_MainCategorySelectorEntryV2");
static_assert(sizeof(WBP_MainCategorySelectorEntryV2_C_ExecuteUbergraph_WBP_MainCategorySelectorEntryV2) == 0x000060, "Wrong size on WBP_MainCategorySelectorEntryV2_C_ExecuteUbergraph_WBP_MainCategorySelectorEntryV2");
static_assert(offsetof(WBP_MainCategorySelectorEntryV2_C_ExecuteUbergraph_WBP_MainCategorySelectorEntryV2, EntryPoint) == 0x000000, "Member 'WBP_MainCategorySelectorEntryV2_C_ExecuteUbergraph_WBP_MainCategorySelectorEntryV2::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MainCategorySelectorEntryV2_C_ExecuteUbergraph_WBP_MainCategorySelectorEntryV2, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'WBP_MainCategorySelectorEntryV2_C_ExecuteUbergraph_WBP_MainCategorySelectorEntryV2::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainCategorySelectorEntryV2_C_ExecuteUbergraph_WBP_MainCategorySelectorEntryV2, CallFunc_Not_PreBool_ReturnValue_1) == 0x000005, "Member 'WBP_MainCategorySelectorEntryV2_C_ExecuteUbergraph_WBP_MainCategorySelectorEntryV2::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainCategorySelectorEntryV2_C_ExecuteUbergraph_WBP_MainCategorySelectorEntryV2, CallFunc_PlayEvent2D_ReturnValue) == 0x000008, "Member 'WBP_MainCategorySelectorEntryV2_C_ExecuteUbergraph_WBP_MainCategorySelectorEntryV2::CallFunc_PlayEvent2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainCategorySelectorEntryV2_C_ExecuteUbergraph_WBP_MainCategorySelectorEntryV2, CallFunc_BooleanAND_ReturnValue) == 0x000010, "Member 'WBP_MainCategorySelectorEntryV2_C_ExecuteUbergraph_WBP_MainCategorySelectorEntryV2::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainCategorySelectorEntryV2_C_ExecuteUbergraph_WBP_MainCategorySelectorEntryV2, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'WBP_MainCategorySelectorEntryV2_C_ExecuteUbergraph_WBP_MainCategorySelectorEntryV2::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainCategorySelectorEntryV2_C_ExecuteUbergraph_WBP_MainCategorySelectorEntryV2, CallFunc_Not_PreBool_ReturnValue_2) == 0x000020, "Member 'WBP_MainCategorySelectorEntryV2_C_ExecuteUbergraph_WBP_MainCategorySelectorEntryV2::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MainCategorySelectorEntryV2_C_ExecuteUbergraph_WBP_MainCategorySelectorEntryV2, K2Node_Event_IsDesignTime) == 0x000021, "Member 'WBP_MainCategorySelectorEntryV2_C_ExecuteUbergraph_WBP_MainCategorySelectorEntryV2::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_MainCategorySelectorEntryV2_C_ExecuteUbergraph_WBP_MainCategorySelectorEntryV2, CallFunc_Not_PreBool_ReturnValue_3) == 0x000022, "Member 'WBP_MainCategorySelectorEntryV2_C_ExecuteUbergraph_WBP_MainCategorySelectorEntryV2::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_MainCategorySelectorEntryV2_C_ExecuteUbergraph_WBP_MainCategorySelectorEntryV2, CallFunc_BooleanAND_ReturnValue_1) == 0x000023, "Member 'WBP_MainCategorySelectorEntryV2_C_ExecuteUbergraph_WBP_MainCategorySelectorEntryV2::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainCategorySelectorEntryV2_C_ExecuteUbergraph_WBP_MainCategorySelectorEntryV2, CallFunc_PlayAnimation_ReturnValue_1) == 0x000028, "Member 'WBP_MainCategorySelectorEntryV2_C_ExecuteUbergraph_WBP_MainCategorySelectorEntryV2::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainCategorySelectorEntryV2_C_ExecuteUbergraph_WBP_MainCategorySelectorEntryV2, CallFunc_PlayEvent2D_ReturnValue_1) == 0x000030, "Member 'WBP_MainCategorySelectorEntryV2_C_ExecuteUbergraph_WBP_MainCategorySelectorEntryV2::CallFunc_PlayEvent2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainCategorySelectorEntryV2_C_ExecuteUbergraph_WBP_MainCategorySelectorEntryV2, CallFunc_Not_PreBool_ReturnValue_4) == 0x000038, "Member 'WBP_MainCategorySelectorEntryV2_C_ExecuteUbergraph_WBP_MainCategorySelectorEntryV2::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_MainCategorySelectorEntryV2_C_ExecuteUbergraph_WBP_MainCategorySelectorEntryV2, CallFunc_SelectColor_ReturnValue) == 0x00003C, "Member 'WBP_MainCategorySelectorEntryV2_C_ExecuteUbergraph_WBP_MainCategorySelectorEntryV2::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainCategorySelectorEntryV2_C_ExecuteUbergraph_WBP_MainCategorySelectorEntryV2, CallFunc_SelectFloat_ReturnValue) == 0x000050, "Member 'WBP_MainCategorySelectorEntryV2_C_ExecuteUbergraph_WBP_MainCategorySelectorEntryV2::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainCategorySelectorEntryV2_C_ExecuteUbergraph_WBP_MainCategorySelectorEntryV2, CallFunc_SetOpacity_InOpacity_ImplicitCast) == 0x000058, "Member 'WBP_MainCategorySelectorEntryV2_C_ExecuteUbergraph_WBP_MainCategorySelectorEntryV2::CallFunc_SetOpacity_InOpacity_ImplicitCast' has a wrong offset!");

// Function WBP_MainCategorySelectorEntryV2.WBP_MainCategorySelectorEntryV2_C.GetText
// 0x0018 (0x0018 - 0x0000)
struct WBP_MainCategorySelectorEntryV2_C_GetText final
{
public:
	class FText                                   Param_Text;                                        // 0x0000(0x0018)(Parm, OutParm)
};
static_assert(alignof(WBP_MainCategorySelectorEntryV2_C_GetText) == 0x000008, "Wrong alignment on WBP_MainCategorySelectorEntryV2_C_GetText");
static_assert(sizeof(WBP_MainCategorySelectorEntryV2_C_GetText) == 0x000018, "Wrong size on WBP_MainCategorySelectorEntryV2_C_GetText");
static_assert(offsetof(WBP_MainCategorySelectorEntryV2_C_GetText, Param_Text) == 0x000000, "Member 'WBP_MainCategorySelectorEntryV2_C_GetText::Param_Text' has a wrong offset!");

// Function WBP_MainCategorySelectorEntryV2.WBP_MainCategorySelectorEntryV2_C.OnEntrySelected__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_MainCategorySelectorEntryV2_C_OnEntrySelected__DelegateSignature final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainCategorySelectorEntryV2_C_OnEntrySelected__DelegateSignature) == 0x000004, "Wrong alignment on WBP_MainCategorySelectorEntryV2_C_OnEntrySelected__DelegateSignature");
static_assert(sizeof(WBP_MainCategorySelectorEntryV2_C_OnEntrySelected__DelegateSignature) == 0x000004, "Wrong size on WBP_MainCategorySelectorEntryV2_C_OnEntrySelected__DelegateSignature");
static_assert(offsetof(WBP_MainCategorySelectorEntryV2_C_OnEntrySelected__DelegateSignature, Param_Index) == 0x000000, "Member 'WBP_MainCategorySelectorEntryV2_C_OnEntrySelected__DelegateSignature::Param_Index' has a wrong offset!");

// Function WBP_MainCategorySelectorEntryV2.WBP_MainCategorySelectorEntryV2_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_MainCategorySelectorEntryV2_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainCategorySelectorEntryV2_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_MainCategorySelectorEntryV2_C_PreConstruct");
static_assert(sizeof(WBP_MainCategorySelectorEntryV2_C_PreConstruct) == 0x000001, "Wrong size on WBP_MainCategorySelectorEntryV2_C_PreConstruct");
static_assert(offsetof(WBP_MainCategorySelectorEntryV2_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_MainCategorySelectorEntryV2_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_MainCategorySelectorEntryV2.WBP_MainCategorySelectorEntryV2_C.SelectEntry
// 0x0038 (0x0038 - 0x0000)
struct WBP_MainCategorySelectorEntryV2_C_SelectEntry final
{
public:
	bool                                          Param_Select;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default_1;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default_2;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainCategorySelectorEntryV2_C_SelectEntry) == 0x000008, "Wrong alignment on WBP_MainCategorySelectorEntryV2_C_SelectEntry");
static_assert(sizeof(WBP_MainCategorySelectorEntryV2_C_SelectEntry) == 0x000038, "Wrong size on WBP_MainCategorySelectorEntryV2_C_SelectEntry");
static_assert(offsetof(WBP_MainCategorySelectorEntryV2_C_SelectEntry, Param_Select) == 0x000000, "Member 'WBP_MainCategorySelectorEntryV2_C_SelectEntry::Param_Select' has a wrong offset!");
static_assert(offsetof(WBP_MainCategorySelectorEntryV2_C_SelectEntry, Temp_bool_Variable) == 0x000001, "Member 'WBP_MainCategorySelectorEntryV2_C_SelectEntry::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MainCategorySelectorEntryV2_C_SelectEntry, CallFunc_IsHovered_ReturnValue) == 0x000002, "Member 'WBP_MainCategorySelectorEntryV2_C_SelectEntry::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainCategorySelectorEntryV2_C_SelectEntry, Temp_bool_Variable_1) == 0x000003, "Member 'WBP_MainCategorySelectorEntryV2_C_SelectEntry::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MainCategorySelectorEntryV2_C_SelectEntry, K2Node_Select_Default) == 0x000008, "Member 'WBP_MainCategorySelectorEntryV2_C_SelectEntry::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_MainCategorySelectorEntryV2_C_SelectEntry, Temp_bool_Variable_2) == 0x000010, "Member 'WBP_MainCategorySelectorEntryV2_C_SelectEntry::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_MainCategorySelectorEntryV2_C_SelectEntry, K2Node_Select_Default_1) == 0x000018, "Member 'WBP_MainCategorySelectorEntryV2_C_SelectEntry::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_MainCategorySelectorEntryV2_C_SelectEntry, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000020, "Member 'WBP_MainCategorySelectorEntryV2_C_SelectEntry::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainCategorySelectorEntryV2_C_SelectEntry, K2Node_Select_Default_2) == 0x000028, "Member 'WBP_MainCategorySelectorEntryV2_C_SelectEntry::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_MainCategorySelectorEntryV2_C_SelectEntry, CallFunc_PlayAnimation_ReturnValue) == 0x000030, "Member 'WBP_MainCategorySelectorEntryV2_C_SelectEntry::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

