#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BinocularsHint

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_BinocularsHint.WBP_BinocularsHint_C.ExecuteUbergraph_WBP_BinocularsHint
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_BinocularsHint_C_ExecuteUbergraph_WBP_BinocularsHint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInputActionKeyMapping>         CallFunc_GetActionMappingByName_OutMappings;       // 0x0058(0x0010)(ReferenceParm)
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC;                  // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      CallFunc_GetPlayerRef_SurvivalPlayer;              // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0098(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BinocularsHint_C_ExecuteUbergraph_WBP_BinocularsHint) == 0x000008, "Wrong alignment on WBP_BinocularsHint_C_ExecuteUbergraph_WBP_BinocularsHint");
static_assert(sizeof(WBP_BinocularsHint_C_ExecuteUbergraph_WBP_BinocularsHint) == 0x0000B0, "Wrong size on WBP_BinocularsHint_C_ExecuteUbergraph_WBP_BinocularsHint");
static_assert(offsetof(WBP_BinocularsHint_C_ExecuteUbergraph_WBP_BinocularsHint, EntryPoint) == 0x000000, "Member 'WBP_BinocularsHint_C_ExecuteUbergraph_WBP_BinocularsHint::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_BinocularsHint_C_ExecuteUbergraph_WBP_BinocularsHint, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_BinocularsHint_C_ExecuteUbergraph_WBP_BinocularsHint::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_BinocularsHint_C_ExecuteUbergraph_WBP_BinocularsHint, K2Node_Event_IsDesignTime) == 0x000014, "Member 'WBP_BinocularsHint_C_ExecuteUbergraph_WBP_BinocularsHint::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_BinocularsHint_C_ExecuteUbergraph_WBP_BinocularsHint, CallFunc_GetInputSettings_ReturnValue) == 0x000018, "Member 'WBP_BinocularsHint_C_ExecuteUbergraph_WBP_BinocularsHint::CallFunc_GetInputSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BinocularsHint_C_ExecuteUbergraph_WBP_BinocularsHint, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'WBP_BinocularsHint_C_ExecuteUbergraph_WBP_BinocularsHint::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_BinocularsHint_C_ExecuteUbergraph_WBP_BinocularsHint, K2Node_CreateDelegate_OutputDelegate_2) == 0x000030, "Member 'WBP_BinocularsHint_C_ExecuteUbergraph_WBP_BinocularsHint::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_BinocularsHint_C_ExecuteUbergraph_WBP_BinocularsHint, K2Node_CreateDelegate_OutputDelegate_3) == 0x000040, "Member 'WBP_BinocularsHint_C_ExecuteUbergraph_WBP_BinocularsHint::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_BinocularsHint_C_ExecuteUbergraph_WBP_BinocularsHint, CallFunc_GetPlayerController_ReturnValue) == 0x000050, "Member 'WBP_BinocularsHint_C_ExecuteUbergraph_WBP_BinocularsHint::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BinocularsHint_C_ExecuteUbergraph_WBP_BinocularsHint, CallFunc_GetActionMappingByName_OutMappings) == 0x000058, "Member 'WBP_BinocularsHint_C_ExecuteUbergraph_WBP_BinocularsHint::CallFunc_GetActionMappingByName_OutMappings' has a wrong offset!");
static_assert(offsetof(WBP_BinocularsHint_C_ExecuteUbergraph_WBP_BinocularsHint, K2Node_DynamicCast_AsBPI_Surv_PC) == 0x000068, "Member 'WBP_BinocularsHint_C_ExecuteUbergraph_WBP_BinocularsHint::K2Node_DynamicCast_AsBPI_Surv_PC' has a wrong offset!");
static_assert(offsetof(WBP_BinocularsHint_C_ExecuteUbergraph_WBP_BinocularsHint, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'WBP_BinocularsHint_C_ExecuteUbergraph_WBP_BinocularsHint::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_BinocularsHint_C_ExecuteUbergraph_WBP_BinocularsHint, CallFunc_GetPlayerRef_SurvivalPlayer) == 0x000080, "Member 'WBP_BinocularsHint_C_ExecuteUbergraph_WBP_BinocularsHint::CallFunc_GetPlayerRef_SurvivalPlayer' has a wrong offset!");
static_assert(offsetof(WBP_BinocularsHint_C_ExecuteUbergraph_WBP_BinocularsHint, K2Node_CreateDelegate_OutputDelegate_4) == 0x000088, "Member 'WBP_BinocularsHint_C_ExecuteUbergraph_WBP_BinocularsHint::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_BinocularsHint_C_ExecuteUbergraph_WBP_BinocularsHint, K2Node_CreateDelegate_OutputDelegate_5) == 0x000098, "Member 'WBP_BinocularsHint_C_ExecuteUbergraph_WBP_BinocularsHint::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_BinocularsHint_C_ExecuteUbergraph_WBP_BinocularsHint, CallFunc_IsValid_ReturnValue) == 0x0000A8, "Member 'WBP_BinocularsHint_C_ExecuteUbergraph_WBP_BinocularsHint::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BinocularsHint_C_ExecuteUbergraph_WBP_BinocularsHint, CallFunc_IsValid_ReturnValue_1) == 0x0000A9, "Member 'WBP_BinocularsHint_C_ExecuteUbergraph_WBP_BinocularsHint::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BinocularsHint_C_ExecuteUbergraph_WBP_BinocularsHint, CallFunc_IsValid_ReturnValue_2) == 0x0000AA, "Member 'WBP_BinocularsHint_C_ExecuteUbergraph_WBP_BinocularsHint::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function WBP_BinocularsHint.WBP_BinocularsHint_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_BinocularsHint_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BinocularsHint_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_BinocularsHint_C_PreConstruct");
static_assert(sizeof(WBP_BinocularsHint_C_PreConstruct) == 0x000001, "Wrong size on WBP_BinocularsHint_C_PreConstruct");
static_assert(offsetof(WBP_BinocularsHint_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_BinocularsHint_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_BinocularsHint.WBP_BinocularsHint_C.Show
// 0x0018 (0x0018 - 0x0000)
struct WBP_BinocularsHint_C_Show final
{
public:
	bool                                          Param_Show;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BinocularsHint_C_Show) == 0x000008, "Wrong alignment on WBP_BinocularsHint_C_Show");
static_assert(sizeof(WBP_BinocularsHint_C_Show) == 0x000018, "Wrong size on WBP_BinocularsHint_C_Show");
static_assert(offsetof(WBP_BinocularsHint_C_Show, Param_Show) == 0x000000, "Member 'WBP_BinocularsHint_C_Show::Param_Show' has a wrong offset!");
static_assert(offsetof(WBP_BinocularsHint_C_Show, Temp_bool_Variable) == 0x000001, "Member 'WBP_BinocularsHint_C_Show::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BinocularsHint_C_Show, Temp_byte_Variable) == 0x000002, "Member 'WBP_BinocularsHint_C_Show::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BinocularsHint_C_Show, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_BinocularsHint_C_Show::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_BinocularsHint_C_Show, K2Node_Select_Default) == 0x000004, "Member 'WBP_BinocularsHint_C_Show::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_BinocularsHint_C_Show, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_BinocularsHint_C_Show::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BinocularsHint_C_Show, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000010, "Member 'WBP_BinocularsHint_C_Show::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

}

