#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MainCategorySelector

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "DayCycleState_structs.hpp"
#include "SlateCore_structs.hpp"
#include "StatType_structs.hpp"
#include "E_TrainStatType_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MainCategorySelector.WBP_MainCategorySelector_C
// 0x0280 (0x0500 - 0x0280)
class UWBP_MainCategorySelector_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoverE;                                            // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoverQ;                                            // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NewSwitch;                                         // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Close;                                             // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hide;                                              // 0x02A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FirstShow;                                         // 0x02B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_SwitchLeft;                                 // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_SwitchRight;                                // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_ButtonsCategories;                   // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Info;                                // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_RP;                                  // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Stats;                               // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Weight;                                       // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Down;                                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Up;                                          // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_VectorL;                                     // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_VectorR;                                     // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_WeightSeparator;                             // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Entries;                                   // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Day;                                          // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Time;                                         // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_WCoin;                                        // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_WCoin_1;                                      // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_WCoinRate;                                    // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_MaxWeight;                               // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_RP;                                      // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Weight;                                  // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_WeightSlots_C*                     WBP_SlotsCapacity;                                 // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_WeightSlots_C*                     WBP_SlotsWeight;                                   // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Day;                                // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_IndexIcon;                          // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class FText>                           EntriesList;                                       // 0x03A0(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	TSet<int32>                                   DisabledEntries;                                   // 0x03B0(0x0050)(Edit, BlueprintVisible, ExposeOnSpawn)
	TSet<int32>                                   ValidEntries;                                      // 0x0400(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         ActiveEntryIndex;                                  // 0x0450(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                EntriesPadding;                                    // 0x0454(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_464[0x4];                                      // 0x0464(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, class UWBP_MainCategorySelectorEntryV2_C*> EntriesMap;                                        // 0x0468(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class ASurvivalPlayer_C*                      PlayerCharacterRef;                                // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnCategoryChanged;                                 // 0x04C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   NewCategoryText;                                   // 0x04D0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bShowStats;                                        // 0x04E8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bPageSwapLocked;                                   // 0x04E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EA[0x6];                                      // 0x04EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJSIContainer_C*                        PocketContainer;                                   // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowArrowButtons;                                 // 0x04F8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	EDayCycleState                                New_Day_State;                                     // 0x04F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InfoVisiblity_;                                    // 0x04FA(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__WBP_MainCategorySelector_Button_1019_K2Node_ComponentBoundEvent_6_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__WBP_MainCategorySelector_Button_487_K2Node_ComponentBoundEvent_7_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__WBP_MainCategorySelector_Button_SwitchLeft_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_MainCategorySelector_Button_SwitchLeft_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_MainCategorySelector_Button_SwitchRight_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_MainCategorySelector_Button_SwitchRight_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
	void ChangeEntriesList(TArray<class FText>& Param_EntriesList);
	void CheckWeightStatUpdate(EStatType StatKey);
	void ClearEntries();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_MainCategorySelector(int32 EntryPoint);
	void GetActiveCategoryIndex(int32* Param_ActiveEntryIndex);
	void GetNextAvailableEntry(int32* Param_Index);
	void GetPrevAvailableEntry(int32* Param_Index);
	void Init();
	void LockPageSwap(bool Lock);
	void NumbersPercentDiffer(double GreaterNumber, double LesserNumber, double* Percent);
	void OnBackpackChanged_Event(class UJSIContainer_C* Backpack);
	void OnCategoryChanged__DelegateSignature(int32 Param_Index);
	void OnDayStateChanged(EDayCycleState NewDayState);
	void OnPocketChanged_Event(class UJSIContainer_C* Pocket);
	void OnPossessedPawnChanged_Event(class APawn* OldPawn, class APawn* NewPawn);
	void PreConstruct(bool IsDesignTime);
	void SelectNextCategory();
	void SelectPrevCategory();
	void SetActiveCategory(int32 Param_Index);
	void SetArrowButtonsVisibility();
	void SetDisabledEntries(const TSet<int32>& Entries);
	void SetNewText();
	void TextBlock_CategoryName_SetNewText();
	void Unbind();
	void UpdateMoney(int32* AmountOfMoney);
	void UpdateRP(int32 RPPoints);
	void UpdateStats();
	void UpdateTime();
	void UpdateWeight();
	void WCoinTrading();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MainCategorySelector_C">();
	}
	static class UWBP_MainCategorySelector_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MainCategorySelector_C>();
	}
};
static_assert(alignof(UWBP_MainCategorySelector_C) == 0x000008, "Wrong alignment on UWBP_MainCategorySelector_C");
static_assert(sizeof(UWBP_MainCategorySelector_C) == 0x000500, "Wrong size on UWBP_MainCategorySelector_C");
static_assert(offsetof(UWBP_MainCategorySelector_C, UberGraphFrame) == 0x000280, "Member 'UWBP_MainCategorySelector_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelector_C, HoverE) == 0x000288, "Member 'UWBP_MainCategorySelector_C::HoverE' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelector_C, HoverQ) == 0x000290, "Member 'UWBP_MainCategorySelector_C::HoverQ' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelector_C, NewSwitch) == 0x000298, "Member 'UWBP_MainCategorySelector_C::NewSwitch' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelector_C, Close) == 0x0002A0, "Member 'UWBP_MainCategorySelector_C::Close' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelector_C, Hide) == 0x0002A8, "Member 'UWBP_MainCategorySelector_C::Hide' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelector_C, FirstShow) == 0x0002B0, "Member 'UWBP_MainCategorySelector_C::FirstShow' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelector_C, Button_SwitchLeft) == 0x0002B8, "Member 'UWBP_MainCategorySelector_C::Button_SwitchLeft' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelector_C, Button_SwitchRight) == 0x0002C0, "Member 'UWBP_MainCategorySelector_C::Button_SwitchRight' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelector_C, HorizontalBox_ButtonsCategories) == 0x0002C8, "Member 'UWBP_MainCategorySelector_C::HorizontalBox_ButtonsCategories' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelector_C, HorizontalBox_Info) == 0x0002D0, "Member 'UWBP_MainCategorySelector_C::HorizontalBox_Info' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelector_C, HorizontalBox_RP) == 0x0002D8, "Member 'UWBP_MainCategorySelector_C::HorizontalBox_RP' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelector_C, HorizontalBox_Stats) == 0x0002E0, "Member 'UWBP_MainCategorySelector_C::HorizontalBox_Stats' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelector_C, Icon_Weight) == 0x0002E8, "Member 'UWBP_MainCategorySelector_C::Icon_Weight' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelector_C, Image_0) == 0x0002F0, "Member 'UWBP_MainCategorySelector_C::Image_0' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelector_C, Image_1) == 0x0002F8, "Member 'UWBP_MainCategorySelector_C::Image_1' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelector_C, Image_2) == 0x000300, "Member 'UWBP_MainCategorySelector_C::Image_2' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelector_C, Image_3) == 0x000308, "Member 'UWBP_MainCategorySelector_C::Image_3' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelector_C, Image_Down) == 0x000310, "Member 'UWBP_MainCategorySelector_C::Image_Down' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelector_C, Image_Up) == 0x000318, "Member 'UWBP_MainCategorySelector_C::Image_Up' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelector_C, Image_VectorL) == 0x000320, "Member 'UWBP_MainCategorySelector_C::Image_VectorL' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelector_C, Image_VectorR) == 0x000328, "Member 'UWBP_MainCategorySelector_C::Image_VectorR' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelector_C, Image_WeightSeparator) == 0x000330, "Member 'UWBP_MainCategorySelector_C::Image_WeightSeparator' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelector_C, SizeBox_Entries) == 0x000338, "Member 'UWBP_MainCategorySelector_C::SizeBox_Entries' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelector_C, Text_Day) == 0x000340, "Member 'UWBP_MainCategorySelector_C::Text_Day' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelector_C, Text_Time) == 0x000348, "Member 'UWBP_MainCategorySelector_C::Text_Time' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelector_C, Text_WCoin) == 0x000350, "Member 'UWBP_MainCategorySelector_C::Text_WCoin' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelector_C, Text_WCoin_1) == 0x000358, "Member 'UWBP_MainCategorySelector_C::Text_WCoin_1' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelector_C, Text_WCoinRate) == 0x000360, "Member 'UWBP_MainCategorySelector_C::Text_WCoinRate' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelector_C, TextBlock_MaxWeight) == 0x000368, "Member 'UWBP_MainCategorySelector_C::TextBlock_MaxWeight' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelector_C, TextBlock_RP) == 0x000370, "Member 'UWBP_MainCategorySelector_C::TextBlock_RP' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelector_C, TextBlock_Weight) == 0x000378, "Member 'UWBP_MainCategorySelector_C::TextBlock_Weight' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelector_C, WBP_SlotsCapacity) == 0x000380, "Member 'UWBP_MainCategorySelector_C::WBP_SlotsCapacity' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelector_C, WBP_SlotsWeight) == 0x000388, "Member 'UWBP_MainCategorySelector_C::WBP_SlotsWeight' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelector_C, WidgetSwitcher_Day) == 0x000390, "Member 'UWBP_MainCategorySelector_C::WidgetSwitcher_Day' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelector_C, WidgetSwitcher_IndexIcon) == 0x000398, "Member 'UWBP_MainCategorySelector_C::WidgetSwitcher_IndexIcon' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelector_C, EntriesList) == 0x0003A0, "Member 'UWBP_MainCategorySelector_C::EntriesList' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelector_C, DisabledEntries) == 0x0003B0, "Member 'UWBP_MainCategorySelector_C::DisabledEntries' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelector_C, ValidEntries) == 0x000400, "Member 'UWBP_MainCategorySelector_C::ValidEntries' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelector_C, ActiveEntryIndex) == 0x000450, "Member 'UWBP_MainCategorySelector_C::ActiveEntryIndex' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelector_C, EntriesPadding) == 0x000454, "Member 'UWBP_MainCategorySelector_C::EntriesPadding' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelector_C, EntriesMap) == 0x000468, "Member 'UWBP_MainCategorySelector_C::EntriesMap' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelector_C, PlayerCharacterRef) == 0x0004B8, "Member 'UWBP_MainCategorySelector_C::PlayerCharacterRef' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelector_C, OnCategoryChanged) == 0x0004C0, "Member 'UWBP_MainCategorySelector_C::OnCategoryChanged' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelector_C, NewCategoryText) == 0x0004D0, "Member 'UWBP_MainCategorySelector_C::NewCategoryText' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelector_C, bShowStats) == 0x0004E8, "Member 'UWBP_MainCategorySelector_C::bShowStats' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelector_C, bPageSwapLocked) == 0x0004E9, "Member 'UWBP_MainCategorySelector_C::bPageSwapLocked' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelector_C, PocketContainer) == 0x0004F0, "Member 'UWBP_MainCategorySelector_C::PocketContainer' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelector_C, bShowArrowButtons) == 0x0004F8, "Member 'UWBP_MainCategorySelector_C::bShowArrowButtons' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelector_C, New_Day_State) == 0x0004F9, "Member 'UWBP_MainCategorySelector_C::New_Day_State' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelector_C, InfoVisiblity_) == 0x0004FA, "Member 'UWBP_MainCategorySelector_C::InfoVisiblity_' has a wrong offset!");

}

