#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Aliases

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FMODStudio_structs.hpp"


namespace SDK::Params
{

// Function WBP_Aliases.WBP_Aliases_C.ExecuteUbergraph_WBP_Aliases
// 0x0020 (0x0020 - 0x0000)
struct WBP_Aliases_C_ExecuteUbergraph_WBP_Aliases final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_1;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Aliases_C_ExecuteUbergraph_WBP_Aliases) == 0x000008, "Wrong alignment on WBP_Aliases_C_ExecuteUbergraph_WBP_Aliases");
static_assert(sizeof(WBP_Aliases_C_ExecuteUbergraph_WBP_Aliases) == 0x000020, "Wrong size on WBP_Aliases_C_ExecuteUbergraph_WBP_Aliases");
static_assert(offsetof(WBP_Aliases_C_ExecuteUbergraph_WBP_Aliases, EntryPoint) == 0x000000, "Member 'WBP_Aliases_C_ExecuteUbergraph_WBP_Aliases::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Aliases_C_ExecuteUbergraph_WBP_Aliases, CallFunc_PlayEvent2D_ReturnValue) == 0x000008, "Member 'WBP_Aliases_C_ExecuteUbergraph_WBP_Aliases::CallFunc_PlayEvent2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Aliases_C_ExecuteUbergraph_WBP_Aliases, K2Node_Event_IsDesignTime) == 0x000010, "Member 'WBP_Aliases_C_ExecuteUbergraph_WBP_Aliases::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Aliases_C_ExecuteUbergraph_WBP_Aliases, CallFunc_PlayEvent2D_ReturnValue_1) == 0x000018, "Member 'WBP_Aliases_C_ExecuteUbergraph_WBP_Aliases::CallFunc_PlayEvent2D_ReturnValue_1' has a wrong offset!");

// Function WBP_Aliases.WBP_Aliases_C.GetName
// 0x0018 (0x0018 - 0x0000)
struct WBP_Aliases_C_GetName final
{
public:
	class FText                                   Param_Name;                                        // 0x0000(0x0018)(Parm, OutParm)
};
static_assert(alignof(WBP_Aliases_C_GetName) == 0x000008, "Wrong alignment on WBP_Aliases_C_GetName");
static_assert(sizeof(WBP_Aliases_C_GetName) == 0x000018, "Wrong size on WBP_Aliases_C_GetName");
static_assert(offsetof(WBP_Aliases_C_GetName, Param_Name) == 0x000000, "Member 'WBP_Aliases_C_GetName::Param_Name' has a wrong offset!");

// Function WBP_Aliases.WBP_Aliases_C.Init
// 0x0020 (0x0020 - 0x0000)
struct WBP_Aliases_C_Init final
{
public:
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
};
static_assert(alignof(WBP_Aliases_C_Init) == 0x000008, "Wrong alignment on WBP_Aliases_C_Init");
static_assert(sizeof(WBP_Aliases_C_Init) == 0x000020, "Wrong size on WBP_Aliases_C_Init");
static_assert(offsetof(WBP_Aliases_C_Init, CallFunc_Round_ReturnValue) == 0x000000, "Member 'WBP_Aliases_C_Init::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Aliases_C_Init, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'WBP_Aliases_C_Init::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function WBP_Aliases.WBP_Aliases_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Aliases_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Aliases_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Aliases_C_PreConstruct");
static_assert(sizeof(WBP_Aliases_C_PreConstruct) == 0x000001, "Wrong size on WBP_Aliases_C_PreConstruct");
static_assert(offsetof(WBP_Aliases_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Aliases_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Aliases.WBP_Aliases_C.Selected_Aliases__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Aliases_C_Selected_Aliases__DelegateSignature final
{
public:
	class UWBP_Aliases_C*                         Ref;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Aliases_C_Selected_Aliases__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Aliases_C_Selected_Aliases__DelegateSignature");
static_assert(sizeof(WBP_Aliases_C_Selected_Aliases__DelegateSignature) == 0x000008, "Wrong size on WBP_Aliases_C_Selected_Aliases__DelegateSignature");
static_assert(offsetof(WBP_Aliases_C_Selected_Aliases__DelegateSignature, Ref) == 0x000000, "Member 'WBP_Aliases_C_Selected_Aliases__DelegateSignature::Ref' has a wrong offset!");

// Function WBP_Aliases.WBP_Aliases_C.SetHovered
// 0x0028 (0x0028 - 0x0000)
struct WBP_Aliases_C_SetHovered final
{
public:
	bool                                          Param_Hovered;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WithAnim;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0014)()
	EUMGSequencePlayMode                          K2Node_Select_Default;                             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Aliases_C_SetHovered) == 0x000008, "Wrong alignment on WBP_Aliases_C_SetHovered");
static_assert(sizeof(WBP_Aliases_C_SetHovered) == 0x000028, "Wrong size on WBP_Aliases_C_SetHovered");
static_assert(offsetof(WBP_Aliases_C_SetHovered, Param_Hovered) == 0x000000, "Member 'WBP_Aliases_C_SetHovered::Param_Hovered' has a wrong offset!");
static_assert(offsetof(WBP_Aliases_C_SetHovered, WithAnim) == 0x000001, "Member 'WBP_Aliases_C_SetHovered::WithAnim' has a wrong offset!");
static_assert(offsetof(WBP_Aliases_C_SetHovered, Temp_bool_Variable) == 0x000002, "Member 'WBP_Aliases_C_SetHovered::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Aliases_C_SetHovered, Temp_byte_Variable) == 0x000003, "Member 'WBP_Aliases_C_SetHovered::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Aliases_C_SetHovered, Temp_byte_Variable_1) == 0x000004, "Member 'WBP_Aliases_C_SetHovered::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Aliases_C_SetHovered, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'WBP_Aliases_C_SetHovered::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_Aliases_C_SetHovered, K2Node_Select_Default) == 0x00001C, "Member 'WBP_Aliases_C_SetHovered::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Aliases_C_SetHovered, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'WBP_Aliases_C_SetHovered::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_Aliases.WBP_Aliases_C.SetSelected
// 0x0048 (0x0048 - 0x0000)
struct WBP_Aliases_C_SetSelected final
{
public:
	bool                                          Param_Selected;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_1;                // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0024(0x0014)()
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default;                             // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Aliases_C_SetSelected) == 0x000008, "Wrong alignment on WBP_Aliases_C_SetSelected");
static_assert(sizeof(WBP_Aliases_C_SetSelected) == 0x000048, "Wrong size on WBP_Aliases_C_SetSelected");
static_assert(offsetof(WBP_Aliases_C_SetSelected, Param_Selected) == 0x000000, "Member 'WBP_Aliases_C_SetSelected::Param_Selected' has a wrong offset!");
static_assert(offsetof(WBP_Aliases_C_SetSelected, Temp_bool_Variable) == 0x000001, "Member 'WBP_Aliases_C_SetSelected::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Aliases_C_SetSelected, Temp_byte_Variable) == 0x000002, "Member 'WBP_Aliases_C_SetSelected::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Aliases_C_SetSelected, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_Aliases_C_SetSelected::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Aliases_C_SetSelected, CallFunc_SelectColor_ReturnValue) == 0x000004, "Member 'WBP_Aliases_C_SetSelected::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Aliases_C_SetSelected, CallFunc_SelectColor_ReturnValue_1) == 0x000014, "Member 'WBP_Aliases_C_SetSelected::CallFunc_SelectColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Aliases_C_SetSelected, K2Node_MakeStruct_SlateColor) == 0x000024, "Member 'WBP_Aliases_C_SetSelected::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_Aliases_C_SetSelected, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000038, "Member 'WBP_Aliases_C_SetSelected::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Aliases_C_SetSelected, K2Node_Select_Default) == 0x000039, "Member 'WBP_Aliases_C_SetSelected::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Aliases_C_SetSelected, CallFunc_PlayAnimation_ReturnValue) == 0x000040, "Member 'WBP_Aliases_C_SetSelected::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_Aliases.WBP_Aliases_C.SetStatus
// 0x0018 (0x0018 - 0x0000)
struct WBP_Aliases_C_SetStatus final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetOpacity_InOpacity_ImplicitCast;        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Aliases_C_SetStatus) == 0x000008, "Wrong alignment on WBP_Aliases_C_SetStatus");
static_assert(sizeof(WBP_Aliases_C_SetStatus) == 0x000018, "Wrong size on WBP_Aliases_C_SetStatus");
static_assert(offsetof(WBP_Aliases_C_SetStatus, Param_Index) == 0x000000, "Member 'WBP_Aliases_C_SetStatus::Param_Index' has a wrong offset!");
static_assert(offsetof(WBP_Aliases_C_SetStatus, CallFunc_SelectFloat_ReturnValue) == 0x000008, "Member 'WBP_Aliases_C_SetStatus::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Aliases_C_SetStatus, CallFunc_SetOpacity_InOpacity_ImplicitCast) == 0x000010, "Member 'WBP_Aliases_C_SetStatus::CallFunc_SetOpacity_InOpacity_ImplicitCast' has a wrong offset!");

}

