#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PistolCrosshair

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PistolCrosshair.WBP_PistolCrosshair_C
// 0x0018 (0x0298 - 0x0280)
class UWBP_PistolCrosshair_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ready_Anim;                                        // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Crosshair;                                   // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Aim(bool Param_Aim);
	void ExecuteUbergraph_WBP_PistolCrosshair(int32 EntryPoint);
	void Hit();
	void Kill();
	void Shoot(bool Shooting, bool* Result);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PistolCrosshair_C">();
	}
	static class UWBP_PistolCrosshair_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PistolCrosshair_C>();
	}
};
static_assert(alignof(UWBP_PistolCrosshair_C) == 0x000008, "Wrong alignment on UWBP_PistolCrosshair_C");
static_assert(sizeof(UWBP_PistolCrosshair_C) == 0x000298, "Wrong size on UWBP_PistolCrosshair_C");
static_assert(offsetof(UWBP_PistolCrosshair_C, UberGraphFrame) == 0x000280, "Member 'UWBP_PistolCrosshair_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PistolCrosshair_C, Ready_Anim) == 0x000288, "Member 'UWBP_PistolCrosshair_C::Ready_Anim' has a wrong offset!");
static_assert(offsetof(UWBP_PistolCrosshair_C, Image_Crosshair) == 0x000290, "Member 'UWBP_PistolCrosshair_C::Image_Crosshair' has a wrong offset!");

}

