#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Workbench_Tutorial

#include "Basic.hpp"

#include "E_TypesOfModes_structs.hpp"
#include "Engine_structs.hpp"
#include "WBP_Workbench_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Workbench_Tutorial.WBP_Workbench_Tutorial_C
// 0x0140 (0x0708 - 0x05C8)
class UWBP_Workbench_Tutorial_C final : public UWBP_Workbench_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_Workbench_Tutorial_C;           // 0x05C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABP_GameHUD_C*                          As_BP_Game_HUD;                                    // 0x05D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         WeaponIDToModify;                                  // 0x05D8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DC[0x4];                                      // 0x05DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<E_TypesOfModes, class UWBP_ModeCategoryTag_C*> ModificationTagsOrder;                             // 0x05E0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         DesiredCategoryIndex;                              // 0x0630(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_634[0x4];                                      // 0x0634(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<E_TypesOfModes>                          ModifiedTags;                                      // 0x0638(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSet<int32>                                   PointerAttachmentsIDs;                             // 0x0688(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	bool                                          bModificationTutorialFinished;                     // 0x06D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D9[0x7];                                      // 0x06D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvPC_C*                              As_Surv_PC;                                        // 0x06E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bCraftTutorialFinished;                            // 0x06E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E9[0x7];                                      // 0x06E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ItemInteractionContainerEntry_C*   EntryToCraft;                                      // 0x06F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CraftedItemName;                                   // 0x06F8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_ModeCategoryTag_C*                 RequiredAttachmentTag;                             // 0x0700(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void BindItemCraft(bool bBind);
	void CompleteCraftAmmoStage(const class FString& StageName);
	void CompleteModificationStage(const class FString& StageName);
	void CraftFinished(const struct FFItemInfo& ItemInfo);
	void ExecuteUbergraph_WBP_Workbench_Tutorial(int32 EntryPoint);
	void Find_Attachment_Cell_to_Point();
	void FindAttachmentTagToInit();
	void FindCraftRowToPoint();
	void FindElementToPoint();
	void FindRequiredCraftEntry(bool LockAll);
	void GetvalidAttachmentTag(class UWBP_ModeCategoryTag_C** Array_Element, bool* Interrupt);
	void IniModificationTags();
	void LockAttachments();
	void OnCategoryChanged_Event(int32 Param_Index);
	void PointToExit();
	void SetDesiredCategory();
	void ShowCategoryPointerHint(int32 CurrentCategoryIndex);
	void ShowCategoryPointerHint_Timer();
	void ShowHintWithCurrentCategory();
	void WeaponRowChanged(class UWBP_WeaponRow_C* WeaponRowRef);
	void WeaponRowChanged_Timer();
	void WeaponTabUpdateAvaliableTags();
	void WeaponTagSelected();
	void WeaponTagSelected_Timer();
	void CheckDismantleItems();
	void CloseWorkbench();
	void NavigationExit();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Workbench_Tutorial_C">();
	}
	static class UWBP_Workbench_Tutorial_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Workbench_Tutorial_C>();
	}
};
static_assert(alignof(UWBP_Workbench_Tutorial_C) == 0x000008, "Wrong alignment on UWBP_Workbench_Tutorial_C");
static_assert(sizeof(UWBP_Workbench_Tutorial_C) == 0x000708, "Wrong size on UWBP_Workbench_Tutorial_C");
static_assert(offsetof(UWBP_Workbench_Tutorial_C, UberGraphFrame_WBP_Workbench_Tutorial_C) == 0x0005C8, "Member 'UWBP_Workbench_Tutorial_C::UberGraphFrame_WBP_Workbench_Tutorial_C' has a wrong offset!");
static_assert(offsetof(UWBP_Workbench_Tutorial_C, As_BP_Game_HUD) == 0x0005D0, "Member 'UWBP_Workbench_Tutorial_C::As_BP_Game_HUD' has a wrong offset!");
static_assert(offsetof(UWBP_Workbench_Tutorial_C, WeaponIDToModify) == 0x0005D8, "Member 'UWBP_Workbench_Tutorial_C::WeaponIDToModify' has a wrong offset!");
static_assert(offsetof(UWBP_Workbench_Tutorial_C, ModificationTagsOrder) == 0x0005E0, "Member 'UWBP_Workbench_Tutorial_C::ModificationTagsOrder' has a wrong offset!");
static_assert(offsetof(UWBP_Workbench_Tutorial_C, DesiredCategoryIndex) == 0x000630, "Member 'UWBP_Workbench_Tutorial_C::DesiredCategoryIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Workbench_Tutorial_C, ModifiedTags) == 0x000638, "Member 'UWBP_Workbench_Tutorial_C::ModifiedTags' has a wrong offset!");
static_assert(offsetof(UWBP_Workbench_Tutorial_C, PointerAttachmentsIDs) == 0x000688, "Member 'UWBP_Workbench_Tutorial_C::PointerAttachmentsIDs' has a wrong offset!");
static_assert(offsetof(UWBP_Workbench_Tutorial_C, bModificationTutorialFinished) == 0x0006D8, "Member 'UWBP_Workbench_Tutorial_C::bModificationTutorialFinished' has a wrong offset!");
static_assert(offsetof(UWBP_Workbench_Tutorial_C, As_Surv_PC) == 0x0006E0, "Member 'UWBP_Workbench_Tutorial_C::As_Surv_PC' has a wrong offset!");
static_assert(offsetof(UWBP_Workbench_Tutorial_C, bCraftTutorialFinished) == 0x0006E8, "Member 'UWBP_Workbench_Tutorial_C::bCraftTutorialFinished' has a wrong offset!");
static_assert(offsetof(UWBP_Workbench_Tutorial_C, EntryToCraft) == 0x0006F0, "Member 'UWBP_Workbench_Tutorial_C::EntryToCraft' has a wrong offset!");
static_assert(offsetof(UWBP_Workbench_Tutorial_C, CraftedItemName) == 0x0006F8, "Member 'UWBP_Workbench_Tutorial_C::CraftedItemName' has a wrong offset!");
static_assert(offsetof(UWBP_Workbench_Tutorial_C, RequiredAttachmentTag) == 0x000700, "Member 'UWBP_Workbench_Tutorial_C::RequiredAttachmentTag' has a wrong offset!");

}

