#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DialogueLine

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_DialogueLine.WBP_DialogueLine_C.ExecuteUbergraph_WBP_DialogueLine
// 0x0008 (0x0008 - 0x0000)
struct WBP_DialogueLine_C_ExecuteUbergraph_WBP_DialogueLine final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DialogueLine_C_ExecuteUbergraph_WBP_DialogueLine) == 0x000004, "Wrong alignment on WBP_DialogueLine_C_ExecuteUbergraph_WBP_DialogueLine");
static_assert(sizeof(WBP_DialogueLine_C_ExecuteUbergraph_WBP_DialogueLine) == 0x000008, "Wrong size on WBP_DialogueLine_C_ExecuteUbergraph_WBP_DialogueLine");
static_assert(offsetof(WBP_DialogueLine_C_ExecuteUbergraph_WBP_DialogueLine, EntryPoint) == 0x000000, "Member 'WBP_DialogueLine_C_ExecuteUbergraph_WBP_DialogueLine::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_DialogueLine_C_ExecuteUbergraph_WBP_DialogueLine, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_DialogueLine_C_ExecuteUbergraph_WBP_DialogueLine::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_DialogueLine.WBP_DialogueLine_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_DialogueLine_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DialogueLine_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_DialogueLine_C_PreConstruct");
static_assert(sizeof(WBP_DialogueLine_C_PreConstruct) == 0x000001, "Wrong size on WBP_DialogueLine_C_PreConstruct");
static_assert(offsetof(WBP_DialogueLine_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_DialogueLine_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_DialogueLine.WBP_DialogueLine_C.SetText
// 0x0018 (0x0018 - 0x0000)
struct WBP_DialogueLine_C_SetText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_DialogueLine_C_SetText) == 0x000008, "Wrong alignment on WBP_DialogueLine_C_SetText");
static_assert(sizeof(WBP_DialogueLine_C_SetText) == 0x000018, "Wrong size on WBP_DialogueLine_C_SetText");
static_assert(offsetof(WBP_DialogueLine_C_SetText, InText) == 0x000000, "Member 'WBP_DialogueLine_C_SetText::InText' has a wrong offset!");

}

