#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DialogueLine

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DialogueLine.WBP_DialogueLine_C
// 0x0028 (0x02A8 - 0x0280)
class UWBP_DialogueLine_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URichTextBlock*                         RichTextBlock_NPC_Phrase;                          // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   In_Text;                                           // 0x0290(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ExposeOnSpawn)

public:
	void ExecuteUbergraph_WBP_DialogueLine(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetText(const class FText& InText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_DialogueLine_C">();
	}
	static class UWBP_DialogueLine_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DialogueLine_C>();
	}
};
static_assert(alignof(UWBP_DialogueLine_C) == 0x000008, "Wrong alignment on UWBP_DialogueLine_C");
static_assert(sizeof(UWBP_DialogueLine_C) == 0x0002A8, "Wrong size on UWBP_DialogueLine_C");
static_assert(offsetof(UWBP_DialogueLine_C, UberGraphFrame) == 0x000280, "Member 'UWBP_DialogueLine_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_DialogueLine_C, RichTextBlock_NPC_Phrase) == 0x000288, "Member 'UWBP_DialogueLine_C::RichTextBlock_NPC_Phrase' has a wrong offset!");
static_assert(offsetof(UWBP_DialogueLine_C, In_Text) == 0x000290, "Member 'UWBP_DialogueLine_C::In_Text' has a wrong offset!");

}

