#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SlidesTutorial

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "S_TutorialSlides_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SlidesTutorial.WBP_SlidesTutorial_C
// 0x00F8 (0x0378 - 0x0280)
class UWBP_SlidesTutorial_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Show_Anim;                                         // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SwapPage_Anim;                                     // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UW_ModalWindowButton_C*                 Button_Back;                                       // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ModalWindowButton_C*                 Button_Continue;                                   // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_ScreenSpace;                                // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_PageCounter;                         // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_TopBlock;                            // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Page;                                        // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_PageCounter_Current;                     // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_PageCounter_Total;                       // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_PageText;                                // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Title;                                   // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         PageIndex;                                         // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class FName>                             Pages_Rows;                                        // 0x02F0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FS_TutorialSlides>              PagesInfo;                                         // 0x0340(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	FMulticastInlineDelegateProperty_             OnClosed;                                          // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnShow;                                            // 0x0360(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bIsOpened;                                         // 0x0370(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_SlidesTutorial_Button_Back_K2Node_ComponentBoundEvent_7_OnPressed__DelegateSignature();
	void BndEvt__WBP_SlidesTutorial_Button_Continue_K2Node_ComponentBoundEvent_6_OnPressed__DelegateSignature();
	void BndEvt__WBP_SlidesTutorial_Button_ScreenSpace_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void Close();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_SlidesTutorial(int32 EntryPoint);
	void Finished_D1B7F2E84B00534E836E6B81996AEE14();
	void NextPage();
	void OnClosed__DelegateSignature();
	void OnShow__DelegateSignature();
	void PreConstruct(bool IsDesignTime);
	void PrevPage();
	void SequenceEvent__ENTRYPOINTWBP_SlidesTutorial();
	void SetCurrentPageInfo();
	void SetPages(const TSet<class FName>& PagesRows);
	void Show();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SlidesTutorial_C">();
	}
	static class UWBP_SlidesTutorial_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SlidesTutorial_C>();
	}
};
static_assert(alignof(UWBP_SlidesTutorial_C) == 0x000008, "Wrong alignment on UWBP_SlidesTutorial_C");
static_assert(sizeof(UWBP_SlidesTutorial_C) == 0x000378, "Wrong size on UWBP_SlidesTutorial_C");
static_assert(offsetof(UWBP_SlidesTutorial_C, UberGraphFrame) == 0x000280, "Member 'UWBP_SlidesTutorial_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_SlidesTutorial_C, Show_Anim) == 0x000288, "Member 'UWBP_SlidesTutorial_C::Show_Anim' has a wrong offset!");
static_assert(offsetof(UWBP_SlidesTutorial_C, SwapPage_Anim) == 0x000290, "Member 'UWBP_SlidesTutorial_C::SwapPage_Anim' has a wrong offset!");
static_assert(offsetof(UWBP_SlidesTutorial_C, Button_Back) == 0x000298, "Member 'UWBP_SlidesTutorial_C::Button_Back' has a wrong offset!");
static_assert(offsetof(UWBP_SlidesTutorial_C, Button_Continue) == 0x0002A0, "Member 'UWBP_SlidesTutorial_C::Button_Continue' has a wrong offset!");
static_assert(offsetof(UWBP_SlidesTutorial_C, Button_ScreenSpace) == 0x0002A8, "Member 'UWBP_SlidesTutorial_C::Button_ScreenSpace' has a wrong offset!");
static_assert(offsetof(UWBP_SlidesTutorial_C, HorizontalBox_PageCounter) == 0x0002B0, "Member 'UWBP_SlidesTutorial_C::HorizontalBox_PageCounter' has a wrong offset!");
static_assert(offsetof(UWBP_SlidesTutorial_C, HorizontalBox_TopBlock) == 0x0002B8, "Member 'UWBP_SlidesTutorial_C::HorizontalBox_TopBlock' has a wrong offset!");
static_assert(offsetof(UWBP_SlidesTutorial_C, Image_Page) == 0x0002C0, "Member 'UWBP_SlidesTutorial_C::Image_Page' has a wrong offset!");
static_assert(offsetof(UWBP_SlidesTutorial_C, TextBlock_PageCounter_Current) == 0x0002C8, "Member 'UWBP_SlidesTutorial_C::TextBlock_PageCounter_Current' has a wrong offset!");
static_assert(offsetof(UWBP_SlidesTutorial_C, TextBlock_PageCounter_Total) == 0x0002D0, "Member 'UWBP_SlidesTutorial_C::TextBlock_PageCounter_Total' has a wrong offset!");
static_assert(offsetof(UWBP_SlidesTutorial_C, TextBlock_PageText) == 0x0002D8, "Member 'UWBP_SlidesTutorial_C::TextBlock_PageText' has a wrong offset!");
static_assert(offsetof(UWBP_SlidesTutorial_C, TextBlock_Title) == 0x0002E0, "Member 'UWBP_SlidesTutorial_C::TextBlock_Title' has a wrong offset!");
static_assert(offsetof(UWBP_SlidesTutorial_C, PageIndex) == 0x0002E8, "Member 'UWBP_SlidesTutorial_C::PageIndex' has a wrong offset!");
static_assert(offsetof(UWBP_SlidesTutorial_C, Pages_Rows) == 0x0002F0, "Member 'UWBP_SlidesTutorial_C::Pages_Rows' has a wrong offset!");
static_assert(offsetof(UWBP_SlidesTutorial_C, PagesInfo) == 0x000340, "Member 'UWBP_SlidesTutorial_C::PagesInfo' has a wrong offset!");
static_assert(offsetof(UWBP_SlidesTutorial_C, OnClosed) == 0x000350, "Member 'UWBP_SlidesTutorial_C::OnClosed' has a wrong offset!");
static_assert(offsetof(UWBP_SlidesTutorial_C, OnShow) == 0x000360, "Member 'UWBP_SlidesTutorial_C::OnShow' has a wrong offset!");
static_assert(offsetof(UWBP_SlidesTutorial_C, bIsOpened) == 0x000370, "Member 'UWBP_SlidesTutorial_C::bIsOpened' has a wrong offset!");

}

