#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ResourceCounter

#include "Basic.hpp"

#include "ContainerPickupsInfo_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_ResourceCounter.WBP_ResourceCounter_C.ExecuteUbergraph_WBP_ResourceCounter
// 0x0150 (0x0150 - 0x0000)
struct WBP_ResourceCounter_C_ExecuteUbergraph_WBP_ResourceCounter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_UpdateCounter_CountResource;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPaperSprite*                           CallFunc_Map_Find_Value;                           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_MakeBrushFromSprite_ReturnValue;          // 0x0050(0x00D0)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0120(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0138(0x0018)()
};
static_assert(alignof(WBP_ResourceCounter_C_ExecuteUbergraph_WBP_ResourceCounter) == 0x000010, "Wrong alignment on WBP_ResourceCounter_C_ExecuteUbergraph_WBP_ResourceCounter");
static_assert(sizeof(WBP_ResourceCounter_C_ExecuteUbergraph_WBP_ResourceCounter) == 0x000150, "Wrong size on WBP_ResourceCounter_C_ExecuteUbergraph_WBP_ResourceCounter");
static_assert(offsetof(WBP_ResourceCounter_C_ExecuteUbergraph_WBP_ResourceCounter, EntryPoint) == 0x000000, "Member 'WBP_ResourceCounter_C_ExecuteUbergraph_WBP_ResourceCounter::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ResourceCounter_C_ExecuteUbergraph_WBP_ResourceCounter, Temp_bool_Variable) == 0x000004, "Member 'WBP_ResourceCounter_C_ExecuteUbergraph_WBP_ResourceCounter::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ResourceCounter_C_ExecuteUbergraph_WBP_ResourceCounter, Temp_text_Variable) == 0x000008, "Member 'WBP_ResourceCounter_C_ExecuteUbergraph_WBP_ResourceCounter::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ResourceCounter_C_ExecuteUbergraph_WBP_ResourceCounter, K2Node_Event_IsDesignTime) == 0x000020, "Member 'WBP_ResourceCounter_C_ExecuteUbergraph_WBP_ResourceCounter::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_ResourceCounter_C_ExecuteUbergraph_WBP_ResourceCounter, CallFunc_UpdateCounter_CountResource) == 0x000024, "Member 'WBP_ResourceCounter_C_ExecuteUbergraph_WBP_ResourceCounter::CallFunc_UpdateCounter_CountResource' has a wrong offset!");
static_assert(offsetof(WBP_ResourceCounter_C_ExecuteUbergraph_WBP_ResourceCounter, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000028, "Member 'WBP_ResourceCounter_C_ExecuteUbergraph_WBP_ResourceCounter::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResourceCounter_C_ExecuteUbergraph_WBP_ResourceCounter, K2Node_DynamicCast_AsSurvival_Player) == 0x000030, "Member 'WBP_ResourceCounter_C_ExecuteUbergraph_WBP_ResourceCounter::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(WBP_ResourceCounter_C_ExecuteUbergraph_WBP_ResourceCounter, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'WBP_ResourceCounter_C_ExecuteUbergraph_WBP_ResourceCounter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ResourceCounter_C_ExecuteUbergraph_WBP_ResourceCounter, CallFunc_Map_Find_Value) == 0x000040, "Member 'WBP_ResourceCounter_C_ExecuteUbergraph_WBP_ResourceCounter::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_ResourceCounter_C_ExecuteUbergraph_WBP_ResourceCounter, CallFunc_Map_Find_ReturnValue) == 0x000048, "Member 'WBP_ResourceCounter_C_ExecuteUbergraph_WBP_ResourceCounter::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResourceCounter_C_ExecuteUbergraph_WBP_ResourceCounter, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000049, "Member 'WBP_ResourceCounter_C_ExecuteUbergraph_WBP_ResourceCounter::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResourceCounter_C_ExecuteUbergraph_WBP_ResourceCounter, CallFunc_MakeBrushFromSprite_ReturnValue) == 0x000050, "Member 'WBP_ResourceCounter_C_ExecuteUbergraph_WBP_ResourceCounter::CallFunc_MakeBrushFromSprite_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResourceCounter_C_ExecuteUbergraph_WBP_ResourceCounter, CallFunc_Conv_IntToText_ReturnValue) == 0x000120, "Member 'WBP_ResourceCounter_C_ExecuteUbergraph_WBP_ResourceCounter::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResourceCounter_C_ExecuteUbergraph_WBP_ResourceCounter, K2Node_Select_Default) == 0x000138, "Member 'WBP_ResourceCounter_C_ExecuteUbergraph_WBP_ResourceCounter::K2Node_Select_Default' has a wrong offset!");

// Function WBP_ResourceCounter.WBP_ResourceCounter_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ResourceCounter_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ResourceCounter_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_ResourceCounter_C_PreConstruct");
static_assert(sizeof(WBP_ResourceCounter_C_PreConstruct) == 0x000001, "Wrong size on WBP_ResourceCounter_C_PreConstruct");
static_assert(offsetof(WBP_ResourceCounter_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_ResourceCounter_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_ResourceCounter.WBP_ResourceCounter_C.UpdateCounter
// 0x0118 (0x0118 - 0x0000)
struct WBP_ResourceCounter_C_UpdateCounter final
{
public:
	int32                                         CountResource;                                     // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FContainerPickupsInfo>          CallFunc_getItemsInventory_ContainerItems;         // 0x0048(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<struct FContainerPickupsInfo>          CallFunc_getItemsInventory_ContainersData;         // 0x0058(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FContainerPickupsInfo                  CallFunc_Array_Get_Item;                           // 0x0068(0x0068)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x00D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00D6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D7[0x1];                                       // 0x00D7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00D8(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x00F0(0x0018)()
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x010C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0115(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ResourceCounter_C_UpdateCounter) == 0x000008, "Wrong alignment on WBP_ResourceCounter_C_UpdateCounter");
static_assert(sizeof(WBP_ResourceCounter_C_UpdateCounter) == 0x000118, "Wrong size on WBP_ResourceCounter_C_UpdateCounter");
static_assert(offsetof(WBP_ResourceCounter_C_UpdateCounter, CountResource) == 0x000000, "Member 'WBP_ResourceCounter_C_UpdateCounter::CountResource' has a wrong offset!");
static_assert(offsetof(WBP_ResourceCounter_C_UpdateCounter, Temp_text_Variable) == 0x000008, "Member 'WBP_ResourceCounter_C_UpdateCounter::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ResourceCounter_C_UpdateCounter, Temp_int_Array_Index_Variable) == 0x000020, "Member 'WBP_ResourceCounter_C_UpdateCounter::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ResourceCounter_C_UpdateCounter, Temp_bool_Variable) == 0x000024, "Member 'WBP_ResourceCounter_C_UpdateCounter::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ResourceCounter_C_UpdateCounter, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'WBP_ResourceCounter_C_UpdateCounter::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ResourceCounter_C_UpdateCounter, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000030, "Member 'WBP_ResourceCounter_C_UpdateCounter::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResourceCounter_C_UpdateCounter, K2Node_DynamicCast_AsSurvival_Player) == 0x000038, "Member 'WBP_ResourceCounter_C_UpdateCounter::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(WBP_ResourceCounter_C_UpdateCounter, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WBP_ResourceCounter_C_UpdateCounter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ResourceCounter_C_UpdateCounter, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'WBP_ResourceCounter_C_UpdateCounter::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResourceCounter_C_UpdateCounter, CallFunc_getItemsInventory_ContainerItems) == 0x000048, "Member 'WBP_ResourceCounter_C_UpdateCounter::CallFunc_getItemsInventory_ContainerItems' has a wrong offset!");
static_assert(offsetof(WBP_ResourceCounter_C_UpdateCounter, CallFunc_getItemsInventory_ContainersData) == 0x000058, "Member 'WBP_ResourceCounter_C_UpdateCounter::CallFunc_getItemsInventory_ContainersData' has a wrong offset!");
static_assert(offsetof(WBP_ResourceCounter_C_UpdateCounter, CallFunc_Array_Get_Item) == 0x000068, "Member 'WBP_ResourceCounter_C_UpdateCounter::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_ResourceCounter_C_UpdateCounter, CallFunc_Array_Length_ReturnValue) == 0x0000D0, "Member 'WBP_ResourceCounter_C_UpdateCounter::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResourceCounter_C_UpdateCounter, CallFunc_Less_IntInt_ReturnValue) == 0x0000D4, "Member 'WBP_ResourceCounter_C_UpdateCounter::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResourceCounter_C_UpdateCounter, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0000D5, "Member 'WBP_ResourceCounter_C_UpdateCounter::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResourceCounter_C_UpdateCounter, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000D6, "Member 'WBP_ResourceCounter_C_UpdateCounter::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResourceCounter_C_UpdateCounter, CallFunc_Conv_IntToText_ReturnValue) == 0x0000D8, "Member 'WBP_ResourceCounter_C_UpdateCounter::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResourceCounter_C_UpdateCounter, K2Node_Select_Default) == 0x0000F0, "Member 'WBP_ResourceCounter_C_UpdateCounter::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ResourceCounter_C_UpdateCounter, CallFunc_Add_IntInt_ReturnValue_1) == 0x000108, "Member 'WBP_ResourceCounter_C_UpdateCounter::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ResourceCounter_C_UpdateCounter, CallFunc_Conv_StringToName_ReturnValue) == 0x00010C, "Member 'WBP_ResourceCounter_C_UpdateCounter::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResourceCounter_C_UpdateCounter, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000114, "Member 'WBP_ResourceCounter_C_UpdateCounter::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResourceCounter_C_UpdateCounter, CallFunc_BooleanAND_ReturnValue) == 0x000115, "Member 'WBP_ResourceCounter_C_UpdateCounter::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

