#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_NegativeEffect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Survival_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_NegativeEffect.WBP_NegativeEffect_C
// 0x0038 (0x02B8 - 0x0280)
class UWBP_NegativeEffect_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         HorizontalBox;                                     // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Icon;                                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_IconShadow;                                  // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox;                                           // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_EffectName;                              // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EUNegativeEffectType                          EffectType;                                        // 0x02B0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_NegativeEffect(int32 EntryPoint);
	void Init();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_NegativeEffect_C">();
	}
	static class UWBP_NegativeEffect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_NegativeEffect_C>();
	}
};
static_assert(alignof(UWBP_NegativeEffect_C) == 0x000008, "Wrong alignment on UWBP_NegativeEffect_C");
static_assert(sizeof(UWBP_NegativeEffect_C) == 0x0002B8, "Wrong size on UWBP_NegativeEffect_C");
static_assert(offsetof(UWBP_NegativeEffect_C, UberGraphFrame) == 0x000280, "Member 'UWBP_NegativeEffect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_NegativeEffect_C, HorizontalBox) == 0x000288, "Member 'UWBP_NegativeEffect_C::HorizontalBox' has a wrong offset!");
static_assert(offsetof(UWBP_NegativeEffect_C, Image_Icon) == 0x000290, "Member 'UWBP_NegativeEffect_C::Image_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_NegativeEffect_C, Image_IconShadow) == 0x000298, "Member 'UWBP_NegativeEffect_C::Image_IconShadow' has a wrong offset!");
static_assert(offsetof(UWBP_NegativeEffect_C, SizeBox) == 0x0002A0, "Member 'UWBP_NegativeEffect_C::SizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_NegativeEffect_C, TextBlock_EffectName) == 0x0002A8, "Member 'UWBP_NegativeEffect_C::TextBlock_EffectName' has a wrong offset!");
static_assert(offsetof(UWBP_NegativeEffect_C, EffectType) == 0x0002B0, "Member 'UWBP_NegativeEffect_C::EffectType' has a wrong offset!");

}

