#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ShopDialogue

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "JSItemType_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ShopDialogue.WBP_ShopDialogue_C
// 0x0158 (0x03D8 - 0x0280)
class UWBP_ShopDialogue_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Close;                                             // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Open;                                              // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_Minus;                                      // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_ModalClose;                                 // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Plus;                                       // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Slider;                                     // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ModalWindowButton_C*                 ConfirmWindow_Accept;                              // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ModalWindowButton_C*                 ConfirmWindow_Decline;                             // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_187;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_365;                                         // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_CountSlider;                               // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USlider*                                Slider_Main;                                       // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Content;                                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Count;                                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_TotalPrice;                                   // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_CurrentCount;                            // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Max;                                     // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Min;                                     // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlockWhattodo;                                 // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlockWhattodo_1;                               // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ModalWindowButton_C*                 W_BaseDialogButton_Accept;                         // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ModalWindowButton_C*                 W_BaseDialogButton_Decline;                        // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemInteractionValueChangeButton_C* WBP_ButtonMinus;                                   // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemInteractionValueChangeButton_C* WBP_ButtonPlus;                                    // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_0;                                  // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_LeftButton;                         // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_RightButton;                        // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnPressedAccept;                                   // 0x0368(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnPressedDecline;                                  // 0x0378(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         MaxCount;                                          // 0x0388(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentValue;                                      // 0x038C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJSI_Slot_C*                            SlotRef;                                           // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Slider_Value;                                      // 0x0398(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39C[0x4];                                      // 0x039C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Step_Slider;                                       // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Float_var;                                         // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ToggleSellPrice;                                   // 0x03B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnPressenConfirmAccept;                            // 0x03B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnPressedConfirmDecline;                           // 0x03C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_ShopDialogue_Button_Minus_K2Node_ComponentBoundEvent_3_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__WBP_ShopDialogue_Button_Plus_K2Node_ComponentBoundEvent_4_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__WBP_ShopDialogue_ConfirmWindow_Accept_K2Node_ComponentBoundEvent_7_OnPressed__DelegateSignature();
	void BndEvt__WBP_ShopDialogue_ConfirmWindow_Decline_K2Node_ComponentBoundEvent_8_OnPressed__DelegateSignature();
	void BndEvt__WBP_ShopDialogue_Slider_Main_K2Node_ComponentBoundEvent_2_OnFloatValueChangedEvent__DelegateSignature(float Value);
	void BndEvt__WBP_ShopDialogue_W_BaseDialogButton_Accept_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature();
	void BndEvt__WBP_ShopDialogue_W_BaseDialogButton_Decline_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature();
	void BndEvt__WBP_ShopDialogue_WBP_ItemInteractionValueChangeButton_212_K2Node_ComponentBoundEvent_6_OnChangeValueButtonPressed__DelegateSignature();
	void BndEvt__WBP_ShopDialogue_WBP_ItemInteractionValueChangeButton_K2Node_ComponentBoundEvent_5_OnChangeValueButtonPressed__DelegateSignature();
	void Destruct();
	void ExecuteUbergraph_WBP_ShopDialogue(int32 EntryPoint);
	void GetCurrentCount(int32* Param_CurrentValue);
	double GetPrice();
	void GetSlotRef(class UJSI_Slot_C** Param_SlotRef);
	void Init();
	void OnPressedAccept__DelegateSignature(int32 Count, class UJSI_Slot_C* Ref_slot);
	void OnPressedConfirmDecline__DelegateSignature();
	void OnPressedDecline__DelegateSignature();
	void OnPressenConfirmAccept__DelegateSignature();
	void SetText(int32 Value);
	void SetTextV2(const struct FFItemInfo& FItemInfo, double Price, int32 RPoints);
	void SetWidgetSwitcher(int32 Param_Index);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ShopDialogue_C">();
	}
	static class UWBP_ShopDialogue_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ShopDialogue_C>();
	}
};
static_assert(alignof(UWBP_ShopDialogue_C) == 0x000008, "Wrong alignment on UWBP_ShopDialogue_C");
static_assert(sizeof(UWBP_ShopDialogue_C) == 0x0003D8, "Wrong size on UWBP_ShopDialogue_C");
static_assert(offsetof(UWBP_ShopDialogue_C, UberGraphFrame) == 0x000280, "Member 'UWBP_ShopDialogue_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ShopDialogue_C, Close) == 0x000288, "Member 'UWBP_ShopDialogue_C::Close' has a wrong offset!");
static_assert(offsetof(UWBP_ShopDialogue_C, Open) == 0x000290, "Member 'UWBP_ShopDialogue_C::Open' has a wrong offset!");
static_assert(offsetof(UWBP_ShopDialogue_C, Button_Minus) == 0x000298, "Member 'UWBP_ShopDialogue_C::Button_Minus' has a wrong offset!");
static_assert(offsetof(UWBP_ShopDialogue_C, Button_ModalClose) == 0x0002A0, "Member 'UWBP_ShopDialogue_C::Button_ModalClose' has a wrong offset!");
static_assert(offsetof(UWBP_ShopDialogue_C, Button_Plus) == 0x0002A8, "Member 'UWBP_ShopDialogue_C::Button_Plus' has a wrong offset!");
static_assert(offsetof(UWBP_ShopDialogue_C, Button_Slider) == 0x0002B0, "Member 'UWBP_ShopDialogue_C::Button_Slider' has a wrong offset!");
static_assert(offsetof(UWBP_ShopDialogue_C, ConfirmWindow_Accept) == 0x0002B8, "Member 'UWBP_ShopDialogue_C::ConfirmWindow_Accept' has a wrong offset!");
static_assert(offsetof(UWBP_ShopDialogue_C, ConfirmWindow_Decline) == 0x0002C0, "Member 'UWBP_ShopDialogue_C::ConfirmWindow_Decline' has a wrong offset!");
static_assert(offsetof(UWBP_ShopDialogue_C, Image) == 0x0002C8, "Member 'UWBP_ShopDialogue_C::Image' has a wrong offset!");
static_assert(offsetof(UWBP_ShopDialogue_C, Image_187) == 0x0002D0, "Member 'UWBP_ShopDialogue_C::Image_187' has a wrong offset!");
static_assert(offsetof(UWBP_ShopDialogue_C, Image_365) == 0x0002D8, "Member 'UWBP_ShopDialogue_C::Image_365' has a wrong offset!");
static_assert(offsetof(UWBP_ShopDialogue_C, SizeBox_CountSlider) == 0x0002E0, "Member 'UWBP_ShopDialogue_C::SizeBox_CountSlider' has a wrong offset!");
static_assert(offsetof(UWBP_ShopDialogue_C, Slider_Main) == 0x0002E8, "Member 'UWBP_ShopDialogue_C::Slider_Main' has a wrong offset!");
static_assert(offsetof(UWBP_ShopDialogue_C, Text_Content) == 0x0002F0, "Member 'UWBP_ShopDialogue_C::Text_Content' has a wrong offset!");
static_assert(offsetof(UWBP_ShopDialogue_C, Text_Count) == 0x0002F8, "Member 'UWBP_ShopDialogue_C::Text_Count' has a wrong offset!");
static_assert(offsetof(UWBP_ShopDialogue_C, Text_TotalPrice) == 0x000300, "Member 'UWBP_ShopDialogue_C::Text_TotalPrice' has a wrong offset!");
static_assert(offsetof(UWBP_ShopDialogue_C, TextBlock_CurrentCount) == 0x000308, "Member 'UWBP_ShopDialogue_C::TextBlock_CurrentCount' has a wrong offset!");
static_assert(offsetof(UWBP_ShopDialogue_C, TextBlock_Max) == 0x000310, "Member 'UWBP_ShopDialogue_C::TextBlock_Max' has a wrong offset!");
static_assert(offsetof(UWBP_ShopDialogue_C, TextBlock_Min) == 0x000318, "Member 'UWBP_ShopDialogue_C::TextBlock_Min' has a wrong offset!");
static_assert(offsetof(UWBP_ShopDialogue_C, TextBlockWhattodo) == 0x000320, "Member 'UWBP_ShopDialogue_C::TextBlockWhattodo' has a wrong offset!");
static_assert(offsetof(UWBP_ShopDialogue_C, TextBlockWhattodo_1) == 0x000328, "Member 'UWBP_ShopDialogue_C::TextBlockWhattodo_1' has a wrong offset!");
static_assert(offsetof(UWBP_ShopDialogue_C, W_BaseDialogButton_Accept) == 0x000330, "Member 'UWBP_ShopDialogue_C::W_BaseDialogButton_Accept' has a wrong offset!");
static_assert(offsetof(UWBP_ShopDialogue_C, W_BaseDialogButton_Decline) == 0x000338, "Member 'UWBP_ShopDialogue_C::W_BaseDialogButton_Decline' has a wrong offset!");
static_assert(offsetof(UWBP_ShopDialogue_C, WBP_ButtonMinus) == 0x000340, "Member 'UWBP_ShopDialogue_C::WBP_ButtonMinus' has a wrong offset!");
static_assert(offsetof(UWBP_ShopDialogue_C, WBP_ButtonPlus) == 0x000348, "Member 'UWBP_ShopDialogue_C::WBP_ButtonPlus' has a wrong offset!");
static_assert(offsetof(UWBP_ShopDialogue_C, WidgetSwitcher_0) == 0x000350, "Member 'UWBP_ShopDialogue_C::WidgetSwitcher_0' has a wrong offset!");
static_assert(offsetof(UWBP_ShopDialogue_C, WidgetSwitcher_LeftButton) == 0x000358, "Member 'UWBP_ShopDialogue_C::WidgetSwitcher_LeftButton' has a wrong offset!");
static_assert(offsetof(UWBP_ShopDialogue_C, WidgetSwitcher_RightButton) == 0x000360, "Member 'UWBP_ShopDialogue_C::WidgetSwitcher_RightButton' has a wrong offset!");
static_assert(offsetof(UWBP_ShopDialogue_C, OnPressedAccept) == 0x000368, "Member 'UWBP_ShopDialogue_C::OnPressedAccept' has a wrong offset!");
static_assert(offsetof(UWBP_ShopDialogue_C, OnPressedDecline) == 0x000378, "Member 'UWBP_ShopDialogue_C::OnPressedDecline' has a wrong offset!");
static_assert(offsetof(UWBP_ShopDialogue_C, MaxCount) == 0x000388, "Member 'UWBP_ShopDialogue_C::MaxCount' has a wrong offset!");
static_assert(offsetof(UWBP_ShopDialogue_C, CurrentValue) == 0x00038C, "Member 'UWBP_ShopDialogue_C::CurrentValue' has a wrong offset!");
static_assert(offsetof(UWBP_ShopDialogue_C, SlotRef) == 0x000390, "Member 'UWBP_ShopDialogue_C::SlotRef' has a wrong offset!");
static_assert(offsetof(UWBP_ShopDialogue_C, Slider_Value) == 0x000398, "Member 'UWBP_ShopDialogue_C::Slider_Value' has a wrong offset!");
static_assert(offsetof(UWBP_ShopDialogue_C, Step_Slider) == 0x0003A0, "Member 'UWBP_ShopDialogue_C::Step_Slider' has a wrong offset!");
static_assert(offsetof(UWBP_ShopDialogue_C, Float_var) == 0x0003A8, "Member 'UWBP_ShopDialogue_C::Float_var' has a wrong offset!");
static_assert(offsetof(UWBP_ShopDialogue_C, ToggleSellPrice) == 0x0003B0, "Member 'UWBP_ShopDialogue_C::ToggleSellPrice' has a wrong offset!");
static_assert(offsetof(UWBP_ShopDialogue_C, OnPressenConfirmAccept) == 0x0003B8, "Member 'UWBP_ShopDialogue_C::OnPressenConfirmAccept' has a wrong offset!");
static_assert(offsetof(UWBP_ShopDialogue_C, OnPressedConfirmDecline) == 0x0003C8, "Member 'UWBP_ShopDialogue_C::OnPressedConfirmDecline' has a wrong offset!");

}

