#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MarkerSystemWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_MarkerSystemWidget.WBP_MarkerSystemWidget_C.GetMainName
// 0x0030 (0x0030 - 0x0000)
struct WBP_MarkerSystemWidget_C_GetMainName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0018)()
};
static_assert(alignof(WBP_MarkerSystemWidget_C_GetMainName) == 0x000008, "Wrong alignment on WBP_MarkerSystemWidget_C_GetMainName");
static_assert(sizeof(WBP_MarkerSystemWidget_C_GetMainName) == 0x000030, "Wrong size on WBP_MarkerSystemWidget_C_GetMainName");
static_assert(offsetof(WBP_MarkerSystemWidget_C_GetMainName, ReturnValue) == 0x000000, "Member 'WBP_MarkerSystemWidget_C_GetMainName::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MarkerSystemWidget_C_GetMainName, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'WBP_MarkerSystemWidget_C_GetMainName::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WBP_MarkerSystemWidget.WBP_MarkerSystemWidget_C.GetSecondaryName
// 0x0030 (0x0030 - 0x0000)
struct WBP_MarkerSystemWidget_C_GetSecondaryName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0018)()
};
static_assert(alignof(WBP_MarkerSystemWidget_C_GetSecondaryName) == 0x000008, "Wrong alignment on WBP_MarkerSystemWidget_C_GetSecondaryName");
static_assert(sizeof(WBP_MarkerSystemWidget_C_GetSecondaryName) == 0x000030, "Wrong size on WBP_MarkerSystemWidget_C_GetSecondaryName");
static_assert(offsetof(WBP_MarkerSystemWidget_C_GetSecondaryName, ReturnValue) == 0x000000, "Member 'WBP_MarkerSystemWidget_C_GetSecondaryName::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MarkerSystemWidget_C_GetSecondaryName, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'WBP_MarkerSystemWidget_C_GetSecondaryName::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

}

