#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PerkCardCharacterCreate

#include "Basic.hpp"

#include "WS_CharaterPerks_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_PerkCardCharacterCreate.WBP_PerkCardCharacterCreate_C.ExecuteUbergraph_WBP_PerkCardCharacterCreate
// 0x0008 (0x0008 - 0x0000)
struct WBP_PerkCardCharacterCreate_C_ExecuteUbergraph_WBP_PerkCardCharacterCreate final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PerkCardCharacterCreate_C_ExecuteUbergraph_WBP_PerkCardCharacterCreate) == 0x000004, "Wrong alignment on WBP_PerkCardCharacterCreate_C_ExecuteUbergraph_WBP_PerkCardCharacterCreate");
static_assert(sizeof(WBP_PerkCardCharacterCreate_C_ExecuteUbergraph_WBP_PerkCardCharacterCreate) == 0x000008, "Wrong size on WBP_PerkCardCharacterCreate_C_ExecuteUbergraph_WBP_PerkCardCharacterCreate");
static_assert(offsetof(WBP_PerkCardCharacterCreate_C_ExecuteUbergraph_WBP_PerkCardCharacterCreate, EntryPoint) == 0x000000, "Member 'WBP_PerkCardCharacterCreate_C_ExecuteUbergraph_WBP_PerkCardCharacterCreate::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PerkCardCharacterCreate_C_ExecuteUbergraph_WBP_PerkCardCharacterCreate, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_PerkCardCharacterCreate_C_ExecuteUbergraph_WBP_PerkCardCharacterCreate::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_PerkCardCharacterCreate.WBP_PerkCardCharacterCreate_C.Init
// 0x0100 (0x0100 - 0x0000)
struct WBP_PerkCardCharacterCreate_C_Init final
{
public:
	struct FWS_CharaterPerks                      PerkInfo;                                          // 0x0000(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	struct FLinearColor                           Color_NegativePerk;                                // 0x00B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color_PositivePerk;                                // 0x00C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x00E8(0x0014)()
};
static_assert(alignof(WBP_PerkCardCharacterCreate_C_Init) == 0x000008, "Wrong alignment on WBP_PerkCardCharacterCreate_C_Init");
static_assert(sizeof(WBP_PerkCardCharacterCreate_C_Init) == 0x000100, "Wrong size on WBP_PerkCardCharacterCreate_C_Init");
static_assert(offsetof(WBP_PerkCardCharacterCreate_C_Init, PerkInfo) == 0x000000, "Member 'WBP_PerkCardCharacterCreate_C_Init::PerkInfo' has a wrong offset!");
static_assert(offsetof(WBP_PerkCardCharacterCreate_C_Init, Color_NegativePerk) == 0x0000B8, "Member 'WBP_PerkCardCharacterCreate_C_Init::Color_NegativePerk' has a wrong offset!");
static_assert(offsetof(WBP_PerkCardCharacterCreate_C_Init, Color_PositivePerk) == 0x0000C8, "Member 'WBP_PerkCardCharacterCreate_C_Init::Color_PositivePerk' has a wrong offset!");
static_assert(offsetof(WBP_PerkCardCharacterCreate_C_Init, CallFunc_SelectColor_ReturnValue) == 0x0000D8, "Member 'WBP_PerkCardCharacterCreate_C_Init::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PerkCardCharacterCreate_C_Init, K2Node_MakeStruct_SlateColor) == 0x0000E8, "Member 'WBP_PerkCardCharacterCreate_C_Init::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function WBP_PerkCardCharacterCreate.WBP_PerkCardCharacterCreate_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_PerkCardCharacterCreate_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PerkCardCharacterCreate_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_PerkCardCharacterCreate_C_PreConstruct");
static_assert(sizeof(WBP_PerkCardCharacterCreate_C_PreConstruct) == 0x000001, "Wrong size on WBP_PerkCardCharacterCreate_C_PreConstruct");
static_assert(offsetof(WBP_PerkCardCharacterCreate_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_PerkCardCharacterCreate_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

