#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ServerScreen

#include "Basic.hpp"

#include "ENUM_ServerRegions_structs.hpp"
#include "S_ServerInfo_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "FMODStudio_structs.hpp"


namespace SDK::Params
{

// Function WBP_ServerScreen.WBP_ServerScreen_C.BndEvt__WBP_ServerScreen_W_ServerCategoryRow_EastAsia_K2Node_ComponentBoundEvent_8_OnButtonPressed__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_ServerScreen_C_BndEvt__WBP_ServerScreen_W_ServerCategoryRow_EastAsia_K2Node_ComponentBoundEvent_8_OnButtonPressed__DelegateSignature final
{
public:
	class UW_ServerCategoryRow_Button_C*          RowButton;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ENUM_ServerRegions                            Param_Region;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ServerScreen_C_BndEvt__WBP_ServerScreen_W_ServerCategoryRow_EastAsia_K2Node_ComponentBoundEvent_8_OnButtonPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ServerScreen_C_BndEvt__WBP_ServerScreen_W_ServerCategoryRow_EastAsia_K2Node_ComponentBoundEvent_8_OnButtonPressed__DelegateSignature");
static_assert(sizeof(WBP_ServerScreen_C_BndEvt__WBP_ServerScreen_W_ServerCategoryRow_EastAsia_K2Node_ComponentBoundEvent_8_OnButtonPressed__DelegateSignature) == 0x000010, "Wrong size on WBP_ServerScreen_C_BndEvt__WBP_ServerScreen_W_ServerCategoryRow_EastAsia_K2Node_ComponentBoundEvent_8_OnButtonPressed__DelegateSignature");
static_assert(offsetof(WBP_ServerScreen_C_BndEvt__WBP_ServerScreen_W_ServerCategoryRow_EastAsia_K2Node_ComponentBoundEvent_8_OnButtonPressed__DelegateSignature, RowButton) == 0x000000, "Member 'WBP_ServerScreen_C_BndEvt__WBP_ServerScreen_W_ServerCategoryRow_EastAsia_K2Node_ComponentBoundEvent_8_OnButtonPressed__DelegateSignature::RowButton' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_BndEvt__WBP_ServerScreen_W_ServerCategoryRow_EastAsia_K2Node_ComponentBoundEvent_8_OnButtonPressed__DelegateSignature, Param_Region) == 0x000008, "Member 'WBP_ServerScreen_C_BndEvt__WBP_ServerScreen_W_ServerCategoryRow_EastAsia_K2Node_ComponentBoundEvent_8_OnButtonPressed__DelegateSignature::Param_Region' has a wrong offset!");

// Function WBP_ServerScreen.WBP_ServerScreen_C.BndEvt__WBP_ServerScreen_W_ServerCategoryRow_NorthAmerica_K2Node_ComponentBoundEvent_1_OnButtonPressed__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_ServerScreen_C_BndEvt__WBP_ServerScreen_W_ServerCategoryRow_NorthAmerica_K2Node_ComponentBoundEvent_1_OnButtonPressed__DelegateSignature final
{
public:
	class UW_ServerCategoryRow_Button_C*          RowButton;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ENUM_ServerRegions                            Param_Region;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ServerScreen_C_BndEvt__WBP_ServerScreen_W_ServerCategoryRow_NorthAmerica_K2Node_ComponentBoundEvent_1_OnButtonPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ServerScreen_C_BndEvt__WBP_ServerScreen_W_ServerCategoryRow_NorthAmerica_K2Node_ComponentBoundEvent_1_OnButtonPressed__DelegateSignature");
static_assert(sizeof(WBP_ServerScreen_C_BndEvt__WBP_ServerScreen_W_ServerCategoryRow_NorthAmerica_K2Node_ComponentBoundEvent_1_OnButtonPressed__DelegateSignature) == 0x000010, "Wrong size on WBP_ServerScreen_C_BndEvt__WBP_ServerScreen_W_ServerCategoryRow_NorthAmerica_K2Node_ComponentBoundEvent_1_OnButtonPressed__DelegateSignature");
static_assert(offsetof(WBP_ServerScreen_C_BndEvt__WBP_ServerScreen_W_ServerCategoryRow_NorthAmerica_K2Node_ComponentBoundEvent_1_OnButtonPressed__DelegateSignature, RowButton) == 0x000000, "Member 'WBP_ServerScreen_C_BndEvt__WBP_ServerScreen_W_ServerCategoryRow_NorthAmerica_K2Node_ComponentBoundEvent_1_OnButtonPressed__DelegateSignature::RowButton' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_BndEvt__WBP_ServerScreen_W_ServerCategoryRow_NorthAmerica_K2Node_ComponentBoundEvent_1_OnButtonPressed__DelegateSignature, Param_Region) == 0x000008, "Member 'WBP_ServerScreen_C_BndEvt__WBP_ServerScreen_W_ServerCategoryRow_NorthAmerica_K2Node_ComponentBoundEvent_1_OnButtonPressed__DelegateSignature::Param_Region' has a wrong offset!");

// Function WBP_ServerScreen.WBP_ServerScreen_C.BndEvt__WBP_ServerScreen_W_ServerCategoryRow_SouthAmerica_K2Node_ComponentBoundEvent_6_OnButtonPressed__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_ServerScreen_C_BndEvt__WBP_ServerScreen_W_ServerCategoryRow_SouthAmerica_K2Node_ComponentBoundEvent_6_OnButtonPressed__DelegateSignature final
{
public:
	class UW_ServerCategoryRow_Button_C*          RowButton;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ENUM_ServerRegions                            Param_Region;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ServerScreen_C_BndEvt__WBP_ServerScreen_W_ServerCategoryRow_SouthAmerica_K2Node_ComponentBoundEvent_6_OnButtonPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ServerScreen_C_BndEvt__WBP_ServerScreen_W_ServerCategoryRow_SouthAmerica_K2Node_ComponentBoundEvent_6_OnButtonPressed__DelegateSignature");
static_assert(sizeof(WBP_ServerScreen_C_BndEvt__WBP_ServerScreen_W_ServerCategoryRow_SouthAmerica_K2Node_ComponentBoundEvent_6_OnButtonPressed__DelegateSignature) == 0x000010, "Wrong size on WBP_ServerScreen_C_BndEvt__WBP_ServerScreen_W_ServerCategoryRow_SouthAmerica_K2Node_ComponentBoundEvent_6_OnButtonPressed__DelegateSignature");
static_assert(offsetof(WBP_ServerScreen_C_BndEvt__WBP_ServerScreen_W_ServerCategoryRow_SouthAmerica_K2Node_ComponentBoundEvent_6_OnButtonPressed__DelegateSignature, RowButton) == 0x000000, "Member 'WBP_ServerScreen_C_BndEvt__WBP_ServerScreen_W_ServerCategoryRow_SouthAmerica_K2Node_ComponentBoundEvent_6_OnButtonPressed__DelegateSignature::RowButton' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_BndEvt__WBP_ServerScreen_W_ServerCategoryRow_SouthAmerica_K2Node_ComponentBoundEvent_6_OnButtonPressed__DelegateSignature, Param_Region) == 0x000008, "Member 'WBP_ServerScreen_C_BndEvt__WBP_ServerScreen_W_ServerCategoryRow_SouthAmerica_K2Node_ComponentBoundEvent_6_OnButtonPressed__DelegateSignature::Param_Region' has a wrong offset!");

// Function WBP_ServerScreen.WBP_ServerScreen_C.BndEvt__WBP_ServerScreen_W_ServerCategoryRow_SoutheastAsia_K2Node_ComponentBoundEvent_9_OnButtonPressed__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_ServerScreen_C_BndEvt__WBP_ServerScreen_W_ServerCategoryRow_SoutheastAsia_K2Node_ComponentBoundEvent_9_OnButtonPressed__DelegateSignature final
{
public:
	class UW_ServerCategoryRow_Button_C*          RowButton;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ENUM_ServerRegions                            Param_Region;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ServerScreen_C_BndEvt__WBP_ServerScreen_W_ServerCategoryRow_SoutheastAsia_K2Node_ComponentBoundEvent_9_OnButtonPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ServerScreen_C_BndEvt__WBP_ServerScreen_W_ServerCategoryRow_SoutheastAsia_K2Node_ComponentBoundEvent_9_OnButtonPressed__DelegateSignature");
static_assert(sizeof(WBP_ServerScreen_C_BndEvt__WBP_ServerScreen_W_ServerCategoryRow_SoutheastAsia_K2Node_ComponentBoundEvent_9_OnButtonPressed__DelegateSignature) == 0x000010, "Wrong size on WBP_ServerScreen_C_BndEvt__WBP_ServerScreen_W_ServerCategoryRow_SoutheastAsia_K2Node_ComponentBoundEvent_9_OnButtonPressed__DelegateSignature");
static_assert(offsetof(WBP_ServerScreen_C_BndEvt__WBP_ServerScreen_W_ServerCategoryRow_SoutheastAsia_K2Node_ComponentBoundEvent_9_OnButtonPressed__DelegateSignature, RowButton) == 0x000000, "Member 'WBP_ServerScreen_C_BndEvt__WBP_ServerScreen_W_ServerCategoryRow_SoutheastAsia_K2Node_ComponentBoundEvent_9_OnButtonPressed__DelegateSignature::RowButton' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_BndEvt__WBP_ServerScreen_W_ServerCategoryRow_SoutheastAsia_K2Node_ComponentBoundEvent_9_OnButtonPressed__DelegateSignature, Param_Region) == 0x000008, "Member 'WBP_ServerScreen_C_BndEvt__WBP_ServerScreen_W_ServerCategoryRow_SoutheastAsia_K2Node_ComponentBoundEvent_9_OnButtonPressed__DelegateSignature::Param_Region' has a wrong offset!");

// Function WBP_ServerScreen.WBP_ServerScreen_C.BndEvt__WBP_ServerScreen_W_ServerCategoryRow_WestEurope_K2Node_ComponentBoundEvent_7_OnButtonPressed__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_ServerScreen_C_BndEvt__WBP_ServerScreen_W_ServerCategoryRow_WestEurope_K2Node_ComponentBoundEvent_7_OnButtonPressed__DelegateSignature final
{
public:
	class UW_ServerCategoryRow_Button_C*          RowButton;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ENUM_ServerRegions                            Param_Region;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ServerScreen_C_BndEvt__WBP_ServerScreen_W_ServerCategoryRow_WestEurope_K2Node_ComponentBoundEvent_7_OnButtonPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ServerScreen_C_BndEvt__WBP_ServerScreen_W_ServerCategoryRow_WestEurope_K2Node_ComponentBoundEvent_7_OnButtonPressed__DelegateSignature");
static_assert(sizeof(WBP_ServerScreen_C_BndEvt__WBP_ServerScreen_W_ServerCategoryRow_WestEurope_K2Node_ComponentBoundEvent_7_OnButtonPressed__DelegateSignature) == 0x000010, "Wrong size on WBP_ServerScreen_C_BndEvt__WBP_ServerScreen_W_ServerCategoryRow_WestEurope_K2Node_ComponentBoundEvent_7_OnButtonPressed__DelegateSignature");
static_assert(offsetof(WBP_ServerScreen_C_BndEvt__WBP_ServerScreen_W_ServerCategoryRow_WestEurope_K2Node_ComponentBoundEvent_7_OnButtonPressed__DelegateSignature, RowButton) == 0x000000, "Member 'WBP_ServerScreen_C_BndEvt__WBP_ServerScreen_W_ServerCategoryRow_WestEurope_K2Node_ComponentBoundEvent_7_OnButtonPressed__DelegateSignature::RowButton' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_BndEvt__WBP_ServerScreen_W_ServerCategoryRow_WestEurope_K2Node_ComponentBoundEvent_7_OnButtonPressed__DelegateSignature, Param_Region) == 0x000008, "Member 'WBP_ServerScreen_C_BndEvt__WBP_ServerScreen_W_ServerCategoryRow_WestEurope_K2Node_ComponentBoundEvent_7_OnButtonPressed__DelegateSignature::Param_Region' has a wrong offset!");

// Function WBP_ServerScreen.WBP_ServerScreen_C.BndEvt__WBP_ServerScreen_WBP_ServerSelector_K2Node_ComponentBoundEvent_2_OnServerSelected__DelegateSignature
// 0x0040 (0x0040 - 0x0000)
struct WBP_ServerScreen_C_BndEvt__WBP_ServerScreen_WBP_ServerSelector_K2Node_ComponentBoundEvent_2_OnServerSelected__DelegateSignature final
{
public:
	struct FS_ServerInfo                          ServerInfo;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ServerScreen_C_BndEvt__WBP_ServerScreen_WBP_ServerSelector_K2Node_ComponentBoundEvent_2_OnServerSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ServerScreen_C_BndEvt__WBP_ServerScreen_WBP_ServerSelector_K2Node_ComponentBoundEvent_2_OnServerSelected__DelegateSignature");
static_assert(sizeof(WBP_ServerScreen_C_BndEvt__WBP_ServerScreen_WBP_ServerSelector_K2Node_ComponentBoundEvent_2_OnServerSelected__DelegateSignature) == 0x000040, "Wrong size on WBP_ServerScreen_C_BndEvt__WBP_ServerScreen_WBP_ServerSelector_K2Node_ComponentBoundEvent_2_OnServerSelected__DelegateSignature");
static_assert(offsetof(WBP_ServerScreen_C_BndEvt__WBP_ServerScreen_WBP_ServerSelector_K2Node_ComponentBoundEvent_2_OnServerSelected__DelegateSignature, ServerInfo) == 0x000000, "Member 'WBP_ServerScreen_C_BndEvt__WBP_ServerScreen_WBP_ServerSelector_K2Node_ComponentBoundEvent_2_OnServerSelected__DelegateSignature::ServerInfo' has a wrong offset!");

// Function WBP_ServerScreen.WBP_ServerScreen_C.Check Is Server Full
// 0x0001 (0x0001 - 0x0000)
struct WBP_ServerScreen_C_Check_Is_Server_Full final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ServerScreen_C_Check_Is_Server_Full) == 0x000001, "Wrong alignment on WBP_ServerScreen_C_Check_Is_Server_Full");
static_assert(sizeof(WBP_ServerScreen_C_Check_Is_Server_Full) == 0x000001, "Wrong size on WBP_ServerScreen_C_Check_Is_Server_Full");
static_assert(offsetof(WBP_ServerScreen_C_Check_Is_Server_Full, Result) == 0x000000, "Member 'WBP_ServerScreen_C_Check_Is_Server_Full::Result' has a wrong offset!");

// Function WBP_ServerScreen.WBP_ServerScreen_C.CheckScreenTransferPossible
// 0x0005 (0x0005 - 0x0000)
struct WBP_ServerScreen_C_CheckScreenTransferPossible final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ServerScreen_C_CheckScreenTransferPossible) == 0x000001, "Wrong alignment on WBP_ServerScreen_C_CheckScreenTransferPossible");
static_assert(sizeof(WBP_ServerScreen_C_CheckScreenTransferPossible) == 0x000005, "Wrong size on WBP_ServerScreen_C_CheckScreenTransferPossible");
static_assert(offsetof(WBP_ServerScreen_C_CheckScreenTransferPossible, ReturnValue) == 0x000000, "Member 'WBP_ServerScreen_C_CheckScreenTransferPossible::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_CheckScreenTransferPossible, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000001, "Member 'WBP_ServerScreen_C_CheckScreenTransferPossible::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_CheckScreenTransferPossible, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'WBP_ServerScreen_C_CheckScreenTransferPossible::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_CheckScreenTransferPossible, CallFunc_Not_PreBool_ReturnValue_1) == 0x000003, "Member 'WBP_ServerScreen_C_CheckScreenTransferPossible::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_CheckScreenTransferPossible, CallFunc_BooleanAND_ReturnValue) == 0x000004, "Member 'WBP_ServerScreen_C_CheckScreenTransferPossible::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_ServerScreen.WBP_ServerScreen_C.ExecuteUbergraph_WBP_ServerScreen
// 0x0370 (0x0370 - 0x0000)
struct WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival;                  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x003C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0050(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0058(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E[0x2];                                       // 0x006E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0070(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival_1;                // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AA_GateCamera_C*                        CallFunc_GetActorOfClass_ReturnValue;              // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x00B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x00C0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       K2Node_CustomEvent_Animation;                      // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_NewState;                       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x00DC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD_MainMenu_C*                        K2Node_DynamicCast_AsHUD_Main_Menu;                // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckScreenTransferPossible_ReturnValue;  // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x011B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_ServerInfo                          K2Node_ComponentBoundEvent_ServerInfo;             // 0x0120(0x0040)(HasGetValueTypeHash)
	class UW_ServerCategoryRow_Button_C*          K2Node_ComponentBoundEvent_RowButton_4;            // 0x0160(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ENUM_ServerRegions                            K2Node_ComponentBoundEvent_Region_4;               // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result; // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue; // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_ServerCategoryRow_Button_C*          K2Node_ComponentBoundEvent_RowButton_3;            // 0x0188(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ENUM_ServerRegions                            K2Node_ComponentBoundEvent_Region_3;               // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_ServerCategoryRow_Button_C*          K2Node_ComponentBoundEvent_RowButton_2;            // 0x0198(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ENUM_ServerRegions                            K2Node_ComponentBoundEvent_Region_2;               // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_ServerCategoryRow_Button_C*          K2Node_ComponentBoundEvent_RowButton_1;            // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ENUM_ServerRegions                            K2Node_ComponentBoundEvent_Region_1;               // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_ServerCategoryRow_Button_C*          K2Node_ComponentBoundEvent_RowButton;              // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ENUM_ServerRegions                            K2Node_ComponentBoundEvent_Region;                 // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UW_ServerCategoryRow_Button_C*>  K2Node_MakeArray_Array;                            // 0x01C8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue_1;                     // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD_MainMenu_C*                        K2Node_DynamicCast_AsHUD_Main_Menu_1;              // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F2[0x2];                                      // 0x01F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x01F4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x0204(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x0214(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_2;            // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival_2;                // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_1;                // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue_2;                     // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUD_MainMenu_C*                        K2Node_DynamicCast_AsHUD_Main_Menu_2;              // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default;                             // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x026A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26B[0x5];                                      // 0x026B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result_1; // 0x0288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue_1; // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_299[0x3];                                      // 0x0299(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_11;           // 0x029C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_1;  // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1; // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x3];                                      // 0x02C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_12;           // 0x02C4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_2;  // 0x02D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_2; // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Check_Is_Server_Full_Result;              // 0x02E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EA[0x6];                                      // 0x02EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_2;                // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Check_Is_Server_Full_Result_1;            // 0x02F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Check_Is_Server_Full_Result_2;            // 0x02FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_1;                           // 0x02FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_2;                           // 0x02FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FD[0x3];                                      // 0x02FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ServerCell_C*                      CallFunc_GetSelectedServer_SelectedServer;         // 0x0300(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSelected_bSelected;                    // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_3;                // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x0318(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_5;        // 0x0320(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_3;            // 0x0328(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival_3;                // 0x0330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_4;            // 0x0340(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival_4;                // 0x0348(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_5;            // 0x0358(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival_5;                // 0x0360(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen) == 0x000008, "Wrong alignment on WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen");
static_assert(sizeof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen) == 0x000370, "Wrong size on WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, EntryPoint) == 0x000000, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, K2Node_DynamicCast_AsGI_Survival) == 0x000010, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::K2Node_DynamicCast_AsGI_Survival' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, K2Node_CreateDelegate_OutputDelegate_1) == 0x00002C, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, K2Node_CreateDelegate_OutputDelegate_2) == 0x00003C, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000050, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, K2Node_CreateDelegate_OutputDelegate_3) == 0x000058, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, Temp_bool_Variable) == 0x000068, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, Temp_bool_Variable_1) == 0x000069, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, Temp_bool_Variable_2) == 0x00006A, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, Temp_bool_Variable_3) == 0x00006B, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, Temp_bool_Variable_4) == 0x00006C, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, Temp_bool_Variable_5) == 0x00006D, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, K2Node_CreateDelegate_OutputDelegate_4) == 0x000070, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, Temp_bool_IsClosed_Variable) == 0x000080, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, CallFunc_GetGameInstance_ReturnValue_1) == 0x000088, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, K2Node_DynamicCast_AsGI_Survival_1) == 0x000090, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::K2Node_DynamicCast_AsGI_Survival_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, K2Node_DynamicCast_bSuccess_1) == 0x000098, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, CallFunc_GetActorOfClass_ReturnValue) == 0x0000A0, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, CallFunc_GetPlayerController_ReturnValue) == 0x0000A8, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, K2Node_CreateDelegate_OutputDelegate_5) == 0x0000B0, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, K2Node_CreateDelegate_OutputDelegate_6) == 0x0000C0, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, K2Node_CustomEvent_Animation) == 0x0000D0, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::K2Node_CustomEvent_Animation' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, K2Node_CustomEvent_NewState) == 0x0000D8, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::K2Node_CustomEvent_NewState' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, K2Node_CreateDelegate_OutputDelegate_7) == 0x0000DC, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, CallFunc_PlayEvent2D_ReturnValue) == 0x0000F0, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::CallFunc_PlayEvent2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, Temp_byte_Variable) == 0x0000F8, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, CallFunc_GetPlayerController_ReturnValue_1) == 0x000100, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, CallFunc_GetHUD_ReturnValue) == 0x000108, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, K2Node_DynamicCast_AsHUD_Main_Menu) == 0x000110, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::K2Node_DynamicCast_AsHUD_Main_Menu' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, K2Node_DynamicCast_bSuccess_2) == 0x000118, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, CallFunc_IsValid_ReturnValue) == 0x000119, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, CallFunc_CheckScreenTransferPossible_ReturnValue) == 0x00011A, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::CallFunc_CheckScreenTransferPossible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, Temp_bool_Has_Been_Initd_Variable) == 0x00011B, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, K2Node_Event_IsDesignTime) == 0x00011C, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, K2Node_ComponentBoundEvent_ServerInfo) == 0x000120, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::K2Node_ComponentBoundEvent_ServerInfo' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, K2Node_ComponentBoundEvent_RowButton_4) == 0x000160, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::K2Node_ComponentBoundEvent_RowButton_4' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, K2Node_ComponentBoundEvent_Region_4) == 0x000168, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::K2Node_ComponentBoundEvent_Region_4' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result) == 0x000170, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue) == 0x000178, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, CallFunc_IsValid_ReturnValue_1) == 0x000180, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, K2Node_ComponentBoundEvent_RowButton_3) == 0x000188, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::K2Node_ComponentBoundEvent_RowButton_3' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, K2Node_ComponentBoundEvent_Region_3) == 0x000190, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::K2Node_ComponentBoundEvent_Region_3' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, K2Node_ComponentBoundEvent_RowButton_2) == 0x000198, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::K2Node_ComponentBoundEvent_RowButton_2' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, K2Node_ComponentBoundEvent_Region_2) == 0x0001A0, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::K2Node_ComponentBoundEvent_Region_2' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, K2Node_ComponentBoundEvent_RowButton_1) == 0x0001A8, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::K2Node_ComponentBoundEvent_RowButton_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, K2Node_ComponentBoundEvent_Region_1) == 0x0001B0, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::K2Node_ComponentBoundEvent_Region_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, K2Node_ComponentBoundEvent_RowButton) == 0x0001B8, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::K2Node_ComponentBoundEvent_RowButton' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, K2Node_ComponentBoundEvent_Region) == 0x0001C0, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::K2Node_ComponentBoundEvent_Region' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, K2Node_MakeArray_Array) == 0x0001C8, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, CallFunc_GetPlayerController_ReturnValue_2) == 0x0001D8, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, CallFunc_GetHUD_ReturnValue_1) == 0x0001E0, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::CallFunc_GetHUD_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, K2Node_DynamicCast_AsHUD_Main_Menu_1) == 0x0001E8, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::K2Node_DynamicCast_AsHUD_Main_Menu_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, K2Node_DynamicCast_bSuccess_3) == 0x0001F0, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, Temp_byte_Variable_1) == 0x0001F1, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, K2Node_CreateDelegate_OutputDelegate_8) == 0x0001F4, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, K2Node_CreateDelegate_OutputDelegate_9) == 0x000204, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, K2Node_CreateDelegate_OutputDelegate_10) == 0x000214, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, CallFunc_GetGameInstance_ReturnValue_2) == 0x000228, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::CallFunc_GetGameInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, K2Node_DynamicCast_AsGI_Survival_2) == 0x000230, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::K2Node_DynamicCast_AsGI_Survival_2' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, K2Node_DynamicCast_bSuccess_4) == 0x000238, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, CallFunc_PlayEvent2D_ReturnValue_1) == 0x000240, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::CallFunc_PlayEvent2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, CallFunc_GetPlayerController_ReturnValue_3) == 0x000248, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, CallFunc_GetHUD_ReturnValue_2) == 0x000250, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::CallFunc_GetHUD_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, Temp_bool_Variable_6) == 0x000258, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, K2Node_DynamicCast_AsHUD_Main_Menu_2) == 0x000260, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::K2Node_DynamicCast_AsHUD_Main_Menu_2' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, K2Node_DynamicCast_bSuccess_5) == 0x000268, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, K2Node_Select_Default) == 0x000269, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, CallFunc_IsValid_ReturnValue_2) == 0x00026A, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000270, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000278, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, CallFunc_IsValid_ReturnValue_3) == 0x000280, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result_1) == 0x000288, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue_1) == 0x000290, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, CallFunc_IsValid_ReturnValue_4) == 0x000298, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen, K2Node_CreateDelegate_OutputDelegate_11) == 0x00029C, "Member 'WBP_ServerScreen_C_ExecuteUbergraph_WBP_ServerScreen::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
