#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SimpleFadeIn

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_SimpleFadeIn.WBP_SimpleFadeIn_C.ExecuteUbergraph_WBP_SimpleFadeIn
// 0x0038 (0x0038 - 0x0000)
struct WBP_SimpleFadeIn_C_ExecuteUbergraph_WBP_SimpleFadeIn final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Show;                           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default;                             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SimpleFadeIn_C_ExecuteUbergraph_WBP_SimpleFadeIn) == 0x000008, "Wrong alignment on WBP_SimpleFadeIn_C_ExecuteUbergraph_WBP_SimpleFadeIn");
static_assert(sizeof(WBP_SimpleFadeIn_C_ExecuteUbergraph_WBP_SimpleFadeIn) == 0x000038, "Wrong size on WBP_SimpleFadeIn_C_ExecuteUbergraph_WBP_SimpleFadeIn");
static_assert(offsetof(WBP_SimpleFadeIn_C_ExecuteUbergraph_WBP_SimpleFadeIn, EntryPoint) == 0x000000, "Member 'WBP_SimpleFadeIn_C_ExecuteUbergraph_WBP_SimpleFadeIn::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SimpleFadeIn_C_ExecuteUbergraph_WBP_SimpleFadeIn, Temp_bool_Variable) == 0x000004, "Member 'WBP_SimpleFadeIn_C_ExecuteUbergraph_WBP_SimpleFadeIn::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SimpleFadeIn_C_ExecuteUbergraph_WBP_SimpleFadeIn, Temp_byte_Variable) == 0x000005, "Member 'WBP_SimpleFadeIn_C_ExecuteUbergraph_WBP_SimpleFadeIn::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SimpleFadeIn_C_ExecuteUbergraph_WBP_SimpleFadeIn, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_SimpleFadeIn_C_ExecuteUbergraph_WBP_SimpleFadeIn::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_SimpleFadeIn_C_ExecuteUbergraph_WBP_SimpleFadeIn, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_SimpleFadeIn_C_ExecuteUbergraph_WBP_SimpleFadeIn::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_SimpleFadeIn_C_ExecuteUbergraph_WBP_SimpleFadeIn, K2Node_CustomEvent_Show) == 0x000018, "Member 'WBP_SimpleFadeIn_C_ExecuteUbergraph_WBP_SimpleFadeIn::K2Node_CustomEvent_Show' has a wrong offset!");
static_assert(offsetof(WBP_SimpleFadeIn_C_ExecuteUbergraph_WBP_SimpleFadeIn, K2Node_Select_Default) == 0x000019, "Member 'WBP_SimpleFadeIn_C_ExecuteUbergraph_WBP_SimpleFadeIn::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_SimpleFadeIn_C_ExecuteUbergraph_WBP_SimpleFadeIn, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000020, "Member 'WBP_SimpleFadeIn_C_ExecuteUbergraph_WBP_SimpleFadeIn::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_SimpleFadeIn_C_ExecuteUbergraph_WBP_SimpleFadeIn, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000028, "Member 'WBP_SimpleFadeIn_C_ExecuteUbergraph_WBP_SimpleFadeIn::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SimpleFadeIn_C_ExecuteUbergraph_WBP_SimpleFadeIn, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'WBP_SimpleFadeIn_C_ExecuteUbergraph_WBP_SimpleFadeIn::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_SimpleFadeIn.WBP_SimpleFadeIn_C.OnFadeIn__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_SimpleFadeIn_C_OnFadeIn__DelegateSignature final
{
public:
	bool                                          Showed;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SimpleFadeIn_C_OnFadeIn__DelegateSignature) == 0x000001, "Wrong alignment on WBP_SimpleFadeIn_C_OnFadeIn__DelegateSignature");
static_assert(sizeof(WBP_SimpleFadeIn_C_OnFadeIn__DelegateSignature) == 0x000001, "Wrong size on WBP_SimpleFadeIn_C_OnFadeIn__DelegateSignature");
static_assert(offsetof(WBP_SimpleFadeIn_C_OnFadeIn__DelegateSignature, Showed) == 0x000000, "Member 'WBP_SimpleFadeIn_C_OnFadeIn__DelegateSignature::Showed' has a wrong offset!");

// Function WBP_SimpleFadeIn.WBP_SimpleFadeIn_C.ShowFadeIn
// 0x0001 (0x0001 - 0x0000)
struct WBP_SimpleFadeIn_C_ShowFadeIn final
{
public:
	bool                                          Show;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SimpleFadeIn_C_ShowFadeIn) == 0x000001, "Wrong alignment on WBP_SimpleFadeIn_C_ShowFadeIn");
static_assert(sizeof(WBP_SimpleFadeIn_C_ShowFadeIn) == 0x000001, "Wrong size on WBP_SimpleFadeIn_C_ShowFadeIn");
static_assert(offsetof(WBP_SimpleFadeIn_C_ShowFadeIn, Show) == 0x000000, "Member 'WBP_SimpleFadeIn_C_ShowFadeIn::Show' has a wrong offset!");

}

