#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LootItem

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FItemInfo_structs.hpp"


namespace SDK::Params
{

// Function WBP_LootItem.WBP_LootItem_C.ExecuteUbergraph_WBP_LootItem
// 0x0530 (0x0530 - 0x0000)
struct WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPaperSprite*                           K2Node_DynamicCast_AsPaper_Sprite;                 // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry_1;                         // 0x002C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFItemInfo                             K2Node_CustomEvent_ItemData;                       // 0x0070(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A2[0x6];                                      // 0x02A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPaperSprite*                           K2Node_Select_Default;                             // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            CallFunc_MakeBrushFromSprite_ReturnValue;          // 0x02B0(0x00D0)()
	double                                        CallFunc_BreakVector2D_X;                          // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x03A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x03C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x03D8(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0410(0x0078)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x0488(0x0078)(ConstParm)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0500(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0508(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0511(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0512(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Equip_Item_Equipped;                      // 0x0513(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_514[0x4];                                      // 0x0514(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJSI_Slot_C*                            CallFunc_Equip_Item_SlotItemRef;                   // 0x0518(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_BreakVector2D_InVec_ImplicitCast;         // 0x0520(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem) == 0x000010, "Wrong alignment on WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem");
static_assert(sizeof(WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem) == 0x000530, "Wrong size on WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem");
static_assert(offsetof(WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem, EntryPoint) == 0x000000, "Member 'WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem, Temp_object_Variable) == 0x000008, "Member 'WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem, K2Node_DynamicCast_AsPaper_Sprite) == 0x000020, "Member 'WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem::K2Node_DynamicCast_AsPaper_Sprite' has a wrong offset!");
static_assert(offsetof(WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem, K2Node_Event_MyGeometry_1) == 0x00002C, "Member 'WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem::K2Node_Event_MyGeometry_1' has a wrong offset!");
static_assert(offsetof(WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem, K2Node_Event_InDeltaTime) == 0x000064, "Member 'WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem, K2Node_CustomEvent_Loaded) == 0x000068, "Member 'WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem, K2Node_CustomEvent_ItemData) == 0x000070, "Member 'WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem::K2Node_CustomEvent_ItemData' has a wrong offset!");
static_assert(offsetof(WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem, CallFunc_PlayAnimationForward_ReturnValue) == 0x000290, "Member 'WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000298, "Member 'WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem, Temp_bool_Variable) == 0x0002A0, "Member 'WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem, CallFunc_IsValid_ReturnValue) == 0x0002A1, "Member 'WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem, K2Node_Select_Default) == 0x0002A8, "Member 'WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem, CallFunc_MakeBrushFromSprite_ReturnValue) == 0x0002B0, "Member 'WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem::CallFunc_MakeBrushFromSprite_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem, CallFunc_BreakVector2D_X) == 0x000380, "Member 'WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem, CallFunc_BreakVector2D_Y) == 0x000388, "Member 'WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000390, "Member 'WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000398, "Member 'WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0003A0, "Member 'WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem, CallFunc_MakeVector2D_ReturnValue) == 0x0003A8, "Member 'WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x0003B8, "Member 'WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0003C0, "Member 'WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem, CallFunc_MakeVector2D_ReturnValue_1) == 0x0003C8, "Member 'WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem, K2Node_Event_MyGeometry) == 0x0003D8, "Member 'WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem, K2Node_Event_MouseEvent_1) == 0x000410, "Member 'WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem, K2Node_Event_MouseEvent) == 0x000488, "Member 'WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000500, "Member 'WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem, K2Node_DynamicCast_AsSurvival_Player) == 0x000508, "Member 'WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem, K2Node_DynamicCast_bSuccess_1) == 0x000510, "Member 'WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem, CallFunc_Not_PreBool_ReturnValue) == 0x000511, "Member 'WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem, CallFunc_Not_PreBool_ReturnValue_1) == 0x000512, "Member 'WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem, CallFunc_Equip_Item_Equipped) == 0x000513, "Member 'WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem::CallFunc_Equip_Item_Equipped' has a wrong offset!");
static_assert(offsetof(WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem, CallFunc_Equip_Item_SlotItemRef) == 0x000518, "Member 'WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem::CallFunc_Equip_Item_SlotItemRef' has a wrong offset!");
static_assert(offsetof(WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem, CallFunc_BreakVector2D_InVec_ImplicitCast) == 0x000520, "Member 'WBP_LootItem_C_ExecuteUbergraph_WBP_LootItem::CallFunc_BreakVector2D_InVec_ImplicitCast' has a wrong offset!");

// Function WBP_LootItem.WBP_LootItem_C.OnCraftingFinished__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_LootItem_C_OnCraftingFinished__DelegateSignature final
{
public:
	class UWBP_CraftItem_C*                       Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LootItem_C_OnCraftingFinished__DelegateSignature) == 0x000008, "Wrong alignment on WBP_LootItem_C_OnCraftingFinished__DelegateSignature");
static_assert(sizeof(WBP_LootItem_C_OnCraftingFinished__DelegateSignature) == 0x000008, "Wrong size on WBP_LootItem_C_OnCraftingFinished__DelegateSignature");
static_assert(offsetof(WBP_LootItem_C_OnCraftingFinished__DelegateSignature, Item) == 0x000000, "Member 'WBP_LootItem_C_OnCraftingFinished__DelegateSignature::Item' has a wrong offset!");

// Function WBP_LootItem.WBP_LootItem_C.OnDismantlingFinished__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_LootItem_C_OnDismantlingFinished__DelegateSignature final
{
public:
	class UWBP_CraftItem_C*                       Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LootItem_C_OnDismantlingFinished__DelegateSignature) == 0x000008, "Wrong alignment on WBP_LootItem_C_OnDismantlingFinished__DelegateSignature");
static_assert(sizeof(WBP_LootItem_C_OnDismantlingFinished__DelegateSignature) == 0x000008, "Wrong size on WBP_LootItem_C_OnDismantlingFinished__DelegateSignature");
static_assert(offsetof(WBP_LootItem_C_OnDismantlingFinished__DelegateSignature, Item) == 0x000000, "Member 'WBP_LootItem_C_OnDismantlingFinished__DelegateSignature::Item' has a wrong offset!");

// Function WBP_LootItem.WBP_LootItem_C.OnDragDetected
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_LootItem_C_OnDragDetected final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          PointerEvent;                                      // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UDragDropOperation*                     Operation;                                         // 0x00B0(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LootItem_C_OnDragDetected) == 0x000008, "Wrong alignment on WBP_LootItem_C_OnDragDetected");
static_assert(sizeof(WBP_LootItem_C_OnDragDetected) == 0x0000B8, "Wrong size on WBP_LootItem_C_OnDragDetected");
static_assert(offsetof(WBP_LootItem_C_OnDragDetected, MyGeometry) == 0x000000, "Member 'WBP_LootItem_C_OnDragDetected::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_LootItem_C_OnDragDetected, PointerEvent) == 0x000038, "Member 'WBP_LootItem_C_OnDragDetected::PointerEvent' has a wrong offset!");
static_assert(offsetof(WBP_LootItem_C_OnDragDetected, Operation) == 0x0000B0, "Member 'WBP_LootItem_C_OnDragDetected::Operation' has a wrong offset!");

// Function WBP_LootItem.WBP_LootItem_C.OnLoaded_FDFF71BD49C265FBDD0D8AB14B11263A
// 0x0008 (0x0008 - 0x0000)
struct WBP_LootItem_C_OnLoaded_FDFF71BD49C265FBDD0D8AB14B11263A final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LootItem_C_OnLoaded_FDFF71BD49C265FBDD0D8AB14B11263A) == 0x000008, "Wrong alignment on WBP_LootItem_C_OnLoaded_FDFF71BD49C265FBDD0D8AB14B11263A");
static_assert(sizeof(WBP_LootItem_C_OnLoaded_FDFF71BD49C265FBDD0D8AB14B11263A) == 0x000008, "Wrong size on WBP_LootItem_C_OnLoaded_FDFF71BD49C265FBDD0D8AB14B11263A");
static_assert(offsetof(WBP_LootItem_C_OnLoaded_FDFF71BD49C265FBDD0D8AB14B11263A, Loaded) == 0x000000, "Member 'WBP_LootItem_C_OnLoaded_FDFF71BD49C265FBDD0D8AB14B11263A::Loaded' has a wrong offset!");

// Function WBP_LootItem.WBP_LootItem_C.OnMouseButtonDown
// 0x0168 (0x0168 - 0x0000)
struct WBP_LootItem_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(WBP_LootItem_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on WBP_LootItem_C_OnMouseButtonDown");
static_assert(sizeof(WBP_LootItem_C_OnMouseButtonDown) == 0x000168, "Wrong size on WBP_LootItem_C_OnMouseButtonDown");
static_assert(offsetof(WBP_LootItem_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'WBP_LootItem_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_LootItem_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'WBP_LootItem_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_LootItem_C_OnMouseButtonDown, ReturnValue) == 0x0000B0, "Member 'WBP_LootItem_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");

// Function WBP_LootItem.WBP_LootItem_C.OnMouseEnter
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_LootItem_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_LootItem_C_OnMouseEnter) == 0x000008, "Wrong alignment on WBP_LootItem_C_OnMouseEnter");
static_assert(sizeof(WBP_LootItem_C_OnMouseEnter) == 0x0000B0, "Wrong size on WBP_LootItem_C_OnMouseEnter");
static_assert(offsetof(WBP_LootItem_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'WBP_LootItem_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_LootItem_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'WBP_LootItem_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function WBP_LootItem.WBP_LootItem_C.OnMouseLeave
// 0x0078 (0x0078 - 0x0000)
struct WBP_LootItem_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_LootItem_C_OnMouseLeave) == 0x000008, "Wrong alignment on WBP_LootItem_C_OnMouseLeave");
static_assert(sizeof(WBP_LootItem_C_OnMouseLeave) == 0x000078, "Wrong size on WBP_LootItem_C_OnMouseLeave");
static_assert(offsetof(WBP_LootItem_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'WBP_LootItem_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function WBP_LootItem.WBP_LootItem_C.OnNotEnoughtInventorySpace__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_LootItem_C_OnNotEnoughtInventorySpace__DelegateSignature final
{
public:
	class UWBP_CraftItem_C*                       Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LootItem_C_OnNotEnoughtInventorySpace__DelegateSignature) == 0x000008, "Wrong alignment on WBP_LootItem_C_OnNotEnoughtInventorySpace__DelegateSignature");
static_assert(sizeof(WBP_LootItem_C_OnNotEnoughtInventorySpace__DelegateSignature) == 0x000008, "Wrong size on WBP_LootItem_C_OnNotEnoughtInventorySpace__DelegateSignature");
static_assert(offsetof(WBP_LootItem_C_OnNotEnoughtInventorySpace__DelegateSignature, Item) == 0x000000, "Member 'WBP_LootItem_C_OnNotEnoughtInventorySpace__DelegateSignature::Item' has a wrong offset!");

// Function WBP_LootItem.WBP_LootItem_C.OnNotEnoughtResources__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_LootItem_C_OnNotEnoughtResources__DelegateSignature final
{
public:
	class UWBP_CraftItem_C*                       Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LootItem_C_OnNotEnoughtResources__DelegateSignature) == 0x000008, "Wrong alignment on WBP_LootItem_C_OnNotEnoughtResources__DelegateSignature");
static_assert(sizeof(WBP_LootItem_C_OnNotEnoughtResources__DelegateSignature) == 0x000008, "Wrong size on WBP_LootItem_C_OnNotEnoughtResources__DelegateSignature");
static_assert(offsetof(WBP_LootItem_C_OnNotEnoughtResources__DelegateSignature, Item) == 0x000000, "Member 'WBP_LootItem_C_OnNotEnoughtResources__DelegateSignature::Item' has a wrong offset!");

// Function WBP_LootItem.WBP_LootItem_C.OnSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_LootItem_C_OnSelected__DelegateSignature final
{
public:
	class UWBP_LootItem_C*                        Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LootItem_C_OnSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_LootItem_C_OnSelected__DelegateSignature");
static_assert(sizeof(WBP_LootItem_C_OnSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_LootItem_C_OnSelected__DelegateSignature");
static_assert(offsetof(WBP_LootItem_C_OnSelected__DelegateSignature, Item) == 0x000000, "Member 'WBP_LootItem_C_OnSelected__DelegateSignature::Item' has a wrong offset!");

// Function WBP_LootItem.WBP_LootItem_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_LootItem_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LootItem_C_Tick) == 0x000004, "Wrong alignment on WBP_LootItem_C_Tick");
static_assert(sizeof(WBP_LootItem_C_Tick) == 0x00003C, "Wrong size on WBP_LootItem_C_Tick");
static_assert(offsetof(WBP_LootItem_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_LootItem_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_LootItem_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_LootItem_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_LootItem.WBP_LootItem_C.UpdateCount
// 0x0530 (0x0530 - 0x0000)
struct WBP_LootItem_C_UpdateCount final
{
public:
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_1;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_2;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_3;          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            CallFunc_MakeBrushFromSprite_ReturnValue;          // 0x0030(0x00D0)()
	struct FSlateBrush                            CallFunc_MakeBrushFromSprite_ReturnValue_1;        // 0x0100(0x00D0)()
	struct FSlateBrush                            CallFunc_MakeBrushFromSprite_ReturnValue_2;        // 0x01D0(0x00D0)()
	struct FSlateBrush                            CallFunc_MakeBrushFromSprite_ReturnValue_3;        // 0x02A0(0x00D0)()
	struct FSlateBrush                            CallFunc_MakeBrushFromSprite_ReturnValue_4;        // 0x0370(0x00D0)()
	struct FSlateBrush                            CallFunc_MakeBrushFromSprite_ReturnValue_5;        // 0x0440(0x00D0)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_511[0x7];                                      // 0x0511(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0518(0x0018)()
};
static_assert(alignof(WBP_LootItem_C_UpdateCount) == 0x000010, "Wrong alignment on WBP_LootItem_C_UpdateCount");
static_assert(sizeof(WBP_LootItem_C_UpdateCount) == 0x000530, "Wrong size on WBP_LootItem_C_UpdateCount");
static_assert(offsetof(WBP_LootItem_C_UpdateCount, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000000, "Member 'WBP_LootItem_C_UpdateCount::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LootItem_C_UpdateCount, K2Node_MakeStruct_Margin) == 0x000008, "Member 'WBP_LootItem_C_UpdateCount::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_LootItem_C_UpdateCount, CallFunc_SlotAsOverlaySlot_ReturnValue_1) == 0x000018, "Member 'WBP_LootItem_C_UpdateCount::CallFunc_SlotAsOverlaySlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LootItem_C_UpdateCount, CallFunc_SlotAsOverlaySlot_ReturnValue_2) == 0x000020, "Member 'WBP_LootItem_C_UpdateCount::CallFunc_SlotAsOverlaySlot_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_LootItem_C_UpdateCount, CallFunc_SlotAsOverlaySlot_ReturnValue_3) == 0x000028, "Member 'WBP_LootItem_C_UpdateCount::CallFunc_SlotAsOverlaySlot_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_LootItem_C_UpdateCount, CallFunc_MakeBrushFromSprite_ReturnValue) == 0x000030, "Member 'WBP_LootItem_C_UpdateCount::CallFunc_MakeBrushFromSprite_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LootItem_C_UpdateCount, CallFunc_MakeBrushFromSprite_ReturnValue_1) == 0x000100, "Member 'WBP_LootItem_C_UpdateCount::CallFunc_MakeBrushFromSprite_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LootItem_C_UpdateCount, CallFunc_MakeBrushFromSprite_ReturnValue_2) == 0x0001D0, "Member 'WBP_LootItem_C_UpdateCount::CallFunc_MakeBrushFromSprite_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_LootItem_C_UpdateCount, CallFunc_MakeBrushFromSprite_ReturnValue_3) == 0x0002A0, "Member 'WBP_LootItem_C_UpdateCount::CallFunc_MakeBrushFromSprite_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_LootItem_C_UpdateCount, CallFunc_MakeBrushFromSprite_ReturnValue_4) == 0x000370, "Member 'WBP_LootItem_C_UpdateCount::CallFunc_MakeBrushFromSprite_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_LootItem_C_UpdateCount, CallFunc_MakeBrushFromSprite_ReturnValue_5) == 0x000440, "Member 'WBP_LootItem_C_UpdateCount::CallFunc_MakeBrushFromSprite_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_LootItem_C_UpdateCount, CallFunc_Greater_IntInt_ReturnValue) == 0x000510, "Member 'WBP_LootItem_C_UpdateCount::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LootItem_C_UpdateCount, CallFunc_Conv_IntToText_ReturnValue) == 0x000518, "Member 'WBP_LootItem_C_UpdateCount::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function WBP_LootItem.WBP_LootItem_C.UpdateItemData
// 0x0220 (0x0220 - 0x0000)
struct WBP_LootItem_C_UpdateItemData final
{
public:
	struct FFItemInfo                             Param_ItemData;                                    // 0x0000(0x0220)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LootItem_C_UpdateItemData) == 0x000008, "Wrong alignment on WBP_LootItem_C_UpdateItemData");
static_assert(sizeof(WBP_LootItem_C_UpdateItemData) == 0x000220, "Wrong size on WBP_LootItem_C_UpdateItemData");
static_assert(offsetof(WBP_LootItem_C_UpdateItemData, Param_ItemData) == 0x000000, "Member 'WBP_LootItem_C_UpdateItemData::Param_ItemData' has a wrong offset!");

}

