#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TutorialObjective

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FMODStudio_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_TutorialObjective.WBP_TutorialObjective_C.ExecuteUbergraph_WBP_TutorialObjective
// 0x0118 (0x0118 - 0x0000)
struct WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_SurvPC_C>         CallFunc_GetQuestComponents_self_CastInput;        // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQuestComponent*                        CallFunc_GetQuestComponents_Quest;                 // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UQuestTrackerComponent*                 CallFunc_GetQuestComponents_QuestTracker;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UQuestComponent*                        K2Node_CustomEvent_QuestComponent;                 // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UQuestContext*                          K2Node_CustomEvent_Context;                        // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvPC_C*                              K2Node_DynamicCast_AsSurv_PC;                      // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UQuest*                                 CallFunc_GetQuestAsset_ReturnValue;                // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UQuestComponent* QuestComponent, class UQuestContext* Context)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x006C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC;                  // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      CallFunc_GetPlayerRef_SurvivalPlayer;              // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x2];                                       // 0x00A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x00A4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00B4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x00C4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_Contains_ReturnValue;                 // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00D6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D7[0x1];                                       // 0x00D7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_GameHUD_C>        K2Node_DynamicCast_AsBPI_Game_HUD;                 // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Workbench_C*                       CallFunc_GetWorkBenchWidgetRef_WorkbenchWidgetRef; // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x00FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInViewport_ReturnValue_1;               // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FF[0x1];                                       // 0x00FF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0100(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInViewport_ReturnValue_2;               // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective) == 0x000008, "Wrong alignment on WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective");
static_assert(sizeof(WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective) == 0x000118, "Wrong size on WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective");
static_assert(offsetof(WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective, EntryPoint) == 0x000000, "Member 'WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective, CallFunc_GetQuestComponents_self_CastInput) == 0x000018, "Member 'WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective::CallFunc_GetQuestComponents_self_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective, CallFunc_GetQuestComponents_Quest) == 0x000028, "Member 'WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective::CallFunc_GetQuestComponents_Quest' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective, CallFunc_GetQuestComponents_QuestTracker) == 0x000030, "Member 'WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective::CallFunc_GetQuestComponents_QuestTracker' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective, CallFunc_GetPlayerController_ReturnValue) == 0x000038, "Member 'WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective, K2Node_CustomEvent_QuestComponent) == 0x000040, "Member 'WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective::K2Node_CustomEvent_QuestComponent' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective, K2Node_CustomEvent_Context) == 0x000048, "Member 'WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective::K2Node_CustomEvent_Context' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective, K2Node_DynamicCast_AsSurv_PC) == 0x000050, "Member 'WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective::K2Node_DynamicCast_AsSurv_PC' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective, CallFunc_GetQuestAsset_ReturnValue) == 0x000060, "Member 'WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective::CallFunc_GetQuestAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000068, "Member 'WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective, K2Node_CreateDelegate_OutputDelegate_1) == 0x00006C, "Member 'WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective, K2Node_Event_IsDesignTime) == 0x00007C, "Member 'WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective, K2Node_DynamicCast_AsBPI_Surv_PC) == 0x000080, "Member 'WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective::K2Node_DynamicCast_AsBPI_Surv_PC' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective, K2Node_DynamicCast_bSuccess_1) == 0x000090, "Member 'WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective, CallFunc_IsValid_ReturnValue) == 0x000091, "Member 'WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective, CallFunc_GetPlayerRef_SurvivalPlayer) == 0x000098, "Member 'WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective::CallFunc_GetPlayerRef_SurvivalPlayer' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective, CallFunc_IsValid_ReturnValue_1) == 0x0000A0, "Member 'WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective, CallFunc_IsValid_ReturnValue_2) == 0x0000A1, "Member 'WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000A4, "Member 'WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000B4, "Member 'WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000C4, "Member 'WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective, CallFunc_Set_Contains_ReturnValue) == 0x0000D4, "Member 'WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective::CallFunc_Set_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective, CallFunc_IsValid_ReturnValue_3) == 0x0000D5, "Member 'WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective, CallFunc_IsValid_ReturnValue_4) == 0x0000D6, "Member 'WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective, K2Node_DynamicCast_AsBPI_Game_HUD) == 0x0000D8, "Member 'WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective::K2Node_DynamicCast_AsBPI_Game_HUD' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective, K2Node_DynamicCast_bSuccess_2) == 0x0000E8, "Member 'WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective, CallFunc_GetWorkBenchWidgetRef_WorkbenchWidgetRef) == 0x0000F0, "Member 'WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective::CallFunc_GetWorkBenchWidgetRef_WorkbenchWidgetRef' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective, CallFunc_IsValid_ReturnValue_5) == 0x0000F8, "Member 'WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective, CallFunc_IsInViewport_ReturnValue) == 0x0000F9, "Member 'WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective::CallFunc_IsInViewport_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective, CallFunc_BooleanOR_ReturnValue) == 0x0000FA, "Member 'WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective, CallFunc_BooleanOR_ReturnValue_1) == 0x0000FB, "Member 'WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective, CallFunc_Not_PreBool_ReturnValue) == 0x0000FC, "Member 'WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective, CallFunc_IsInViewport_ReturnValue_1) == 0x0000FD, "Member 'WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective::CallFunc_IsInViewport_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective, CallFunc_BooleanAND_ReturnValue) == 0x0000FE, "Member 'WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective, K2Node_CreateDelegate_OutputDelegate_5) == 0x000100, "Member 'WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective, CallFunc_IsInViewport_ReturnValue_2) == 0x000110, "Member 'WBP_TutorialObjective_C_ExecuteUbergraph_WBP_TutorialObjective::CallFunc_IsInViewport_ReturnValue_2' has a wrong offset!");

// Function WBP_TutorialObjective.WBP_TutorialObjective_C.InstantHide
// 0x0010 (0x0010 - 0x0000)
struct WBP_TutorialObjective_C_InstantHide final
{
public:
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_TutorialObjective_C_InstantHide) == 0x000004, "Wrong alignment on WBP_TutorialObjective_C_InstantHide");
static_assert(sizeof(WBP_TutorialObjective_C_InstantHide) == 0x000010, "Wrong size on WBP_TutorialObjective_C_InstantHide");
static_assert(offsetof(WBP_TutorialObjective_C_InstantHide, K2Node_MakeStruct_Margin) == 0x000000, "Member 'WBP_TutorialObjective_C_InstantHide::K2Node_MakeStruct_Margin' has a wrong offset!");

// Function WBP_TutorialObjective.WBP_TutorialObjective_C.IsEqualBothText
// 0x0004 (0x0004 - 0x0000)
struct WBP_TutorialObjective_C_IsEqualBothText final
{
public:
	bool                                          IsEqual;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue_1;        // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TutorialObjective_C_IsEqualBothText) == 0x000001, "Wrong alignment on WBP_TutorialObjective_C_IsEqualBothText");
static_assert(sizeof(WBP_TutorialObjective_C_IsEqualBothText) == 0x000004, "Wrong size on WBP_TutorialObjective_C_IsEqualBothText");
static_assert(offsetof(WBP_TutorialObjective_C_IsEqualBothText, IsEqual) == 0x000000, "Member 'WBP_TutorialObjective_C_IsEqualBothText::IsEqual' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_IsEqualBothText, CallFunc_EqualEqual_TextText_ReturnValue) == 0x000001, "Member 'WBP_TutorialObjective_C_IsEqualBothText::CallFunc_EqualEqual_TextText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_IsEqualBothText, CallFunc_EqualEqual_TextText_ReturnValue_1) == 0x000002, "Member 'WBP_TutorialObjective_C_IsEqualBothText::CallFunc_EqualEqual_TextText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_IsEqualBothText, CallFunc_BooleanAND_ReturnValue) == 0x000003, "Member 'WBP_TutorialObjective_C_IsEqualBothText::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_TutorialObjective.WBP_TutorialObjective_C.OnQuestContextCreated_Event
// 0x0010 (0x0010 - 0x0000)
struct WBP_TutorialObjective_C_OnQuestContextCreated_Event final
{
public:
	class UQuestComponent*                        QuestComponent;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UQuestContext*                          Param_Context;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TutorialObjective_C_OnQuestContextCreated_Event) == 0x000008, "Wrong alignment on WBP_TutorialObjective_C_OnQuestContextCreated_Event");
static_assert(sizeof(WBP_TutorialObjective_C_OnQuestContextCreated_Event) == 0x000010, "Wrong size on WBP_TutorialObjective_C_OnQuestContextCreated_Event");
static_assert(offsetof(WBP_TutorialObjective_C_OnQuestContextCreated_Event, QuestComponent) == 0x000000, "Member 'WBP_TutorialObjective_C_OnQuestContextCreated_Event::QuestComponent' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_OnQuestContextCreated_Event, Param_Context) == 0x000008, "Member 'WBP_TutorialObjective_C_OnQuestContextCreated_Event::Param_Context' has a wrong offset!");

// Function WBP_TutorialObjective.WBP_TutorialObjective_C.OnTryShowNewTask__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_TutorialObjective_C_OnTryShowNewTask__DelegateSignature final
{
public:
	bool                                          bIsShowed;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TutorialObjective_C_OnTryShowNewTask__DelegateSignature) == 0x000001, "Wrong alignment on WBP_TutorialObjective_C_OnTryShowNewTask__DelegateSignature");
static_assert(sizeof(WBP_TutorialObjective_C_OnTryShowNewTask__DelegateSignature) == 0x000001, "Wrong size on WBP_TutorialObjective_C_OnTryShowNewTask__DelegateSignature");
static_assert(offsetof(WBP_TutorialObjective_C_OnTryShowNewTask__DelegateSignature, bIsShowed) == 0x000000, "Member 'WBP_TutorialObjective_C_OnTryShowNewTask__DelegateSignature::bIsShowed' has a wrong offset!");

// Function WBP_TutorialObjective.WBP_TutorialObjective_C.ParseButton
// 0x0068 (0x0068 - 0x0000)
struct WBP_TutorialObjective_C_ParseButton final
{
public:
	class FText                                   OriginalText;                                      // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   ParsedText;                                        // 0x0018(0x0018)(Parm, OutParm)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue;                      // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0050(0x0018)()
};
static_assert(alignof(WBP_TutorialObjective_C_ParseButton) == 0x000008, "Wrong alignment on WBP_TutorialObjective_C_ParseButton");
static_assert(sizeof(WBP_TutorialObjective_C_ParseButton) == 0x000068, "Wrong size on WBP_TutorialObjective_C_ParseButton");
static_assert(offsetof(WBP_TutorialObjective_C_ParseButton, OriginalText) == 0x000000, "Member 'WBP_TutorialObjective_C_ParseButton::OriginalText' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ParseButton, ParsedText) == 0x000018, "Member 'WBP_TutorialObjective_C_ParseButton::ParsedText' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ParseButton, CallFunc_Conv_TextToString_ReturnValue) == 0x000030, "Member 'WBP_TutorialObjective_C_ParseButton::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ParseButton, CallFunc_Replace_ReturnValue) == 0x000040, "Member 'WBP_TutorialObjective_C_ParseButton::CallFunc_Replace_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ParseButton, CallFunc_Conv_StringToText_ReturnValue) == 0x000050, "Member 'WBP_TutorialObjective_C_ParseButton::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WBP_TutorialObjective.WBP_TutorialObjective_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_TutorialObjective_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TutorialObjective_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_TutorialObjective_C_PreConstruct");
static_assert(sizeof(WBP_TutorialObjective_C_PreConstruct) == 0x000001, "Wrong size on WBP_TutorialObjective_C_PreConstruct");
static_assert(offsetof(WBP_TutorialObjective_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_TutorialObjective_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_TutorialObjective.WBP_TutorialObjective_C.SetQuestText
// 0x0080 (0x0080 - 0x0000)
struct WBP_TutorialObjective_C_SetQuestText final
{
public:
	bool                                          WasTextEmpty;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue_1;                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0008(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0058(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0068(0x0018)()
};
static_assert(alignof(WBP_TutorialObjective_C_SetQuestText) == 0x000008, "Wrong alignment on WBP_TutorialObjective_C_SetQuestText");
static_assert(sizeof(WBP_TutorialObjective_C_SetQuestText) == 0x000080, "Wrong size on WBP_TutorialObjective_C_SetQuestText");
static_assert(offsetof(WBP_TutorialObjective_C_SetQuestText, WasTextEmpty) == 0x000000, "Member 'WBP_TutorialObjective_C_SetQuestText::WasTextEmpty' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_SetQuestText, CallFunc_TextIsEmpty_ReturnValue) == 0x000001, "Member 'WBP_TutorialObjective_C_SetQuestText::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_SetQuestText, CallFunc_TextIsEmpty_ReturnValue_1) == 0x000002, "Member 'WBP_TutorialObjective_C_SetQuestText::CallFunc_TextIsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_SetQuestText, CallFunc_BooleanOR_ReturnValue) == 0x000003, "Member 'WBP_TutorialObjective_C_SetQuestText::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_SetQuestText, K2Node_MakeStruct_FormatArgumentData) == 0x000008, "Member 'WBP_TutorialObjective_C_SetQuestText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_SetQuestText, K2Node_MakeArray_Array) == 0x000058, "Member 'WBP_TutorialObjective_C_SetQuestText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_SetQuestText, CallFunc_Format_ReturnValue) == 0x000068, "Member 'WBP_TutorialObjective_C_SetQuestText::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WBP_TutorialObjective.WBP_TutorialObjective_C.ShowByCachedInfo
// 0x0110 (0x0110 - 0x0000)
struct WBP_TutorialObjective_C_ShowByCachedInfo final
{
public:
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0000(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0060(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0078(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x00C8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x00D8(0x0018)()
	bool                                          CallFunc_Set_Contains_ReturnValue;                 // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F2[0x6];                                       // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default;                             // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_TutorialObjective_C_ShowByCachedInfo) == 0x000008, "Wrong alignment on WBP_TutorialObjective_C_ShowByCachedInfo");
static_assert(sizeof(WBP_TutorialObjective_C_ShowByCachedInfo) == 0x000110, "Wrong size on WBP_TutorialObjective_C_ShowByCachedInfo");
static_assert(offsetof(WBP_TutorialObjective_C_ShowByCachedInfo, K2Node_MakeStruct_FormatArgumentData) == 0x000000, "Member 'WBP_TutorialObjective_C_ShowByCachedInfo::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ShowByCachedInfo, K2Node_MakeArray_Array) == 0x000050, "Member 'WBP_TutorialObjective_C_ShowByCachedInfo::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ShowByCachedInfo, CallFunc_Format_ReturnValue) == 0x000060, "Member 'WBP_TutorialObjective_C_ShowByCachedInfo::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ShowByCachedInfo, K2Node_MakeStruct_FormatArgumentData_1) == 0x000078, "Member 'WBP_TutorialObjective_C_ShowByCachedInfo::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ShowByCachedInfo, K2Node_MakeArray_Array_1) == 0x0000C8, "Member 'WBP_TutorialObjective_C_ShowByCachedInfo::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ShowByCachedInfo, CallFunc_Format_ReturnValue_1) == 0x0000D8, "Member 'WBP_TutorialObjective_C_ShowByCachedInfo::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ShowByCachedInfo, CallFunc_Set_Contains_ReturnValue) == 0x0000F0, "Member 'WBP_TutorialObjective_C_ShowByCachedInfo::CallFunc_Set_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ShowByCachedInfo, Temp_bool_Variable) == 0x0000F1, "Member 'WBP_TutorialObjective_C_ShowByCachedInfo::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ShowByCachedInfo, K2Node_Select_Default) == 0x0000F8, "Member 'WBP_TutorialObjective_C_ShowByCachedInfo::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ShowByCachedInfo, CallFunc_PlayAnimation_ReturnValue) == 0x000100, "Member 'WBP_TutorialObjective_C_ShowByCachedInfo::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ShowByCachedInfo, CallFunc_PlayEvent2D_ReturnValue) == 0x000108, "Member 'WBP_TutorialObjective_C_ShowByCachedInfo::CallFunc_PlayEvent2D_ReturnValue' has a wrong offset!");

// Function WBP_TutorialObjective.WBP_TutorialObjective_C.ShowGeneralObjective
// 0x0078 (0x0078 - 0x0000)
struct WBP_TutorialObjective_C_ShowGeneralObjective final
{
public:
	bool                                          Show;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Param_QuestName;                                   // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Param_MessageText;                                 // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC;                  // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      CallFunc_GetPlayerRef_SurvivalPlayer;              // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0064(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TutorialObjective_C_ShowGeneralObjective) == 0x000008, "Wrong alignment on WBP_TutorialObjective_C_ShowGeneralObjective");
static_assert(sizeof(WBP_TutorialObjective_C_ShowGeneralObjective) == 0x000078, "Wrong size on WBP_TutorialObjective_C_ShowGeneralObjective");
static_assert(offsetof(WBP_TutorialObjective_C_ShowGeneralObjective, Show) == 0x000000, "Member 'WBP_TutorialObjective_C_ShowGeneralObjective::Show' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ShowGeneralObjective, Param_QuestName) == 0x000008, "Member 'WBP_TutorialObjective_C_ShowGeneralObjective::Param_QuestName' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ShowGeneralObjective, Param_MessageText) == 0x000020, "Member 'WBP_TutorialObjective_C_ShowGeneralObjective::Param_MessageText' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ShowGeneralObjective, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'WBP_TutorialObjective_C_ShowGeneralObjective::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ShowGeneralObjective, K2Node_DynamicCast_AsBPI_Surv_PC) == 0x000040, "Member 'WBP_TutorialObjective_C_ShowGeneralObjective::K2Node_DynamicCast_AsBPI_Surv_PC' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ShowGeneralObjective, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'WBP_TutorialObjective_C_ShowGeneralObjective::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ShowGeneralObjective, CallFunc_GetPlayerRef_SurvivalPlayer) == 0x000058, "Member 'WBP_TutorialObjective_C_ShowGeneralObjective::CallFunc_GetPlayerRef_SurvivalPlayer' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ShowGeneralObjective, CallFunc_IsValid_ReturnValue_1) == 0x000060, "Member 'WBP_TutorialObjective_C_ShowGeneralObjective::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ShowGeneralObjective, CallFunc_IsValid_ReturnValue_2) == 0x000061, "Member 'WBP_TutorialObjective_C_ShowGeneralObjective::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ShowGeneralObjective, K2Node_CreateDelegate_OutputDelegate) == 0x000064, "Member 'WBP_TutorialObjective_C_ShowGeneralObjective::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ShowGeneralObjective, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000074, "Member 'WBP_TutorialObjective_C_ShowGeneralObjective::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function WBP_TutorialObjective.WBP_TutorialObjective_C.ShowTutorialObjective
// 0x0050 (0x0050 - 0x0000)
struct WBP_TutorialObjective_C_ShowTutorialObjective final
{
public:
	bool                                          Show;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Param_QuestName;                                   // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Param_MessageText;                                 // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue;              // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TutorialObjective_C_ShowTutorialObjective) == 0x000008, "Wrong alignment on WBP_TutorialObjective_C_ShowTutorialObjective");
static_assert(sizeof(WBP_TutorialObjective_C_ShowTutorialObjective) == 0x000050, "Wrong size on WBP_TutorialObjective_C_ShowTutorialObjective");
static_assert(offsetof(WBP_TutorialObjective_C_ShowTutorialObjective, Show) == 0x000000, "Member 'WBP_TutorialObjective_C_ShowTutorialObjective::Show' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ShowTutorialObjective, Param_QuestName) == 0x000008, "Member 'WBP_TutorialObjective_C_ShowTutorialObjective::Param_QuestName' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ShowTutorialObjective, Param_MessageText) == 0x000020, "Member 'WBP_TutorialObjective_C_ShowTutorialObjective::Param_MessageText' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ShowTutorialObjective, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'WBP_TutorialObjective_C_ShowTutorialObjective::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ShowTutorialObjective, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'WBP_TutorialObjective_C_ShowTutorialObjective::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ShowTutorialObjective, CallFunc_IsValid_ReturnValue_1) == 0x000049, "Member 'WBP_TutorialObjective_C_ShowTutorialObjective::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ShowTutorialObjective, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x00004A, "Member 'WBP_TutorialObjective_C_ShowTutorialObjective::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ShowTutorialObjective, CallFunc_IsValid_ReturnValue_2) == 0x00004B, "Member 'WBP_TutorialObjective_C_ShowTutorialObjective::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ShowTutorialObjective, CallFunc_NotEqual_StrStr_ReturnValue) == 0x00004C, "Member 'WBP_TutorialObjective_C_ShowTutorialObjective::CallFunc_NotEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_ShowTutorialObjective, CallFunc_BooleanOR_ReturnValue) == 0x00004D, "Member 'WBP_TutorialObjective_C_ShowTutorialObjective::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function WBP_TutorialObjective.WBP_TutorialObjective_C.Unbind
// 0x0090 (0x0090 - 0x0000)
struct WBP_TutorialObjective_C_Unbind final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_GameHUD_C>        K2Node_DynamicCast_AsBPI_Game_HUD;                 // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Workbench_C*                       CallFunc_GetWorkBenchWidgetRef_WorkbenchWidgetRef; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0070(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0080(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TutorialObjective_C_Unbind) == 0x000008, "Wrong alignment on WBP_TutorialObjective_C_Unbind");
static_assert(sizeof(WBP_TutorialObjective_C_Unbind) == 0x000090, "Wrong size on WBP_TutorialObjective_C_Unbind");
static_assert(offsetof(WBP_TutorialObjective_C_Unbind, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_TutorialObjective_C_Unbind::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_Unbind, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'WBP_TutorialObjective_C_Unbind::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialObjective_C_Unbind, CallFunc_GetHUD_ReturnValue) == 0x000018, "Member 'WBP_TutorialObjective_C_Unbind::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
