#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BaseMessage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WE_MessageTypes_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_BaseMessage.WBP_BaseMessage_C
// 0x00B0 (0x0330 - 0x0280)
class UWBP_BaseMessage_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FillingProgressBar;                                // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ToggleWidget;                                      // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_Time;                                  // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Text;                                         // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Type;                                         // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EWE_MessageTypes                              MessageType;                                       // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EWE_MessageTypes, class FText>           MessageTypeLocalization;                           // 0x02B8(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly)
	class FText                                   MessageText;                                       // 0x0308(0x0018)(Edit, BlueprintVisible)
	double                                        MessageDefaultDuration;                            // 0x0320(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          VisibilityWidget;                                  // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_BaseMessage(int32 EntryPoint);
	void OnPushMessage(EWE_MessageTypes Type, const class FText& Text, double Duration);
	void OnResetMessage();
	void OnToggleVisibility();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_BaseMessage_C">();
	}
	static class UWBP_BaseMessage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_BaseMessage_C>();
	}
};
static_assert(alignof(UWBP_BaseMessage_C) == 0x000008, "Wrong alignment on UWBP_BaseMessage_C");
static_assert(sizeof(UWBP_BaseMessage_C) == 0x000330, "Wrong size on UWBP_BaseMessage_C");
static_assert(offsetof(UWBP_BaseMessage_C, UberGraphFrame) == 0x000280, "Member 'UWBP_BaseMessage_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_BaseMessage_C, FillingProgressBar) == 0x000288, "Member 'UWBP_BaseMessage_C::FillingProgressBar' has a wrong offset!");
static_assert(offsetof(UWBP_BaseMessage_C, ToggleWidget) == 0x000290, "Member 'UWBP_BaseMessage_C::ToggleWidget' has a wrong offset!");
static_assert(offsetof(UWBP_BaseMessage_C, ProgressBar_Time) == 0x000298, "Member 'UWBP_BaseMessage_C::ProgressBar_Time' has a wrong offset!");
static_assert(offsetof(UWBP_BaseMessage_C, Text_Text) == 0x0002A0, "Member 'UWBP_BaseMessage_C::Text_Text' has a wrong offset!");
static_assert(offsetof(UWBP_BaseMessage_C, Text_Type) == 0x0002A8, "Member 'UWBP_BaseMessage_C::Text_Type' has a wrong offset!");
static_assert(offsetof(UWBP_BaseMessage_C, MessageType) == 0x0002B0, "Member 'UWBP_BaseMessage_C::MessageType' has a wrong offset!");
static_assert(offsetof(UWBP_BaseMessage_C, MessageTypeLocalization) == 0x0002B8, "Member 'UWBP_BaseMessage_C::MessageTypeLocalization' has a wrong offset!");
static_assert(offsetof(UWBP_BaseMessage_C, MessageText) == 0x000308, "Member 'UWBP_BaseMessage_C::MessageText' has a wrong offset!");
static_assert(offsetof(UWBP_BaseMessage_C, MessageDefaultDuration) == 0x000320, "Member 'UWBP_BaseMessage_C::MessageDefaultDuration' has a wrong offset!");
static_assert(offsetof(UWBP_BaseMessage_C, VisibilityWidget) == 0x000328, "Member 'UWBP_BaseMessage_C::VisibilityWidget' has a wrong offset!");

}

