#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CraftErrorMessage

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_CraftErrorMessage.WBP_CraftErrorMessage_C.ExecuteUbergraph_WBP_CraftErrorMessage
// 0x0030 (0x0030 - 0x0000)
struct WBP_CraftErrorMessage_C_ExecuteUbergraph_WBP_CraftErrorMessage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_MessageText;                    // 0x0008(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CraftErrorMessage_C_ExecuteUbergraph_WBP_CraftErrorMessage) == 0x000008, "Wrong alignment on WBP_CraftErrorMessage_C_ExecuteUbergraph_WBP_CraftErrorMessage");
static_assert(sizeof(WBP_CraftErrorMessage_C_ExecuteUbergraph_WBP_CraftErrorMessage) == 0x000030, "Wrong size on WBP_CraftErrorMessage_C_ExecuteUbergraph_WBP_CraftErrorMessage");
static_assert(offsetof(WBP_CraftErrorMessage_C_ExecuteUbergraph_WBP_CraftErrorMessage, EntryPoint) == 0x000000, "Member 'WBP_CraftErrorMessage_C_ExecuteUbergraph_WBP_CraftErrorMessage::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CraftErrorMessage_C_ExecuteUbergraph_WBP_CraftErrorMessage, K2Node_CustomEvent_MessageText) == 0x000008, "Member 'WBP_CraftErrorMessage_C_ExecuteUbergraph_WBP_CraftErrorMessage::K2Node_CustomEvent_MessageText' has a wrong offset!");
static_assert(offsetof(WBP_CraftErrorMessage_C_ExecuteUbergraph_WBP_CraftErrorMessage, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'WBP_CraftErrorMessage_C_ExecuteUbergraph_WBP_CraftErrorMessage::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftErrorMessage_C_ExecuteUbergraph_WBP_CraftErrorMessage, CallFunc_PlayAnimationForward_ReturnValue) == 0x000028, "Member 'WBP_CraftErrorMessage_C_ExecuteUbergraph_WBP_CraftErrorMessage::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function WBP_CraftErrorMessage.WBP_CraftErrorMessage_C.SetText
// 0x0018 (0x0018 - 0x0000)
struct WBP_CraftErrorMessage_C_SetText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_CraftErrorMessage_C_SetText) == 0x000008, "Wrong alignment on WBP_CraftErrorMessage_C_SetText");
static_assert(sizeof(WBP_CraftErrorMessage_C_SetText) == 0x000018, "Wrong size on WBP_CraftErrorMessage_C_SetText");
static_assert(offsetof(WBP_CraftErrorMessage_C_SetText, Text) == 0x000000, "Member 'WBP_CraftErrorMessage_C_SetText::Text' has a wrong offset!");

// Function WBP_CraftErrorMessage.WBP_CraftErrorMessage_C.ShowErrorMessage
// 0x0018 (0x0018 - 0x0000)
struct WBP_CraftErrorMessage_C_ShowErrorMessage final
{
public:
	class FText                                   MessageText;                                       // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_CraftErrorMessage_C_ShowErrorMessage) == 0x000008, "Wrong alignment on WBP_CraftErrorMessage_C_ShowErrorMessage");
static_assert(sizeof(WBP_CraftErrorMessage_C_ShowErrorMessage) == 0x000018, "Wrong size on WBP_CraftErrorMessage_C_ShowErrorMessage");
static_assert(offsetof(WBP_CraftErrorMessage_C_ShowErrorMessage, MessageText) == 0x000000, "Member 'WBP_CraftErrorMessage_C_ShowErrorMessage::MessageText' has a wrong offset!");

}

