#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Stat

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_Stat.WBP_Stat_C.ExecuteUbergraph_WBP_Stat
// 0x03B0 (0x03B0 - 0x0000)
struct WBP_Stat_C_ExecuteUbergraph_WBP_Stat final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_CurrentValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsCritical;                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            CallFunc_MakeBrushFromSprite_ReturnValue;          // 0x0020(0x00D0)()
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x00F0(0x0018)()
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue;      // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FProgressBarStyle                      CallFunc_SetStyleBar_ProgressBarStyle;             // 0x0110(0x0290)()
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Stat_C_ExecuteUbergraph_WBP_Stat) == 0x000010, "Wrong alignment on WBP_Stat_C_ExecuteUbergraph_WBP_Stat");
static_assert(sizeof(WBP_Stat_C_ExecuteUbergraph_WBP_Stat) == 0x0003B0, "Wrong size on WBP_Stat_C_ExecuteUbergraph_WBP_Stat");
static_assert(offsetof(WBP_Stat_C_ExecuteUbergraph_WBP_Stat, EntryPoint) == 0x000000, "Member 'WBP_Stat_C_ExecuteUbergraph_WBP_Stat::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_ExecuteUbergraph_WBP_Stat, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_Stat_C_ExecuteUbergraph_WBP_Stat::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_ExecuteUbergraph_WBP_Stat, K2Node_CustomEvent_CurrentValue) == 0x000008, "Member 'WBP_Stat_C_ExecuteUbergraph_WBP_Stat::K2Node_CustomEvent_CurrentValue' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_ExecuteUbergraph_WBP_Stat, K2Node_CustomEvent_IsCritical) == 0x000010, "Member 'WBP_Stat_C_ExecuteUbergraph_WBP_Stat::K2Node_CustomEvent_IsCritical' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_ExecuteUbergraph_WBP_Stat, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000018, "Member 'WBP_Stat_C_ExecuteUbergraph_WBP_Stat::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_ExecuteUbergraph_WBP_Stat, CallFunc_MakeBrushFromSprite_ReturnValue) == 0x000020, "Member 'WBP_Stat_C_ExecuteUbergraph_WBP_Stat::CallFunc_MakeBrushFromSprite_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_ExecuteUbergraph_WBP_Stat, CallFunc_Conv_DoubleToText_ReturnValue) == 0x0000F0, "Member 'WBP_Stat_C_ExecuteUbergraph_WBP_Stat::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_ExecuteUbergraph_WBP_Stat, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue) == 0x000108, "Member 'WBP_Stat_C_ExecuteUbergraph_WBP_Stat::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_ExecuteUbergraph_WBP_Stat, CallFunc_SetStyleBar_ProgressBarStyle) == 0x000110, "Member 'WBP_Stat_C_ExecuteUbergraph_WBP_Stat::CallFunc_SetStyleBar_ProgressBarStyle' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_ExecuteUbergraph_WBP_Stat, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x0003A0, "Member 'WBP_Stat_C_ExecuteUbergraph_WBP_Stat::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");

// Function WBP_Stat.WBP_Stat_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Stat_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Stat_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Stat_C_PreConstruct");
static_assert(sizeof(WBP_Stat_C_PreConstruct) == 0x000001, "Wrong size on WBP_Stat_C_PreConstruct");
static_assert(offsetof(WBP_Stat_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Stat_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Stat.WBP_Stat_C.SetIsCritical
// 0x00D0 (0x00D0 - 0x0000)
struct WBP_Stat_C_SetIsCritical final
{
public:
	bool                                          IsCritical;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0028(0x0014)()
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x003C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x004C(0x0014)()
	struct FSlateColor                            K2Node_Select_Default;                             // 0x0060(0x0014)()
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x0074(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_1;                // 0x0084(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0094(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x00A8(0x0014)()
	struct FSlateColor                            K2Node_Select_Default_2;                           // 0x00BC(0x0014)()
};
static_assert(alignof(WBP_Stat_C_SetIsCritical) == 0x000004, "Wrong alignment on WBP_Stat_C_SetIsCritical");
static_assert(sizeof(WBP_Stat_C_SetIsCritical) == 0x0000D0, "Wrong size on WBP_Stat_C_SetIsCritical");
static_assert(offsetof(WBP_Stat_C_SetIsCritical, IsCritical) == 0x000000, "Member 'WBP_Stat_C_SetIsCritical::IsCritical' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_SetIsCritical, Temp_bool_Variable) == 0x000001, "Member 'WBP_Stat_C_SetIsCritical::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_SetIsCritical, Temp_bool_Variable_1) == 0x000002, "Member 'WBP_Stat_C_SetIsCritical::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_SetIsCritical, Temp_struct_Variable) == 0x000004, "Member 'WBP_Stat_C_SetIsCritical::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_SetIsCritical, Temp_struct_Variable_1) == 0x000014, "Member 'WBP_Stat_C_SetIsCritical::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_SetIsCritical, Temp_bool_Variable_2) == 0x000024, "Member 'WBP_Stat_C_SetIsCritical::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_SetIsCritical, CallFunc_Not_PreBool_ReturnValue) == 0x000025, "Member 'WBP_Stat_C_SetIsCritical::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_SetIsCritical, K2Node_MakeStruct_SlateColor) == 0x000028, "Member 'WBP_Stat_C_SetIsCritical::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_SetIsCritical, CallFunc_SelectColor_ReturnValue) == 0x00003C, "Member 'WBP_Stat_C_SetIsCritical::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_SetIsCritical, K2Node_MakeStruct_SlateColor_1) == 0x00004C, "Member 'WBP_Stat_C_SetIsCritical::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_SetIsCritical, K2Node_Select_Default) == 0x000060, "Member 'WBP_Stat_C_SetIsCritical::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_SetIsCritical, K2Node_Select_Default_1) == 0x000074, "Member 'WBP_Stat_C_SetIsCritical::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_SetIsCritical, CallFunc_SelectColor_ReturnValue_1) == 0x000084, "Member 'WBP_Stat_C_SetIsCritical::CallFunc_SelectColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_SetIsCritical, K2Node_MakeStruct_SlateColor_2) == 0x000094, "Member 'WBP_Stat_C_SetIsCritical::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_SetIsCritical, K2Node_MakeStruct_SlateColor_3) == 0x0000A8, "Member 'WBP_Stat_C_SetIsCritical::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_SetIsCritical, K2Node_Select_Default_2) == 0x0000BC, "Member 'WBP_Stat_C_SetIsCritical::K2Node_Select_Default_2' has a wrong offset!");

// Function WBP_Stat.WBP_Stat_C.SetProgressBarSize
// 0x0028 (0x0028 - 0x0000)
struct WBP_Stat_C_SetProgressBarSize final
{
public:
	struct FVector2D                              Size;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Stat_C_SetProgressBarSize) == 0x000008, "Wrong alignment on WBP_Stat_C_SetProgressBarSize");
static_assert(sizeof(WBP_Stat_C_SetProgressBarSize) == 0x000028, "Wrong size on WBP_Stat_C_SetProgressBarSize");
static_assert(offsetof(WBP_Stat_C_SetProgressBarSize, Size) == 0x000000, "Member 'WBP_Stat_C_SetProgressBarSize::Size' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_SetProgressBarSize, CallFunc_BreakVector2D_X) == 0x000010, "Member 'WBP_Stat_C_SetProgressBarSize::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_SetProgressBarSize, CallFunc_BreakVector2D_Y) == 0x000018, "Member 'WBP_Stat_C_SetProgressBarSize::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_SetProgressBarSize, CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast) == 0x000020, "Member 'WBP_Stat_C_SetProgressBarSize::CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_SetProgressBarSize, CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast) == 0x000024, "Member 'WBP_Stat_C_SetProgressBarSize::CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast' has a wrong offset!");

// Function WBP_Stat.WBP_Stat_C.SetStyleBar
// 0x07D0 (0x07D0 - 0x0000)
struct WBP_Stat_C_SetStyleBar final
{
public:
	struct FProgressBarStyle                      ProgressBarStyle;                                  // 0x0000(0x0290)(Parm, OutParm)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0290(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x02A4(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x02B8(0x0014)()
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x02D0(0x00D0)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_1;                    // 0x03A0(0x00D0)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_2;                    // 0x0470(0x00D0)()
	struct FProgressBarStyle                      K2Node_MakeStruct_ProgressBarStyle;                // 0x0540(0x0290)()
};
static_assert(alignof(WBP_Stat_C_SetStyleBar) == 0x000010, "Wrong alignment on WBP_Stat_C_SetStyleBar");
static_assert(sizeof(WBP_Stat_C_SetStyleBar) == 0x0007D0, "Wrong size on WBP_Stat_C_SetStyleBar");
static_assert(offsetof(WBP_Stat_C_SetStyleBar, ProgressBarStyle) == 0x000000, "Member 'WBP_Stat_C_SetStyleBar::ProgressBarStyle' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_SetStyleBar, K2Node_MakeStruct_SlateColor) == 0x000290, "Member 'WBP_Stat_C_SetStyleBar::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_SetStyleBar, K2Node_MakeStruct_SlateColor_1) == 0x0002A4, "Member 'WBP_Stat_C_SetStyleBar::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_SetStyleBar, K2Node_MakeStruct_SlateColor_2) == 0x0002B8, "Member 'WBP_Stat_C_SetStyleBar::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_SetStyleBar, K2Node_MakeStruct_SlateBrush) == 0x0002D0, "Member 'WBP_Stat_C_SetStyleBar::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_SetStyleBar, K2Node_MakeStruct_SlateBrush_1) == 0x0003A0, "Member 'WBP_Stat_C_SetStyleBar::K2Node_MakeStruct_SlateBrush_1' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_SetStyleBar, K2Node_MakeStruct_SlateBrush_2) == 0x000470, "Member 'WBP_Stat_C_SetStyleBar::K2Node_MakeStruct_SlateBrush_2' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_SetStyleBar, K2Node_MakeStruct_ProgressBarStyle) == 0x000540, "Member 'WBP_Stat_C_SetStyleBar::K2Node_MakeStruct_ProgressBarStyle' has a wrong offset!");

// Function WBP_Stat.WBP_Stat_C.SetValue
// 0x0010 (0x0010 - 0x0000)
struct WBP_Stat_C_SetValue final
{
public:
	double                                        Param_CurrentValue;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCritical;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Stat_C_SetValue) == 0x000008, "Wrong alignment on WBP_Stat_C_SetValue");
static_assert(sizeof(WBP_Stat_C_SetValue) == 0x000010, "Wrong size on WBP_Stat_C_SetValue");
static_assert(offsetof(WBP_Stat_C_SetValue, Param_CurrentValue) == 0x000000, "Member 'WBP_Stat_C_SetValue::Param_CurrentValue' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_SetValue, IsCritical) == 0x000008, "Member 'WBP_Stat_C_SetValue::IsCritical' has a wrong offset!");

}

