#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Offer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Offer.WBP_Offer_C
// 0x0090 (0x0310 - 0x0280)
class UWBP_Offer_C : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Fade;                                              // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             PlayerName;                                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Description;                                  // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           Timecode;                                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Interact_C*                          W_Accept;                                          // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Interact_C*                          W_Decline;                                         // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      OwningSurvivalPlayer;                              // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class APS_TDB_C*                              NewPS;                                             // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FString                                 PlayerNameOfferer;                                 // 0x02C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        Percent;                                           // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Timer;                                             // 0x02E0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ASurvPC_C*                              Surv_PC;                                           // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CanUpdateHoldInteractAccept;                       // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CurrentHoldTime;                                   // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanUpdateHoldInteractDecline;                      // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_GameHUD_C*                          As_BP_Game_HUD;                                    // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AcceptOffer();
	void Construct();
	void DeclineOffer();
	void ExecuteUbergraph_WBP_Offer(int32 EntryPoint);
	void FinishHoldInteract();
	void Init();
	void SetProgressBar();
	void StartHold_Interact(const struct FKey& Key);
	void StopHoldInteract(const struct FKey& Key);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Offer_C">();
	}
	static class UWBP_Offer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Offer_C>();
	}
};
static_assert(alignof(UWBP_Offer_C) == 0x000008, "Wrong alignment on UWBP_Offer_C");
static_assert(sizeof(UWBP_Offer_C) == 0x000310, "Wrong size on UWBP_Offer_C");
static_assert(offsetof(UWBP_Offer_C, UberGraphFrame) == 0x000280, "Member 'UWBP_Offer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Offer_C, Fade) == 0x000288, "Member 'UWBP_Offer_C::Fade' has a wrong offset!");
static_assert(offsetof(UWBP_Offer_C, PlayerName) == 0x000290, "Member 'UWBP_Offer_C::PlayerName' has a wrong offset!");
static_assert(offsetof(UWBP_Offer_C, Text_Description) == 0x000298, "Member 'UWBP_Offer_C::Text_Description' has a wrong offset!");
static_assert(offsetof(UWBP_Offer_C, Timecode) == 0x0002A0, "Member 'UWBP_Offer_C::Timecode' has a wrong offset!");
static_assert(offsetof(UWBP_Offer_C, W_Accept) == 0x0002A8, "Member 'UWBP_Offer_C::W_Accept' has a wrong offset!");
static_assert(offsetof(UWBP_Offer_C, W_Decline) == 0x0002B0, "Member 'UWBP_Offer_C::W_Decline' has a wrong offset!");
static_assert(offsetof(UWBP_Offer_C, OwningSurvivalPlayer) == 0x0002B8, "Member 'UWBP_Offer_C::OwningSurvivalPlayer' has a wrong offset!");
static_assert(offsetof(UWBP_Offer_C, NewPS) == 0x0002C0, "Member 'UWBP_Offer_C::NewPS' has a wrong offset!");
static_assert(offsetof(UWBP_Offer_C, PlayerNameOfferer) == 0x0002C8, "Member 'UWBP_Offer_C::PlayerNameOfferer' has a wrong offset!");
static_assert(offsetof(UWBP_Offer_C, Percent) == 0x0002D8, "Member 'UWBP_Offer_C::Percent' has a wrong offset!");
static_assert(offsetof(UWBP_Offer_C, Timer) == 0x0002E0, "Member 'UWBP_Offer_C::Timer' has a wrong offset!");
static_assert(offsetof(UWBP_Offer_C, Surv_PC) == 0x0002E8, "Member 'UWBP_Offer_C::Surv_PC' has a wrong offset!");
static_assert(offsetof(UWBP_Offer_C, CanUpdateHoldInteractAccept) == 0x0002F0, "Member 'UWBP_Offer_C::CanUpdateHoldInteractAccept' has a wrong offset!");
static_assert(offsetof(UWBP_Offer_C, CurrentHoldTime) == 0x0002F8, "Member 'UWBP_Offer_C::CurrentHoldTime' has a wrong offset!");
static_assert(offsetof(UWBP_Offer_C, CanUpdateHoldInteractDecline) == 0x000300, "Member 'UWBP_Offer_C::CanUpdateHoldInteractDecline' has a wrong offset!");
static_assert(offsetof(UWBP_Offer_C, As_BP_Game_HUD) == 0x000308, "Member 'UWBP_Offer_C::As_BP_Game_HUD' has a wrong offset!");

}

