#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_AdminPanel

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_AdminPanel.WBP_AdminPanel_C.AdminButtonPressed
// 0x0008 (0x0008 - 0x0000)
struct WBP_AdminPanel_C_AdminButtonPressed final
{
public:
	class UWBP_AdminPanelButton_C*                TargetButton;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AdminPanel_C_AdminButtonPressed) == 0x000008, "Wrong alignment on WBP_AdminPanel_C_AdminButtonPressed");
static_assert(sizeof(WBP_AdminPanel_C_AdminButtonPressed) == 0x000008, "Wrong size on WBP_AdminPanel_C_AdminButtonPressed");
static_assert(offsetof(WBP_AdminPanel_C_AdminButtonPressed, TargetButton) == 0x000000, "Member 'WBP_AdminPanel_C_AdminButtonPressed::TargetButton' has a wrong offset!");

// Function WBP_AdminPanel.WBP_AdminPanel_C.BanButtonPressed
// 0x0008 (0x0008 - 0x0000)
struct WBP_AdminPanel_C_BanButtonPressed final
{
public:
	class UWBP_AdminPanelButton_C*                TargetButton;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AdminPanel_C_BanButtonPressed) == 0x000008, "Wrong alignment on WBP_AdminPanel_C_BanButtonPressed");
static_assert(sizeof(WBP_AdminPanel_C_BanButtonPressed) == 0x000008, "Wrong size on WBP_AdminPanel_C_BanButtonPressed");
static_assert(offsetof(WBP_AdminPanel_C_BanButtonPressed, TargetButton) == 0x000000, "Member 'WBP_AdminPanel_C_BanButtonPressed::TargetButton' has a wrong offset!");

// Function WBP_AdminPanel.WBP_AdminPanel_C.ExecuteUbergraph_WBP_AdminPanel
// 0x06E8 (0x06E8 - 0x0000)
struct WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0008(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0030(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0040(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0058(0x0018)()
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0088(0x0018)()
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00A8(0x0018)()
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00C8(0x0050)(HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0120(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0130(0x0018)()
	bool                                          Temp_bool_True_if_break_was_hit_Variable_1;        // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0158(0x0018)()
	class ASurvivalPlayer_V2_C*                   CallFunc_GetCharRef_OutputCharRef;                 // 0x0170(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0178(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x01C8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_3;                     // 0x01D8(0x0018)()
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x01F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0208(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_252[0x6];                                      // 0x0252(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APS_TDB_C*>                      CallFunc_GetAllActorsOfClass_OutActors;            // 0x0258(0x0010)(ReferenceParm)
	class APS_TDB_C*                              CallFunc_Array_Get_Item;                           // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0278(0x0018)()
	class UWBP_AdminPanelButton_C*                K2Node_CustomEvent_TargetButton_9;                 // 0x0290(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_AdminPanelButton_C* TargetButton)> K2Node_CreateDelegate_OutputDelegate;              // 0x0298(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_AdminPanelButton_C* TargetButton)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x02A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_AdminPanelButton_C*                K2Node_CustomEvent_TargetButton_8;                 // 0x02B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_AdminPanelButton_C*                CallFunc_Create_ReturnValue;                       // 0x02D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x02E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_1;            // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_1;                              // 0x02F0(0x0018)()
	bool                                          Temp_bool_Variable_1;                              // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_AdminPanelButton_C*                CallFunc_Array_Get_Item_1;                         // 0x0310(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_AdminPanelButton_C* TargetButton)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x031C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_AdminPanelButton_C*                K2Node_CustomEvent_TargetButton_7;                 // 0x0330(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APS_TDB_C*                              CallFunc_Array_Get_Item_2;                         // 0x0338(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0340(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0354(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0355(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0356(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_357[0x1];                                      // 0x0357(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x035C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35D[0x3];                                      // 0x035D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_2;                              // 0x0368(0x0018)()
	bool                                          CallFunc_IsEmpty_ReturnValue_1;                    // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_381[0x3];                                      // 0x0381(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UWBP_AdminPanelButton_C* TargetButton)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0384(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_394[0x4];                                      // 0x0394(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_AdminPanelButton_C*                K2Node_CustomEvent_TargetButton_6;                 // 0x0398(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A1[0x7];                                      // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x03A8(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x03C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_AdminPanelButton_C* TargetButton)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x03D0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_AdminPanelButton_C*                K2Node_CustomEvent_TargetButton_5;                 // 0x03E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x03E8(0x0018)()
	class FText                                   CallFunc_GetText_ReturnValue_1;                    // 0x0400(0x0018)()
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0419(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41A[0x2];                                      // 0x041A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x041C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_421[0x3];                                      // 0x0421(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0424(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_4;                          // 0x0428(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_4;                     // 0x0438(0x0018)()
	class APS_TDB_C*                              CallFunc_Array_Get_Item_3;                         // 0x0450(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_V2_C*                   CallFunc_GetCharRef_OutputCharRef_1;               // 0x0458(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0464(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0465(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x0466(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_467[0x1];                                      // 0x0467(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_5;                          // 0x0468(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_5;                     // 0x0478(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0490(0x0018)()
	TDelegate<void(class UWBP_AdminPanelButton_C* TargetButton)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x04A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_AdminPanelButton_C*                K2Node_CustomEvent_TargetButton_4;                 // 0x04B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C1[0x7];                                      // 0x04C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue_2;                    // 0x04C8(0x0018)()
	bool                                          Temp_bool_Variable_3;                              // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E1[0x7];                                      // 0x04E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x04E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x04F8(0x0018)()
	class FText                                   CallFunc_GetText_ReturnValue_3;                    // 0x0510(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_2;            // 0x0528(0x0018)()
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue_1;        // 0x0540(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_541[0x7];                                      // 0x0541(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_AdminPanelButton_C*                K2Node_CustomEvent_TargetButton_3;                 // 0x0548(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default_1;                           // 0x0550(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0568(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_569[0x7];                                      // 0x0569(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue_4;                    // 0x0570(0x0018)()
	class FText                                   CallFunc_GetText_ReturnValue_5;                    // 0x0588(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_3;          // 0x05A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_3;            // 0x05B0(0x0018)()
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue_2;        // 0x05C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C9[0x3];                                      // 0x05C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UWBP_AdminPanelButton_C* TargetButton)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x05CC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DC[0x4];                                      // 0x05DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_2;                           // 0x05E0(0x0018)()
	TDelegate<void(class UWBP_AdminPanelButton_C* TargetButton)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x05F8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_AdminPanelButton_C*                K2Node_CustomEvent_TargetButton_2;                 // 0x0608(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_AdminPanelButton_C*                K2Node_CustomEvent_TargetButton_1;                 // 0x0610(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsChecked_ReturnValue;                    // 0x0618(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0619(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61A[0x6];                                      // 0x061A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue_6;                    // 0x0620(0x0018)()
	class FText                                   CallFunc_GetText_ReturnValue_7;                    // 0x0638(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_4;          // 0x0650(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_4;            // 0x0660(0x0018)()
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue_3;        // 0x0678(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_679[0x7];                                      // 0x0679(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_3;                           // 0x0680(0x0018)()
	TDelegate<void(class UWBP_AdminPanelButton_C* TargetButton)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x0698(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_AdminPanelButton_C* TargetButton)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x06A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_AdminPanelButton_C*                K2Node_CustomEvent_TargetButton;                   // 0x06B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x06C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C1[0x7];                                      // 0x06C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue_8;                    // 0x06C8(0x0018)()
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue_4;        // 0x06E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel) == 0x000008, "Wrong alignment on WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel");
static_assert(sizeof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel) == 0x0006E8, "Wrong size on WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, EntryPoint) == 0x000000, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_MakeLiteralText_ReturnValue) == 0x000008, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, K2Node_MakeArray_Array) == 0x000020, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, K2Node_MakeArray_Array_1) == 0x000030, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_Format_ReturnValue) == 0x000040, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_Format_ReturnValue_1) == 0x000058, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, Temp_int_Array_Index_Variable) == 0x000070, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, Temp_int_Loop_Counter_Variable) == 0x000074, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_Add_IntInt_ReturnValue) == 0x000078, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, Temp_bool_True_if_break_was_hit_Variable) == 0x00007C, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, Temp_int_Array_Index_Variable_1) == 0x000080, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_Not_PreBool_ReturnValue) == 0x000084, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, Temp_text_Variable) == 0x000088, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, Temp_int_Array_Index_Variable_2) == 0x0000A0, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_Conv_StringToText_ReturnValue) == 0x0000A8, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, Temp_int_Loop_Counter_Variable_1) == 0x0000C0, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, K2Node_MakeStruct_FormatArgumentData) == 0x0000C8, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_Add_IntInt_ReturnValue_1) == 0x000118, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, K2Node_MakeArray_Array_2) == 0x000120, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_Format_ReturnValue_2) == 0x000130, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, Temp_bool_True_if_break_was_hit_Variable_1) == 0x000148, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::Temp_bool_True_if_break_was_hit_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, Temp_int_Array_Index_Variable_3) == 0x00014C, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_Not_PreBool_ReturnValue_1) == 0x000150, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000158, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_GetCharRef_OutputCharRef) == 0x000170, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_GetCharRef_OutputCharRef' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, K2Node_MakeStruct_FormatArgumentData_1) == 0x000178, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, K2Node_MakeArray_Array_3) == 0x0001C8, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_Format_ReturnValue_3) == 0x0001D8, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_Format_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_IsEmpty_ReturnValue) == 0x0001F0, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_SelectString_ReturnValue) == 0x0001F8, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, K2Node_Event_MyGeometry) == 0x000208, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, K2Node_Event_InDeltaTime) == 0x000240, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_GetPlayerController_ReturnValue) == 0x000248, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_Not_PreBool_ReturnValue_2) == 0x000250, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, Temp_bool_Variable) == 0x000251, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_GetAllActorsOfClass_OutActors) == 0x000258, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_Array_Get_Item) == 0x000268, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_Array_Length_ReturnValue) == 0x000270, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000278, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, K2Node_CustomEvent_TargetButton_9) == 0x000290, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::K2Node_CustomEvent_TargetButton_9' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, K2Node_CreateDelegate_OutputDelegate) == 0x000298, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, K2Node_CreateDelegate_OutputDelegate_1) == 0x0002A8, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, K2Node_CustomEvent_TargetButton_8) == 0x0002B8, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::K2Node_CustomEvent_TargetButton_8' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_Array_AddUnique_ReturnValue) == 0x0002C0, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_Array_Find_ReturnValue) == 0x0002C4, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_GetPlayerController_ReturnValue_1) == 0x0002C8, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0002D0, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_Create_ReturnValue) == 0x0002D8, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_AddChild_ReturnValue) == 0x0002E0, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_Array_AddUnique_ReturnValue_1) == 0x0002E8, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_Array_AddUnique_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, Temp_text_Variable_1) == 0x0002F0, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, Temp_bool_Variable_1) == 0x000308, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_Array_Get_Item_1) == 0x000310, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_Array_Length_ReturnValue_1) == 0x000318, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, K2Node_CreateDelegate_OutputDelegate_2) == 0x00031C, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, K2Node_CustomEvent_TargetButton_7) == 0x000330, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::K2Node_CustomEvent_TargetButton_7' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_Array_Get_Item_2) == 0x000338, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_Conv_TextToString_ReturnValue) == 0x000340, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_Array_Length_ReturnValue_2) == 0x000350, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000354, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_Less_IntInt_ReturnValue) == 0x000355, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_BooleanAND_ReturnValue) == 0x000356, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, Temp_int_Loop_Counter_Variable_2) == 0x000358, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_Less_IntInt_ReturnValue_1) == 0x00035C, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_Add_IntInt_ReturnValue_2) == 0x000360, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, Temp_text_Variable_2) == 0x000368, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_IsEmpty_ReturnValue_1) == 0x000380, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_IsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, K2Node_CreateDelegate_OutputDelegate_3) == 0x000384, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, K2Node_CustomEvent_TargetButton_6) == 0x000398, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::K2Node_CustomEvent_TargetButton_6' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, Temp_bool_Variable_2) == 0x0003A0, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_GetText_ReturnValue) == 0x0003A8, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_Conv_TextToString_ReturnValue_1) == 0x0003C0, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, K2Node_CreateDelegate_OutputDelegate_4) == 0x0003D0, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, K2Node_CustomEvent_TargetButton_5) == 0x0003E0, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::K2Node_CustomEvent_TargetButton_5' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_MakeLiteralText_ReturnValue_1) == 0x0003E8, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_GetText_ReturnValue_1) == 0x000400, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_GetText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_EqualEqual_TextText_ReturnValue) == 0x000418, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_EqualEqual_TextText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_IsValid_ReturnValue) == 0x000419, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, Temp_int_Loop_Counter_Variable_3) == 0x00041C, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_Less_IntInt_ReturnValue_2) == 0x000420, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_Add_IntInt_ReturnValue_3) == 0x000424, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, K2Node_MakeArray_Array_4) == 0x000428, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_Format_ReturnValue_4) == 0x000438, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_Format_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_Array_Get_Item_3) == 0x000450, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_GetCharRef_OutputCharRef_1) == 0x000458, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_GetCharRef_OutputCharRef_1' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_Array_Length_ReturnValue_3) == 0x000460, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_Less_IntInt_ReturnValue_3) == 0x000464, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_BooleanAND_ReturnValue_1) == 0x000465, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x000466, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, K2Node_MakeArray_Array_5) == 0x000468, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::K2Node_MakeArray_Array_5' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_Format_ReturnValue_5) == 0x000478, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_Format_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, Temp_text_Variable_3) == 0x000490, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, K2Node_CreateDelegate_OutputDelegate_5) == 0x0004A8, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, K2Node_CustomEvent_TargetButton_4) == 0x0004B8, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::K2Node_CustomEvent_TargetButton_4' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_IsValid_ReturnValue_1) == 0x0004C0, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_GetText_ReturnValue_2) == 0x0004C8, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_GetText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, Temp_bool_Variable_3) == 0x0004E0, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_Conv_TextToString_ReturnValue_2) == 0x0004E8, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, K2Node_Select_Default) == 0x0004F8, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_GetText_ReturnValue_3) == 0x000510, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_GetText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_MakeLiteralText_ReturnValue_2) == 0x000528, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_MakeLiteralText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_EqualEqual_TextText_ReturnValue_1) == 0x000540, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_EqualEqual_TextText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, K2Node_CustomEvent_TargetButton_3) == 0x000548, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::K2Node_CustomEvent_TargetButton_3' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, K2Node_Select_Default_1) == 0x000550, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_IsValid_ReturnValue_2) == 0x000568, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_GetText_ReturnValue_4) == 0x000570, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_GetText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_GetText_ReturnValue_5) == 0x000588, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_GetText_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_Conv_TextToString_ReturnValue_3) == 0x0005A0, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_Conv_TextToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_MakeLiteralText_ReturnValue_3) == 0x0005B0, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_MakeLiteralText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_EqualEqual_TextText_ReturnValue_2) == 0x0005C8, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_EqualEqual_TextText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, K2Node_CreateDelegate_OutputDelegate_6) == 0x0005CC, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, K2Node_Select_Default_2) == 0x0005E0, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, K2Node_CreateDelegate_OutputDelegate_7) == 0x0005F8, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, K2Node_CustomEvent_TargetButton_2) == 0x000608, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::K2Node_CustomEvent_TargetButton_2' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, K2Node_CustomEvent_TargetButton_1) == 0x000610, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::K2Node_CustomEvent_TargetButton_1' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_IsChecked_ReturnValue) == 0x000618, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_IsChecked_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_IsValid_ReturnValue_3) == 0x000619, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_GetText_ReturnValue_6) == 0x000620, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_GetText_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_GetText_ReturnValue_7) == 0x000638, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_GetText_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_Conv_TextToString_ReturnValue_4) == 0x000650, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_Conv_TextToString_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_MakeLiteralText_ReturnValue_4) == 0x000660, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_MakeLiteralText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_EqualEqual_TextText_ReturnValue_3) == 0x000678, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_EqualEqual_TextText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, K2Node_Select_Default_3) == 0x000680, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, K2Node_CreateDelegate_OutputDelegate_8) == 0x000698, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, K2Node_CreateDelegate_OutputDelegate_9) == 0x0006A8, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, K2Node_CustomEvent_TargetButton) == 0x0006B8, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::K2Node_CustomEvent_TargetButton' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_IsValid_ReturnValue_4) == 0x0006C0, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_GetText_ReturnValue_8) == 0x0006C8, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_GetText_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel, CallFunc_EqualEqual_TextText_ReturnValue_4) == 0x0006E0, "Member 'WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel::CallFunc_EqualEqual_TextText_ReturnValue_4' has a wrong offset!");

// Function WBP_AdminPanel.WBP_AdminPanel_C.ExitButtonPressed
// 0x0008 (0x0008 - 0x0000)
struct WBP_AdminPanel_C_ExitButtonPressed final
{
public:
	class UWBP_AdminPanelButton_C*                TargetButton;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AdminPanel_C_ExitButtonPressed) == 0x000008, "Wrong alignment on WBP_AdminPanel_C_ExitButtonPressed");
static_assert(sizeof(WBP_AdminPanel_C_ExitButtonPressed) == 0x000008, "Wrong size on WBP_AdminPanel_C_ExitButtonPressed");
