#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GPSObjective

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_Works_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GPSObjective.WBP_GPSObjective_C
// 0x0108 (0x0388 - 0x0280)
class UWBP_GPSObjective_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_Text;                                       // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UQuestObjectiveViewModel*               QuestObjectiveViewModel;                           // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UWidgetAnimation*                       Outro;                                             // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border;                                            // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             GoalText_Current;                                  // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             GoalText_Total;                                    // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Separator;                                   // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ObjectiveText;                                     // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ObjectiveText_1;                                   // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 StateImage;                                        // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Objective;                               // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Counter;                            // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<class FString, int32>                    ObjectiveInfo;                                     // 0x02F0(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, ExposeOnSpawn)
	bool                                          bObjectiveCompleted;                               // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_341[0x7];                                      // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      Survival_Player;                                   // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FText                                   TextObjective;                                     // 0x0350(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ExposeOnSpawn)
	struct FLinearColor                           CompleteColor;                                     // 0x0368(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Works                                       QuestType;                                         // 0x0378(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_379[0x7];                                      // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvPC_C*                              Surv_PC;                                           // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_GPSObjective(int32 EntryPoint);
	void Finished_C397537F41E36A82881D97B09A0664D3();
	void Init();
	void IsObjectiveCompleted(bool* Param_bObjectiveCompleted);
	void ParseText(class FText* Param_TextObjective);
	void PlayIntro();
	void PlayOutroAndRemove();
	void SetQuestObjectiveViewModel(class UQuestObjectiveViewModel* ViewModel);

	struct FLinearColor __45748789Minus469cMinus368aMinus47d1Minusd595f185b0da_SourceToDest() const;
	struct FLinearColor __ec0151eeMinus4afdMinus45c4Minusc3b1Minus1dafbd46bd63_SourceToDest() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GPSObjective_C">();
	}
	static class UWBP_GPSObjective_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GPSObjective_C>();
	}
};
static_assert(alignof(UWBP_GPSObjective_C) == 0x000008, "Wrong alignment on UWBP_GPSObjective_C");
static_assert(sizeof(UWBP_GPSObjective_C) == 0x000388, "Wrong size on UWBP_GPSObjective_C");
static_assert(offsetof(UWBP_GPSObjective_C, UberGraphFrame) == 0x000280, "Member 'UWBP_GPSObjective_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GPSObjective_C, Border_Text) == 0x000288, "Member 'UWBP_GPSObjective_C::Border_Text' has a wrong offset!");
static_assert(offsetof(UWBP_GPSObjective_C, QuestObjectiveViewModel) == 0x000290, "Member 'UWBP_GPSObjective_C::QuestObjectiveViewModel' has a wrong offset!");
static_assert(offsetof(UWBP_GPSObjective_C, Outro) == 0x000298, "Member 'UWBP_GPSObjective_C::Outro' has a wrong offset!");
static_assert(offsetof(UWBP_GPSObjective_C, Intro) == 0x0002A0, "Member 'UWBP_GPSObjective_C::Intro' has a wrong offset!");
static_assert(offsetof(UWBP_GPSObjective_C, Border) == 0x0002A8, "Member 'UWBP_GPSObjective_C::Border' has a wrong offset!");
static_assert(offsetof(UWBP_GPSObjective_C, GoalText_Current) == 0x0002B0, "Member 'UWBP_GPSObjective_C::GoalText_Current' has a wrong offset!");
static_assert(offsetof(UWBP_GPSObjective_C, GoalText_Total) == 0x0002B8, "Member 'UWBP_GPSObjective_C::GoalText_Total' has a wrong offset!");
static_assert(offsetof(UWBP_GPSObjective_C, Image_Separator) == 0x0002C0, "Member 'UWBP_GPSObjective_C::Image_Separator' has a wrong offset!");
static_assert(offsetof(UWBP_GPSObjective_C, ObjectiveText) == 0x0002C8, "Member 'UWBP_GPSObjective_C::ObjectiveText' has a wrong offset!");
static_assert(offsetof(UWBP_GPSObjective_C, ObjectiveText_1) == 0x0002D0, "Member 'UWBP_GPSObjective_C::ObjectiveText_1' has a wrong offset!");
static_assert(offsetof(UWBP_GPSObjective_C, StateImage) == 0x0002D8, "Member 'UWBP_GPSObjective_C::StateImage' has a wrong offset!");
static_assert(offsetof(UWBP_GPSObjective_C, TextBlock_Objective) == 0x0002E0, "Member 'UWBP_GPSObjective_C::TextBlock_Objective' has a wrong offset!");
static_assert(offsetof(UWBP_GPSObjective_C, WidgetSwitcher_Counter) == 0x0002E8, "Member 'UWBP_GPSObjective_C::WidgetSwitcher_Counter' has a wrong offset!");
static_assert(offsetof(UWBP_GPSObjective_C, ObjectiveInfo) == 0x0002F0, "Member 'UWBP_GPSObjective_C::ObjectiveInfo' has a wrong offset!");
static_assert(offsetof(UWBP_GPSObjective_C, bObjectiveCompleted) == 0x000340, "Member 'UWBP_GPSObjective_C::bObjectiveCompleted' has a wrong offset!");
static_assert(offsetof(UWBP_GPSObjective_C, Survival_Player) == 0x000348, "Member 'UWBP_GPSObjective_C::Survival_Player' has a wrong offset!");
static_assert(offsetof(UWBP_GPSObjective_C, TextObjective) == 0x000350, "Member 'UWBP_GPSObjective_C::TextObjective' has a wrong offset!");
static_assert(offsetof(UWBP_GPSObjective_C, CompleteColor) == 0x000368, "Member 'UWBP_GPSObjective_C::CompleteColor' has a wrong offset!");
static_assert(offsetof(UWBP_GPSObjective_C, QuestType) == 0x000378, "Member 'UWBP_GPSObjective_C::QuestType' has a wrong offset!");
static_assert(offsetof(UWBP_GPSObjective_C, Surv_PC) == 0x000380, "Member 'UWBP_GPSObjective_C::Surv_PC' has a wrong offset!");

}

