#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PerkMenu

#include "Basic.hpp"

#include "WS_CharaterPerks_structs.hpp"
#include "FMODStudio_structs.hpp"


namespace SDK::Params
{

// Function WBP_PerkMenu.WBP_PerkMenu_C.AddChildrenPerks
// 0x0150 (0x0150 - 0x0000)
struct WBP_PerkMenu_C_AddChildrenPerks final
{
public:
	int32                                         Row_Counter_Negative;                              // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Row_Counter_Positive;                              // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UW_PerkCard_C* GivenPerkCard)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0038(0x0010)(ReferenceParm)
	class UW_PerkCard_C*                          CallFunc_Create_ReturnValue;                       // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWS_CharaterPerks                      CallFunc_GetDataTableRowFromName_OutRow;           // 0x0058(0x00B8)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUniformGridPanel*                      K2Node_Select_Default;                             // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UW_PerkCard_C*>                  K2Node_Select_Default_1;                           // 0x0128(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue;        // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PerkMenu_C_AddChildrenPerks) == 0x000008, "Wrong alignment on WBP_PerkMenu_C_AddChildrenPerks");
static_assert(sizeof(WBP_PerkMenu_C_AddChildrenPerks) == 0x000150, "Wrong size on WBP_PerkMenu_C_AddChildrenPerks");
static_assert(offsetof(WBP_PerkMenu_C_AddChildrenPerks, Row_Counter_Negative) == 0x000000, "Member 'WBP_PerkMenu_C_AddChildrenPerks::Row_Counter_Negative' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_AddChildrenPerks, Row_Counter_Positive) == 0x000004, "Member 'WBP_PerkMenu_C_AddChildrenPerks::Row_Counter_Positive' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_AddChildrenPerks, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WBP_PerkMenu_C_AddChildrenPerks::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_AddChildrenPerks, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'WBP_PerkMenu_C_AddChildrenPerks::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_AddChildrenPerks, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_PerkMenu_C_AddChildrenPerks::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_AddChildrenPerks, Temp_bool_Variable) == 0x000014, "Member 'WBP_PerkMenu_C_AddChildrenPerks::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_AddChildrenPerks, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'WBP_PerkMenu_C_AddChildrenPerks::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_AddChildrenPerks, Temp_bool_Variable_1) == 0x000028, "Member 'WBP_PerkMenu_C_AddChildrenPerks::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_AddChildrenPerks, CallFunc_GetPlayerController_ReturnValue) == 0x000030, "Member 'WBP_PerkMenu_C_AddChildrenPerks::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_AddChildrenPerks, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000038, "Member 'WBP_PerkMenu_C_AddChildrenPerks::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_AddChildrenPerks, CallFunc_Create_ReturnValue) == 0x000048, "Member 'WBP_PerkMenu_C_AddChildrenPerks::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_AddChildrenPerks, CallFunc_Array_Get_Item) == 0x000050, "Member 'WBP_PerkMenu_C_AddChildrenPerks::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_AddChildrenPerks, CallFunc_GetDataTableRowFromName_OutRow) == 0x000058, "Member 'WBP_PerkMenu_C_AddChildrenPerks::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_AddChildrenPerks, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000110, "Member 'WBP_PerkMenu_C_AddChildrenPerks::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_AddChildrenPerks, CallFunc_Array_Length_ReturnValue) == 0x000114, "Member 'WBP_PerkMenu_C_AddChildrenPerks::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_AddChildrenPerks, CallFunc_Less_IntInt_ReturnValue) == 0x000118, "Member 'WBP_PerkMenu_C_AddChildrenPerks::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_AddChildrenPerks, K2Node_Select_Default) == 0x000120, "Member 'WBP_PerkMenu_C_AddChildrenPerks::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_AddChildrenPerks, K2Node_Select_Default_1) == 0x000128, "Member 'WBP_PerkMenu_C_AddChildrenPerks::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_AddChildrenPerks, CallFunc_GetChildrenCount_ReturnValue) == 0x000138, "Member 'WBP_PerkMenu_C_AddChildrenPerks::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_AddChildrenPerks, CallFunc_Array_AddUnique_ReturnValue) == 0x00013C, "Member 'WBP_PerkMenu_C_AddChildrenPerks::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_AddChildrenPerks, CallFunc_Divide_IntInt_ReturnValue) == 0x000140, "Member 'WBP_PerkMenu_C_AddChildrenPerks::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_AddChildrenPerks, CallFunc_Percent_IntInt_ReturnValue) == 0x000144, "Member 'WBP_PerkMenu_C_AddChildrenPerks::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_AddChildrenPerks, CallFunc_AddChildToUniformGrid_ReturnValue) == 0x000148, "Member 'WBP_PerkMenu_C_AddChildrenPerks::CallFunc_AddChildToUniformGrid_ReturnValue' has a wrong offset!");

// Function WBP_PerkMenu.WBP_PerkMenu_C.BindedEvent_HandlePressOnCard
// 0x0008 (0x0008 - 0x0000)
struct WBP_PerkMenu_C_BindedEvent_HandlePressOnCard final
{
public:
	class UW_PerkCard_C*                          GivenPerkCard;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PerkMenu_C_BindedEvent_HandlePressOnCard) == 0x000008, "Wrong alignment on WBP_PerkMenu_C_BindedEvent_HandlePressOnCard");
static_assert(sizeof(WBP_PerkMenu_C_BindedEvent_HandlePressOnCard) == 0x000008, "Wrong size on WBP_PerkMenu_C_BindedEvent_HandlePressOnCard");
static_assert(offsetof(WBP_PerkMenu_C_BindedEvent_HandlePressOnCard, GivenPerkCard) == 0x000000, "Member 'WBP_PerkMenu_C_BindedEvent_HandlePressOnCard::GivenPerkCard' has a wrong offset!");

// Function WBP_PerkMenu.WBP_PerkMenu_C.CheckPerksCount
// 0x0038 (0x0038 - 0x0000)
struct WBP_PerkMenu_C_CheckPerksCount final
{
public:
	class UW_PerkCard_C*                          Perk;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CanAdd;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPriceReal_Price_Real;                  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsSelected_bSelected;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPriceReal_Price_Real_1;                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PerkMenu_C_CheckPerksCount) == 0x000008, "Wrong alignment on WBP_PerkMenu_C_CheckPerksCount");
static_assert(sizeof(WBP_PerkMenu_C_CheckPerksCount) == 0x000038, "Wrong size on WBP_PerkMenu_C_CheckPerksCount");
static_assert(offsetof(WBP_PerkMenu_C_CheckPerksCount, Perk) == 0x000000, "Member 'WBP_PerkMenu_C_CheckPerksCount::Perk' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_CheckPerksCount, CanAdd) == 0x000008, "Member 'WBP_PerkMenu_C_CheckPerksCount::CanAdd' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_CheckPerksCount, CallFunc_GetPriceReal_Price_Real) == 0x00000C, "Member 'WBP_PerkMenu_C_CheckPerksCount::CallFunc_GetPriceReal_Price_Real' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_CheckPerksCount, CallFunc_GetIsSelected_bSelected) == 0x000010, "Member 'WBP_PerkMenu_C_CheckPerksCount::CallFunc_GetIsSelected_bSelected' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_CheckPerksCount, CallFunc_Subtract_IntInt_ReturnValue) == 0x000014, "Member 'WBP_PerkMenu_C_CheckPerksCount::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_CheckPerksCount, CallFunc_GetPriceReal_Price_Real_1) == 0x000018, "Member 'WBP_PerkMenu_C_CheckPerksCount::CallFunc_GetPriceReal_Price_Real_1' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_CheckPerksCount, Temp_bool_Variable) == 0x00001C, "Member 'WBP_PerkMenu_C_CheckPerksCount::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_CheckPerksCount, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'WBP_PerkMenu_C_CheckPerksCount::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_CheckPerksCount, Temp_bool_Variable_1) == 0x000024, "Member 'WBP_PerkMenu_C_CheckPerksCount::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_CheckPerksCount, CallFunc_SelectInt_ReturnValue) == 0x000028, "Member 'WBP_PerkMenu_C_CheckPerksCount::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_CheckPerksCount, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00002C, "Member 'WBP_PerkMenu_C_CheckPerksCount::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_CheckPerksCount, CallFunc_Add_IntInt_ReturnValue_1) == 0x000030, "Member 'WBP_PerkMenu_C_CheckPerksCount::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_CheckPerksCount, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'WBP_PerkMenu_C_CheckPerksCount::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_CheckPerksCount, K2Node_Select_Default) == 0x000035, "Member 'WBP_PerkMenu_C_CheckPerksCount::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_CheckPerksCount, CallFunc_BooleanAND_ReturnValue) == 0x000036, "Member 'WBP_PerkMenu_C_CheckPerksCount::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_PerkMenu.WBP_PerkMenu_C.ClearSelectedPerks
// 0x0070 (0x0070 - 0x0000)
struct WBP_PerkMenu_C_ClearSelectedPerks final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_PerkCard_C*                          CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_PerkCard_C*                          CallFunc_Array_Get_Item_1;                         // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_PerkCard_C*                          CallFunc_Array_Get_Item_2;                         // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E[0x2];                                       // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_PerkCard_C*                          CallFunc_Array_Get_Item_3;                         // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PerkMenu_C_ClearSelectedPerks) == 0x000008, "Wrong alignment on WBP_PerkMenu_C_ClearSelectedPerks");
static_assert(sizeof(WBP_PerkMenu_C_ClearSelectedPerks) == 0x000070, "Wrong size on WBP_PerkMenu_C_ClearSelectedPerks");
static_assert(offsetof(WBP_PerkMenu_C_ClearSelectedPerks, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'WBP_PerkMenu_C_ClearSelectedPerks::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ClearSelectedPerks, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'WBP_PerkMenu_C_ClearSelectedPerks::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ClearSelectedPerks, Temp_int_Loop_Counter_Variable_1) == 0x000008, "Member 'WBP_PerkMenu_C_ClearSelectedPerks::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ClearSelectedPerks, CallFunc_Add_IntInt_ReturnValue_1) == 0x00000C, "Member 'WBP_PerkMenu_C_ClearSelectedPerks::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ClearSelectedPerks, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_PerkMenu_C_ClearSelectedPerks::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ClearSelectedPerks, Temp_int_Loop_Counter_Variable_2) == 0x000014, "Member 'WBP_PerkMenu_C_ClearSelectedPerks::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ClearSelectedPerks, CallFunc_Add_IntInt_ReturnValue_2) == 0x000018, "Member 'WBP_PerkMenu_C_ClearSelectedPerks::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ClearSelectedPerks, Temp_int_Array_Index_Variable_1) == 0x00001C, "Member 'WBP_PerkMenu_C_ClearSelectedPerks::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ClearSelectedPerks, Temp_int_Loop_Counter_Variable_3) == 0x000020, "Member 'WBP_PerkMenu_C_ClearSelectedPerks::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ClearSelectedPerks, CallFunc_Add_IntInt_ReturnValue_3) == 0x000024, "Member 'WBP_PerkMenu_C_ClearSelectedPerks::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ClearSelectedPerks, Temp_int_Array_Index_Variable_2) == 0x000028, "Member 'WBP_PerkMenu_C_ClearSelectedPerks::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ClearSelectedPerks, Temp_int_Array_Index_Variable_3) == 0x00002C, "Member 'WBP_PerkMenu_C_ClearSelectedPerks::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ClearSelectedPerks, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_PerkMenu_C_ClearSelectedPerks::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ClearSelectedPerks, CallFunc_Array_Get_Item_1) == 0x000038, "Member 'WBP_PerkMenu_C_ClearSelectedPerks::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ClearSelectedPerks, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'WBP_PerkMenu_C_ClearSelectedPerks::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ClearSelectedPerks, CallFunc_Array_Length_ReturnValue_1) == 0x000044, "Member 'WBP_PerkMenu_C_ClearSelectedPerks::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ClearSelectedPerks, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'WBP_PerkMenu_C_ClearSelectedPerks::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ClearSelectedPerks, CallFunc_Less_IntInt_ReturnValue_1) == 0x000049, "Member 'WBP_PerkMenu_C_ClearSelectedPerks::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ClearSelectedPerks, CallFunc_Array_Get_Item_2) == 0x000050, "Member 'WBP_PerkMenu_C_ClearSelectedPerks::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ClearSelectedPerks, CallFunc_Array_Length_ReturnValue_2) == 0x000058, "Member 'WBP_PerkMenu_C_ClearSelectedPerks::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ClearSelectedPerks, CallFunc_Less_IntInt_ReturnValue_2) == 0x00005C, "Member 'WBP_PerkMenu_C_ClearSelectedPerks::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ClearSelectedPerks, CallFunc_IsValid_ReturnValue) == 0x00005D, "Member 'WBP_PerkMenu_C_ClearSelectedPerks::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ClearSelectedPerks, CallFunc_Array_Get_Item_3) == 0x000060, "Member 'WBP_PerkMenu_C_ClearSelectedPerks::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ClearSelectedPerks, CallFunc_Array_Length_ReturnValue_3) == 0x000068, "Member 'WBP_PerkMenu_C_ClearSelectedPerks::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ClearSelectedPerks, CallFunc_Less_IntInt_ReturnValue_3) == 0x00006C, "Member 'WBP_PerkMenu_C_ClearSelectedPerks::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");

// Function WBP_PerkMenu.WBP_PerkMenu_C.CreateEmptyPerksSlots
// 0x0030 (0x0030 - 0x0000)
struct WBP_PerkMenu_C_CreateEmptyPerksSlots final
{
public:
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_PerkCard_C*                          CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PerkMenu_C_CreateEmptyPerksSlots) == 0x000008, "Wrong alignment on WBP_PerkMenu_C_CreateEmptyPerksSlots");
static_assert(sizeof(WBP_PerkMenu_C_CreateEmptyPerksSlots) == 0x000030, "Wrong size on WBP_PerkMenu_C_CreateEmptyPerksSlots");
static_assert(offsetof(WBP_PerkMenu_C_CreateEmptyPerksSlots, CallFunc_Subtract_IntInt_ReturnValue) == 0x000000, "Member 'WBP_PerkMenu_C_CreateEmptyPerksSlots::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_CreateEmptyPerksSlots, Temp_int_Variable) == 0x000004, "Member 'WBP_PerkMenu_C_CreateEmptyPerksSlots::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_CreateEmptyPerksSlots, CallFunc_Divide_IntInt_ReturnValue) == 0x000008, "Member 'WBP_PerkMenu_C_CreateEmptyPerksSlots::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_CreateEmptyPerksSlots, CallFunc_Percent_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_PerkMenu_C_CreateEmptyPerksSlots::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_CreateEmptyPerksSlots, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000010, "Member 'WBP_PerkMenu_C_CreateEmptyPerksSlots::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_CreateEmptyPerksSlots, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'WBP_PerkMenu_C_CreateEmptyPerksSlots::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_CreateEmptyPerksSlots, CallFunc_Create_ReturnValue) == 0x000018, "Member 'WBP_PerkMenu_C_CreateEmptyPerksSlots::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_CreateEmptyPerksSlots, CallFunc_AddChildToUniformGrid_ReturnValue) == 0x000020, "Member 'WBP_PerkMenu_C_CreateEmptyPerksSlots::CallFunc_AddChildToUniformGrid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_CreateEmptyPerksSlots, CallFunc_Array_AddUnique_ReturnValue) == 0x000028, "Member 'WBP_PerkMenu_C_CreateEmptyPerksSlots::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");

// Function WBP_PerkMenu.WBP_PerkMenu_C.ExecuteUbergraph_WBP_PerkMenu
// 0x03C8 (0x03C8 - 0x0000)
struct WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetShowed_Showed;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_1;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_2;                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(class UW_PerkCard_C* GivenPerkCard)> K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival;                  // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_3;                // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_4;                // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD_MainMenu_C*                        K2Node_DynamicCast_AsHUD_Main_Menu;                // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PerkInfo_C*                        CallFunc_GetPerkInfo_PerkInfo;                     // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_5;                // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00C0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_6;                // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_7;                // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Survival_C*                         K2Node_DynamicCast_AsGI_Survival_1;                // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_PerkCard_C*                          K2Node_CustomEvent_GivenPerkCard;                  // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetName_Name;                             // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWS_CharaterPerks                      CallFunc_GetPerkInfo_PerkInfo_1;                   // 0x0118(0x00B8)(HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x3];                                      // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWS_CharaterPerks                      CallFunc_GetPerkInfo_PerkInfo_2;                   // 0x01D8(0x00B8)(HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0290(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x02A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetName_Name_1;                           // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWS_CharaterPerks                      CallFunc_GetPerkInfo_PerkInfo_3;                   // 0x02B8(0x00B8)(HasGetValueTypeHash)
	bool                                          CallFunc_CheckPerksCount_CanAdd;                   // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckPerksCount_CanAdd_1;                 // 0x0371(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsSelected_bSelected;                  // 0x0372(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_373[0x1];                                      // 0x0373(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0374(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_384[0x4];                                      // 0x0384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_PerkCard_C*                          CallFunc_Create_ReturnValue;                       // 0x0388(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_394[0x4];                                      // 0x0394(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue;        // 0x0398(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x03A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x03B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x03C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetShowed_Showed_1;                       // 0x03C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu) == 0x000008, "Wrong alignment on WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu");
static_assert(sizeof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu) == 0x0003C8, "Wrong size on WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu");
static_assert(offsetof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu, EntryPoint) == 0x000000, "Member 'WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu, CallFunc_GetShowed_Showed) == 0x000004, "Member 'WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu::CallFunc_GetShowed_Showed' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x00000C, "Member 'WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu, CallFunc_PlayEvent2D_ReturnValue) == 0x000018, "Member 'WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu::CallFunc_PlayEvent2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu, CallFunc_PlayEvent2D_ReturnValue_1) == 0x000020, "Member 'WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu::CallFunc_PlayEvent2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu, K2Node_Event_IsDesignTime) == 0x000028, "Member 'WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu, CallFunc_PlayEvent2D_ReturnValue_2) == 0x000030, "Member 'WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu::CallFunc_PlayEvent2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu, CallFunc_GetGameInstance_ReturnValue) == 0x000050, "Member 'WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu, CallFunc_IsValid_ReturnValue_1) == 0x000058, "Member 'WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu, K2Node_DynamicCast_AsGI_Survival) == 0x000060, "Member 'WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu::K2Node_DynamicCast_AsGI_Survival' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu, CallFunc_IsValid_ReturnValue_2) == 0x000069, "Member 'WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu, CallFunc_PlayEvent2D_ReturnValue_3) == 0x000070, "Member 'WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu::CallFunc_PlayEvent2D_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000078, "Member 'WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu, CallFunc_Array_Length_ReturnValue) == 0x00007C, "Member 'WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu, CallFunc_Divide_IntInt_ReturnValue) == 0x000080, "Member 'WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu, CallFunc_Percent_IntInt_ReturnValue) == 0x000084, "Member 'WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu, CallFunc_PlayEvent2D_ReturnValue_4) == 0x000088, "Member 'WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu::CallFunc_PlayEvent2D_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu, CallFunc_GetPlayerController_ReturnValue) == 0x000090, "Member 'WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu, CallFunc_GetHUD_ReturnValue) == 0x000098, "Member 'WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu, K2Node_DynamicCast_AsHUD_Main_Menu) == 0x0000A0, "Member 'WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu::K2Node_DynamicCast_AsHUD_Main_Menu' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu, K2Node_DynamicCast_bSuccess_1) == 0x0000A8, "Member 'WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu, CallFunc_GetPerkInfo_PerkInfo) == 0x0000B0, "Member 'WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu::CallFunc_GetPerkInfo_PerkInfo' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu, CallFunc_PlayEvent2D_ReturnValue_5) == 0x0000B8, "Member 'WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu::CallFunc_PlayEvent2D_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000C0, "Member 'WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000D0, "Member 'WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu, CallFunc_PlayEvent2D_ReturnValue_6) == 0x0000D8, "Member 'WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu::CallFunc_PlayEvent2D_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu, CallFunc_Less_IntInt_ReturnValue) == 0x0000E0, "Member 'WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu, CallFunc_PlayEvent2D_ReturnValue_7) == 0x0000E8, "Member 'WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu::CallFunc_PlayEvent2D_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu, CallFunc_GetGameInstance_ReturnValue_1) == 0x0000F0, "Member 'WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu, K2Node_DynamicCast_AsGI_Survival_1) == 0x0000F8, "Member 'WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu::K2Node_DynamicCast_AsGI_Survival_1' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu, K2Node_DynamicCast_bSuccess_2) == 0x000100, "Member 'WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu, K2Node_CustomEvent_GivenPerkCard) == 0x000108, "Member 'WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu::K2Node_CustomEvent_GivenPerkCard' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu, CallFunc_GetName_Name) == 0x000110, "Member 'WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu::CallFunc_GetName_Name' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu, CallFunc_GetPerkInfo_PerkInfo_1) == 0x000118, "Member 'WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu::CallFunc_GetPerkInfo_PerkInfo_1' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu, CallFunc_Array_RemoveItem_ReturnValue) == 0x0001D0, "Member 'WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu, CallFunc_Array_Add_ReturnValue) == 0x0001D4, "Member 'WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu, CallFunc_GetPerkInfo_PerkInfo_2) == 0x0001D8, "Member 'WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu::CallFunc_GetPerkInfo_PerkInfo_2' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu, CallFunc_Conv_TextToString_ReturnValue) == 0x000290, "Member 'WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu, CallFunc_Concat_StrStr_ReturnValue) == 0x0002A0, "Member 'WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu, CallFunc_GetName_Name_1) == 0x0002B0, "Member 'WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu::CallFunc_GetName_Name_1' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu, CallFunc_GetPerkInfo_PerkInfo_3) == 0x0002B8, "Member 'WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu::CallFunc_GetPerkInfo_PerkInfo_3' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu, CallFunc_CheckPerksCount_CanAdd) == 0x000370, "Member 'WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu::CallFunc_CheckPerksCount_CanAdd' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu, CallFunc_CheckPerksCount_CanAdd_1) == 0x000371, "Member 'WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu::CallFunc_CheckPerksCount_CanAdd_1' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu, CallFunc_GetIsSelected_bSelected) == 0x000372, "Member 'WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu::CallFunc_GetIsSelected_bSelected' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu, K2Node_CreateDelegate_OutputDelegate_2) == 0x000374, "Member 'WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu, CallFunc_Create_ReturnValue) == 0x000388, "Member 'WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu, CallFunc_Array_AddUnique_ReturnValue) == 0x000390, "Member 'WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu, CallFunc_AddChildToUniformGrid_ReturnValue) == 0x000398, "Member 'WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu::CallFunc_AddChildToUniformGrid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu, K2Node_CreateDelegate_OutputDelegate_3) == 0x0003A0, "Member 'WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu, K2Node_CreateDelegate_OutputDelegate_4) == 0x0003B0, "Member 'WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu, CallFunc_Array_Length_ReturnValue_1) == 0x0003C0, "Member 'WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu, CallFunc_Greater_IntInt_ReturnValue) == 0x0003C4, "Member 'WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu, CallFunc_GetShowed_Showed_1) == 0x0003C5, "Member 'WBP_PerkMenu_C_ExecuteUbergraph_WBP_PerkMenu::CallFunc_GetShowed_Showed_1' has a wrong offset!");

// Function WBP_PerkMenu.WBP_PerkMenu_C.FillWithEmptySlots
// 0x0038 (0x0038 - 0x0000)
struct WBP_PerkMenu_C_FillWithEmptySlots final
{
public:
	class UUniformGridPanel*                      GridPanel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue_1;           // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
