#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ChatLine

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "ChatType_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ChatLine.WBP_ChatLine_C
// 0x0050 (0x02D0 - 0x0280)
class UWBP_ChatLine_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOut;                                           // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_47;                                      // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 Player;                                            // 0x0298(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FString                                 Text;                                              // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FTimerHandle                           FadeOutTimer;                                      // 0x02B8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	EChatType                                     ChatType;                                          // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        PauseTime;                                         // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void CustomEvent_0();
	void ExecuteUbergraph_WBP_ChatLine(int32 EntryPoint);
	void Finished_E49418FE44AB47BC84686284001089FC();
	class FText GetText_0();
	void PauseAnim();
	void ResumeAnim();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ChatLine_C">();
	}
	static class UWBP_ChatLine_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ChatLine_C>();
	}
};
static_assert(alignof(UWBP_ChatLine_C) == 0x000008, "Wrong alignment on UWBP_ChatLine_C");
static_assert(sizeof(UWBP_ChatLine_C) == 0x0002D0, "Wrong size on UWBP_ChatLine_C");
static_assert(offsetof(UWBP_ChatLine_C, UberGraphFrame) == 0x000280, "Member 'UWBP_ChatLine_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ChatLine_C, FadeOut) == 0x000288, "Member 'UWBP_ChatLine_C::FadeOut' has a wrong offset!");
static_assert(offsetof(UWBP_ChatLine_C, TextBlock_47) == 0x000290, "Member 'UWBP_ChatLine_C::TextBlock_47' has a wrong offset!");
static_assert(offsetof(UWBP_ChatLine_C, Player) == 0x000298, "Member 'UWBP_ChatLine_C::Player' has a wrong offset!");
static_assert(offsetof(UWBP_ChatLine_C, Text) == 0x0002A8, "Member 'UWBP_ChatLine_C::Text' has a wrong offset!");
static_assert(offsetof(UWBP_ChatLine_C, FadeOutTimer) == 0x0002B8, "Member 'UWBP_ChatLine_C::FadeOutTimer' has a wrong offset!");
static_assert(offsetof(UWBP_ChatLine_C, ChatType) == 0x0002C0, "Member 'UWBP_ChatLine_C::ChatType' has a wrong offset!");
static_assert(offsetof(UWBP_ChatLine_C, PauseTime) == 0x0002C8, "Member 'UWBP_ChatLine_C::PauseTime' has a wrong offset!");

}

