#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_IngameNotifications

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_IngameNotifications.WBP_IngameNotifications_C
// 0x0050 (0x02D0 - 0x0280)
class UWBP_IngameNotifications_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Expand;                                            // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Icon;                                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         NotifyText;                                        // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Content;                                   // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Title;                                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Message_Index;                                     // 0x02B0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2B4[0x4];                                      // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Nick_Name;                                         // 0x02B8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         NotificationLifetime;                              // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Shown;                                             // 0x02CC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bRemoveFromParentOnAnimationEnd;                   // 0x02CD(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_IngameNotifications(int32 EntryPoint);
	void Finished_A174E2E94EBFB5111F9E11A1208BE667();
	void Finished_A6128CFF4EA6353F586E92B7320AA35D();
	void Init();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_IngameNotifications_C">();
	}
	static class UWBP_IngameNotifications_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_IngameNotifications_C>();
	}
};
static_assert(alignof(UWBP_IngameNotifications_C) == 0x000008, "Wrong alignment on UWBP_IngameNotifications_C");
static_assert(sizeof(UWBP_IngameNotifications_C) == 0x0002D0, "Wrong size on UWBP_IngameNotifications_C");
static_assert(offsetof(UWBP_IngameNotifications_C, UberGraphFrame) == 0x000280, "Member 'UWBP_IngameNotifications_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_IngameNotifications_C, Expand) == 0x000288, "Member 'UWBP_IngameNotifications_C::Expand' has a wrong offset!");
static_assert(offsetof(UWBP_IngameNotifications_C, Image_Icon) == 0x000290, "Member 'UWBP_IngameNotifications_C::Image_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_IngameNotifications_C, NotifyText) == 0x000298, "Member 'UWBP_IngameNotifications_C::NotifyText' has a wrong offset!");
static_assert(offsetof(UWBP_IngameNotifications_C, SizeBox_Content) == 0x0002A0, "Member 'UWBP_IngameNotifications_C::SizeBox_Content' has a wrong offset!");
static_assert(offsetof(UWBP_IngameNotifications_C, Text_Title) == 0x0002A8, "Member 'UWBP_IngameNotifications_C::Text_Title' has a wrong offset!");
static_assert(offsetof(UWBP_IngameNotifications_C, Message_Index) == 0x0002B0, "Member 'UWBP_IngameNotifications_C::Message_Index' has a wrong offset!");
static_assert(offsetof(UWBP_IngameNotifications_C, Nick_Name) == 0x0002B8, "Member 'UWBP_IngameNotifications_C::Nick_Name' has a wrong offset!");
static_assert(offsetof(UWBP_IngameNotifications_C, NotificationLifetime) == 0x0002C8, "Member 'UWBP_IngameNotifications_C::NotificationLifetime' has a wrong offset!");
static_assert(offsetof(UWBP_IngameNotifications_C, Shown) == 0x0002CC, "Member 'UWBP_IngameNotifications_C::Shown' has a wrong offset!");
static_assert(offsetof(UWBP_IngameNotifications_C, bRemoveFromParentOnAnimationEnd) == 0x0002CD, "Member 'UWBP_IngameNotifications_C::bRemoveFromParentOnAnimationEnd' has a wrong offset!");

}

