#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GPSJournal_Entry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GPSJournal_Entry.WBP_GPSJournal_Entry_C
// 0x0070 (0x02F0 - 0x0280)
class UWBP_GPSJournal_Entry_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_Details;                                    // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Timer;                               // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_324;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_QuestGiver;                                  // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Description;                             // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_QuestgiverName;                          // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_RewardMoney;                             // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Time;                                    // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UQuest*                                 Quest;                                             // 0x02C8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FTimerHandle                           QuestTimer;                                        // 0x02D0(0x0008)(Edit, BlueprintVisible, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FTimerHandle                           UpdateTimer;                                       // 0x02D8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnDetailsClicked;                                  // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_GPSJournal_Entry_Button_Details_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__WBP_GPSJournal_Entry_Button_Details_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_GPSJournal_Entry(int32 EntryPoint);
	void Init();
	void Int_to_Time_String(int32 Num, class FString* Value);
	void OnDetailsClicked__DelegateSignature(class UQuest* Param_Quest);
	void UpdateTime();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GPSJournal_Entry_C">();
	}
	static class UWBP_GPSJournal_Entry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GPSJournal_Entry_C>();
	}
};
static_assert(alignof(UWBP_GPSJournal_Entry_C) == 0x000008, "Wrong alignment on UWBP_GPSJournal_Entry_C");
static_assert(sizeof(UWBP_GPSJournal_Entry_C) == 0x0002F0, "Wrong size on UWBP_GPSJournal_Entry_C");
static_assert(offsetof(UWBP_GPSJournal_Entry_C, UberGraphFrame) == 0x000280, "Member 'UWBP_GPSJournal_Entry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GPSJournal_Entry_C, Button_Details) == 0x000288, "Member 'UWBP_GPSJournal_Entry_C::Button_Details' has a wrong offset!");
static_assert(offsetof(UWBP_GPSJournal_Entry_C, HorizontalBox_Timer) == 0x000290, "Member 'UWBP_GPSJournal_Entry_C::HorizontalBox_Timer' has a wrong offset!");
static_assert(offsetof(UWBP_GPSJournal_Entry_C, Image_324) == 0x000298, "Member 'UWBP_GPSJournal_Entry_C::Image_324' has a wrong offset!");
static_assert(offsetof(UWBP_GPSJournal_Entry_C, Image_QuestGiver) == 0x0002A0, "Member 'UWBP_GPSJournal_Entry_C::Image_QuestGiver' has a wrong offset!");
static_assert(offsetof(UWBP_GPSJournal_Entry_C, TextBlock_Description) == 0x0002A8, "Member 'UWBP_GPSJournal_Entry_C::TextBlock_Description' has a wrong offset!");
static_assert(offsetof(UWBP_GPSJournal_Entry_C, TextBlock_QuestgiverName) == 0x0002B0, "Member 'UWBP_GPSJournal_Entry_C::TextBlock_QuestgiverName' has a wrong offset!");
static_assert(offsetof(UWBP_GPSJournal_Entry_C, TextBlock_RewardMoney) == 0x0002B8, "Member 'UWBP_GPSJournal_Entry_C::TextBlock_RewardMoney' has a wrong offset!");
static_assert(offsetof(UWBP_GPSJournal_Entry_C, TextBlock_Time) == 0x0002C0, "Member 'UWBP_GPSJournal_Entry_C::TextBlock_Time' has a wrong offset!");
static_assert(offsetof(UWBP_GPSJournal_Entry_C, Quest) == 0x0002C8, "Member 'UWBP_GPSJournal_Entry_C::Quest' has a wrong offset!");
static_assert(offsetof(UWBP_GPSJournal_Entry_C, QuestTimer) == 0x0002D0, "Member 'UWBP_GPSJournal_Entry_C::QuestTimer' has a wrong offset!");
static_assert(offsetof(UWBP_GPSJournal_Entry_C, UpdateTimer) == 0x0002D8, "Member 'UWBP_GPSJournal_Entry_C::UpdateTimer' has a wrong offset!");
static_assert(offsetof(UWBP_GPSJournal_Entry_C, OnDetailsClicked) == 0x0002E0, "Member 'UWBP_GPSJournal_Entry_C::OnDetailsClicked' has a wrong offset!");

}

