#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RUSure

#include "Basic.hpp"

#include "FMODStudio_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_RUSure.WBP_RUSure_C.ExecuteUbergraph_WBP_RUSure
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_RUSure_C_ExecuteUbergraph_WBP_RUSure final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0008(0x0018)()
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ReferenceParm)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_1;                // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0090(0x0018)()
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_2;                // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_3;                // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_RUSure_C_ExecuteUbergraph_WBP_RUSure) == 0x000008, "Wrong alignment on WBP_RUSure_C_ExecuteUbergraph_WBP_RUSure");
static_assert(sizeof(WBP_RUSure_C_ExecuteUbergraph_WBP_RUSure) == 0x0000B8, "Wrong size on WBP_RUSure_C_ExecuteUbergraph_WBP_RUSure");
static_assert(offsetof(WBP_RUSure_C_ExecuteUbergraph_WBP_RUSure, EntryPoint) == 0x000000, "Member 'WBP_RUSure_C_ExecuteUbergraph_WBP_RUSure::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_RUSure_C_ExecuteUbergraph_WBP_RUSure, CallFunc_Conv_NameToText_ReturnValue) == 0x000008, "Member 'WBP_RUSure_C_ExecuteUbergraph_WBP_RUSure::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RUSure_C_ExecuteUbergraph_WBP_RUSure, CallFunc_PlayEvent2D_ReturnValue) == 0x000020, "Member 'WBP_RUSure_C_ExecuteUbergraph_WBP_RUSure::CallFunc_PlayEvent2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RUSure_C_ExecuteUbergraph_WBP_RUSure, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'WBP_RUSure_C_ExecuteUbergraph_WBP_RUSure::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_RUSure_C_ExecuteUbergraph_WBP_RUSure, K2Node_MakeArray_Array) == 0x000078, "Member 'WBP_RUSure_C_ExecuteUbergraph_WBP_RUSure::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_RUSure_C_ExecuteUbergraph_WBP_RUSure, CallFunc_PlayEvent2D_ReturnValue_1) == 0x000088, "Member 'WBP_RUSure_C_ExecuteUbergraph_WBP_RUSure::CallFunc_PlayEvent2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RUSure_C_ExecuteUbergraph_WBP_RUSure, CallFunc_Format_ReturnValue) == 0x000090, "Member 'WBP_RUSure_C_ExecuteUbergraph_WBP_RUSure::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RUSure_C_ExecuteUbergraph_WBP_RUSure, CallFunc_PlayEvent2D_ReturnValue_2) == 0x0000A8, "Member 'WBP_RUSure_C_ExecuteUbergraph_WBP_RUSure::CallFunc_PlayEvent2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_RUSure_C_ExecuteUbergraph_WBP_RUSure, CallFunc_PlayEvent2D_ReturnValue_3) == 0x0000B0, "Member 'WBP_RUSure_C_ExecuteUbergraph_WBP_RUSure::CallFunc_PlayEvent2D_ReturnValue_3' has a wrong offset!");

}

