#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlayButton

#include "Basic.hpp"

#include "FMODStudio_structs.hpp"


namespace SDK::Params
{

// Function WBP_PlayButton.WBP_PlayButton_C.ExecuteUbergraph_WBP_PlayButton
// 0x0050 (0x0050 - 0x0000)
struct WBP_PlayButton_C_ExecuteUbergraph_WBP_PlayButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0018(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0030(0x0018)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayButton_C_ExecuteUbergraph_WBP_PlayButton) == 0x000008, "Wrong alignment on WBP_PlayButton_C_ExecuteUbergraph_WBP_PlayButton");
static_assert(sizeof(WBP_PlayButton_C_ExecuteUbergraph_WBP_PlayButton) == 0x000050, "Wrong size on WBP_PlayButton_C_ExecuteUbergraph_WBP_PlayButton");
static_assert(offsetof(WBP_PlayButton_C_ExecuteUbergraph_WBP_PlayButton, EntryPoint) == 0x000000, "Member 'WBP_PlayButton_C_ExecuteUbergraph_WBP_PlayButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PlayButton_C_ExecuteUbergraph_WBP_PlayButton, CallFunc_PlayEvent2D_ReturnValue) == 0x000008, "Member 'WBP_PlayButton_C_ExecuteUbergraph_WBP_PlayButton::CallFunc_PlayEvent2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayButton_C_ExecuteUbergraph_WBP_PlayButton, Temp_bool_Variable) == 0x000010, "Member 'WBP_PlayButton_C_ExecuteUbergraph_WBP_PlayButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PlayButton_C_ExecuteUbergraph_WBP_PlayButton, CallFunc_TextIsEmpty_ReturnValue) == 0x000011, "Member 'WBP_PlayButton_C_ExecuteUbergraph_WBP_PlayButton::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayButton_C_ExecuteUbergraph_WBP_PlayButton, CallFunc_MakeLiteralText_ReturnValue) == 0x000018, "Member 'WBP_PlayButton_C_ExecuteUbergraph_WBP_PlayButton::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayButton_C_ExecuteUbergraph_WBP_PlayButton, K2Node_Select_Default) == 0x000030, "Member 'WBP_PlayButton_C_ExecuteUbergraph_WBP_PlayButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_PlayButton_C_ExecuteUbergraph_WBP_PlayButton, K2Node_Event_IsDesignTime) == 0x000048, "Member 'WBP_PlayButton_C_ExecuteUbergraph_WBP_PlayButton::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_PlayButton.WBP_PlayButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_PlayButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayButton_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_PlayButton_C_PreConstruct");
static_assert(sizeof(WBP_PlayButton_C_PreConstruct) == 0x000001, "Wrong size on WBP_PlayButton_C_PreConstruct");
static_assert(offsetof(WBP_PlayButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_PlayButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_PlayButton.WBP_PlayButton_C.SetButtonText
// 0x0018 (0x0018 - 0x0000)
struct WBP_PlayButton_C_SetButtonText final
{
public:
	class FText                                   NewText;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_PlayButton_C_SetButtonText) == 0x000008, "Wrong alignment on WBP_PlayButton_C_SetButtonText");
static_assert(sizeof(WBP_PlayButton_C_SetButtonText) == 0x000018, "Wrong size on WBP_PlayButton_C_SetButtonText");
static_assert(offsetof(WBP_PlayButton_C_SetButtonText, NewText) == 0x000000, "Member 'WBP_PlayButton_C_SetButtonText::NewText' has a wrong offset!");

}

