#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Journal

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Journal.WBP_Journal_C.ExecuteUbergraph_WBP_Journal
// 0x00F8 (0x00F8 - 0x0000)
struct WBP_Journal_C_ExecuteUbergraph_WBP_Journal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_QuestDetails_C*                    CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Object;                         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_CustomEvent_Field;                          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UQuestContextViewModel*                 CallFunc_GetDetailQuestContextViewModel_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_QuestDetails_C*                    CallFunc_Create_ReturnValue_1;                     // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_QuestDetails_C*                    K2Node_DynamicCast_AsWBP_Quest_Details;            // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UQuestContextViewModel*                 CallFunc_GetDetailQuestContextViewModel_ReturnValue_1; // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object, const struct FFieldNotificationId& Field)> K2Node_CreateDelegate_OutputDelegate;              // 0x0058(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Object, const struct FFieldNotificationId& Field)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x007C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object, const struct FFieldNotificationId& Field)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x008C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotTutorialQuest_NotSpecial;              // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UQuestContextViewModel*                 CallFunc_GetDetailQuestContextViewModel_ReturnValue_2; // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_QuestDetails_C*                    CallFunc_Create_ReturnValue_2;                     // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_1;                   // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x00E8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Journal_C_ExecuteUbergraph_WBP_Journal) == 0x000008, "Wrong alignment on WBP_Journal_C_ExecuteUbergraph_WBP_Journal");
static_assert(sizeof(WBP_Journal_C_ExecuteUbergraph_WBP_Journal) == 0x0000F8, "Wrong size on WBP_Journal_C_ExecuteUbergraph_WBP_Journal");
static_assert(offsetof(WBP_Journal_C_ExecuteUbergraph_WBP_Journal, EntryPoint) == 0x000000, "Member 'WBP_Journal_C_ExecuteUbergraph_WBP_Journal::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Journal_C_ExecuteUbergraph_WBP_Journal, CallFunc_Create_ReturnValue) == 0x000008, "Member 'WBP_Journal_C_ExecuteUbergraph_WBP_Journal::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Journal_C_ExecuteUbergraph_WBP_Journal, K2Node_CustomEvent_Object) == 0x000010, "Member 'WBP_Journal_C_ExecuteUbergraph_WBP_Journal::K2Node_CustomEvent_Object' has a wrong offset!");
static_assert(offsetof(WBP_Journal_C_ExecuteUbergraph_WBP_Journal, K2Node_CustomEvent_Field) == 0x000018, "Member 'WBP_Journal_C_ExecuteUbergraph_WBP_Journal::K2Node_CustomEvent_Field' has a wrong offset!");
static_assert(offsetof(WBP_Journal_C_ExecuteUbergraph_WBP_Journal, CallFunc_GetDetailQuestContextViewModel_ReturnValue) == 0x000020, "Member 'WBP_Journal_C_ExecuteUbergraph_WBP_Journal::CallFunc_GetDetailQuestContextViewModel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Journal_C_ExecuteUbergraph_WBP_Journal, CallFunc_GetOwningPlayer_ReturnValue) == 0x000028, "Member 'WBP_Journal_C_ExecuteUbergraph_WBP_Journal::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Journal_C_ExecuteUbergraph_WBP_Journal, CallFunc_Create_ReturnValue_1) == 0x000030, "Member 'WBP_Journal_C_ExecuteUbergraph_WBP_Journal::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Journal_C_ExecuteUbergraph_WBP_Journal, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000038, "Member 'WBP_Journal_C_ExecuteUbergraph_WBP_Journal::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Journal_C_ExecuteUbergraph_WBP_Journal, K2Node_DynamicCast_AsWBP_Quest_Details) == 0x000040, "Member 'WBP_Journal_C_ExecuteUbergraph_WBP_Journal::K2Node_DynamicCast_AsWBP_Quest_Details' has a wrong offset!");
static_assert(offsetof(WBP_Journal_C_ExecuteUbergraph_WBP_Journal, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'WBP_Journal_C_ExecuteUbergraph_WBP_Journal::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Journal_C_ExecuteUbergraph_WBP_Journal, CallFunc_IsValid_ReturnValue) == 0x000049, "Member 'WBP_Journal_C_ExecuteUbergraph_WBP_Journal::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Journal_C_ExecuteUbergraph_WBP_Journal, CallFunc_GetDetailQuestContextViewModel_ReturnValue_1) == 0x000050, "Member 'WBP_Journal_C_ExecuteUbergraph_WBP_Journal::CallFunc_GetDetailQuestContextViewModel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Journal_C_ExecuteUbergraph_WBP_Journal, K2Node_CreateDelegate_OutputDelegate) == 0x000058, "Member 'WBP_Journal_C_ExecuteUbergraph_WBP_Journal::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Journal_C_ExecuteUbergraph_WBP_Journal, CallFunc_IsValid_ReturnValue_1) == 0x000068, "Member 'WBP_Journal_C_ExecuteUbergraph_WBP_Journal::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Journal_C_ExecuteUbergraph_WBP_Journal, CallFunc_AddChild_ReturnValue) == 0x000070, "Member 'WBP_Journal_C_ExecuteUbergraph_WBP_Journal::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Journal_C_ExecuteUbergraph_WBP_Journal, K2Node_Event_IsDesignTime) == 0x000078, "Member 'WBP_Journal_C_ExecuteUbergraph_WBP_Journal::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Journal_C_ExecuteUbergraph_WBP_Journal, K2Node_CreateDelegate_OutputDelegate_1) == 0x00007C, "Member 'WBP_Journal_C_ExecuteUbergraph_WBP_Journal::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Journal_C_ExecuteUbergraph_WBP_Journal, K2Node_CreateDelegate_OutputDelegate_2) == 0x00008C, "Member 'WBP_Journal_C_ExecuteUbergraph_WBP_Journal::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_Journal_C_ExecuteUbergraph_WBP_Journal, CallFunc_IsValid_ReturnValue_2) == 0x00009C, "Member 'WBP_Journal_C_ExecuteUbergraph_WBP_Journal::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Journal_C_ExecuteUbergraph_WBP_Journal, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x0000A0, "Member 'WBP_Journal_C_ExecuteUbergraph_WBP_Journal::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_Journal_C_ExecuteUbergraph_WBP_Journal, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x0000A8, "Member 'WBP_Journal_C_ExecuteUbergraph_WBP_Journal::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Journal_C_ExecuteUbergraph_WBP_Journal, CallFunc_IsValid_ReturnValue_3) == 0x0000B0, "Member 'WBP_Journal_C_ExecuteUbergraph_WBP_Journal::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Journal_C_ExecuteUbergraph_WBP_Journal, CallFunc_NotTutorialQuest_NotSpecial) == 0x0000B1, "Member 'WBP_Journal_C_ExecuteUbergraph_WBP_Journal::CallFunc_NotTutorialQuest_NotSpecial' has a wrong offset!");
static_assert(offsetof(WBP_Journal_C_ExecuteUbergraph_WBP_Journal, CallFunc_GetDetailQuestContextViewModel_ReturnValue_2) == 0x0000B8, "Member 'WBP_Journal_C_ExecuteUbergraph_WBP_Journal::CallFunc_GetDetailQuestContextViewModel_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Journal_C_ExecuteUbergraph_WBP_Journal, CallFunc_BooleanAND_ReturnValue) == 0x0000C0, "Member 'WBP_Journal_C_ExecuteUbergraph_WBP_Journal::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Journal_C_ExecuteUbergraph_WBP_Journal, CallFunc_Create_ReturnValue_2) == 0x0000C8, "Member 'WBP_Journal_C_ExecuteUbergraph_WBP_Journal::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Journal_C_ExecuteUbergraph_WBP_Journal, CallFunc_AddChild_ReturnValue_1) == 0x0000D0, "Member 'WBP_Journal_C_ExecuteUbergraph_WBP_Journal::CallFunc_AddChild_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Journal_C_ExecuteUbergraph_WBP_Journal, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000D8, "Member 'WBP_Journal_C_ExecuteUbergraph_WBP_Journal::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_Journal_C_ExecuteUbergraph_WBP_Journal, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000E8, "Member 'WBP_Journal_C_ExecuteUbergraph_WBP_Journal::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");

// Function WBP_Journal.WBP_Journal_C.OnQuestDetailsViewModelChanged
// 0x0010 (0x0010 - 0x0000)
struct WBP_Journal_C_OnQuestDetailsViewModelChanged final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   Field;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Journal_C_OnQuestDetailsViewModelChanged) == 0x000008, "Wrong alignment on WBP_Journal_C_OnQuestDetailsViewModelChanged");
static_assert(sizeof(WBP_Journal_C_OnQuestDetailsViewModelChanged) == 0x000010, "Wrong size on WBP_Journal_C_OnQuestDetailsViewModelChanged");
static_assert(offsetof(WBP_Journal_C_OnQuestDetailsViewModelChanged, Object) == 0x000000, "Member 'WBP_Journal_C_OnQuestDetailsViewModelChanged::Object' has a wrong offset!");
static_assert(offsetof(WBP_Journal_C_OnQuestDetailsViewModelChanged, Field) == 0x000008, "Member 'WBP_Journal_C_OnQuestDetailsViewModelChanged::Field' has a wrong offset!");

// Function WBP_Journal.WBP_Journal_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Journal_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Journal_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Journal_C_PreConstruct");
static_assert(sizeof(WBP_Journal_C_PreConstruct) == 0x000001, "Wrong size on WBP_Journal_C_PreConstruct");
static_assert(offsetof(WBP_Journal_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Journal_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Journal.WBP_Journal_C.GetQuestListViewModel
// 0x0018 (0x0018 - 0x0000)
struct WBP_Journal_C_GetQuestListViewModel final
{
public:
	class UQuestListViewModel*                    ViewModel;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UQuestListViewModel*                    CallFunc_GetPlayerQuestListViewModel_ReturnValue;  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Journal_C_GetQuestListViewModel) == 0x000008, "Wrong alignment on WBP_Journal_C_GetQuestListViewModel");
static_assert(sizeof(WBP_Journal_C_GetQuestListViewModel) == 0x000018, "Wrong size on WBP_Journal_C_GetQuestListViewModel");
static_assert(offsetof(WBP_Journal_C_GetQuestListViewModel, ViewModel) == 0x000000, "Member 'WBP_Journal_C_GetQuestListViewModel::ViewModel' has a wrong offset!");
static_assert(offsetof(WBP_Journal_C_GetQuestListViewModel, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'WBP_Journal_C_GetQuestListViewModel::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Journal_C_GetQuestListViewModel, CallFunc_GetPlayerQuestListViewModel_ReturnValue) == 0x000010, "Member 'WBP_Journal_C_GetQuestListViewModel::CallFunc_GetPlayerQuestListViewModel_ReturnValue' has a wrong offset!");

}

