#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Objective_0

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Objective.WBP_Objective_C
// 0x0090 (0x0310 - 0x0280)
class WBP_Objective_0::UWBP_Objective_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOutObjCol;                                     // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowObjCollection;                                 // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeOut;                                           // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_44;                                         // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_68;                                          // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ObjectiveNameText;                                 // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTreeView*                              SubObjectivesTreeView;                             // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Objective_C*                        Objective;                                         // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UBP_Objective_C*>                ObjectivesPool;                                    // 0x02D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	FMulticastInlineDelegateProperty_             ObjCollectionCompleted;                            // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          TickEnabled;                                       // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_ObjCollection_C*                    ObjCollection;                                     // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<class UBP_Objective_C*>                RemovedPool;                                       // 0x0300(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void AddObjective(class UBP_Objective_C* Param_Objective);
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void ExecuteUbergraph_WBP_Objective(int32 EntryPoint);
	void Finished_7D4082964D8E2932FA267CB2A555FA86();
	void Finished_7FD6ED2046B55D98C30A14BDB44B9906();
	void Finished_9E50549D40421753A45F78B1FD554733();
	void Finished_E72C6BE94311A64A433981B00DB57F40();
	void ObjCollectionCompleted__DelegateSignature(class UBP_ObjCollection_C* Param_ObjCollection);
	void OnActivated_Event_0(class UBP_Objective_C* Param_Objective);
	void OnCompleted(class UBP_Objective_C* Param_Objective);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void RemoveObjective(class UBP_Objective_C* Param_Objective);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WidgetBlueprintGeneratedClass WBP_Objective.WBP_Objective_C", true, "WBP_Objective_C">();
	}
	static class WBP_Objective_0::UWBP_Objective_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<WBP_Objective_0::UWBP_Objective_C>();
	}
};
static_assert(alignof(WBP_Objective_0::UWBP_Objective_C) == 0x000008, "Wrong alignment on WBP_Objective_0::UWBP_Objective_C");
static_assert(sizeof(WBP_Objective_0::UWBP_Objective_C) == 0x000310, "Wrong size on WBP_Objective_0::UWBP_Objective_C");
static_assert(offsetof(WBP_Objective_0::UWBP_Objective_C, UberGraphFrame) == 0x000280, "Member 'WBP_Objective_0::UWBP_Objective_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(WBP_Objective_0::UWBP_Objective_C, FadeOutObjCol) == 0x000288, "Member 'WBP_Objective_0::UWBP_Objective_C::FadeOutObjCol' has a wrong offset!");
static_assert(offsetof(WBP_Objective_0::UWBP_Objective_C, ShowObjCollection) == 0x000290, "Member 'WBP_Objective_0::UWBP_Objective_C::ShowObjCollection' has a wrong offset!");
static_assert(offsetof(WBP_Objective_0::UWBP_Objective_C, FadeIn) == 0x000298, "Member 'WBP_Objective_0::UWBP_Objective_C::FadeIn' has a wrong offset!");
static_assert(offsetof(WBP_Objective_0::UWBP_Objective_C, FadeOut) == 0x0002A0, "Member 'WBP_Objective_0::UWBP_Objective_C::FadeOut' has a wrong offset!");
static_assert(offsetof(WBP_Objective_0::UWBP_Objective_C, Button_44) == 0x0002A8, "Member 'WBP_Objective_0::UWBP_Objective_C::Button_44' has a wrong offset!");
static_assert(offsetof(WBP_Objective_0::UWBP_Objective_C, Image_68) == 0x0002B0, "Member 'WBP_Objective_0::UWBP_Objective_C::Image_68' has a wrong offset!");
static_assert(offsetof(WBP_Objective_0::UWBP_Objective_C, ObjectiveNameText) == 0x0002B8, "Member 'WBP_Objective_0::UWBP_Objective_C::ObjectiveNameText' has a wrong offset!");
static_assert(offsetof(WBP_Objective_0::UWBP_Objective_C, SubObjectivesTreeView) == 0x0002C0, "Member 'WBP_Objective_0::UWBP_Objective_C::SubObjectivesTreeView' has a wrong offset!");
static_assert(offsetof(WBP_Objective_0::UWBP_Objective_C, Objective) == 0x0002C8, "Member 'WBP_Objective_0::UWBP_Objective_C::Objective' has a wrong offset!");
static_assert(offsetof(WBP_Objective_0::UWBP_Objective_C, ObjectivesPool) == 0x0002D0, "Member 'WBP_Objective_0::UWBP_Objective_C::ObjectivesPool' has a wrong offset!");
static_assert(offsetof(WBP_Objective_0::UWBP_Objective_C, ObjCollectionCompleted) == 0x0002E0, "Member 'WBP_Objective_0::UWBP_Objective_C::ObjCollectionCompleted' has a wrong offset!");
static_assert(offsetof(WBP_Objective_0::UWBP_Objective_C, TickEnabled) == 0x0002F0, "Member 'WBP_Objective_0::UWBP_Objective_C::TickEnabled' has a wrong offset!");
static_assert(offsetof(WBP_Objective_0::UWBP_Objective_C, ObjCollection) == 0x0002F8, "Member 'WBP_Objective_0::UWBP_Objective_C::ObjCollection' has a wrong offset!");
static_assert(offsetof(WBP_Objective_0::UWBP_Objective_C, RemovedPool) == 0x000300, "Member 'WBP_Objective_0::UWBP_Objective_C::RemovedPool' has a wrong offset!");

}

