#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CharStatProgress

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "S_StatInfo_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CharStatProgress.WBP_CharStatProgress_C
// 0x00B0 (0x0330 - 0x0280)
class UWBP_CharStatProgress_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_432;                                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BGIcon;                                      // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Icon;                                        // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_1;                                     // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_2;                                     // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_3;                                     // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_4;                                     // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_5;                                     // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Description;                             // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Name;                                    // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FS_StatInfo                            StatInfo;                                          // 0x02E0(0x0040)(Edit, BlueprintVisible, BlueprintReadOnly, ExposeOnSpawn, HasGetValueTypeHash)
	TArray<class UProgressBar*>                   Array;                                             // 0x0320(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void BndEvt__WBP_CharStatProgress_Button_432_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_CharStatProgress_Button_432_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_CharStatProgress(int32 EntryPoint);
	void Init();
	void PreConstruct(bool IsDesignTime);
	void SetProgress(int32 CurrentProgress, int32 MaxProgress);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CharStatProgress_C">();
	}
	static class UWBP_CharStatProgress_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CharStatProgress_C>();
	}
};
static_assert(alignof(UWBP_CharStatProgress_C) == 0x000008, "Wrong alignment on UWBP_CharStatProgress_C");
static_assert(sizeof(UWBP_CharStatProgress_C) == 0x000330, "Wrong size on UWBP_CharStatProgress_C");
static_assert(offsetof(UWBP_CharStatProgress_C, UberGraphFrame) == 0x000280, "Member 'UWBP_CharStatProgress_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CharStatProgress_C, Hover) == 0x000288, "Member 'UWBP_CharStatProgress_C::Hover' has a wrong offset!");
static_assert(offsetof(UWBP_CharStatProgress_C, Button_432) == 0x000290, "Member 'UWBP_CharStatProgress_C::Button_432' has a wrong offset!");
static_assert(offsetof(UWBP_CharStatProgress_C, Image_BGIcon) == 0x000298, "Member 'UWBP_CharStatProgress_C::Image_BGIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CharStatProgress_C, Image_Icon) == 0x0002A0, "Member 'UWBP_CharStatProgress_C::Image_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_CharStatProgress_C, ProgressBar_1) == 0x0002A8, "Member 'UWBP_CharStatProgress_C::ProgressBar_1' has a wrong offset!");
static_assert(offsetof(UWBP_CharStatProgress_C, ProgressBar_2) == 0x0002B0, "Member 'UWBP_CharStatProgress_C::ProgressBar_2' has a wrong offset!");
static_assert(offsetof(UWBP_CharStatProgress_C, ProgressBar_3) == 0x0002B8, "Member 'UWBP_CharStatProgress_C::ProgressBar_3' has a wrong offset!");
static_assert(offsetof(UWBP_CharStatProgress_C, ProgressBar_4) == 0x0002C0, "Member 'UWBP_CharStatProgress_C::ProgressBar_4' has a wrong offset!");
static_assert(offsetof(UWBP_CharStatProgress_C, ProgressBar_5) == 0x0002C8, "Member 'UWBP_CharStatProgress_C::ProgressBar_5' has a wrong offset!");
static_assert(offsetof(UWBP_CharStatProgress_C, TextBlock_Description) == 0x0002D0, "Member 'UWBP_CharStatProgress_C::TextBlock_Description' has a wrong offset!");
static_assert(offsetof(UWBP_CharStatProgress_C, TextBlock_Name) == 0x0002D8, "Member 'UWBP_CharStatProgress_C::TextBlock_Name' has a wrong offset!");
static_assert(offsetof(UWBP_CharStatProgress_C, StatInfo) == 0x0002E0, "Member 'UWBP_CharStatProgress_C::StatInfo' has a wrong offset!");
static_assert(offsetof(UWBP_CharStatProgress_C, Array) == 0x000320, "Member 'UWBP_CharStatProgress_C::Array' has a wrong offset!");

}

