#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_QuestLog

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_QuestLog.WBP_QuestLog_C
// 0x0140 (0x03C0 - 0x0280)
class UWBP_QuestLog_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UQuestListViewModel*                    QuestListViewModel;                                // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVerticalBox*                           Activities_EntryBox;                               // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_1;                                     // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           CompletedQuests_Container;                         // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           CompletedQuests_EntryBox;                          // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           EntryBox;                                          // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Quests_Container;                                  // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             QuestTitleText;                                    // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           TrackedQuests_EntryBox;                            // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_LabelText_C*                       UMG_LabelText;                                     // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_LabelText_C*                       UMG_LabelText_1;                                   // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_LabelText_C*                       UMG_LabelText_2;                                   // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<class UQuestContextViewModel*, class UWBP_QuestLogEntry_C*> EntryWidgets;                                      // 0x02E8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UWBP_QuestLogEntry_C*                   SelectedLogEntry;                                  // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_QuestLogEntry_C*                   EmptyEntry;                                        // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMap<class UQuestContextViewModel*, class UWBP_QuestLogEntry_C*> ActiveQuest;                                       // 0x0348(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UWBP_QuestLogEntry_C*                   LastAddedCompleteEntry;                            // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_QuestDetails_C*                    QuestDetails;                                      // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsQuestChanged;                                   // 0x03A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UQuestContextViewModel*                 TutorialQuestViewModel;                            // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UQuestContextViewModel*                 WayOutViewModel;                                   // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_QuestLog(int32 EntryPoint);
	void FindSpecialQuestContexts();
	void Finished_78C5196F4F1B8A6DEA964CB351AA18E2();
	void NotTutorialQuest(class UQuestContextViewModel* QuestContext, bool* NotSpecial);
	void OnInitialized();
	void OnLogEntrySelected(class UQuestContextViewModel* ViewModel, class UWBP_QuestLogEntry_C* WidgetRef);
	void OnQuestListChanged(class UObject* Object, const struct FFieldNotificationId& Field);

	void GetQuestListViewModel(class UQuestListViewModel** ViewModel) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_QuestLog_C">();
	}
	static class UWBP_QuestLog_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_QuestLog_C>();
	}
};
static_assert(alignof(UWBP_QuestLog_C) == 0x000008, "Wrong alignment on UWBP_QuestLog_C");
static_assert(sizeof(UWBP_QuestLog_C) == 0x0003C0, "Wrong size on UWBP_QuestLog_C");
static_assert(offsetof(UWBP_QuestLog_C, UberGraphFrame) == 0x000280, "Member 'UWBP_QuestLog_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_QuestLog_C, QuestListViewModel) == 0x000288, "Member 'UWBP_QuestLog_C::QuestListViewModel' has a wrong offset!");
static_assert(offsetof(UWBP_QuestLog_C, Activities_EntryBox) == 0x000290, "Member 'UWBP_QuestLog_C::Activities_EntryBox' has a wrong offset!");
static_assert(offsetof(UWBP_QuestLog_C, CanvasPanel_1) == 0x000298, "Member 'UWBP_QuestLog_C::CanvasPanel_1' has a wrong offset!");
static_assert(offsetof(UWBP_QuestLog_C, CompletedQuests_Container) == 0x0002A0, "Member 'UWBP_QuestLog_C::CompletedQuests_Container' has a wrong offset!");
static_assert(offsetof(UWBP_QuestLog_C, CompletedQuests_EntryBox) == 0x0002A8, "Member 'UWBP_QuestLog_C::CompletedQuests_EntryBox' has a wrong offset!");
static_assert(offsetof(UWBP_QuestLog_C, EntryBox) == 0x0002B0, "Member 'UWBP_QuestLog_C::EntryBox' has a wrong offset!");
static_assert(offsetof(UWBP_QuestLog_C, Quests_Container) == 0x0002B8, "Member 'UWBP_QuestLog_C::Quests_Container' has a wrong offset!");
static_assert(offsetof(UWBP_QuestLog_C, QuestTitleText) == 0x0002C0, "Member 'UWBP_QuestLog_C::QuestTitleText' has a wrong offset!");
static_assert(offsetof(UWBP_QuestLog_C, TrackedQuests_EntryBox) == 0x0002C8, "Member 'UWBP_QuestLog_C::TrackedQuests_EntryBox' has a wrong offset!");
static_assert(offsetof(UWBP_QuestLog_C, UMG_LabelText) == 0x0002D0, "Member 'UWBP_QuestLog_C::UMG_LabelText' has a wrong offset!");
static_assert(offsetof(UWBP_QuestLog_C, UMG_LabelText_1) == 0x0002D8, "Member 'UWBP_QuestLog_C::UMG_LabelText_1' has a wrong offset!");
static_assert(offsetof(UWBP_QuestLog_C, UMG_LabelText_2) == 0x0002E0, "Member 'UWBP_QuestLog_C::UMG_LabelText_2' has a wrong offset!");
static_assert(offsetof(UWBP_QuestLog_C, EntryWidgets) == 0x0002E8, "Member 'UWBP_QuestLog_C::EntryWidgets' has a wrong offset!");
static_assert(offsetof(UWBP_QuestLog_C, SelectedLogEntry) == 0x000338, "Member 'UWBP_QuestLog_C::SelectedLogEntry' has a wrong offset!");
static_assert(offsetof(UWBP_QuestLog_C, EmptyEntry) == 0x000340, "Member 'UWBP_QuestLog_C::EmptyEntry' has a wrong offset!");
static_assert(offsetof(UWBP_QuestLog_C, ActiveQuest) == 0x000348, "Member 'UWBP_QuestLog_C::ActiveQuest' has a wrong offset!");
static_assert(offsetof(UWBP_QuestLog_C, LastAddedCompleteEntry) == 0x000398, "Member 'UWBP_QuestLog_C::LastAddedCompleteEntry' has a wrong offset!");
static_assert(offsetof(UWBP_QuestLog_C, QuestDetails) == 0x0003A0, "Member 'UWBP_QuestLog_C::QuestDetails' has a wrong offset!");
static_assert(offsetof(UWBP_QuestLog_C, bIsQuestChanged) == 0x0003A8, "Member 'UWBP_QuestLog_C::bIsQuestChanged' has a wrong offset!");
static_assert(offsetof(UWBP_QuestLog_C, TutorialQuestViewModel) == 0x0003B0, "Member 'UWBP_QuestLog_C::TutorialQuestViewModel' has a wrong offset!");
static_assert(offsetof(UWBP_QuestLog_C, WayOutViewModel) == 0x0003B8, "Member 'UWBP_QuestLog_C::WayOutViewModel' has a wrong offset!");

}

