#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_QuestLog

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_QuestLog.WBP_QuestLog_C.ExecuteUbergraph_WBP_QuestLog
// 0x0250 (0x0250 - 0x0000)
struct WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_QuestLogEntry_C*                   CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_QuestLogEntry_C*                   K2Node_DynamicCast_AsWBP_Quest_Log_Entry;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UQuestContextViewModel*                 K2Node_CustomEvent_ViewModel;                      // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_QuestLogEntry_C*                   K2Node_CustomEvent_WidgetRef;                      // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UQuestContextViewModel*                 CallFunc_GetDetailQuestContextViewModel_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UQuestContextViewModel*>         CallFunc_Map_Keys_Keys;                            // 0x0048(0x0010)(ReferenceParm)
	class UObject*                                K2Node_CustomEvent_Object;                         // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_CustomEvent_Field;                          // 0x0060(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<class UQuestContextViewModel*>         CallFunc_GetQuestContexts_ReturnValue;             // 0x0068(0x0010)(ReferenceParm)
	TArray<class UQuestContextViewModel*>         CallFunc_FilterChangedQuestContextViewModels_OutAdded; // 0x0078(0x0010)(ReferenceParm)
	TArray<class UQuestContextViewModel*>         CallFunc_FilterChangedQuestContextViewModels_OutRemoved; // 0x0088(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyChildren_ReturnValue;               // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A6[0x2];                                       // 0x00A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_QuestLogEntry_C*>           CallFunc_Map_Values_Values;                        // 0x00A8(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UQuestContextViewModel*>         CallFunc_Map_Keys_Keys_1;                          // 0x00C0(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UQuestContextViewModel*                 CallFunc_Array_Get_Item;                           // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E3[0x5];                                       // 0x00E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBox*                           K2Node_Select_Default;                             // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_QuestLogEntry_C*>           CallFunc_Map_Values_Values_1;                      // 0x00F8(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_QuestLogEntry_C*                   CallFunc_Array_Get_Item_1;                         // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11A[0x2];                                      // 0x011A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_QuestLogEntry_C*                   CallFunc_Array_Get_Item_2;                         // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_1;      // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UQuestContextViewModel*>         CallFunc_Map_Keys_Keys_2;                          // 0x0130(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UQuestContextViewModel*                 CallFunc_Array_Get_Item_3;                         // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue_1;      // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_152[0x2];                                      // 0x0152(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x015C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UQuestContextViewModel*                 CallFunc_Array_Get_Item_4;                         // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_QuestLogEntry_C*                   CallFunc_Map_Find_Value;                           // 0x0180(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x3];                                      // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x018C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UQuestContextViewModel* ViewModel, class UWBP_QuestLogEntry_C* WidgetRef)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x01A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B2[0x2];                                      // 0x01B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BD[0x3];                                      // 0x01BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UQuestContextViewModel*                 CallFunc_Array_Get_Item_5;                         // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_QuestLogEntry_C*                   CallFunc_Array_Get_Item_6;                         // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_2;      // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_3;      // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_4;      // 0x0200(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x3];                                      // 0x0219(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Object, const struct FFieldNotificationId& Field)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x021C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x022C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue_2;      // 0x022D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x022E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x022F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231[0x3];                                      // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_5;      // 0x0238(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x3];                                      // 0x0241(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_QuestLogEntry_C*                   CallFunc_Create_ReturnValue_1;                     // 0x0248(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog) == 0x000008, "Wrong alignment on WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog");
static_assert(sizeof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog) == 0x000250, "Wrong size on WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, EntryPoint) == 0x000000, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_Create_ReturnValue) == 0x000010, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, K2Node_DynamicCast_AsWBP_Quest_Log_Entry) == 0x000018, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::K2Node_DynamicCast_AsWBP_Quest_Log_Entry' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, K2Node_CustomEvent_ViewModel) == 0x000028, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::K2Node_CustomEvent_ViewModel' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, K2Node_CustomEvent_WidgetRef) == 0x000030, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::K2Node_CustomEvent_WidgetRef' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000038, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_GetDetailQuestContextViewModel_ReturnValue) == 0x000040, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_GetDetailQuestContextViewModel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_Map_Keys_Keys) == 0x000048, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, K2Node_CustomEvent_Object) == 0x000058, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::K2Node_CustomEvent_Object' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, K2Node_CustomEvent_Field) == 0x000060, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::K2Node_CustomEvent_Field' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_GetQuestContexts_ReturnValue) == 0x000068, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_GetQuestContexts_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_FilterChangedQuestContextViewModels_OutAdded) == 0x000078, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_FilterChangedQuestContextViewModels_OutAdded' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_FilterChangedQuestContextViewModels_OutRemoved) == 0x000088, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_FilterChangedQuestContextViewModels_OutRemoved' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_Array_Length_ReturnValue) == 0x000098, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_Array_Length_ReturnValue_1) == 0x00009C, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, Temp_int_Array_Index_Variable) == 0x0000A0, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_HasAnyChildren_ReturnValue) == 0x0000A4, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_HasAnyChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, Temp_bool_Variable) == 0x0000A5, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_Map_Values_Values) == 0x0000A8, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_Array_Length_ReturnValue_2) == 0x0000B8, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_Map_Keys_Keys_1) == 0x0000C0, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_Map_Keys_Keys_1' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, Temp_int_Array_Index_Variable_1) == 0x0000D0, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, Temp_bool_True_if_break_was_hit_Variable) == 0x0000D4, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_Array_Get_Item) == 0x0000D8, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000E0, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_Not_PreBool_ReturnValue) == 0x0000E1, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000E2, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, K2Node_Select_Default) == 0x0000E8, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x0000F0, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_Map_Values_Values_1) == 0x0000F8, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_Map_Values_Values_1' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, Temp_int_Loop_Counter_Variable) == 0x000108, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_Array_Get_Item_1) == 0x000110, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_IsValid_ReturnValue_1) == 0x000118, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_Less_IntInt_ReturnValue) == 0x000119, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_Add_IntInt_ReturnValue) == 0x00011C, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_Array_Get_Item_2) == 0x000120, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_AddChildToVerticalBox_ReturnValue_1) == 0x000128, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_AddChildToVerticalBox_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_Map_Keys_Keys_2) == 0x000130, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_Map_Keys_Keys_2' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_IsValid_ReturnValue_2) == 0x000140, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_Array_Get_Item_3) == 0x000148, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_NotEqual_ObjectObject_ReturnValue_1) == 0x000150, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_NotEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_IsValid_ReturnValue_3) == 0x000151, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_Array_Length_ReturnValue_3) == 0x000154, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, Temp_int_Array_Index_Variable_2) == 0x000158, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, K2Node_MakeStruct_Margin) == 0x00015C, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_Array_Get_Item_4) == 0x000170, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_Map_Remove_ReturnValue) == 0x000178, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_Map_Remove_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_Map_Find_Value) == 0x000180, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_Map_Find_ReturnValue) == 0x000188, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, K2Node_CreateDelegate_OutputDelegate) == 0x00018C, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, Temp_int_Loop_Counter_Variable_1) == 0x00019C, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001A0, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_Less_IntInt_ReturnValue_1) == 0x0001B0, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_BooleanAND_ReturnValue) == 0x0001B1, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_Add_IntInt_ReturnValue_1) == 0x0001B4, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, Temp_int_Loop_Counter_Variable_2) == 0x0001B8, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_Less_IntInt_ReturnValue_2) == 0x0001BC, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_Add_IntInt_ReturnValue_2) == 0x0001C0, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, Temp_int_Array_Index_Variable_3) == 0x0001C4, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_IsValid_ReturnValue_4) == 0x0001C8, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_Array_Get_Item_5) == 0x0001D0, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_IsValid_ReturnValue_5) == 0x0001D8, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_Array_Get_Item_6) == 0x0001E0, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_Array_Get_Item_6' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0001E8, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_AddChildToVerticalBox_ReturnValue_2) == 0x0001F0, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_AddChildToVerticalBox_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_AddChildToVerticalBox_ReturnValue_3) == 0x0001F8, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_AddChildToVerticalBox_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_AddChildToVerticalBox_ReturnValue_4) == 0x000200, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_AddChildToVerticalBox_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000208, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000210, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_IsValid_ReturnValue_6) == 0x000218, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, K2Node_CreateDelegate_OutputDelegate_2) == 0x00021C, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_IsValid_ReturnValue_7) == 0x00022C, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_NotEqual_ObjectObject_ReturnValue_2) == 0x00022D, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_NotEqual_ObjectObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x00022E, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00022F, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_IsValid_ReturnValue_8) == 0x000230, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, Temp_int_Loop_Counter_Variable_3) == 0x000234, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_AddChildToVerticalBox_ReturnValue_5) == 0x000238, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_AddChildToVerticalBox_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_Less_IntInt_ReturnValue_3) == 0x000240, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_Add_IntInt_ReturnValue_3) == 0x000244, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog, CallFunc_Create_ReturnValue_1) == 0x000248, "Member 'WBP_QuestLog_C_ExecuteUbergraph_WBP_QuestLog::CallFunc_Create_ReturnValue_1' has a wrong offset!");

// Function WBP_QuestLog.WBP_QuestLog_C.FindSpecialQuestContexts
// 0x0068 (0x0068 - 0x0000)
struct WBP_QuestLog_C_FindSpecialQuestContexts final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvPC_C*                              K2Node_DynamicCast_AsSurv_PC;                      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UQuestContext*>                  CallFunc_GetAllActiveQuestContexts_OutContexts;    // 0x0028(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UQuestContext*                          CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UQuestContextViewModel*                 CallFunc_GetViewModel_ReturnValue;                 // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UQuest*                                 CallFunc_GetQuestAsset_ReturnValue;                // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_QuestLog_C_FindSpecialQuestContexts) == 0x000008, "Wrong alignment on WBP_QuestLog_C_FindSpecialQuestContexts");
static_assert(sizeof(WBP_QuestLog_C_FindSpecialQuestContexts) == 0x000068, "Wrong size on WBP_QuestLog_C_FindSpecialQuestContexts");
static_assert(offsetof(WBP_QuestLog_C_FindSpecialQuestContexts, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_QuestLog_C_FindSpecialQuestContexts::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_FindSpecialQuestContexts, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_QuestLog_C_FindSpecialQuestContexts::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_FindSpecialQuestContexts, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_QuestLog_C_FindSpecialQuestContexts::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_FindSpecialQuestContexts, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'WBP_QuestLog_C_FindSpecialQuestContexts::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_FindSpecialQuestContexts, K2Node_DynamicCast_AsSurv_PC) == 0x000018, "Member 'WBP_QuestLog_C_FindSpecialQuestContexts::K2Node_DynamicCast_AsSurv_PC' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_FindSpecialQuestContexts, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_QuestLog_C_FindSpecialQuestContexts::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_FindSpecialQuestContexts, CallFunc_GetAllActiveQuestContexts_OutContexts) == 0x000028, "Member 'WBP_QuestLog_C_FindSpecialQuestContexts::CallFunc_GetAllActiveQuestContexts_OutContexts' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_FindSpecialQuestContexts, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'WBP_QuestLog_C_FindSpecialQuestContexts::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_FindSpecialQuestContexts, CallFunc_Array_Get_Item) == 0x000040, "Member 'WBP_QuestLog_C_FindSpecialQuestContexts::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_FindSpecialQuestContexts, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'WBP_QuestLog_C_FindSpecialQuestContexts::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_FindSpecialQuestContexts, CallFunc_GetViewModel_ReturnValue) == 0x000050, "Member 'WBP_QuestLog_C_FindSpecialQuestContexts::CallFunc_GetViewModel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_FindSpecialQuestContexts, CallFunc_GetQuestAsset_ReturnValue) == 0x000058, "Member 'WBP_QuestLog_C_FindSpecialQuestContexts::CallFunc_GetQuestAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_FindSpecialQuestContexts, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000060, "Member 'WBP_QuestLog_C_FindSpecialQuestContexts::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_FindSpecialQuestContexts, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000061, "Member 'WBP_QuestLog_C_FindSpecialQuestContexts::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");

// Function WBP_QuestLog.WBP_QuestLog_C.NotTutorialQuest
// 0x0010 (0x0010 - 0x0000)
struct WBP_QuestLog_C_NotTutorialQuest final
{
public:
	class UQuestContextViewModel*                 QuestContext;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          NotSpecial;                                        // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_QuestLog_C_NotTutorialQuest) == 0x000008, "Wrong alignment on WBP_QuestLog_C_NotTutorialQuest");
static_assert(sizeof(WBP_QuestLog_C_NotTutorialQuest) == 0x000010, "Wrong size on WBP_QuestLog_C_NotTutorialQuest");
static_assert(offsetof(WBP_QuestLog_C_NotTutorialQuest, QuestContext) == 0x000000, "Member 'WBP_QuestLog_C_NotTutorialQuest::QuestContext' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_NotTutorialQuest, NotSpecial) == 0x000008, "Member 'WBP_QuestLog_C_NotTutorialQuest::NotSpecial' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_NotTutorialQuest, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000009, "Member 'WBP_QuestLog_C_NotTutorialQuest::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function WBP_QuestLog.WBP_QuestLog_C.OnLogEntrySelected
// 0x0010 (0x0010 - 0x0000)
struct WBP_QuestLog_C_OnLogEntrySelected final
{
public:
	class UQuestContextViewModel*                 ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_QuestLogEntry_C*                   WidgetRef;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_QuestLog_C_OnLogEntrySelected) == 0x000008, "Wrong alignment on WBP_QuestLog_C_OnLogEntrySelected");
static_assert(sizeof(WBP_QuestLog_C_OnLogEntrySelected) == 0x000010, "Wrong size on WBP_QuestLog_C_OnLogEntrySelected");
static_assert(offsetof(WBP_QuestLog_C_OnLogEntrySelected, ViewModel) == 0x000000, "Member 'WBP_QuestLog_C_OnLogEntrySelected::ViewModel' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_OnLogEntrySelected, WidgetRef) == 0x000008, "Member 'WBP_QuestLog_C_OnLogEntrySelected::WidgetRef' has a wrong offset!");

// Function WBP_QuestLog.WBP_QuestLog_C.OnQuestListChanged
// 0x0010 (0x0010 - 0x0000)
struct WBP_QuestLog_C_OnQuestListChanged final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   Field;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_QuestLog_C_OnQuestListChanged) == 0x000008, "Wrong alignment on WBP_QuestLog_C_OnQuestListChanged");
static_assert(sizeof(WBP_QuestLog_C_OnQuestListChanged) == 0x000010, "Wrong size on WBP_QuestLog_C_OnQuestListChanged");
static_assert(offsetof(WBP_QuestLog_C_OnQuestListChanged, Object) == 0x000000, "Member 'WBP_QuestLog_C_OnQuestListChanged::Object' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_OnQuestListChanged, Field) == 0x000008, "Member 'WBP_QuestLog_C_OnQuestListChanged::Field' has a wrong offset!");

// Function WBP_QuestLog.WBP_QuestLog_C.GetQuestListViewModel
// 0x0018 (0x0018 - 0x0000)
struct WBP_QuestLog_C_GetQuestListViewModel final
{
public:
	class UQuestListViewModel*                    ViewModel;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UQuestListViewModel*                    CallFunc_GetPlayerQuestListViewModel_ReturnValue;  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_QuestLog_C_GetQuestListViewModel) == 0x000008, "Wrong alignment on WBP_QuestLog_C_GetQuestListViewModel");
static_assert(sizeof(WBP_QuestLog_C_GetQuestListViewModel) == 0x000018, "Wrong size on WBP_QuestLog_C_GetQuestListViewModel");
static_assert(offsetof(WBP_QuestLog_C_GetQuestListViewModel, ViewModel) == 0x000000, "Member 'WBP_QuestLog_C_GetQuestListViewModel::ViewModel' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_GetQuestListViewModel, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'WBP_QuestLog_C_GetQuestListViewModel::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestLog_C_GetQuestListViewModel, CallFunc_GetPlayerQuestListViewModel_ReturnValue) == 0x000010, "Member 'WBP_QuestLog_C_GetQuestListViewModel::CallFunc_GetPlayerQuestListViewModel_ReturnValue' has a wrong offset!");

}

