#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_New_Location

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_New_Location.WBP_New_Location_C.ExecuteUbergraph_WBP_New_Location
// 0x0090 (0x0090 - 0x0000)
struct WBP_New_Location_C_ExecuteUbergraph_WBP_New_Location final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_RegionName;                     // 0x0018(0x0018)()
	class FText                                   K2Node_CustomEvent_LocationName;                   // 0x0030(0x0018)()
	bool                                          K2Node_CustomEvent_IsCity;                         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x004C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default;                             // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result; // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue; // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_1;         // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInViewport_ReturnValue_1;               // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_2;         // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CreatePlayAnimationTimeRangeProxyObject_PlaybackSpeed_ImplicitCast; // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_New_Location_C_ExecuteUbergraph_WBP_New_Location) == 0x000008, "Wrong alignment on WBP_New_Location_C_ExecuteUbergraph_WBP_New_Location");
static_assert(sizeof(WBP_New_Location_C_ExecuteUbergraph_WBP_New_Location) == 0x000090, "Wrong size on WBP_New_Location_C_ExecuteUbergraph_WBP_New_Location");
static_assert(offsetof(WBP_New_Location_C_ExecuteUbergraph_WBP_New_Location, EntryPoint) == 0x000000, "Member 'WBP_New_Location_C_ExecuteUbergraph_WBP_New_Location::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_New_Location_C_ExecuteUbergraph_WBP_New_Location, Temp_bool_Variable) == 0x000004, "Member 'WBP_New_Location_C_ExecuteUbergraph_WBP_New_Location::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_New_Location_C_ExecuteUbergraph_WBP_New_Location, CallFunc_IsInViewport_ReturnValue) == 0x000005, "Member 'WBP_New_Location_C_ExecuteUbergraph_WBP_New_Location::CallFunc_IsInViewport_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_New_Location_C_ExecuteUbergraph_WBP_New_Location, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'WBP_New_Location_C_ExecuteUbergraph_WBP_New_Location::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_New_Location_C_ExecuteUbergraph_WBP_New_Location, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000010, "Member 'WBP_New_Location_C_ExecuteUbergraph_WBP_New_Location::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_New_Location_C_ExecuteUbergraph_WBP_New_Location, K2Node_CustomEvent_RegionName) == 0x000018, "Member 'WBP_New_Location_C_ExecuteUbergraph_WBP_New_Location::K2Node_CustomEvent_RegionName' has a wrong offset!");
static_assert(offsetof(WBP_New_Location_C_ExecuteUbergraph_WBP_New_Location, K2Node_CustomEvent_LocationName) == 0x000030, "Member 'WBP_New_Location_C_ExecuteUbergraph_WBP_New_Location::K2Node_CustomEvent_LocationName' has a wrong offset!");
static_assert(offsetof(WBP_New_Location_C_ExecuteUbergraph_WBP_New_Location, K2Node_CustomEvent_IsCity) == 0x000048, "Member 'WBP_New_Location_C_ExecuteUbergraph_WBP_New_Location::K2Node_CustomEvent_IsCity' has a wrong offset!");
static_assert(offsetof(WBP_New_Location_C_ExecuteUbergraph_WBP_New_Location, K2Node_CreateDelegate_OutputDelegate) == 0x00004C, "Member 'WBP_New_Location_C_ExecuteUbergraph_WBP_New_Location::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_New_Location_C_ExecuteUbergraph_WBP_New_Location, K2Node_Select_Default) == 0x000060, "Member 'WBP_New_Location_C_ExecuteUbergraph_WBP_New_Location::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_New_Location_C_ExecuteUbergraph_WBP_New_Location, CallFunc_SelectFloat_ReturnValue) == 0x000068, "Member 'WBP_New_Location_C_ExecuteUbergraph_WBP_New_Location::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_New_Location_C_ExecuteUbergraph_WBP_New_Location, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000070, "Member 'WBP_New_Location_C_ExecuteUbergraph_WBP_New_Location::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_New_Location_C_ExecuteUbergraph_WBP_New_Location, CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result) == 0x000078, "Member 'WBP_New_Location_C_ExecuteUbergraph_WBP_New_Location::CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_New_Location_C_ExecuteUbergraph_WBP_New_Location, CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue) == 0x000080, "Member 'WBP_New_Location_C_ExecuteUbergraph_WBP_New_Location::CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_New_Location_C_ExecuteUbergraph_WBP_New_Location, CallFunc_IsValid_ReturnValue) == 0x000088, "Member 'WBP_New_Location_C_ExecuteUbergraph_WBP_New_Location::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_New_Location_C_ExecuteUbergraph_WBP_New_Location, CallFunc_IsAnimationPlaying_ReturnValue_1) == 0x000089, "Member 'WBP_New_Location_C_ExecuteUbergraph_WBP_New_Location::CallFunc_IsAnimationPlaying_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_New_Location_C_ExecuteUbergraph_WBP_New_Location, CallFunc_IsInViewport_ReturnValue_1) == 0x00008A, "Member 'WBP_New_Location_C_ExecuteUbergraph_WBP_New_Location::CallFunc_IsInViewport_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_New_Location_C_ExecuteUbergraph_WBP_New_Location, CallFunc_IsAnimationPlaying_ReturnValue_2) == 0x00008B, "Member 'WBP_New_Location_C_ExecuteUbergraph_WBP_New_Location::CallFunc_IsAnimationPlaying_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_New_Location_C_ExecuteUbergraph_WBP_New_Location, CallFunc_CreatePlayAnimationTimeRangeProxyObject_PlaybackSpeed_ImplicitCast) == 0x00008C, "Member 'WBP_New_Location_C_ExecuteUbergraph_WBP_New_Location::CallFunc_CreatePlayAnimationTimeRangeProxyObject_PlaybackSpeed_ImplicitCast' has a wrong offset!");

// Function WBP_New_Location.WBP_New_Location_C.ShowNotification
// 0x0038 (0x0038 - 0x0000)
struct WBP_New_Location_C_ShowNotification final
{
public:
	class FText                                   RegionName;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   LocationName;                                      // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          IsCity;                                            // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_New_Location_C_ShowNotification) == 0x000008, "Wrong alignment on WBP_New_Location_C_ShowNotification");
static_assert(sizeof(WBP_New_Location_C_ShowNotification) == 0x000038, "Wrong size on WBP_New_Location_C_ShowNotification");
static_assert(offsetof(WBP_New_Location_C_ShowNotification, RegionName) == 0x000000, "Member 'WBP_New_Location_C_ShowNotification::RegionName' has a wrong offset!");
static_assert(offsetof(WBP_New_Location_C_ShowNotification, LocationName) == 0x000018, "Member 'WBP_New_Location_C_ShowNotification::LocationName' has a wrong offset!");
static_assert(offsetof(WBP_New_Location_C_ShowNotification, IsCity) == 0x000030, "Member 'WBP_New_Location_C_ShowNotification::IsCity' has a wrong offset!");

}

