#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Squad

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK::Params
{

// Function WBP_Squad.WBP_Squad_C.AddInviteWidget
// 0x0018 (0x0018 - 0x0000)
struct WBP_Squad_C_AddInviteWidget final
{
public:
	int32                                         InvitedSquadIndex;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PlayerNameInviter;                                 // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Squad_C_AddInviteWidget) == 0x000008, "Wrong alignment on WBP_Squad_C_AddInviteWidget");
static_assert(sizeof(WBP_Squad_C_AddInviteWidget) == 0x000018, "Wrong size on WBP_Squad_C_AddInviteWidget");
static_assert(offsetof(WBP_Squad_C_AddInviteWidget, InvitedSquadIndex) == 0x000000, "Member 'WBP_Squad_C_AddInviteWidget::InvitedSquadIndex' has a wrong offset!");
static_assert(offsetof(WBP_Squad_C_AddInviteWidget, PlayerNameInviter) == 0x000008, "Member 'WBP_Squad_C_AddInviteWidget::PlayerNameInviter' has a wrong offset!");

// Function WBP_Squad.WBP_Squad_C.ExecuteUbergraph_WBP_Squad
// 0x0100 (0x0100 - 0x0000)
struct WBP_Squad_C_ExecuteUbergraph_WBP_Squad final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Name_C*                            CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_CustomEvent_InVisibility;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_InvitedSquadIndex;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_PlayerNameInviter;              // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Invite_C*                          CallFunc_Create_ReturnValue_1;                     // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       K2Node_DynamicCast_AsCanvas_Panel_Slot;            // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnchors                               K2Node_MakeStruct_Anchors;                         // 0x0088(0x0020)(NoDestructor)
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue_1;        // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player_1;            // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BB[0x5];                                       // 0x00BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue_2;        // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player_2;            // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APS_TDB_C*                              CallFunc_Array_Get_Item;                           // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Squad_C_ExecuteUbergraph_WBP_Squad) == 0x000008, "Wrong alignment on WBP_Squad_C_ExecuteUbergraph_WBP_Squad");
static_assert(sizeof(WBP_Squad_C_ExecuteUbergraph_WBP_Squad) == 0x000100, "Wrong size on WBP_Squad_C_ExecuteUbergraph_WBP_Squad");
static_assert(offsetof(WBP_Squad_C_ExecuteUbergraph_WBP_Squad, EntryPoint) == 0x000000, "Member 'WBP_Squad_C_ExecuteUbergraph_WBP_Squad::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Squad_C_ExecuteUbergraph_WBP_Squad, CallFunc_Create_ReturnValue) == 0x000008, "Member 'WBP_Squad_C_ExecuteUbergraph_WBP_Squad::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Squad_C_ExecuteUbergraph_WBP_Squad, K2Node_CustomEvent_InVisibility) == 0x000010, "Member 'WBP_Squad_C_ExecuteUbergraph_WBP_Squad::K2Node_CustomEvent_InVisibility' has a wrong offset!");
static_assert(offsetof(WBP_Squad_C_ExecuteUbergraph_WBP_Squad, Temp_byte_Variable) == 0x000011, "Member 'WBP_Squad_C_ExecuteUbergraph_WBP_Squad::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Squad_C_ExecuteUbergraph_WBP_Squad, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x000018, "Member 'WBP_Squad_C_ExecuteUbergraph_WBP_Squad::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Squad_C_ExecuteUbergraph_WBP_Squad, Temp_int_Array_Index_Variable) == 0x000020, "Member 'WBP_Squad_C_ExecuteUbergraph_WBP_Squad::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Squad_C_ExecuteUbergraph_WBP_Squad, K2Node_DynamicCast_AsSurvival_Player) == 0x000028, "Member 'WBP_Squad_C_ExecuteUbergraph_WBP_Squad::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(WBP_Squad_C_ExecuteUbergraph_WBP_Squad, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_Squad_C_ExecuteUbergraph_WBP_Squad::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Squad_C_ExecuteUbergraph_WBP_Squad, K2Node_CustomEvent_InvitedSquadIndex) == 0x000034, "Member 'WBP_Squad_C_ExecuteUbergraph_WBP_Squad::K2Node_CustomEvent_InvitedSquadIndex' has a wrong offset!");
static_assert(offsetof(WBP_Squad_C_ExecuteUbergraph_WBP_Squad, K2Node_CustomEvent_PlayerNameInviter) == 0x000038, "Member 'WBP_Squad_C_ExecuteUbergraph_WBP_Squad::K2Node_CustomEvent_PlayerNameInviter' has a wrong offset!");
static_assert(offsetof(WBP_Squad_C_ExecuteUbergraph_WBP_Squad, Temp_bool_Variable) == 0x000048, "Member 'WBP_Squad_C_ExecuteUbergraph_WBP_Squad::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Squad_C_ExecuteUbergraph_WBP_Squad, Temp_int_Loop_Counter_Variable) == 0x00004C, "Member 'WBP_Squad_C_ExecuteUbergraph_WBP_Squad::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Squad_C_ExecuteUbergraph_WBP_Squad, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'WBP_Squad_C_ExecuteUbergraph_WBP_Squad::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Squad_C_ExecuteUbergraph_WBP_Squad, CallFunc_Add_IntInt_ReturnValue) == 0x000054, "Member 'WBP_Squad_C_ExecuteUbergraph_WBP_Squad::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Squad_C_ExecuteUbergraph_WBP_Squad, CallFunc_GetOwningPlayer_ReturnValue) == 0x000058, "Member 'WBP_Squad_C_ExecuteUbergraph_WBP_Squad::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Squad_C_ExecuteUbergraph_WBP_Squad, CallFunc_Create_ReturnValue_1) == 0x000060, "Member 'WBP_Squad_C_ExecuteUbergraph_WBP_Squad::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Squad_C_ExecuteUbergraph_WBP_Squad, CallFunc_GetChildrenCount_ReturnValue) == 0x000068, "Member 'WBP_Squad_C_ExecuteUbergraph_WBP_Squad::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Squad_C_ExecuteUbergraph_WBP_Squad, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00006C, "Member 'WBP_Squad_C_ExecuteUbergraph_WBP_Squad::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Squad_C_ExecuteUbergraph_WBP_Squad, CallFunc_AddChild_ReturnValue) == 0x000070, "Member 'WBP_Squad_C_ExecuteUbergraph_WBP_Squad::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Squad_C_ExecuteUbergraph_WBP_Squad, K2Node_DynamicCast_AsCanvas_Panel_Slot) == 0x000078, "Member 'WBP_Squad_C_ExecuteUbergraph_WBP_Squad::K2Node_DynamicCast_AsCanvas_Panel_Slot' has a wrong offset!");
static_assert(offsetof(WBP_Squad_C_ExecuteUbergraph_WBP_Squad, K2Node_DynamicCast_bSuccess_1) == 0x000080, "Member 'WBP_Squad_C_ExecuteUbergraph_WBP_Squad::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Squad_C_ExecuteUbergraph_WBP_Squad, K2Node_MakeStruct_Anchors) == 0x000088, "Member 'WBP_Squad_C_ExecuteUbergraph_WBP_Squad::K2Node_MakeStruct_Anchors' has a wrong offset!");
static_assert(offsetof(WBP_Squad_C_ExecuteUbergraph_WBP_Squad, CallFunc_GetOwningPlayerPawn_ReturnValue_1) == 0x0000A8, "Member 'WBP_Squad_C_ExecuteUbergraph_WBP_Squad::CallFunc_GetOwningPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Squad_C_ExecuteUbergraph_WBP_Squad, K2Node_DynamicCast_AsSurvival_Player_1) == 0x0000B0, "Member 'WBP_Squad_C_ExecuteUbergraph_WBP_Squad::K2Node_DynamicCast_AsSurvival_Player_1' has a wrong offset!");
static_assert(offsetof(WBP_Squad_C_ExecuteUbergraph_WBP_Squad, K2Node_DynamicCast_bSuccess_2) == 0x0000B8, "Member 'WBP_Squad_C_ExecuteUbergraph_WBP_Squad::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_Squad_C_ExecuteUbergraph_WBP_Squad, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0000B9, "Member 'WBP_Squad_C_ExecuteUbergraph_WBP_Squad::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Squad_C_ExecuteUbergraph_WBP_Squad, K2Node_Select_Default) == 0x0000BA, "Member 'WBP_Squad_C_ExecuteUbergraph_WBP_Squad::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Squad_C_ExecuteUbergraph_WBP_Squad, CallFunc_PlayAnimation_ReturnValue) == 0x0000C0, "Member 'WBP_Squad_C_ExecuteUbergraph_WBP_Squad::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Squad_C_ExecuteUbergraph_WBP_Squad, CallFunc_GetOwningPlayerPawn_ReturnValue_2) == 0x0000C8, "Member 'WBP_Squad_C_ExecuteUbergraph_WBP_Squad::CallFunc_GetOwningPlayerPawn_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Squad_C_ExecuteUbergraph_WBP_Squad, K2Node_DynamicCast_AsSurvival_Player_2) == 0x0000D0, "Member 'WBP_Squad_C_ExecuteUbergraph_WBP_Squad::K2Node_DynamicCast_AsSurvival_Player_2' has a wrong offset!");
static_assert(offsetof(WBP_Squad_C_ExecuteUbergraph_WBP_Squad, K2Node_DynamicCast_bSuccess_3) == 0x0000D8, "Member 'WBP_Squad_C_ExecuteUbergraph_WBP_Squad::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_Squad_C_ExecuteUbergraph_WBP_Squad, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x0000D9, "Member 'WBP_Squad_C_ExecuteUbergraph_WBP_Squad::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Squad_C_ExecuteUbergraph_WBP_Squad, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x0000E0, "Member 'WBP_Squad_C_ExecuteUbergraph_WBP_Squad::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Squad_C_ExecuteUbergraph_WBP_Squad, CallFunc_IsValid_ReturnValue_1) == 0x0000E8, "Member 'WBP_Squad_C_ExecuteUbergraph_WBP_Squad::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Squad_C_ExecuteUbergraph_WBP_Squad, CallFunc_Array_Get_Item) == 0x0000F0, "Member 'WBP_Squad_C_ExecuteUbergraph_WBP_Squad::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Squad_C_ExecuteUbergraph_WBP_Squad, CallFunc_Array_Length_ReturnValue) == 0x0000F8, "Member 'WBP_Squad_C_ExecuteUbergraph_WBP_Squad::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Squad_C_ExecuteUbergraph_WBP_Squad, CallFunc_Less_IntInt_ReturnValue) == 0x0000FC, "Member 'WBP_Squad_C_ExecuteUbergraph_WBP_Squad::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Squad.WBP_Squad_C.RemoveAddPlayerWidget
// 0x0018 (0x0018 - 0x0000)
struct WBP_Squad_C_RemoveAddPlayerWidget final
{
public:
	class AActor*                                 Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_AddPlayerToSquad_C*                WBP_AddWidget;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Squad_C_RemoveAddPlayerWidget) == 0x000008, "Wrong alignment on WBP_Squad_C_RemoveAddPlayerWidget");
static_assert(sizeof(WBP_Squad_C_RemoveAddPlayerWidget) == 0x000018, "Wrong size on WBP_Squad_C_RemoveAddPlayerWidget");
static_assert(offsetof(WBP_Squad_C_RemoveAddPlayerWidget, Player) == 0x000000, "Member 'WBP_Squad_C_RemoveAddPlayerWidget::Player' has a wrong offset!");
static_assert(offsetof(WBP_Squad_C_RemoveAddPlayerWidget, WBP_AddWidget) == 0x000008, "Member 'WBP_Squad_C_RemoveAddPlayerWidget::WBP_AddWidget' has a wrong offset!");
static_assert(offsetof(WBP_Squad_C_RemoveAddPlayerWidget, CallFunc_Map_Remove_ReturnValue) == 0x000010, "Member 'WBP_Squad_C_RemoveAddPlayerWidget::CallFunc_Map_Remove_ReturnValue' has a wrong offset!");

// Function WBP_Squad.WBP_Squad_C.ShowPartyWidget
// 0x0001 (0x0001 - 0x0000)
struct WBP_Squad_C_ShowPartyWidget final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Squad_C_ShowPartyWidget) == 0x000001, "Wrong alignment on WBP_Squad_C_ShowPartyWidget");
static_assert(sizeof(WBP_Squad_C_ShowPartyWidget) == 0x000001, "Wrong size on WBP_Squad_C_ShowPartyWidget");
static_assert(offsetof(WBP_Squad_C_ShowPartyWidget, InVisibility) == 0x000000, "Member 'WBP_Squad_C_ShowPartyWidget::InVisibility' has a wrong offset!");

}

